{
  "positive": [
    {
      "review": "Love the game 100%, but the amount of cheating chinese players on the Aussie servers is getting out of hand. Literally one of their names translated was King of x-ray vision...",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Its fun, looks nice.\nCrashes a lot. (Unreal Engine 4)\nPeople cheat, often.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This is the best WW II FPS at the moment...graphics are high standard and the gameplay is awesome.Lots of things to do and to achieve....so to say HELL LET LOOSE RULEZ !!! 9/10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great successor to the Rising Storm / Red Orchestra games which I loved. HLL combines great realism but it is not as complicated or hardcore as Escape from Tarkov or Arma games.. I am sure that those who loved Rising Storm/RO games will love this.. and developers continue to support this game unlike others..",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "With the right group, this game is an amazing experience. But just like all games, if you end up with a rough group, it will make it almost unplayable.\n\nVery fun game!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game makes you a cog in the wheel during WW2. Straight PTSD simulator at peak moments. The map control and dynamic combat is amazing. I love this game and want to play it more. \r\n\r\nCONS: Please for the love of god can we get a better way to get in the games, like spending 20 30 minutes of my limited playtime to screw around looking for valid servers. That or at the very least increase the amount of people that can be in a queue so I can at least not have to repeatedly keep clicking over and over on trying to get in queue.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Personally I really like this game, but there are times when all I want is to turn it off xD\nI have played the previous 2 free weekends before buying it. (on old PC)\nIf you have an mid/high-end PC i would recommend this game to you.\nOf course it's not for everyone.\nAll you need to have a fun session on this game is to have team that communicates and works together.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game, however since it's latest update problems are admittingly becoming more prevalent. Clunkiness with weapons and fatal errors are now a normality. It is a shame that such a fantastic game is being held back. I have faith that it can be fixed sooner rather than later. Regardless of my issues, I would still recommend this game to those that wish for an immersive shooter with a friendly player base.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best team-based fps at the moment*. To win a map 50 players have to communicate and coordinate their efforts. Join the fun if you like that concept!\n\nThe dlc are pure cosmetics - no pay-to-win here.\n\n__________________\n* 5 years ago that title went to another game - playerbases have shifted and 2025 hell let loose has by far the best atmosphere and n00b friendly servers",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game with a level of immersion that feels unmatched, still to this day. Never have I been more fearful of my mortality in a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game with satisfying gunplay and great teamwork. Would definitely recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think it's a very good and immersive game, no doubt. But for me it's just to much investment to put in and I don't have time for it. If you love immersive War Game like \"Operation Flashpoint\" or \"Arma\", you should definitely have fun on this game !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can be super frustrating getting shot from who knows where, so if you can get past that you will have fun. Just don't go run across an open field, it probably won't go well. It's not a run-and-gun style game, once you figure out this is truly a team multiplayer game it can be a lot of fun. I'd recommend watching some YouTube videos on this game to kind of give yourself a general idea of how the game works and different units function in the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone locked in after the Valor & Courageousness displayed by our Redneck Commander after he started getting bitched out by his ex-wife over the mic in Command Chat: this Man finally stood up for himself, turned the tables on his wife just as he had turned the tide of Battle whilst Intoxicated to the third Degree and in doing so had thusly inspired all of us to take the Game back without so much as a hassle from the opposite side... This game will truly change your life if you're white and in your mid 30's; 10/10, also, the Alt-Right E-Girl Squad Leads in the command chats... LOL!!!!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "yes but no at the same time it is very hard to gat a single kill so if you like grinding i suggest you get this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game but I feel it deserves Nvidia DLSS and I cannot express that enough. I am extremely somewhat disappointed, but I love the game's community and teamwork.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game but players don't build enough garrisons",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After reading all the negative reviews i felt that i had to post a positive one due to all the unfair flak the devs are getting.\n\nI run, gun and have a blast (literally, artillery is a menace) but got 500+ hours and 35 in the last two weeks alone with absolutely no more than 1 problem (i managed to get myself stuck but that was just silly QA in me messing around) overall i would give it a strong 7.5/10 with improvements possible in LODDING in particular with stone walls being invisible over extreme distances (+500m) making it hard to make long range small arms combat work.\n\nOutside of this issue (which is a general issue across FPS titles) lets look at some gameplay stuff\nPRO's\n- Gunplay is amazing, good animations and solid audio for all of em.\n- Directional and distance amibance for audio is above and beyond (watching explosions then getting the audio second delays on distance is such an incredible feel)\n- Good mix between arcade and realism usage such as blast ranges, damage dealing and so on.\n- Continued polish from the devs and added functionality for weapons and more (bipods working and a lot more usable now!)\n- Hit detection works pretty damn well (i really dont get why all the negative comments about this is coming from but considering i generally have 0 problems getting hits nor kills i dont want to say it but...skill issue? or latency problems (i play on +150 ms servrs so idk...)).\n- Open for feedback (double edged sword, check cons)\n\nCON's\n- Lack of feedback responce in open channels (not really clear what data is used for things like cost adjustments etc)\n- The community biting itself and can be outright hostile if you make mistakes.( the devs have 0 control over this, its entirely a competetive sore loser problem on some servers )\n- Some parts of the gameplay loop is very static and not very interesting (nodes and arty vs recon and its expected role, but this is also something being worked on )\n- Lack of protection in Streamer mode (it doesnt hide the map, please fix this as stream sniping is annoying and trying to manually block the map with an overlay through recording software is absolutely insane)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Realistic, nice to have game that is not bullet sponges because hs is hs and time to kill is nice and realistic. if ppl would play more in team and use mic it would be even better experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While it can be a bit buggy, I attribute that to poor hardware. It really feels like a real scenario and it requires extreme concentration to be able to do ok at it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I won't say that there isn't anything quite like it, because that's just not true, there's tons of games like it; but [i]Hell Let Loose[/i] is a very good example of its genre. It's totally distinct from arena shooters or extraction shooters or whatever else the kids play these days, it has a lot more going on than those do, if not in moment to moment gameplay than in the big picture. It's not so complicated as to be obtuse to those who have never played a game like it though, I was once one of those people but now I pretty much have the basics down in most categories and actually help my team.\r\n\r\nIt feels satisfying to win a duel not because you got a kill but because you stayed alive. Actually killing people is usually secondary to tasks like placing spawn points for your team or destroying them for the enemy. That's fun, that means you can have a good time just from using your head even if you can't aim for shit. Small arms not your thing? Try artillery where you never see the enemy but you sure can blow them up if you know what you're doing (I don't). Maybe you don't care for combat much at all, just be a truck driver then delivering supplies around the map and helping everyone out. Depending on my mood I'll do any one of these jobs or something else entirely, there's a lot of options.\r\n\r\nI paid more for this game than I usually would for a multiplayer game, but it was worth it. They add new stuff pretty frequently and the community is one of the best I've ever played with. Obviously not everyone is nice, especially to newcomers, but as long as you're honest that you suck most people will help you out until you can be the one helping out. Not too many obnoxious cosmetics either, everything is pretty authentic to the setting which is a major boon in 2025 when most games start to look like [i]Fortnite[/i] after a couple years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No other WWII FPS game has come close to this. It's not for the feint of heart as you will always die from some random stuff but the kill streaks will be epic. It has successfully combined an addictive FPS action shooter with a multiplayer Coop and strategy game. If can't work with others, don't play. But if you can, glory awaits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game once you get an understanding of the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite FPS of all time. Very immersive gameplay that isn't so realistic that it turns off casual players, but realistic enough to make you feel like your life matters. Teamwork, positioning, and communication is also rewarded significantly more than good aim, so it's the perfect shooter for mature players who don't want to slide cancel or bunny hop across a map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like I just enlisted into the US army during 1940 and have a loving wife and kids back home waiting for me. Very realistic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game for those who love the raw WW2 genre. But be aware that you will die, a lot, and teamwork is a must. I didn't like it that much for the instant death. I couldn't figure out where i was being shot from, which annoys me, but that's just my experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the realistic feel of this game. The 50 v 50 style ensures every match is action packed! The audio and visuals of this game are fantastic. I can't wait for Hell Let Loose: Vietnam! I will definitely be buying that and playing it when it comes out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played as a medic and healed a few dudes then their heads got blown up seconds later...\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very high quality game and very fun. However updates require lots of storage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Even better if you can get into a squad that talks or have a good leader.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a history lover like me, I love the game a lot and I wouldn't have found the 7th Cavalry Gaming Regiment without it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very similar to rising storm 2 or red orchestra 2, the difference is only in the pace, its a bit slower. The commander and  squad leader classes are a little bit more complex. The chat, command, and engineer system really reminds me of foxhole, but less sophisticated. I love that the game shows u how useful you are in the squad rather than k/d ratio. And this game really needs you to communicate with your team, get that voice chat on. Although not as active as foxhole, its still fun. The Gun feels great and powerful, Its very realistic, and unique. \r\n It is enjoyable but my gripes are probably that because the map is too big, the pace becomes slower. I have no problem with the walking but I had to wait in a great spot for a minute or two until I see some enemy coming in. And the grind for the better weapons are so long, It's probably one of the longest in any fps games that I've played. Not only that but the xp you get from a match can only get you so far because of the big maps that cause u to meet less enemy. Before I play this game, I heard that the engagement distance in hll especially in afrika is mostly very far, so basically a pixel wide of enemy, and its true. And destroying enemy's outposts or resources or garrisons or even killing enemies itself doesnt rewards you with a lot of xp. So it's better to just hunker down in an objective doing nothing and wait for the enemy instead of being active. I had a game where I became a rifleman, get a lot of kills, destroy garrisons and outpost and still doesnt get enough xp, I'd still get outshined by easy class like machinegunners that just do supressions on the enemy. I didnt even get a new level, It was an hour+ match, And I had the most xp and was the most active in my squad. Its like as if hunting enemy spawn isn't worth it. \r\n I'd say that if you came from call of duty or battlefield, its best that you try something like rising storm or red orchestra first before entering this game. I saw a lot of people, enemy or teammate that charge blindly into the battlefield without looking left and right, and they would easily get flanked. In afrika I got 10+ kills in a point while lying down with 2 enemy panzers inches away from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s fun, I don’t really ever run into toxic people. I mean if you’re new to the game don’t pick a command/support role and everyone will be cool. The realism is great, just wish more were playing. Sad :((",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come on so much since it's early access days. The developers have put a lot of continued effort into it for the last five years. Rarely have I seen a game come out of early access and continue to get a serious level of commitment from developers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great WWII game with lots of potential, would recommend to anyone who enjoys playing with a squad and authentic feeling FPS combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have so much fun playing medic... until I get mowed down by teammates while I'm trying to revive a fellow medic.\r\n\r\nGreat game though, would recommend to people that are willing to die over and over! OG Souls players will love this game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing gameplay and amazing group of people cant wait for next one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game, enjoy the teamwork required for actually getting most objectives. Only thing about this game i dislike is how long some matches can last for, don't always want to dedicate more than 1 hour for a single match(when you lose every point in the last 5 minutes). Very fun ww2 game would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive ww2 shooter. Focus on teamplay and communication.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game very realistic game i wish there was a ww1 game also like this one but i like the ww2 feeling nice sounds too the planes flying over you is cool but yea i like the game like the sounds of the guns too is nice but the game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is, for me, the best, most atmospheric, and most exciting shooter I've ever played—in short.\nWhereas in other FPSs I get tired during longer sessions due to the sheer volume of everything, hell let loose, allowed me to play slowly at the beginning, exactly as I want to learn magnitude of it's mechanics. This is a game that has something different in store for everyone. You can play cautiously and defend, focus on fortifications, or attack enemy points. The multitude of tactical options is a result of the open maps and the perfect balance between Mil Sim and arcade games. If you're considering buying it, keep in mind that it takes time to get a feel for the gameplay. But you'll get better with each passing hour. Additionally, the community is great - you'll rarely find a team that isn't willing to help you understand the game's mechanics.\n\nI recommend it, it's my favorite shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hell Let Loose is one of the best games I have ever played. The vehicle combat is incredible, the squad teamwork makes it feel insanely immersive when you can only communicate with those around you and rely on the chain of command, and the maps are very well made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a great community. Bring a mic if you want to have some real fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. One of the best games out there. Big maps, realistic battle pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PTSD simulator sums up this game in a nutshell. Had some great laughs on this game, great to play with friends! 100% worth the buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top 10 worst experiences playing infantry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with both randoms and friends. 100% immersive, 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, better with friends, best when on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started this game in love with the weapons and watching my friends blow up. Now I can't stop complaining about the inept command structure that is definitely 100% the reason we're losing.\n\nI love this game, I only get frustrated because I love it so much and it punishes you for playing it like it's CoD. Also Bolt-action rifles 1 shot <--- This is very pleasant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still is an awesome game, however wait until the devs fix all the issues currently happening with server connectivity to buy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for those WW FPS lovers.  really fun with and without friends.  Most of the time you can get in squads with people talking in game whether you do or dont have friends to play with.  It would be nice to have some better leveling or more unlocks but its still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s at its best when players communicate, turning each match into a dynamic and engaging strategic experience. Without teamwork, it shifts into a more straightforward military shooter where map knowledge helps secure consistent kills. Overall, it’s a compelling and highly enjoyable game that earns a strong 93/100.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+ Really immersive gameplay\n+ Great map designs\n+ Graphics are on point\n+ Atmospheric both visually and audio-visually\n+ Active development\n- Requires good community to really thrive because teamwork is the key\n- Performance can be really poor\n- Movement can feel a little clumsy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A more interesting take on the FPS genre, focusing heavily on a coordinated team effort and command structures. Good teamwide strategy becomes far more important than individual skill, while providing a variety of roles capable of making an impact.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]93/100[/b][/h1]\n\n[b]Impressive: 85-94 (85-94%)[/b]\nPerformance or gameplay surpasses the passing mark and stands out from the average.\nProvides a high level of quality and enjoyable gameplay.\nStrongly Recommended - ✔✔\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (22/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☐ Very Difficult (+1)\n☐ Difficult (+2)\n☐ Moderate (+3)\n☐ Easy (+4)\n☑ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☐ Somewhat Balanced (+2)\n☐ Moderately Balanced (+3)\n☑ Well Balanced (+4)\n☐ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☐ Moderately (+3)\n☑ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☐ Somewhat Meaningful (+3)\n☑ Quite Meaningful (+4)\n☐ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☐ Unsatisfying (+2)\n☐ Neutral (+3)\n☐ Satisfying (+4)\n☑ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (23/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☐ Slightly Interesting (+2)\n☑ Moderately Interesting (+3)\n☐ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☐ Moderately Immersive (+3)\n☐ Very Immersive (+4)\n☑ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☐ Very Appealing (+4)\n☑ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☐ Slightly Engaging (+2)\n☐ Moderately Engaging (+3)\n☐ Very Engaging (+4)\n☑ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☐ Neutral (+3)\n☐ Friendly (+4)\n☑ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (23/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☐ Well Designed (+4)\n☑ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☐ Moderate Content (+3)\n☐ Extensive Content (+4)\n☑ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☑ Average (+3)\n☐ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☐ Flexible (+4)\n☑ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☐ Numerous (+1)\n☐ Moderate (+2)\n☐ Limited (+3)\n☐ Minor (+4)\n☑ None (+5)\n\n\n[b]Final Considerations (25/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☐ Satisfied (+4)\n☑ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☐ Substantial (+2)\n☐ Moderate (+3)\n☐ Minimal (+4)\n☑ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☐ High (+4)\n☑ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☐ Good Value (+4)\n☑ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Its a great mix of chaos and realism",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good, and has less racism than your typical counterstrike match. I dont understand how some of these people can play a game for over 1000 hours and then call it bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most intense FPS shooters I've played, with a really cool focus on teamplay. Community is generally far less toxic than other shooters. The teamplay and the communication required to win sets this apart from other shooters. It's not cringey mil-sim, so it's actually approachable as a casual. It's akin to playing battlefield on hardcore mode with proximity and radio chat. The shell shock is real with this one, can't wait for it to give me PTSD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best WW2 realism shooters-PTSD simulators.\nYoull get to see your teammates evaporate infront of by warmachines and horrors beyond human comprehension.\nTeamwork and communication is vital and highly rewarding, game isnt about kills, its about capturing those objectives.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, I hope they will bring the game back to a functional state, but some of my best memories are on this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, funny moments with friends and being blown up with artillery :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game and when there is communication there is more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its like playing 100 player Brothers in Arms Road to Hill 40; if you're player character had cinder blocks for feet. I can see the systems being there but it is a little too slow and clunky for my tastes. But don't let that stop you from gettin' down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice balanced light millsim that manages to stay exciting. Less running or driving around than other games like arma or squad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game I would recommend. The current development team is still working hard and providing a lot of content for the player base. New maps, new factions and improving game mechanics, a lot of entertainment for the player base in here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and hate it at the same time. Love the immersion of it and when you get in a good game with a good team. Hate that I can barely see anything and for every kill I get I die about 15 to 20 times. Very difficult game that requires a lot of patience. Fun but can be very frustrating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, so many hours put in and it's one of the best ww2 games out there that actually takes patience and teamwork. Absolutely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game sometimes there is a lot of running but it gets made up for by the battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a WW2 online 50v50 game. It has realistic mechanics and i think i have minor ptsd because of the game. Its great if your a history nerd or a masochist, luckily I'm both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very frustrating when you first get started, but it very rewarding once you start getting the hang of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only game that can scratch the itch that Red Orchestra 2 left behind while filling the void for a good WW2 Battlefield game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the realism -  but i do not like how easy it is to ban someone by vote or other as  its not ways justified",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well... what to say? Used to be a rather stable and enjoyable game. Recent updates have managed to add random server kicks and introduced new critical errors. Cannot even launch the game locally anymore without worrying about issues, Hope it gets better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing fps since Quake 2, this is best ww2 online pvp game rn , every bullet counts , have impact, team roles tutorial should exist, confusing to start game ,bad map UI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great opportunity to develop PTSD, would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like cooperative play. Good maps.\r\nDislike that it is a little buggy. Need more servers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! This and Day Z are my top 2 favs to play. also coincidedntly there seems to be a lot of cross over between day z players trying an liking this game and HLL Hell let loose players trying and liking day z.Enjoy them both! also both games soon are having some new releases. Day z will be getting a new desert map/new gameplay in the next few months and HLL will be getting their vietnam game. Im more than a little disappointed that they didn't make a Korean War game because no one ever seems to want to or is terrified of upsetting china so avoid the korean war like the plauge. However i am interested to see how the vietnam game turns out but of course will still keep playing Hell let loose!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a game that needs to be played. It is World War 2 sim. Yes there are long walks if you played battlefield and cod all your life but this is a World War 2 sim. Soldiers were walking for days in World War 2. And its not even half the walking sim it should be to reflect reality of WW2. It is tactical, the graphics are beautiful, It is my favorite game on steam that I always come back to. Being tactical helps having friends/clan etc. If not, jump into higher lvl servers where people talk and you can coordinate your way to victory! \n     \n    10/10 compared to what else its out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This last update has thrown a lot of people, both new and old, into a fire, with issues with crashing, stability, and general server connections. The devs are actively fixing and patching it, and the last year or 2 has been one of the best for both maps and listening to the community, even with the issues update 18 came with. Gameplay-wise, think of Squad but with more arcade feel when it comes to guns and lives. Still a milsim, so you'll be punished if you don't coordinate or die while being overly aggressive. The biggest issue this game has, and will always have, is command chat, commanders, and people without mics. If you're new, don't make a squad till you at least start having a mic. The only time you shouldn't have a mic is when you're really experienced, and even then, you are crippling your team.\n\nTLDR: game is good, and really arcade milsim is easier to get into than Squad. Current review reflects issues within the last update, which devs are actively fixing.\n\nED NOTE: I got kicked 5 times in less than 2 hours due to a connection error or something like that. I'm using a VPN in my own area, meaning that VPNs are an issue for community servers. Just wanted to let new users know",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. At 38, re-living my console youth, but a game worthy! Made some awesome friends as well. Cant wait for Nam!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game to play, especially if you have friends who are also into realistic large map large team shooters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but they need to add proper updates regarding gameplay mechanics rather than pumping out dlc/paid cosmetics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get on the public servers, find a squad who are using voice chat, and you'll have the time of your life. Don't aim for kills - aim to get garrisons built and to help your squadmates. There's nothing quite like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, slow and considered game-play where tactics and team communication are essential. Tight knit community and no screaming kids...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty good, not just a walking simulator like games in the this genre tend to be, you can actually find action surprisingly easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun and unique multiplayer game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VOIP marathon simulator disguised as a hardcore WWI squad game. learn where to put outposts and life gets easier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bit of a learning curve but it's a fantastic game otherwise, I'd definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best WW2 game so far, it might lack features compared to Squad 44, but it makes up for it in terms of gameplay, it's way more relaxed and way easier to spawn and directly head to combat, compared to other rival games which are more focused on battle simulation, whenever i want to play a short game rather then an hour long game, i just start playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used to love the game but downloaded it on PC and it runs terrible even with good modern hardware despite being an older game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "once you learn the game play and how to work as a squad, it is an amazing game. even better to squad up with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game for those looking for a realistic shooter mixed with more casual elements. This game feels like it falls in between COD and ARMA 3. Can be a lot of running tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent atmosphere,  and usually very good community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is by far my favourite world war 2 shooter game. The level of realism is incredible! Teamwork is essential, you have to coordinate with your squad and communicate effectively to achieve victory. It’s even more enjoyable when played with friends, but it’s also a great way to meet new people when playing alone. I’d highly recommend it to anyone who enjoys realistic ww2 shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When two teams of players face off where each team coordinates with their allies and works together to secure and defend objectives - game is a blast.\n\nUnfortunately too often 1 team cooperates and the other team thinks they are playing CoD or BF6 and hold \"W\" key.\n\nIt can be a lot of fun, often times its a 1 sided beat down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and can with play a great community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is phenomenal in two ways.\n\nFirst, while a time investment, this game provides some of the best cooperative gameplay you'll find.\n\nSecond, their handling of the recent rollout of their update gone wrong has been nothing short of a fresh breath of air. The response was a bit slow, but soon not only did devs give regular updates, but have taken steps to ensure the same mistakes don't happen again, AND kept communication on discord, reddit, etc constant and up to date.\n\nFor a problem that only gravely affected 1/7th the player base (based on reddit polling), I have nothing but praise.\n\nCould not ask for a better development team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hell Let Loose continues to be one of the most intense and rewarding FPS experiences out there. Every match feels like a real battle not just because of the sound design and visuals, but because teamwork actually matters. When your squad is communicating, marking targets, and coordinating with command, the game becomes a lot more immersive.\n\nThe maps are huge and detailed, the gunplay is satisfying without being arcadey, and the pacing strikes a perfect balance between tactical and chaotic. Even after hundreds of hours, no two matches feel the same.\n\nIt’s one of the few shooters where victory truly comes from coordination, not just individual skill. If you enjoy immersive, strategy-heavy FPS games, Hell Let Loose is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Felt like Desmond Doss, got shot by a MG 34. Repeat, 10/10 game would revive again. (Add Japanese front so I can live it up to it's real potential).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has to be the hardest most unforgiving and realistic WW2 shooter I have ever played. IT IS NOT beginner friendly! My love for a WW2 shooter and the fact I paid money for this is why I keep trying!\nI strongly suggest watching Soulsniper or Warfrags class guides on youtube...It will seriously help! This isn't a normal FPS game.\n\nYou will get the whole fresh recruit on the front lines experience...you stand no chance!\nBullets whiz by and you have absolutely no idea where from and you will be picked off by people you cannot see. \n\nKeep your cool and persist. It is not CoD or BF or any other shooter game you are good at, Dying is part of the game, Infantry die. This game requires tactical thinking! you need to be able to read your map, these maps are gigantic! Study the map predict where the enemy will be and where they have been spotted and plan your movements accordingly! Each class plays a very specific role.\n\nThere is a known bug where left leaning around a corner makes you completely invisible to the enemy, so remember that if you're killed and you have absolute no idea how.\n\nAlso keep in mind there are people in this game who have put ungodly amount of hours into this AND take it very seriously!, some will kick you for being too low level or not using your mic. Look for servers that say \"New players welcome\" your life will be much easier (these also tend to be the fullest servers)",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "This game is an absolute disaster now. Everything that made Hell Let Loose great is gone. The last major update ruined it completely. Infantry is broken. Shooting feels off. Hit registration is garbage. Tanks are unplayable. The movement feels clunky and delayed. It used to be smooth, balanced, and immersive. Now it’s just chaos. Nothing works the way it should.\n\nTeam17 has no idea what they are doing. It feels like they never even played their own game. Every single change made it worse. You took something that was perfect and destroyed it for no reason. The community was giving you free feedback for months and you ignored every bit of it. People begged you not to mess with the core gameplay, and you went ahead and did it anyway.\n\nThis update killed the entire experience. Vehicles are broken, the new sounds are awful, optimization is worse, and the servers run like trash. I used to love playing this game. I have thousands of hours in it. Played in competitive with the best of the best. Maybe one of the best players out there. Now I can’t even make it through one round without wanting to quit.\n\nTeam17 turned something special into a complete joke. You had a loyal community that supported you from the beginning and you betrayed them. Instead of fixing bugs or improving stability, you changed mechanics that didn’t need to be touched. Now you’ve got an unplayable, frustrating, broken mess that nobody wants to touch.\n\nHell Let Loose went from one of the best tactical shooters out there to one of the worst. Team17, you ruined your own game. Congratulations.",
      "voted_up": false,
      "votes_helpful": 228
    },
    {
      "review": "ive played since launch, i have never seen a bigger flop since COD. this game used to be perfect, teamwork, communication, content, it was all i ever wanted. ever since launching on consoles, the game has died, theres no life to it anymore, no excitement, theres no substance to the gameplay. NO ONE uses mics AT ALL anymore, and teamwork no longer exists. everyone just tries to run and gun instead of building spawnpoints for the team. I LOVE IT when i spend 10 minutes walking from HQ to OBJ just to get killed by a recon team and do it all over again. Console releases are plaguing the industry for actual good indie pc games.",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "I used to love this game. I've logged 1,100 hrs on it. and if you are interested in a tactical, realistic, teambuilding FPS game. Than don't look here. Once upon a time it was filled with people working together as a team and working together to win a match. But it is no longer that. It has become just a Battlefield ripoff without all the special battlefield perks. Everyone is just running around alone trying to get as many kills before they lose the game (And you will lose}. No-one acts like a squad anymore, much less as a team. And the CONSTANT \"Trolling,  teamkilling, cheating, lack of communication, disorganization, spawnkilling, & insults\" is just running rampant.  I really did used to love everything this game used to be about, and it makes me sad to right this review. Unfortunately the player base just changed too much and it is no longer a tactical shooter. So if you want a WWII battlefield without health-bars, than this is your game. And if you want a teambuilding, tactical shooter. I'm sorry to say you won't find it here.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have nearly 3,000 hours into this game and was excited to see the upcoming changes. However, the number of people using various game hacks has made this unplayable. The devs can add maps and change the rules, but until they seriously address the amount of cheating, I advise not purchasing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "how about you dogs stop promoting a new game and just fix the connection issues on your current game you muts. I'm sick of lost connection to host EVERY game! only on this game though everything else works fine. I will NOT be buying your next game if this is the sort of rubbish you will be dealing up.\r\n\r\nhope you all walk into a pile of Lego and then stub your toe when u wake up in the morning.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "-Spawn into game\n-Nobody on squad is talking except for one other guy\n-Squad lead refuses to place an outpost for spawning\n-No squad coordination\n-Squad members are scattered across the map each trying to be Rambo.\n-Commander gets kicked after 10 minutes so no team coordination\n-Random enemy soldiers are camping my teams spawn points miles away from the main objective\n-Get shot by some random camping spawn\n-Call medic to revive me\n-Medic completely ignores me despite being right next to me\n-Nobody is playing armor \n-Half the team is still defending the objective we lost 5 minutes ago while the other half is outnumbered at the next objective\n-Enemy steamrolls us in under 15 minutes",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Admins of each server can kick you at will based on their own personal beliefs of how the game should be played. Rules of each server are not explained well.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The original idea of this game is great, a nice middle point somewhat between strategy and arcadey shooter. Going through several companies and no real testing or genuine human communication. HLL has been an absolute pain in the backside for myself and im sure others. The current devs haven't been able to release any real content, gameplay reworking without breaking the game in some aspect, followed by the most robot CM garbage of 'we do better, we adding this also & we hear your concerns and then go off to state some random thing.\n\nThese past 5-6 months or so, I've been getting some progressively worse lag spikes, map desynced, staggered comms. Along with the usual bugs that have been around for years. Around August (Yuge armour rework and uneeded ugly UI) this all turned into hard disconnects every 2 games, 3 if im lucky. I can't really play a match now and im over it tbh. It baffles me that these guys,\n1. are still the same team with the same/similar plan for rollouts \n2. some dude/dudette decided they're so good infact, that they should make an entire new game in vietnam \n3. ect.ect.ect.\n\nTLDR: Currently unplayable, good original premise, been steadily getting booted in the ribs over the last few years",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun don't get me wrong. But the amount of CN players Infested matches makes it hard to enjoy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love this game but i would never recommend it anymore. The amount of cheaters have made it unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game used to be an amazing game, arguably the best WW2 game I've ever played. I don't know how they've managed to ruin it so much considering the main structure of the game was there. Not to mention this awful death screen now where it tells you who killed you by what etc. Where's the immersion gone? The game is struggling with some sort of identity crisis.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "imagine get lag for 0.00001 sec and game will dc you. this guys just ruined this game after last update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i used to love this game but after the last update it became impossible to play. it keeps crashing kicking you out after a few seconds",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun game overall, BUT BUYER BE WARE. Game breaking 'LOST CONNECTION TO HOST' makes this game unplayable. Got disconnected probably the last 12 games without one not crashing. The released Hotfix actually made the game crash even more for me. Don't know how long it will take a fix to be made. I would rather suggest checking out SQUAD 44 if this is something you would be interested in. Goodluck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 370 Hours on this game and have taken the time to learn its ins and outs. I have made tons of friends on this game and have dipped my toes into many of the discord communities surrounding this game. I preface my review to point out that I am not a grief-er or just am on here just to complain. I have a vested interest in seeing this game succeed and I really want to see players return! \n\nUpdate 18 Needs to be Rolled Back!\n\nThis update has broken the balance of Tanks, destroyed server stability and has had a huge impact on player retention. I have read all of the dev logs and updates. The simple fact is that people had a positive view of the game before the update and enjoyed playing the game. After U18, the player count has plummeted. Please find a way to revert these changes and be more mindful not to tinker with the balance the game has. For better or for worse, the game is not in early access and the meta should not be changed if the player base is healthy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DMV Let Loose - I went 80 minutes playing this game and saw a collective 4 enemies. The tutorial is garbage and tells me nothing. Army Men World War Team Assault for the PS1 has a better tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't get passed lost connection to host, it all started when the original company sold it. I have played this game a lot and every once in a blue moon I get in to a server and get to play but I spent an hour picking sever and 95% of the time I get lost connection to host, this problem has been a thing since the they sold it. It has nothing to do with my WiFi connection because I have tried different connections and even switched internet providers hoping this would solve the issue but still no luck. This used to be my favorite game so this is very disappointing!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'd like to say \"i cant believe I'm giving Hell Let Loose a negative review,\" but SERIOUSLY, ever since the tank update \"lost Connection to Host\" is CONSTANT. And i never had that before! its a problem with everyone too! Look at the forums! Holy COW this is stupid. Dont buy this game until this is fixed. It is actually, literally, unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Almost 6 years on the market and it still is an absolute mess when it comes to performance and stability.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Official servers filled with hackers. Clan servers filled with clan members who cheat and hack. Unplayable game where there is no way to report hackers and cheaters except for admins on private servers wich will never kick their own cheating clan members. Don't waste your time in this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "what good is a shooter game when it stutters all the time? or any game for that matter. no matter how good the graphics are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terrible how badly they have fucked this game up - absolute dog shit it just breaks. im running through a feild and the game minimizes to a tiny screen and I cannot do anything to fix it. alt+enter, somehow change resolution / screen type and it just breaks and does nothing.\n\nCrazy how good this game was like 1-2 years ago and now it just doesn't function properly and breaks constantly.  so disappointing. How do you have a fully functioning product, and then break it so bad its unplayable. so bizarre. Was so hyped for HLL Vietnam but will DEFINITELY not be purchasing anymore. Devs cannot be trusted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "always \"lost host connection\" at the end of the game. lost all progress and exp. what a shitty game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nah, this is NOT it, I hate this game with an actual passion, and it's not because of a skill issue either. This game is just trash that's hard to swallow. Ever heard of Enlisted? It's a free shooter that's better than this game in EVERY SINGLE ASPECT. On Enlisted the maps are better and have some impressive destruction (slapping a window with your gun to open it up and shoot out of it is always a thrill). The progression system is also way more in depth and can be nearly fully completed without paying a single dime (there is a free tier tree with most items and a few select paid ones I see nobody ever use). The experience of spawning in this game is just walking for 8 minutes just to get shot by some guy across the map you can't even see cause this game's graphics and clarity are genuinely awful compared to Enlisted. This game runs so poorly for me even on the lowest settings, I can run Enlisted on it's highest settings with much smoother feel and framerate. This game is just so bad in general.. I don't see a point to paying for this when it's such a genuinely dogwater experience compared to a free to play game. One of the few free to play games without straight up pay to win features in it too. Enlisted is just better, there are more maps, more weapons, and more community in general. Imagine war thunder crossed with an FPS, that's Enlisted. Alright I'm done riding the Enlisted dev's schlong now, but seriously, try it, don't waste your money on this and try Enlisted first.\n\nTLDR: Just play Enlisted, it's free and better than this mess of a \"game\".\n\nTo any hurt feelings from this review, cry more, I don't care :)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have 570 hours in this game. I literally played for 4 hours today and couldn't finish a single game without being booted at the very end due to a \"NETWORK ERROR\". Absolute waste of my time. Team17 has completely ruined this game. But hopefully they feel wonderful about themselves by adding \"features\" that literally zero people care about nor asked for. Great work ruining a gem, chaps.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played 2 games. Now it simply won't start \"Network error occurred\" after trying a dozen different fixes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great \nhowever i get kicked every game because i loose connection to host when i mean every game i mean every \ni play for 30 mins then get kicked to loose all xp gained and cant progress sort your servers Team 17 its trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hell Let Loose – A Masterpiece… When It Actually Lets You Play\n\nI absolutely love Hell Let Loose. The graphics, the atmosphere, the sound design, the gameplay — it’s pure cinema. When the game works, it delivers some of the most immersive and intense battles I’ve ever experienced.\n\nBut actually getting into a game with friends? That’s a whole different war.\n\nTrying to find a server with enough space and good ping is already a mission. Then you finally join, you play for three minutes… and one friend gets disconnected for no reason. So you try another server, only for someone to get kicked because they’re “not speaking on the mic” despite having barely joined the match.\n\nAnd this loop repeats. For an hour.\n\nIn the end, it feels like we spend more time fighting the server browser than fighting the enemy. It’s frustrating, it’s a waste of our time, and it takes away from what is otherwise an incredible experience.\n\nHell Let Loose is brilliant — it just needs to stop letting players loose from the server every five minutes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game itself more or less seems fine. I didnt play enough to see all of it. I refund it because i see how thanks to low Player counts and tons of servers demanding a certain Level cap its basically impossible to enter into the game properly. And the one match i was in had literally no one using a Mic. From the community posts and online discussions aswell as some reviews of Veteran players its honestly obvious that while the game is not really dead, the community is closed off and a new player wont be able to enjoy this fully. I recommend you should play something else and either wait till the game seems to have gotten better or well dies off. Sad really...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is awful. I permanently removed it from my account. I wasted my money, and after countless attempts, I see absolutely no point in playing it anymore. Still, that was the right decision, because the gameplay itself isn’t fun at all. It lures you in but gives you nothing but irritation. Everything about it is wrong, and the system is full of exploits and player abuse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i`m so disappointing in this game,gameplay is so terrible,looking videos,gameplay i was so hyped and then wow so bad,playing 20min for me was enough.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll admit that I have only played this game for a few hours so please take some of this with a pinch of salt as I could be missing something. I don't get a whole lot of time to game anymore so I bought this to pickup for a quick round or two, this game is definitely not that kind of game.\n\nFirstly the game looks great, movement feels good, and the maps are massive and varied. The gameplay is immersive and exciting.\n\nHowever, my issues with this game mainly come from the waiting. If you want to join a game with lots of people in you have to queue (kind of expected on popular severs on most games). When you want to spawn you have to be part of a team to do so. Most of the teams are locked so you have to wait until one opens up or make one. You then have to wait up to a minute before you can spawn.  but wait! \"The team you are in doesn't have a leader!\", \"that's an extra minute added to your spawn timer\".  Then within a few seconds you're dead from spawn campers, now you have to wait another minute on top of the the regular minute. If you don't want to be spawn camped you then have to spawn further away from the front line (remember I said the maps were massive), I found myself wandering for a long time to get to the action.\nSo I spent over half of my play hours sitting scrolling on my phone waiting for countdown timers. Admittedly, the short lifes I had likely came from a skill issue on my part but that doesn't change the silly amount of hanging around there was.\n\nI purchased this on sale but if I had paid the full £45 for this, I would have been disappointed.\nI feel if you have a lot of time to put into this game it could be really good but I found the constant waiting frustrating and it showed it was definitely not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no SEA servers, only CN servers have stable ping. either you play with english-speaking players with unstable connection, or play with mandarin-speakers with stable connection. This games heavily requires coordination, so if you can't speak chinese and/or have a bad connection on english servers, this game will not give you any satisfactory gameplay. Unless the devs add an in-game translation, I will not recommend this game to everyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent about 20 min and didn't shoot a single bullet. Spent 10 mins joining a server. Then spent 10 mins spawning and running and getting killed without seeing any enemies. Not sure how it's supposed to be fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game when it works. Unfortunately, the most recent update has made the servers very difficult to stay connected to for many players. I can't recommend it in good conscience until this issue is resolved.\n\nEDIT:\nYeah, even after every possible solution on my end up to forwarding ports on my router (something no consumer should ever have to do to get a game running properly), I can't stay connected to a match for more than 10 minutes. The update causing this issue has been out for almost two months, but in a game with such a small community already, I guess 10 percent of your users isn't enough people being angry with you to do anything on your end about the problem. They must just not care very much about their fans... Great work, guys...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very pretty game, really gets you in the mood. Sadly, two things really held it back for me:\n1. It was crashing, quite a bit, for me and my friends.\n2. A lot of servers would not allow you to play certain roles without leveling up, which kinda just sucked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a Squad player I REALLY fucking hate this game. 25 minute games (since nobody communicates you will get steam rolled by any opposing team that actually does)  running simulator just a big map deathmatch game.\n\n\n\nMeh good first time you play it then really gives youy reason to go back to playing Squad. Buggy and badly optimized runing and dying siumlator with no sense of objective.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 125 hours played in this game, lately this game turned to crap. Bunch of performance issues and bugs with latest updates but that is not the most frustrating experience. Now there are cheaters and devs not doing anything with it. Dont get me wrong it was always simulator of dying on the front line but last 3 months it felt like people see me through buildings and obstacles. Maybe I am bad but somehow I played so many hours and had fun. well, unfortunately not anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent money buying this game today played 3 or so hours, I loved the immersion and gameplay however, EXP not registering my first experience with HLL and already a broken feature.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the latest patch, servers seem to be overrun with blatant cheaters. I never encountered any in this game beforfe, but it is now unplayable. Literally immortal enemies teleporting across the map or blowing you up immediately. Otherwise a rather good semi-realistic WW2 shooter, but if this doesn't get fixed soon, it's a dead game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, the strategic pace, the squad-based combat, the factions, and their unique weapons. Overall, I’d rate it a solid 9/10.\nThe only issue I’ve found is with the servers. There aren’t many official ones, and most of them are full with long queues. As for private servers, you need to be at least +30 lvl, which is understandable, but without enough official servers to level up on, it’s nearly impossible for new players to enjoy a good match.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Currently uninstalled. \nThis is not the game I supported on Kickstarter.\nSeems the focus has changed towards paid DLC skins when backers are still waiting on ones promised on Kickstarter.\nSince 2021 23 DLC have come out.\nListen to the community, fix the game play.\nAdding paid DLC for a update when the game update is in a bad state says a lot about this company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs hardcoded a key I use, \"P\", to open the in game menu. I can't change it. This key is integral to my keyboard layout. I know it's not a big deal but I can't play the game anymore because of this. thus I leave a negative review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "after 1316 hours of game play it is now unplayable the ip will be past around for profit until it hits the dust \ni have requested a refund on the fact the game does not even work doubt i will get one but worth a try such a shame \nits clear the team implemented updates which caused critical problems in the code once it goes to far there is no real way back",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DONT DO IT, I want to make something very clear, I didnt spend a sec playing the game, I spent the entire time in diffrent loading screens, and when I found a way to load in and when I got into the game, the game instanly DCed me becouse \"host lost\". don't waist your money. an hour and 30mins gone...what a waist",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game fucking crashes when trying to open the server menu.. my specs are good so wtf",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "garbage, can't even load the game.\nstuck at loading the map.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starting this game SUCKS. Team mates kill you while you are trying to learn. you can be kicked for absolutely NO REASON. Loading into games or even the practice range takes FOREVER! I'm trying so hard to learn because I want to play but this has been trash so far. I will change this if down the road if I can get past team kills for no reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont bother buying. Between the cheaters, the terrible patching and crashes, and half of even high level requirement servers are total vacant skulls that dont put down garries or OPs. Every single time. \r\n\r\nIve noticed european servers are way better with the teamwork but being US based the ping on most of those servers is unplayable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After all my time playing it was pretty a miserable experience. Every death was to somebody sitting in something not moving, window, tree, bush, off in bum fuck nowhere. They would sit and not move a single muscle, basically moving in and building a camp in one spot. With the death experience there is no learning from it, no location of where you got killed no indicator or kill cam. Nothing. So you can't ever learn from dying to plan the next life accordingly. So I get punished for trying to maneuver and flank, because I get one tapped from someone sitting in one spot beating his meat and not moving a single inch. If you are a player that likes to sit in one spot not really moving and just play the entire hour and a half in a single generalized spot they buy the game and install it because you will match the player base.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Feels like a walking simulator half the time, with long runs and long waiting times between actual action. Performance swings from mediocre to bad, hit boxes feel unreliable, and cheating reports show up often enough to be noticeable. Combined with crashes, stutters, and sluggish controls, the whole thing ends up more exhausting than rewarding. Not recommended.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not fun game to play, crappy moderation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "players are all larpers from the armchair division who struggle to pick up their backpack off their mom's basement yet want to claim their game is so quirky and realistic despite being more arcade than any other wannabe milsim on the market.\n\nTeam17 should be the first red flag you see since they haven't made/published a good game in decades\n\njust get literally any other WW2 game on the market, they're all the same but at least they don't have a performance jankier than Cyberpunk 2077 and break if you try to even play with the video settings.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oh god stay clear, running simulator without the running, more just screen shake and heavy breathing, terrible game, exceptionally boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every match has lag spikes and random server disconnects since last update. Don't buy until they fix this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing this for over 1700 hours and recently the game has started to crash every second time when I open it. \"Low level fatal error\" or similar and after it starts working, all my configurations and settings are gone! \r\n\r\nPretty much unplayable now. Used to be my all time favorite game :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It doenst matter the graphics.\nIt doesnt matter the audio.\nIt doesnt matter the type of game.\nIt doesnt matter how many people play.\nIt doesnt matter the general idea of the game.\n\nA game that have hacks, its a no sense trash game.\nThis is just as bad as all of any other.\nI wish we had bots so i can play a fair fight against soldiers that cant see behind walls.\n\nA trash game.\nIf vietnam allow hacks, again, another trash game.\nALL games that cant deal with hacks, is a trash game.\n\nToo many lifeless tiny snake scums playing games this days, there are no point of playing this if you are playing against hacks.\n\nI have more fun playing mario kart from snes than playing this garbage.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yeah this game was pretty terrible. I wanted to play as a tank crew but couldn't do that because of the level 4 millions getting them first. Couldn't even really spawn in because there's just players camping in bushes outside of all the spawns. Everyone is better than you because they just sit in their basement and play this all day as part of their weird roleplay fantasy. Even 75% off I wouldn't recommend this suffering",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spend most of your time on the floor dead, it's tutorial sucks and I don't wanna waste money on a game I don't have fun playing. It's a cool idea but the more - ahem - experienced players tend to find the spots to spawn camp almost all the time and the maps are very big, which is decent I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kind of like if you were to have squad 44 with battlefield players, cool if you like it. Not for me, zero communication, zero team play. run and shoot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "arty has been ruined, get shot by pros quicker than you can react because suppression doesn't faze their aim. Servers have gotten worse and cheaters are plentiful. Muzzle flash doesn't exist unless you are an MG gunner. Tanks get stuck on the stupidest things. Same feeling as war thunder.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its like broken to all hell shame realy it used to be more stable and more fun",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just not very good.\n\nYou feel like your walking in goop, your guns sounds are not great to bad, comms are nearly non-existant compared to others games in the genre (Squad, PS/Squad 44), I don't remember the last time I was picked up by a Medic (and I alwasys wait if there is one within 100m)\n\nIt has some great additions (Artillery is fun to use, smaller squad sizes are nice compared to PS/Sq44, Comsmetics are AWESOME) but just falls short when actually being played. And the visuals are great also!\n\nIf you have a small group, tank is fun, if your a medium group (4-6) inf is fun. If your solo don't bother play Squad. \n\nSo sad that PS died compared to this game, should have been the other way around.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not fun at all. The movement is sluggish, the sound is sub par, and the maps are a dull brown barely any color that it makes seeing enemies a pain. Then you have all the blue dots from your team distracting you as well. The redeploy window is terrible too making you wait over 40 seconds to get back into the game. That is lost time. I really tried to give this game a chance, but it is more a chore to play than having fun. If you are looking for a RO2 replacement, this is not it.\n\nIf the new Vietnam game will be anything like this game, it will fail hard. I am not asking for faster speed movement, just more fluidity; less heavy feeling. It also needs better map design, better raw sound, and a respawn system that makes sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ESP hackers are rampant and everyone defends them for some reason. What ever PRO-cheat indeed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not fun. Only few maps running on servers british faction disabled on most servers cheaters galore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Developers not doing much about hackers. They literally wallbang and can hear bullets following you wherever you go.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "WORST WAR GAME EVER! The players are completely toxic. You wont even see an enemy. You will only spawn and die from random 5000 yard cheater shots, over and over and over. There is nothing good about this game. Everything looks foggy. Every player is a hack. Play Enlisted, instead. I WANT MY MONEY BACK!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i want to play with bots i don`t want to play with online every time when i play online i got kick out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lowk ass, but im ass i see how ppl WOULD like this, i love ww2 games but i hate dying right when i spawn right after i waited like 15-20 secs to respawn yk.\n\nif ur a nerd youll prolly like ts, i thought i was a nerd but i was very wrong.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game either doesn't load or the server times out. \n\nP.S. I have good internet and I have played this game on my Xbox",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not as good after some of the recent updates. It’s a shame because I used to love this game, but now everything feels more clunky and less smooth than before. It really just isn’t as fun to play. Unfortunately I’ll probably end up dropping this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i`m so disappointing in this game,gameplay is so terrible,looking videos,gameplay i was so hyped and then wow so bad,playing 20min for me was enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game's absolute garbage at its best and at its worst.\r\nConcept is fine but its 100% either riddled with cheaters or Graphics abusers,bad renderring,absolute horrible movement, and the squad concept itself is complete nonsense.\r\nSo is the weapon choises for classes are beyond questionable due the fact that some random RNG nonsense decides wether you kill someone or no apparently, if you dont for some reason, they burst you because everyone is either running automatic guns either magical rifles that shoot across the map, and if you do not onetap people (yes on mutliple occasions you wont,because fuck you thats why, its that simple) youre dead, and back at 3hr respawn screen(20 seconds is the least time you get, gl spawning on garris because then youre at an average wait time of 5 hours,LMAO, garry gets overrun, youre at another respawn timer for another 90 hours)\r\nThe shooting is wonky, so is moving,vaulting,going prone, you bug trough walls, and if that happens, of course someone with 90K monitor and apparently eyesight of a genetically modified eagle  will most likely kill you while actually looking the other way\r\n(good luck playing machine gun, everytime you vault it it wither shoots you pwards to the sky or completely locks you out of normal horizontal sight, you will respawn it 10x times to get the position( no you wont youll get shot)\r\nGraphics are shit, and youre pressured into devolving them into more shittier options due the fact its the only way to see something, you do that yet still you have to glue your eyes to the monitor because every pixel might be a redered moustache of an enemy combatant, and god forbid you miss that moustache and dont dome him instantly,because if you wont he surely will, because of course, somehow he sees trough brick walls,sandbags,rubble,bushes,concrete, and most likely trough your soul.\r\n\r\nSeeing something: you cant see anything, but apparently magically everyone can see you, you get domed from questionable angles,places. (whoever yells skill issue is a delusional pedal) Even when you tune the settings to see something as some people recommend its still absolute garbage and it completely ruins the gameplay.\r\nSquad composition: its horrible, due the fact that medic as it is is completely useless in general, everyone just taps respawn and youre left in a field or ditch and ofcourse you get shot,because why not.\r\nOfficer: some of you will be FORCED into playing officer  if you want to play with friends and the role is utter nonsense whatsoever,you will get flamed, and you will get raged at by incompetent  Commanders.\r\nEveryone else from the playable options are just meatbags with Musketeer rifles and a deathwish.\r\nMaps are absolute garbage: as far as ive noticed on most maps theres always one team with complete advantage over the other field wise, doesnt matter if its assault or warfare, good luck being on the recieving end because for 2hours at minimum you will die and suffer.\r\nhave read multiple posts that this game has no cheaters almost whatsoever (a blatant cope and lie)\r\nOne of community server admin mentioned they ban 12-15 cheaters a month( i asume you can easily multiply that by 3x times) soft aim and ofc ESP, because theres no god on this earth that someone could convince me that people just are so good that they 360 noscope you in a tree,rubble,bush FILLED area from 400 meters while youre being concealed pretty good ( there are ofcourse good players i dont doubt that)\r\nMap sniping is a constant issue it seems, because noticed on multiple times that when theres more than 7 people from the same clan playing, sometimes one of them hops over, and then suddenly garris get instawiped on our side after 2-3 minutes max, that results in a blitzkrieg from their side.\r\nAs an officer have heard from commanders the same thing when they say in VC that some people joined and instantly garris go down wherever they are.\r\n\r\nGames good for a while while playing in group, after numerous sessions you understand that its a crowbar but its straight: basically unusable by any means",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dogshit quality servers, server queue browser is utterly slow and horrible, game plays like a flimsy piece of plastic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maps are too small, creating a very fast paced COD like experience. It's a chaotic experience, zero downtime and very little strategy. I recommend either waiting for this game to go on sale before you grab it or until they fix the map ratio to player problem.. Unless you like the meat grinder then go for it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a piece of bullshit today, you cannot connect to servers, unplayable and broken. It's such sahme for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Time to revert the patch fellas. No reason to keep the game when you cant get more than 15 minutes into a match without a fatal error or losing connection to hosts.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "running at 100+ fps, its running fine but I keep having issues with connection and loading in.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved this game. Loved playing it with friends and alone. Now i cant even join a server at all. Period. Point blank. The bare minimum for a game is that i can play it. With this game in its current state i cant even do that making it nothing more than blank space on my SSD. Will be uninstalling and not even considering playing until this is addressed and fixed in its entirety. As much as id love to recommend this game to people i will instead dissuade them from wasting their hard earned money on a game that doesn't even let them play the game. Hope this gets fixed but wont be holding my breath. RIP a phenomenal game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game wouldn't let me change settings to fix its stupid clicker issue, and it kept moving the mouse cursor it had rendered invisible NOT where I was clicking, and server filled up when I needed to restart it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its ok. \nBUT.\nLike with every shooter game with intrusive foliage ( MUH IMMURSHON-grass), foliage is in bad need of removal or reworking. It is exploitable to infuriating degree, to point where you may be laying down in a ditch full of grass, but for anyone past 100m, you may be plain visible from even slightly elevated position. And you can't even see what kills you. \nTerrain/map feature wise:\nTrenches in maps are too narrow, people cannot get past one another in them. \nMost windows are either too low or too high to be of any use, for anything.\n\nyou will also for some reason become blind shellshocked drooling vegetable if a single bullet so much as passes you within 1m radius. your eyes will cross so hard you will be able to see close up view of your own nasal bridge. They cross so high that any more and you'll risk being able to see in the fourth and fifth dimension at the same time, with how absolutely fouled up, up your sight is. \nNow imagine how bad it gets when machine gun opens up anywhere near you. \nWhich, mechanically, by the way, is idiots invention. It could be understandable if explosions had such effect. But not with bullets. The make believe suppression effect, is just plain bad. \nIt is so bad that i almost understand why someone might want to cheat in the game.\n\nYour view point is actually at your neck, rather than where your eyes actually are, so even if you think you are hidden, someone is going to pop your dome and you can't even accurately tell why it happened because you cant tell, if part of you is visible to the enemy. \n\nAnd speaking of visibility, there are a lot of people trying to shoot you through solid cover. Whichever magic it is that they use to see you then, who knows. But you will see that often enough to be too much.\n\nEDIT:\nMost of the time you end up having to play a squad leader because nobody else will do it, and for that, there is a reason because after you reach level 6 as squad lead, you get exactly nothing worthwhile for the effort. Squad leaders need more loadouts or ability to rank up other specializations with the xp they gain so there might be at least a theoretical reason for why anyone would want to play as one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloody hell the servers keep crashing, players are as clueless as BF6 player, and admins are power tripping with \"seeding\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A thoughtfully made, beloved game. It was bought by a studio of cynical digital rentiers, who are also 'developers', but more in the way that property developers are. They occasionally release updates as a minimum gesture to the idea that they're interested in raising the quality of the property instead of the just the rent. In doing so they've painted over most of the power outlets, the 'handyman' hardly ever picks up or responds, and the best you're likely to get as more and more utilities break down is a lost security deposit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No death penatly makes this game chineese on your back simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not fun, too slow paced even for a Sim game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A NETWORK ERROR HAS OCCURRED. PLEASE TRY AGAIN.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "100% camper game boringgg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you change your time and date settings on your pc it won't let you join a match",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid shit barely works",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "dont buy this game. dying simulator. will see you in vietnam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hell let loose in a nutshell\n-Spawn as a german medic \n-Get in a truck with a chinese guy, a 4 year old and a 47 father of four and five combat deployments\n-Get hit with artillery\n-Respawn at garrison spawn\n-Run to the objective and revive a swedish guy (he thanks you and dies 4 seconds later)\n-Go to a nearby field\n-Get head shot by a guy (you didnt see him)\n-Spawn at a church \n-Look out of a window \n-Get hit with a granade\n-Die 20 times in one match and get 2 kills \n-Uninstall",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game not launching since update!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "6 years in development, - you can't change resolution on PC",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why cant i see who shoots me but still feel their bullets that connect with my brain matter",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "aint no way you dont even have a tutorial",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the emperor did NOT protect me ;w;",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Absolutely shite. Don't waste your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "menu simulator die and u have to wait 5 mins to respawn",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gamje is compltely brtonken",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}