{
  "positive": [
    {
      "review": "It’s not a game for everyone, but for those who want real rally, it’s one of the best you can get.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Most addictive and best game ive ever played. From a simulator experience its the best rally game out there.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I have tried various rally games, ea wrc, ac rally, all the wrc series and I can say that Dirt Rally 2.0 wins on so many levels. Feeling the cars physics, tracks, responsiveness, graphism etc.. overall just a better game. I just compared AC rally now with Dirt rally 2.0 and I find dirt rally just much more realistic and more pleasurable. This is on Nov. 15 2025. Maybe AC will improved but it is at this point not worth the hype at all. Hey, Dirt Rally maker, please continue to work on additions or expansion. Don't give up, you are the best!!!!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Works well with the Logitech G29 and a thrustmaster gear switch. Does have a rally like feel in the driving. Some animations look really bad, but that is the non-driving part.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It work the car is very much work. it will drive forward, cuz it work. dont break it, then in it dosent work.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "solid sim, appropriately unforgiving, fewer tracks than wrc, but better feeling to drive",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best rally game, very well optimized for vr, high-end racing equipments and motion cockpit. it's a great enjoyment every time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First rally sim style game I played. It's tough but fun. It starts to click and then it's very fun getting in the zone shifting and braking and whatnot to keep the magic carpet ride going without slamming into anything (too much). The car tuning stuff is a bit much for me but thankfully it's not crucial to have a more relatively casual experience. I play with an xbox pro controller and works fine. Graphics won't blow your mind but hold up in 2025.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There has never been a more convincing representation of four tyres slithering around on gravel than in this game and it makes every second you spend sawing away at the virtual wheel a joy. \nThe Dirt series has hit new heights and, as usual, it's flat over the crest...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Goated car game, feels very responsive and realistic. perfect for rally enjoyers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best rally game ever made by far none of the new games even come close. everyone who loves racing games or rally should buy this game and give it a go. it shows you truly how hard rallying is and makes you appreciate the sport even more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Looks great, runs great, feels great, very playable on a gamepad, there's no going wrong with this one, it really is a shame what EA did to Codemasters, because this is Codemasters at their full potential...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to get into rallying and sim racing in general. Note: In the trailer, it shows the GR Yaris but there is no yaris.  :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me:\n\n1. Go outside and watch real rallycross events\n2. Discover the joys and horrors of Richard Burns Rally\n3. Waste i mean valuably spend 210 hours of my life, including my time in DiRT Rally 1\n4. Realize that holy demonetized mid 90s peugeot engineers somehow made a naturally aspirated 2.0L i4 that revs to 10,000RPM making 280hp, then put it in a FWD, and somehow it was fast enough to beat late 90s group A cars on tarmac???\n\nCannot recommend enough. Go play RBR and support your local rally club",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lose every time in easy mode but it is the nicest arcade rally game really. Let's hope EA doesn't change it 🤞",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing fun! the egraphics are pleasing, the cars controlls realisticly. but the \"5 restart rule\" is too strict in my opinion. luckily, the freeplay doesnt have that rule so you can have endless fun there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]Oldie but goldie[/h2]\nIt’s the end of 2025 and this game is still fantastic. Don’t be misled by comments about [b]EA’s servers - they’re still running[/b], and you can easily compete with others on the leaderboards. The best proof is the fact that [b]more people are playing Dirt Rally 2.0 than EA WRC[/b]. There’s plenty of content here to enjoy for dozens of hours. Historical challenges, career mode, and the rallycross career all offer a lot of fun (although I’m not a fan of how the difficulty scales in rallycross - when you’re racing with the AI in your lobby they drive calmly, but outside of it you get much faster times that are hard to compete with).\nGrab Dirt Rally 2.0 GOTY Edition on sale and you won’t be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't driven a rally car (yet), so I'm not sure exactly how realistic some aspects of the handling are, but driving with a basic Logitech G29 in this game feels really nice. My favorite car to drive in this game as of writing this review would probably be the 1998 Subaru Impreza S4. My favorite rallies in no particular order are New England, Finland, and Sweden; though I enjoy all of them in their own ways.\n\nI wish that this game had longer stages and maybe some more variety. The longest stage is, if I remember correctly, about 10 miles (16km) and there's basically only two tracks per location with each of those is split into 6 stages: forwards and backwards for the full length of track, then split in half and the halves being forwards and backwards. Of course, it's still plenty to keep you busy for a while.\n\nMy biggest issue with this game is that I can't drive a RWD to save my life, but that's just a skill issue on my part lmao. Maybe one day I'll figure it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definetively, Dark Souls of the racing games. Give it a go and enjoy missing that damn corner over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was fun at first then got consistent game crashes every other race.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun rally racing game that does not go overboard with simulation, but at the same time gives a sufficiently realistic experience to make it relatively easy to get into. There is a lot of content here, and you will have to get used to each car and each track. If you have never played games of this genre, this is possibly one of the best options to get into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had this in my library for  donkey's years without hardly playing it.\nRecently bought a decent computer and dd wheel, and it's \none of the best games in vr for speed , immersion and challenge (on dirt and gravel)\nTarmac ffb is crap! ....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a good game with communities still running clubs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good rally game, gravel physics are iffy, need alot of dlcs which sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game use the t248 and th8s shifter with a usb handbrtake all on my desk and its great !! defo recomend good fun for any car enthusiast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "how come all of the DLC are free on PlayStation except the vr but $130 on here. dosent make any sense. Kinda bs. But I absolutely love the game tho probably my favorite one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decided to jump back into this before assetto corsa rally comes out. Played a good amount of Ea WRC and this feels pretty solid, am still a rookie at this point, but fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since I bought for a discounted price, I think it's OK, that it includes fictional places like Australia.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There's a huge reason why people still play this. Beautiful, always feels great, this is the gateway drug into rally if you have a steering wheel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For the love of god.... PLEASE !!! let me turn off that s#!t steering assist that comes on when you use a controller.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "rally realistic but whre is anti-lag or im youst dump 1 of 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have a ton of hours on this game but recently moved to PC. Still a great game and still my go to for racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff. Easier than RBR but the day/week/monthlies are usually fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I get to drive my first car, rallying through places like I used to drive mine (factory model:))\r\nCan't afford one now :)\r\nI also used to jump the humpback bridges around locally (don't please, hypocrisy I know).\r\nEscort Mk.II baby.\r\nI love you\r\n(My 2nd car was a Mk.I)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hands down the best rally game in the world right now. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is awesome, but they made it the hardest game possible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good rally game, still holds up in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good wish they made a 3rd one.... also would love to see one with the ability to go offline and not need a internet connection 24/7 to race in a solo event.... come on why you gotta do us dirty and make us have internet...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a rally sim. If you know what that means, then you know whether you want to play it or not. If you don't know what it means, first do some googling and Youtube clip viewing. A wheel helps, but you can still play fairly well with controller and keyboard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun when you get the hang of it,i recomend playing on a wheel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good but website works like its powered by potatos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure how you can make a great game better, no complaints. This is peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insanely good graphics and driving feedback",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fucking right get the game on a sim racing wheel oooo weeee this shit feels nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worse that cock and ball torture",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Esse jogo é o melhor da categoria, recomendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game to crash on evry turn i would recommend :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Car go vroom. Mud go everywhere. Pure rally. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game, so detailed.\nThe hours don't lie...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "not sure how accurate it is but its very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "patience and a little ffb tweaking will get you far in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes hard, but very enjoyable game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "car totalled, went through finish line at 0.1 mph",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Argentina - denial, anger, acceptance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My fav rally sim. Hands down the crown jewel of the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El mejor juego para empezar con volante",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect racing game for Steam Deck👍🏾",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm addicted! Its true, This is the \"Dark souls\" of sim racing and I LOVE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hot cars rub their tyres on the floor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "car go vroom on dirt. is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "started the car hit a tree 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best rally game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, may melt brain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah dirt rally 2 is still king try again asseto mfs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice games just wish i knew how to play it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es un juego muy solido",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game feels very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dirt rally 2.0 is so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenominal\r\nBest rally game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a good old game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game simple.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to much fun  Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must for rally wannabe drivers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Peak Rally Lover's Simulator Frrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun rally game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "badass game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 dope game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun rally game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game ig",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game gud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a joy to play every once awhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a visceral master piece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vroom vroom very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me very much recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very real feel",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game will stop you from playing single player races and anything else because it cannot connect to EA's spotty servers. The game mechanics are great and I enjoy the game but I am not able to play anymore because of the game's always-online requirement. If EA can't maintain their servers, no one can play this game anymore. Don't waste your money as you are renting access to the game.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "the game is great beautiful and speedy but it has many problems. the physics are too light and cars can be sent flying by a single rock. wheel is too stiff and has almost no feedback. cars have barely any grip on tarmac and they are floating so they lose traction very easily especially rwd which drift uncontrollably and its annoying. anything else about the game is very well made though",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Great game, lots of fun. Pace notes are not always accurate. But what really kills the game is the server connection issues. It's a single player game which forces you to be always online and have a connection to the server. Only that one out of four times the server connection fails and I cannot play. It's not my connection, every other game works perfectly fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I often can't play a single player part of this game because the servers are down all the time?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I couldn't get past the start screen and too many people have not been able to figure out how to get past this bug. I tried to contact support for the gwme but it didn't work. Since the Devs aren't supporting it anymore I had to make a choice. Chance it and likely waste my money, or do a refund through steam. Luckily for me AC rally is being developed. So I waited and I am now playing that.  \n\nIts likely just a matter of time before you can't play it either. Don't buy this. Richard Burns Rally and ACR are the way to go.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "*Playing the game*\n\"Oh wow this game is amazing...\"\n- Great physics\n- Great graphics\n- Great gameplay\n- Amazing wheel support\n- Lots of cars and tracks\n10/10\n\n*Exits game for a while and launches it again*\n- Server refused your connection\n- Cant connect to servers\n- Connection failed\n- Servers are busy\n...And for the next hour or two you can't access most of the game...\n\nI would rate the game a thumbs up but since connecting to the servers is such a horrendious task I simply cannot give this a positive review.\n\nEA please fix your servers. Dont abandon games people actually like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well it was fun while it lasted. I would avoid spending money as the servers have had issues connecting. Unplayable without the ability to connect to servers....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but they have such shit maps, and  90% of the game is pay to unlock, shit concept and needs to stop for games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "horrible game, callouts are mad inconsistant and blatandly wrong. messing your stage up completely, 1 miniscule tap or a bump and your rolling at mach 5, no idea why i bought this or why i should ever keep playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "good gsme but too much space not worth it for the 109GB it takes up not including dlc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very good and intense game.... \nBUT....\nthe settings for wheel is very limited and doesn't explain anything on them...\nFreeroam has ONE track thats not even a track.\nCareer mode is REALLY DRY.\nDoesn't feel like your even playing career mode at all until you realise you have to retire because you ran out of restarts and car is internally damaged.\nOTHER THAN THAT,\n\nGame is great. graphics are great. cars sound amazing, physics are good after you find ONE car to master. i would reccomend to someone who is a controller player.. but wheel players, unless your seasoned at car games and are used to very little explanations in settings then i do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics seem over assisted and almost Forza-like. Doesnt help this game doesnt want to work until it has established an online connection. Thankfully Asseto Corsa Rally is out so there is no more reason to play this for graphics or RBR for physics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great good driving experience but so horrible UI/UX design that i cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA Bought this game just to kill it and consolidate the genre into their WRC series.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC does not work in myteam, known issue for long - no way to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is way too hard. Recommended only if you are a professional racer or a retarded person who doesnt have any work and plays game 24*7.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has a game ever been more lame than this?? It's racing without the controls. The car just slides around and does whatever it wants. It's about as fun as being stuck in the mud - which is to say not at all. \n\nDon't bother playing with a controller. This game demands precision waaaay beyond what a controller can provide. If you don't have a really good wheel, don't bother.\n\nOr better yet, just don't bother with this... whatever tf this is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ticking clock for when EA pulls the plug and you can't play half the game modes (including career mode, the main game mode) because they're always-online modes. EA just announced canceling future support for their recent 2023 \"EA WRC\" and paused development for all their future rally titles. I can save my money and my surprise for when the servers suddenly shut down by picking up a cracked copy today! I'll cut to the chase and focus my time on the content that won't soon be cut. Gameplay-wise, good rally game, Dirt Rally 1.0 better though in my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "steering weels dont do shit and cannot be configured correctly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics are silly and unrealistic, it feels like a huge step back from the first one. The menus aren't clear on car set up. It just feels like a poorly compiled money grab,,, well done Codemasters,, you got my money,, but you lost my respect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HELL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fine but EA's recent decision to remove support for all of their games from linux targets is horribly misguided and very disappointing as a user who only uses linux. My money was good enough when I bought the game, but now that the refund period is over, you want to say that I shouldn't be able to use it without an OS that abuses the user?",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "The game will stop you from playing single player races and anything else because it cannot connect to EA's spotty servers. The game mechanics are great and I enjoy the game but I am not able to play anymore because of the game's always-online requirement. If EA can't maintain their servers, no one can play this game anymore. Don't waste your money as you are renting access to the game.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Good Rally game in it's core BUT.... Don't buy it at full price! (yes, not even the 20 bucks they want now). The way they butcherd the games content just to sell it to you as a dlc is disgusting. You can put another 40 bucks (roughly) into it, just to get the rest of the tracks. And don't get me started on cars...",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Terrible do not reccomend. does not have an accurate represantation of suspension in relation to a car. you hit one small rock abd your car turns into a projectile. Booo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, lots of fun. Pace notes are not always accurate. But what really kills the game is the server connection issues. It's a single player game which forces you to be always online and have a connection to the server. Only that one out of four times the server connection fails and I cannot play. It's not my connection, every other game works perfectly fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is great beautiful and speedy but it has many problems. the physics are too light and cars can be sent flying by a single rock. wheel is too stiff and has almost no feedback. cars have barely any grip on tarmac and they are floating so they lose traction very easily especially rwd which drift uncontrollably and its annoying. anything else about the game is very well made though",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I often can't play a single player part of this game because the servers are down all the time?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I couldn't get past the start screen and too many people have not been able to figure out how to get past this bug. I tried to contact support for the gwme but it didn't work. Since the Devs aren't supporting it anymore I had to make a choice. Chance it and likely waste my money, or do a refund through steam. Luckily for me AC rally is being developed. So I waited and I am now playing that.  \n\nIts likely just a matter of time before you can't play it either. Don't buy this. Richard Burns Rally and ACR are the way to go.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "*Playing the game*\n\"Oh wow this game is amazing...\"\n- Great physics\n- Great graphics\n- Great gameplay\n- Amazing wheel support\n- Lots of cars and tracks\n10/10\n\n*Exits game for a while and launches it again*\n- Server refused your connection\n- Cant connect to servers\n- Connection failed\n- Servers are busy\n...And for the next hour or two you can't access most of the game...\n\nI would rate the game a thumbs up but since connecting to the servers is such a horrendious task I simply cannot give this a positive review.\n\nEA please fix your servers. Dont abandon games people actually like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well it was fun while it lasted. I would avoid spending money as the servers have had issues connecting. Unplayable without the ability to connect to servers....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but they have such shit maps, and  90% of the game is pay to unlock, shit concept and needs to stop for games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nice game cool controls not a lot of maps, some settings dont save, career is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is so much good content for this game; interesting historical cars, beautiful scenerey, the inclusion of rallycross etc. Its such a shame that the physics are so horrible. It baffles me how a game almost solely based on racing on offroad surfaces simulates them so poorly. This game is only fun on a controller and even then still doesnt feel right. The damage model sucks too, you side swipe a plastic cone and suffer a fatal crash but you can fling your car off the side of a mountain at 150km/h and teleport back on the stage with only a 4 second time penalty.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DO NOT BUY THIS GAME\n\nIt requires an internet connection to do anything.\nThe game constantly stutters and frame drops no matter what graphics setting I have it on.\nThe Co-Driver calls are not consistant, sometimes the 5 Left is actually a Caution don't cut 3 Left.\n\nOutside of these problems the game is probably the best you can get for rally I have not tried the new assetto corsa rally yet, it's sad because I have over 150 Hrs clocked on the Xbox one version of the game and my PC that has more power under the hood can't run it as good as the console version.\n\nI7 14700F\n4080 Super \n32GB DDR5\nRunning off a 7400 read and write NVME SSD\n3440x1440P Display\n\nI do not wan't to argue specs its insane that there's frame drops and sutters with this hardware, but if you can point me in the right direction to make this game run better on my system I urge you please let me know in the comments I will buy you a beer.\n\nI can not recommend this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "horrible game, callouts are mad inconsistant and blatandly wrong. messing your stage up completely, 1 miniscule tap or a bump and your rolling at mach 5, no idea why i bought this or why i should ever keep playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is, by far, the most exceptionally difficult / impossible racing video game I've ever had the misfortune of playing. If it were possible to rate the playibility of this game with negative stars, I would give it a -5. When attempting to complete any race, even on easy mode, the announcer gives incorrect instructions on which direction to turn about 60% of the time. So, you can't compensate for this immense flaw by turning the opposite direction of what they tell you, because it's right almost half of the time, but wrong the majority of the time. For example, it will tell you there is a left turn coming up, when that is incorrect, it's a right turn. Totally and completely unplayable, even on easy mode, for me.  Strongly regret purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not what i think driving a real car feels like, you don't get insatant traction in a slide again, terrible physics. sick of snapping my wrists",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good gsme but too much space not worth it for the 109GB it takes up not including dlc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very good and intense game.... \nBUT....\nthe settings for wheel is very limited and doesn't explain anything on them...\nFreeroam has ONE track thats not even a track.\nCareer mode is REALLY DRY.\nDoesn't feel like your even playing career mode at all until you realise you have to retire because you ran out of restarts and car is internally damaged.\nOTHER THAN THAT,\n\nGame is great. graphics are great. cars sound amazing, physics are good after you find ONE car to master. i would reccomend to someone who is a controller player.. but wheel players, unless your seasoned at car games and are used to very little explanations in settings then i do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics seem over assisted and almost Forza-like. Doesnt help this game doesnt want to work until it has established an online connection. Thankfully Asseto Corsa Rally is out so there is no more reason to play this for graphics or RBR for physics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great good driving experience but so horrible UI/UX design that i cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA Bought this game just to kill it and consolidate the genre into their WRC series.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC does not work in myteam, known issue for long - no way to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is way too hard. Recommended only if you are a professional racer or a retarded person who doesnt have any work and plays game 24*7.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has a game ever been more lame than this?? It's racing without the controls. The car just slides around and does whatever it wants. It's about as fun as being stuck in the mud - which is to say not at all. \n\nDon't bother playing with a controller. This game demands precision waaaay beyond what a controller can provide. If you don't have a really good wheel, don't bother.\n\nOr better yet, just don't bother with this... whatever tf this is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ticking clock for when EA pulls the plug and you can't play half the game modes (including career mode, the main game mode) because they're always-online modes. EA just announced canceling future support for their recent 2023 \"EA WRC\" and paused development for all their future rally titles. I can save my money and my surprise for when the servers suddenly shut down by picking up a cracked copy today! I'll cut to the chase and focus my time on the content that won't soon be cut. Gameplay-wise, good rally game, Dirt Rally 1.0 better though in my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "steering weels dont do shit and cannot be configured correctly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics are silly and unrealistic, it feels like a huge step back from the first one. The menus aren't clear on car set up. It just feels like a poorly compiled money grab,,, well done Codemasters,, you got my money,, but you lost my respect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HELL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fine but EA's recent decision to remove support for all of their games from linux targets is horribly misguided and very disappointing as a user who only uses linux. My money was good enough when I bought the game, but now that the refund period is over, you want to say that I shouldn't be able to use it without an OS that abuses the user?",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "The game will stop you from playing single player races and anything else because it cannot connect to EA's spotty servers. The game mechanics are great and I enjoy the game but I am not able to play anymore because of the game's always-online requirement. If EA can't maintain their servers, no one can play this game anymore. Don't waste your money as you are renting access to the game.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Good Rally game in it's core BUT.... Don't buy it at full price! (yes, not even the 20 bucks they want now). The way they butcherd the games content just to sell it to you as a dlc is disgusting. You can put another 40 bucks (roughly) into it, just to get the rest of the tracks. And don't get me started on cars...",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Terrible do not reccomend. does not have an accurate represantation of suspension in relation to a car. you hit one small rock abd your car turns into a projectile. Booo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, lots of fun. Pace notes are not always accurate. But what really kills the game is the server connection issues. It's a single player game which forces you to be always online and have a connection to the server. Only that one out of four times the server connection fails and I cannot play. It's not my connection, every other game works perfectly fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is great beautiful and speedy but it has many problems. the physics are too light and cars can be sent flying by a single rock. wheel is too stiff and has almost no feedback. cars have barely any grip on tarmac and they are floating so they lose traction very easily especially rwd which drift uncontrollably and its annoying. anything else about the game is very well made though",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I often can't play a single player part of this game because the servers are down all the time?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I couldn't get past the start screen and too many people have not been able to figure out how to get past this bug. I tried to contact support for the gwme but it didn't work. Since the Devs aren't supporting it anymore I had to make a choice. Chance it and likely waste my money, or do a refund through steam. Luckily for me AC rally is being developed. So I waited and I am now playing that.  \n\nIts likely just a matter of time before you can't play it either. Don't buy this. Richard Burns Rally and ACR are the way to go.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "*Playing the game*\n\"Oh wow this game is amazing...\"\n- Great physics\n- Great graphics\n- Great gameplay\n- Amazing wheel support\n- Lots of cars and tracks\n10/10\n\n*Exits game for a while and launches it again*\n- Server refused your connection\n- Cant connect to servers\n- Connection failed\n- Servers are busy\n...And for the next hour or two you can't access most of the game...\n\nI would rate the game a thumbs up but since connecting to the servers is such a horrendious task I simply cannot give this a positive review.\n\nEA please fix your servers. Dont abandon games people actually like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well it was fun while it lasted. I would avoid spending money as the servers have had issues connecting. Unplayable without the ability to connect to servers....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but they have such shit maps, and  90% of the game is pay to unlock, shit concept and needs to stop for games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nice game cool controls not a lot of maps, some settings dont save, career is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is so much good content for this game; interesting historical cars, beautiful scenerey, the inclusion of rallycross etc. Its such a shame that the physics are so horrible. It baffles me how a game almost solely based on racing on offroad surfaces simulates them so poorly. This game is only fun on a controller and even then still doesnt feel right. The damage model sucks too, you side swipe a plastic cone and suffer a fatal crash but you can fling your car off the side of a mountain at 150km/h and teleport back on the stage with only a 4 second time penalty.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DO NOT BUY THIS GAME\n\nIt requires an internet connection to do anything.\nThe game constantly stutters and frame drops no matter what graphics setting I have it on.\nThe Co-Driver calls are not consistant, sometimes the 5 Left is actually a Caution don't cut 3 Left.\n\nOutside of these problems the game is probably the best you can get for rally I have not tried the new assetto corsa rally yet, it's sad because I have over 150 Hrs clocked on the Xbox one version of the game and my PC that has more power under the hood can't run it as good as the console version.\n\nI7 14700F\n4080 Super \n32GB DDR5\nRunning off a 7400 read and write NVME SSD\n3440x1440P Display\n\nI do not wan't to argue specs its insane that there's frame drops and sutters with this hardware, but if you can point me in the right direction to make this game run better on my system I urge you please let me know in the comments I will buy you a beer.\n\nI can not recommend this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "horrible game, callouts are mad inconsistant and blatandly wrong. messing your stage up completely, 1 miniscule tap or a bump and your rolling at mach 5, no idea why i bought this or why i should ever keep playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is, by far, the most exceptionally difficult / impossible racing video game I've ever had the misfortune of playing. If it were possible to rate the playibility of this game with negative stars, I would give it a -5. When attempting to complete any race, even on easy mode, the announcer gives incorrect instructions on which direction to turn about 60% of the time. So, you can't compensate for this immense flaw by turning the opposite direction of what they tell you, because it's right almost half of the time, but wrong the majority of the time. For example, it will tell you there is a left turn coming up, when that is incorrect, it's a right turn. Totally and completely unplayable, even on easy mode, for me.  Strongly regret purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not what i think driving a real car feels like, you don't get insatant traction in a slide again, terrible physics. sick of snapping my wrists",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good gsme but too much space not worth it for the 109GB it takes up not including dlc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very good and intense game.... \nBUT....\nthe settings for wheel is very limited and doesn't explain anything on them...\nFreeroam has ONE track thats not even a track.\nCareer mode is REALLY DRY.\nDoesn't feel like your even playing career mode at all until you realise you have to retire because you ran out of restarts and car is internally damaged.\nOTHER THAN THAT,\n\nGame is great. graphics are great. cars sound amazing, physics are good after you find ONE car to master. i would reccomend to someone who is a controller player.. but wheel players, unless your seasoned at car games and are used to very little explanations in settings then i do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics seem over assisted and almost Forza-like. Doesnt help this game doesnt want to work until it has established an online connection. Thankfully Asseto Corsa Rally is out so there is no more reason to play this for graphics or RBR for physics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great good driving experience but so horrible UI/UX design that i cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA Bought this game just to kill it and consolidate the genre into their WRC series.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC does not work in myteam, known issue for long - no way to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is way too hard. Recommended only if you are a professional racer or a retarded person who doesnt have any work and plays game 24*7.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has a game ever been more lame than this?? It's racing without the controls. The car just slides around and does whatever it wants. It's about as fun as being stuck in the mud - which is to say not at all. \n\nDon't bother playing with a controller. This game demands precision waaaay beyond what a controller can provide. If you don't have a really good wheel, don't bother.\n\nOr better yet, just don't bother with this... whatever tf this is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ticking clock for when EA pulls the plug and you can't play half the game modes (including career mode, the main game mode) because they're always-online modes. EA just announced canceling future support for their recent 2023 \"EA WRC\" and paused development for all their future rally titles. I can save my money and my surprise for when the servers suddenly shut down by picking up a cracked copy today! I'll cut to the chase and focus my time on the content that won't soon be cut. Gameplay-wise, good rally game, Dirt Rally 1.0 better though in my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "steering weels dont do shit and cannot be configured correctly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics are silly and unrealistic, it feels like a huge step back from the first one. The menus aren't clear on car set up. It just feels like a poorly compiled money grab,,, well done Codemasters,, you got my money,, but you lost my respect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HELL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fine but EA's recent decision to remove support for all of their games from linux targets is horribly misguided and very disappointing as a user who only uses linux. My money was good enough when I bought the game, but now that the refund period is over, you want to say that I shouldn't be able to use it without an OS that abuses the user?",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "The game will stop you from playing single player races and anything else because it cannot connect to EA's spotty servers. The game mechanics are great and I enjoy the game but I am not able to play anymore because of the game's always-online requirement. If EA can't maintain their servers, no one can play this game anymore. Don't waste your money as you are renting access to the game.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "Good Rally game in it's core BUT.... Don't buy it at full price! (yes, not even the 20 bucks they want now). The way they butcherd the games content just to sell it to you as a dlc is disgusting. You can put another 40 bucks (roughly) into it, just to get the rest of the tracks. And don't get me started on cars...",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Terrible do not reccomend. does not have an accurate represantation of suspension in relation to a car. you hit one small rock abd your car turns into a projectile. Booo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, lots of fun. Pace notes are not always accurate. But what really kills the game is the server connection issues. It's a single player game which forces you to be always online and have a connection to the server. Only that one out of four times the server connection fails and I cannot play. It's not my connection, every other game works perfectly fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is great beautiful and speedy but it has many problems. the physics are too light and cars can be sent flying by a single rock. wheel is too stiff and has almost no feedback. cars have barely any grip on tarmac and they are floating so they lose traction very easily especially rwd which drift uncontrollably and its annoying. anything else about the game is very well made though",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I often can't play a single player part of this game because the servers are down all the time?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I couldn't get past the start screen and too many people have not been able to figure out how to get past this bug. I tried to contact support for the gwme but it didn't work. Since the Devs aren't supporting it anymore I had to make a choice. Chance it and likely waste my money, or do a refund through steam. Luckily for me AC rally is being developed. So I waited and I am now playing that.  \n\nIts likely just a matter of time before you can't play it either. Don't buy this. Richard Burns Rally and ACR are the way to go.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "*Playing the game*\n\"Oh wow this game is amazing...\"\n- Great physics\n- Great graphics\n- Great gameplay\n- Amazing wheel support\n- Lots of cars and tracks\n10/10\n\n*Exits game for a while and launches it again*\n- Server refused your connection\n- Cant connect to servers\n- Connection failed\n- Servers are busy\n...And for the next hour or two you can't access most of the game...\n\nI would rate the game a thumbs up but since connecting to the servers is such a horrendious task I simply cannot give this a positive review.\n\nEA please fix your servers. Dont abandon games people actually like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well it was fun while it lasted. I would avoid spending money as the servers have had issues connecting. Unplayable without the ability to connect to servers....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but they have such shit maps, and  90% of the game is pay to unlock, shit concept and needs to stop for games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nice game cool controls not a lot of maps, some settings dont save, career is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is so much good content for this game; interesting historical cars, beautiful scenerey, the inclusion of rallycross etc. Its such a shame that the physics are so horrible. It baffles me how a game almost solely based on racing on offroad surfaces simulates them so poorly. This game is only fun on a controller and even then still doesnt feel right. The damage model sucks too, you side swipe a plastic cone and suffer a fatal crash but you can fling your car off the side of a mountain at 150km/h and teleport back on the stage with only a 4 second time penalty.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DO NOT BUY THIS GAME\n\nIt requires an internet connection to do anything.\nThe game constantly stutters and frame drops no matter what graphics setting I have it on.\nThe Co-Driver calls are not consistant, sometimes the 5 Left is actually a Caution don't cut 3 Left.\n\nOutside of these problems the game is probably the best you can get for rally I have not tried the new assetto corsa rally yet, it's sad because I have over 150 Hrs clocked on the Xbox one version of the game and my PC that has more power under the hood can't run it as good as the console version.\n\nI7 14700F\n4080 Super \n32GB DDR5\nRunning off a 7400 read and write NVME SSD\n3440x1440P Display\n\nI do not wan't to argue specs its insane that there's frame drops and sutters with this hardware, but if you can point me in the right direction to make this game run better on my system I urge you please let me know in the comments I will buy you a beer.\n\nI can not recommend this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "horrible game, callouts are mad inconsistant and blatandly wrong. messing your stage up completely, 1 miniscule tap or a bump and your rolling at mach 5, no idea why i bought this or why i should ever keep playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is, by far, the most exceptionally difficult / impossible racing video game I've ever had the misfortune of playing. If it were possible to rate the playibility of this game with negative stars, I would give it a -5. When attempting to complete any race, even on easy mode, the announcer gives incorrect instructions on which direction to turn about 60% of the time. So, you can't compensate for this immense flaw by turning the opposite direction of what they tell you, because it's right almost half of the time, but wrong the majority of the time. For example, it will tell you there is a left turn coming up, when that is incorrect, it's a right turn. Totally and completely unplayable, even on easy mode, for me.  Strongly regret purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not what i think driving a real car feels like, you don't get insatant traction in a slide again, terrible physics. sick of snapping my wrists",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good gsme but too much space not worth it for the 109GB it takes up not including dlc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very good and intense game.... \nBUT....\nthe settings for wheel is very limited and doesn't explain anything on them...\nFreeroam has ONE track thats not even a track.\nCareer mode is REALLY DRY.\nDoesn't feel like your even playing career mode at all until you realise you have to retire because you ran out of restarts and car is internally damaged.\nOTHER THAN THAT,\n\nGame is great. graphics are great. cars sound amazing, physics are good after you find ONE car to master. i would reccomend to someone who is a controller player.. but wheel players, unless your seasoned at car games and are used to very little explanations in settings then i do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Physics seem over assisted and almost Forza-like. Doesnt help this game doesnt want to work until it has established an online connection. Thankfully Asseto Corsa Rally is out so there is no more reason to play this for graphics or RBR for physics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great good driving experience but so horrible UI/UX design that i cannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}