{
  "positive": [
    {
      "review": "So, uh, they removed the weather system and there is no natural day/night cycle. \n\nFun game, but whyyyyyyy remove such little things that create immersion?",
      "voted_up": true,
      "votes_helpful": 106
    },
    {
      "review": "This is a game I keep coming back to when I want something nice, cute and relaxing. I like designing a nice looking but efficient settlement, honing my city layout strategies, building monuments, decorating, and sometimes just watching my inhabitants go sit on a bench. \n\nI also like that there aren't (and won't be) any enemies or wild animals attacking my settlement. All combat happens off the map, is completely optional and initiated by the player. Just train and equip your troops, send them off and hope they come back mostly in one piece and with nice loot. Or ignore combat alltogether and build a peaceful settlement focused on production and trade. \n\nThere are still some things that need polishing for the perfect medieval city builder experience, but no more than other city builders I've played. I'm looking forward to the next update which promises to do some of those polishes, but the game is fully enjoyable as it is.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Honestly quite chill, hope they keep adding stuff like snow or different biomes.\nIt has a nice charm to it and could probably use more QOL stuff but overall a nice 7,5 game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I am very disappointed!\n\nI decided to buy this game because I like such kind of games.\nBecause I wanted to play it directly I violated my personal rule to buy games only during special sale periods. So I paid full price (34€).\n\nThe game itself is very nice and I love it but its unplayable for me at the moment.\nI started my session and everything went smooth and without any issues for 3h. \nWhen I started the game again on the next day, it started on my second screen for what ever reason. I had to correct that via setup but after that the game keeps crashing to the desktop after 5 to 10 minutes after every start!\n\nI tried to start as admin, I deleted the config folder to re-initialize the files there. I stored saves in the cloud and denied that as well. \nThe game keeps crashing!\n\nThat is very disappointing! This seems to be a known problem since the game was released, so why was that not fixed?\n\nI really want to play the game and to support the developer with a positive feedback or recommandation. \nSo fix it!\n\n\n===== EDIT =====\nI found some information how to get a more stable game experience. So I tried some of these things.\n\nWhat seams to help so far:\n\n- Set the FPS limit ingame to the value which corresponds to the value of your monitor. To be on the save side I also disconnected my second monitor.\n\n- I installed Microsoft Visual C++ Redistributable\n\n- Furthermore I added some starting boundaries via Steam to force the game to start with DirectX11 -> -force-d3d11\n\n\nMaybe that is helpful for somebody. For me it worked so far. Now the game does not crash every 10 minutes as before. But sometimes there are still crashes to desktop but on the other hand I can play 2 hours without a crash also. \n\nSo in this case I will change my negative feedback to a positive, but with a huge qotationmark! \nThe game itself is fantastic and recommandable in total, but be aware of this massive issue regarding Crash-To-Desktop which is very frustrating!",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "[u] THIS [/u] game is the kind of city builder that every other ones should take as an example. Why ? Because it's a limitless freedom of construction. I'm amazed about all the variety, all the buildings, all the stuff inside. And heh, I installed all the mods  and it's even more and more fun ! I highly recommend this game if you love city builders and colony managment at its finest.\n\nOh and one thing you shouldn't expect tho : no combat. But is it really that important here, hm ?",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Foundation is an irresistibly cute, endlessly playable game Its grid free medieval city building gives you mad freedom, you sculpt villages and towns that feel alive, organic, and unique. The pace is soothing and stress free you can tinker, build monuments, trade, and manage villagers at your own rhythm. Every time I load it up I find something new to love and I keep coming back. If you want a chill, creative, and surprisingly deep city builder, Foundation is a total win.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun game.  Love building castles and kingdoms.  Graphics and sound are great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A nice take on the town-builder genre that manages to balance some game-mechanic pressures (budget, labor force, etc.) with a very laid-back atmosphere. You want to set up a good economy, sure, but you don't need to stress about it too much while you adjust every fence post to be right where you want it. The organic nature of buildings sprawling and upgrading is unique and makes for pleasantly chaotic town layouts over the typical grid-based building of other games. Well worth it for town-builder novices and veterans alike!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☑ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\nBoth this version and it's early access have been able to achieve wide ranges of success. Be warned though, updates come once in a blue moon (I don't even know if we'll have more or we'll just have the most recent one). Also, their Discord is extremely friendly, as well as their Reddit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the organic nature of the paths and housing.  It is my favorite game in this genre.  If you like this style of game, I would say it is worth a try.  Obviously not everyone is going to like it, but I believe that if you looked at this post, you probably will.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "IMO, the best city builder on the market.  So much fun designing and upgrading structures.  The organic feel of how you can lay out your city is also really quite refreshing and unique.  There's definitely some challenge here though once you get to supply chains and upper class citizens and all of that.\nI really like the way the game focuses around some core structures... like if you want to focus on a giant castle, or a big church, etc.  Also from what I found, the trade systems are actually somewhat functional and not overcosted into oblivion.\n\nThis game really nails the cozy joy of building out a city and focusing on your layout, steady growth, and providing new and expanding things to do and watch for as you progress further into a particular scenario.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really nice and cozy little city building game..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a goo9d city building game for people who like to take it slow and easy recomend yes 7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This completely redefined the genre for me, and is already \"inspiring\" other games to go down a similar path.\n\nHogs quite a few system resources, and while it looks like a laid-back, cozy decoration sim, the economic side can get a little brutal as you spread your settlements across the maps, so keep that in mind.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In short- it is a good and satisfying city-builder game. I like the visuals and the core gimmick of no grids is really cool. I also like the trading mechanics and how they interact with other systems in the game. It's great that they have several modes of play - default is great for learning the game, challenge rules are a nice way to push experienced players to explore game in more detail especially when combined with aspirations, and there is a casual mode for those that just want to build a pretty city without stress. So - something for everyone. \r\n\r\nI also have some complaints - from time to time a weird bug would pop up. And for veterans of city builders there is some frustration from opaque systems on how many resources are produced and how many are consumed by various buildings or over time. If you're one of those people that likes to optimise perfectly, it's kind of not possible. The overproduction is the way to go if possible, or topping up through trade and selling off surpluses when they happen. \r\nLogistics are also a bit basic and can lead to frustrations on challenge difficulty. \r\nAnd finally not being able to micromanage where the villagers live directly. There are some workarounds, but when I tried them I had to deal with glitches in the game, where a citizen would leave the house, the house would start downgrading, even though I promoted two other villagers to citizen status. Then you pay the cost of downgrading the building, and when it's finished the game recognizes that there are indeed two citizens in the building , so it starts upgrading again, with you paying the costs of it again. \r\n\r\nOverall, though, I still enjoy very much it and would recommend it. Just be aware that it's not perfect",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly recommend . This is a sit back and relax city builder game. A well-polished masterpiece game with very nice graphics",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Cute and Cozy but there are mechanics. It's like Tiny Glade but with an actual game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Foundation is the city-builder for people who love medieval villages but hate straight lines. Roads? Optional. Zoning? Please. Here you simply drop buildings wherever your heart desires and hope your villagers don’t turn the town into a drunken spiral of footpaths. The game is charming, peaceful, and slightly chaotic. Your citizens complain politely, your economy collapses elegantly, and somehow everything still looks picturesque enough for a postcard.\n\nIf you’ve ever wanted to run a kingdom powered entirely by whimsy and questionable planning decisions, Foundation delivers gloriously.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great city builder, you will not regret buying it. I m 71 hours in and still there are new buildings to discover.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most relaxing games I've ever played, the music, the mechanics, the visuals,... Everything feels right and coherent to me.  If you need a calm, beautiful game to chill on, I strongly recommend Foundation.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Been playing Foundation from day 1 and I cannot thank the devs enough for their ongoing work on it. Their updates aren't always frequent but boy do they do a great job with these big updates; they'll go deep, completely revamping something if necessary and the results are always incredible. The graphics, even years later hold up nicely and the gameplay is tight and fun. It's so organic too and while there's still some work that probably needs to be done around pathing, they improve the game incrementally over time and for that I say thank you!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I recommend this game 100%!  Take your time, relax and be creative. I've had this game since the beginning. The devs have made a lot of improvements and been consistent on updating the game.  My favorite thing about this game is you can make it as easy or challenging as you want.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoyed this game.  More complex than it looks on the surface.  Nice relaxing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wonderful game that can get difficult in the later regions but that is all just a part of the fun! I love getting very detailed with ... Foundation!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is chill.  You can get really into the mechanics of custom made buildings and how you organize your layouts, and it is pretty complex and has a lot of problem solving if you want to min max your settlement, but you can also just enjoy a sprawling village and have fun building giant custom churches, monasteries, taverns, and castles at your leisure.  you can control the difficulty to create a challenging strategy game or you can turn it down and have a more relaxed medieval city simulator experience.  Good vibes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game and the updates after release are very good!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HOLY SHIT A NON SQUARE MEDIEVAL CITY BUILDER.\r\n\r\nfolks, foundation doesnt have the most beautiful graphics, she doesnt have the most intuitaive controls.\r\nbut still she blows everything else (maybe not manor lords, havent played it yet) out of the water. so much is customizeable, so much freedom to build is given.\r\n\r\nexcellent game, if you wanna build your own town then this is something that will scratch that itch",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "City building game for people who like to take it slow and easy. \nI hope they keep develop this and giving us more 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a cosy little village buidling game which you can play in quite many different ways.\nFrom basically a sandbox mode (especially if  you add som mods to it) to various kinds of challenges\nlike conquer, buidling an impressive castle/fortress or other things. \n\nI'd say that this is the spiritual successor of the settlers game. \n\nPros:\n*Very customisable gameplay rules\n*very nice looking graphics \n*lots of different building\n*Larger monument buidlings have lots of different subbuidlings \nwhich can be placed/combined to your liking. \n*One can build very magnificent manors, castles, monestaries. \n*dynamic/organic villages due to residential zoning and due to roads/path\nbeing based on what route villagers use (terrain becoming downtrodden).\n*One can easily block villagers from walking a certain route (like straight throgh your grain fields)\nwith the forbidden zoning tool. \n*Overall very stable gane (have had crashes but they are rare)\n\nCons:\n*The logic of the villagers is sometimes a bit lacking as they sometimes traverse the \nentire village for resources that are found nearby.\n*Villager pathfinding can be an issue sometimes, especially since residential building\nare placed by the villagers in the painted residential zones.\n*Placement of bridges (for construction) is a bit tricky due to that if not \"perfectly\" alined\nvillagers won't use it. Sometimes it needs to be adjusted several times before villagers being happy.\n*One cannot manually assign monks/non to monestary workplaces as the game automatically assign monks/nuns to tasks ( i think in chronological order of sub-buidling construction\n*Larger villages (like 800-900+ villagers) is really performance heavy/low fps.\n\nOverall this a really good game and the cons are more of he nusiance type and really game breaking. \nThus I can really recommend this game.\n\nThere were also a large quality of life update today with lots of new feautures, but I haven't played it enough yet to determine how much it affects the game overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the laid back play style, finding the best way to balance trading and production chains to improve the quality of life for the inhabitants of the village/town/city. I've been playing since early beta and the way the gameplay and graphics have progressed shows just how much Ash and the other coders love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cute and relaxing ciry builder, fun to play while Manor Lords is being worked on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent game, relaxing and visually satisfying. A must buy for a cozy afternoon gaming session. The devs keep updating the game, and major problems are taken care of. Mod integration is also quite good. This is by no means a hard game, but certainly a great one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun medieval city builder with huge replay value, lots of content and a laid-back atmosphere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really well rounded, fluid, and has depth. To go along with that it's art style is unique and beautiful.  worth every penny for someone who wants to relax city build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're at all a fan of city builders, this is certainly one that should not be missed, especially if you are fond of the medieval theme! One thing that turns me away from many other games in this genre is that they tend to stick to a grid system, making the final city feel inorganic and lack a certain sense of immersion that I'm after. And on the contrary, games like Cities Skylines allow you to build in a more free-flowing way if you want, but I tend to feel overwhelmed at just how much there is to focus on in that game. Foundation, to me, is the perfect middle ground; everything feels organic without needing extraordinary efforts. Supply lines are simple and easy to follow, and it really doesn't feel like I have to micromanage in order to build a successful community. There are multiple paths your city can take as it grows, and you're only really limited by your own constraints. Above all else, I believe that the monument building feature in Foundation is second to none, allowing you to really let your creativity go wild and build some truly unique structures. I can't recommend this game enough, and I'm sure it will only get better as the devs continue to polish it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игрушка красивая и интересная. С момента раннего доступа, она прошла большой путь, постоянно улучшаясь. И после релиза, она не перестает расти дальше, что приятно.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From where the game started to where it is now. Huge development and all thanks to the huge community and the developers actually listening to what the players love and want to have in a game. Great accomplishment on both sides",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like a game where I can build or make small changes and then watch the effects over time, all while doing other things, and Foundation allows me to play like that. It can also be a fully involved city builder, but it doesn't punish you for stepping away while is on. High recommended if you like that sort of thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Lots of fun for the more casual and cozy city builder enjoyers. Needs optimization fixes though as it runs poorly on even high end pcs once your city gets a little bigger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautifully crafted game. You can really lose yourself in this.\nController support + mouse panning would be awesome. Some controls are a little wonky at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really cozy, nice depth, cool ideas in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a shocking realisation that grid based city builders are not natural since I've been playing them for decades. But of course, this is the how a fledgling town of yore would naturally evolve its pathing. It makes so much sense and I'm thoroughly enjoying this spin on city builders. \r\n\r\nIt is still early days for me in this game though, after ten hours or so I would say I see where I'm going with it, and how deep and complex it can get. It's almost a little too deep and complex for my liking, as at this point I just see a huge list of paths to explore and I'm not sure I have that much time in my life, but I know for most people that is preferred.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good Cozy city builder game\r\nlovely Visual style. Relaxing gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love that this game can be played chilled (sit back, relax, watch your avatars as they go about their day, etc) on speed 1, and just really enjoy the game. And at the same time, it has all these gameplay mechanics that will drive you insane. Figuring out what you did wrong and how to correct those mistakes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just being a medieval city builder WITHOUT BEING ON A GRID makes this better than 90% of city builders out there, and for me this is my personal alltime favourite, from someone who loves this genre in general.\nStill getting updates too, keep it up guys, its so fucking good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo and betas and it's came a longgg way from the early days! That being said it's very relaxing or challenging depending on how you feel on certain modes. I like that it's sandboxy but not too sandboxy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good little cozy city builder. The art style is quite grabbing and helps it to stand out in the city builder sim genre. Complexity is simpler than other Anno, fathest frontier, manor lords etc. It would actually be a great intro game for children 8+ with the stylised graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the more relaxed/natural feel it has to town building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has mix of creativity, planning and chill. it give me option to take it slowly enjoy and show my creativity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Settlements turn into organic looking places all through game systems which is great and rare to find in the genre of grid dominated settlement builders. \r\n\r\nPersonally I find building all 3 specialisations the most interesting but it's also the least cared for by the game, not giving it any achievements or proper endgame goal.\r\n\r\nPatrols can be janky, the balance of trade and production lines are sometimes wildly out of whack (looking at you beer production) and there are a bunch of micromanagement tools missing.\r\n\r\nHowever this has not made growing over the entire map any less fun to watch especially with the freedom of placement and making your own large community buildings. This turns every map you start into a unique new canvas even if you go for the same approach each time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, i hope it becomes extremely well optimized",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it is quite fun. It is very cute, cozy, but also requires thinking/planning.\r\nI am happy that I bought it. No regrets so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't get enough of this relaxing city builder. The gameplay and art style are unique and pleasant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cozy city builder, that also looks quite pretty. You'll most likely have to look up tutorials to get stuff done in the early game, but if you put your mind to it, its a lovely game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Since 2019 Alpha build this is my go to game to relax. Loving it since day one. Exceptional dev team and great game. If you like the genre you need to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to throw some music on and turn off your brain for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There’s a certain magic to this game that keeps pulling me back in. Whenever I’m craving something calm and cozy, it’s the first title I launch. Designing a settlement here feels less like managing a city and more like nurturing a living, breathing world. I love shaping the terrain, arranging buildings just so, optimizing production flows, and watching my little medieval town blossom into a bustling community. Half the fun is simply observing the villagers go about their day, resting on benches, chatting by the market stalls, or wandering through the paths I’ve carefully planned.\n\nWhat really sets this game apart is the complete lack of pressure from enemies or random disasters. Nothing storms the gates or sabotages your progress. Any combat that does exist is entirely player-driven and takes place far from your town. If you want to train an army and send them out on risky expeditions for treasure, you can. If you'd rather ignore fighting altogether and focus on crafting, trading, and city design, that’s perfectly viable too.\n\nWhile it still has room for refinement, it’s already a wonderfully polished and genuinely relaxing city builder. And with new updates on the horizon promising even more improvements, I’m excited to see how the experience evolves. For now, it’s a delightfully peaceful escape, one I keep finding new reasons to return to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing and relaxing game to play when you wanna just relax after a tough day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, had fun and its honestly a pretty straight forward mideval city buidler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love that I can place buildings IN a mountain side. As long as the villagers can reach the door, they can use it. It's a great way to use more space and make each game more unique than other building/villager games I've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a very good game very cozy and nice to play if you want something relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game with a lot of attention to detail. The new quality of game improvements put this up there with the best in genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Foundation is a relaxing and beautifully designed city-building game that encourages creativity without overwhelming you. The organic building system feels natural and satisfying, and watching your medieval town grow piece by piece is genuinely rewarding. It strikes a great balance between strategy and calm, making it perfect for both casual players and fans of detailed management games. Highly recommended for anyone who enjoys building something at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing so many medieval themed city management games, I think this one is one of the better ones:\n\n- gridless building\n- procedural generated  housing spaces\n- modular buildings (extremely fun, and the best part of the game)\n- beautiful cartoony artstyle\n\nAnd the only things that annoyed me during my normal chill gameplay:\n- some bug when you go into x3 speed \n- cannot paint roads, and cannot fully control pathways (for visual appeal)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Summary (November 2025)[/b]\nPlayed it since early access. Still many rough edges, but keep getting better each update. Zoning system is lovely, but can get annoying cuz it's not that easy to move building. Music always bzzt-bzzt when on-battery, I recommend to turn it off and just sfx only, or play it while charging. Pacing is a bit slow, with only max 3X speed. Casual is like Sandbox, you won't get achievement. Challenge is no difference than Classic, but just take loooonger to manage, and depletable small resources. But overall, the village when it's done is a beauty, thus worth the time :)\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, and a great sim that actually offers a lot of creative possibilities, which is super important to me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If the cosiness of tiny glade and a city builder merge you get Foundation. Its not the game with the deepest story but it makes more then up for it by having all small villagers live out their daily life's including relaxation, faith, work and so forth. Its a great game do wind down and build something in a relaxed way. Its not a pure creative builder though, you have to manage resources, trade, laws, taxes, money and much, much more. There is no combat in the game but there are soldiers whom you can send on missions. I personally find it especially nice to build a city with a rough layout in mind and then see what the tiny villagers realize it in their own dynamic way. \nThere is room for improvement to the game but it is a good game already, I would love to see different biomes such as desert.. maybe even cultures, and something with less ambition maybe day night cycles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First city builder game where my citizens are happy and don't run away from me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice, cozy, sit back & chill game\neven better with Lo-fi and some snacks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy little game, good for relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me feel both calm and relax after working a long day beating up beets. would farm again. thank you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, I'm not good at this game and the stupidity a my citizens triggered me more than once (upgrading then downgrading theirs houses constantly, throwing ressouces in the void) but i think it's still my fault. I still enjoilled the game even if i don't think there must to do once you already finished the game once or twice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice chill sandbox city management game - or a challenging one if you so wish. This game allows for a wide range of play-styles thanks to the addition of the customisation at the start. They are continually making updates to the game, showing that they truly care.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a diamond that needs polishing, but it's an absolute gem that you must try yourself, the ability to create a village from square one and managing resources is easier than any of the Anno games.\r\nIt's an easy, calm, and forgiving game, the tutorial is well made to guide the player during their first time.\r\nAnd the terrain generator gives the game endless replayability.\r\n\r\n10/10 - Definitely a contender for the Nominee of the Steam Awards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite city builder style game have really like the direction they are taking it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game to just relax after a long day! I really dig the art style, I can build some really good looking villages. The different branches allow me to create so many different types of villages.\n\nThe recent quality of life update has brought some needed polish to the game, meaning I can get back to a couple of my villages and improve them even further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking back through the year (for the nomination reasons), this has been the nicest experience of the 2025 games to me. Building the village is satisfying thanks to the automatically created desire paths. And thanks to nothing being locked to grids or any other pre-made limits, you can really make the place look just like you want. Now with some of the QoL edits in the latest patch, updating and editing the villages is a breeze too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Foundation is a nice chill game that you can start and play for however long, save it, then come back months later to the same save game and continue. It has limited building design as well so can be fun designing and redesigning castles, manors and monasteries. It's great for when you don't have a reliable intenet connection or just need a break from intense gaming... or real life. A really good game I'd recommend to anyone that likes city management games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing out there really does what foundations allows for, as far as building monuments goes. Love this game, one of those I can chill to for a while. Not the most engaging gameplay, but man I love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and Cozy little game. Right what I needed since finishing building my castle in V rising.\r\n\r\nI like how the game makes a priority goal to always make the villagers happy. they are cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, probably my favorite city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much everything you could wish for in a relaxing city-building game. Unique way of extremely natural town building paired with pretty good customization options for building larger projects. This game is definitely NOT a survival city-builder a lot of people expect when they first try it, but it never was meant to be a game like that. Say goodbye to overoptimalized building, min-maxing efficiency of pathfinding or geometrical symetry of everything. Just relax and watch your town grown in organic manner no other game can currently offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You could say that this game fills a huge void created by a long gone Settlers and a very disappointing simulation (if you can even call it that) in the Anno series of games. But that wouldn't do it justice to this gem of a game. \r\n\r\nEvery little royal subject of your kingdom has its own identity, very well defined. They go to work, come home, shop, goes for a beer, etc. Visitors can also come to enjoy your town while sleeping at the inn. Based on their status,  they all have different needs however as opposed to Anno, the entire industry chain is fully simulated. The baker isn't just gonna want flour, but that bag of flour needs to be carried from the windmill, and you'll see in real time a person doing just that.\r\n\r\nBut the game goes way beyond simulating needs and industry chains. You can customize and upgrade parts of every building, some people will have requirements that will require beautification, safety, entertainment, etc. There are so many mechanisms and content in this game it'll make your head spin. I'm so glad this game exists!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a really solid, amazing, well made game. More port options though would be nice ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waited years for this to come out of Early Access and it was great. Spent way longer in it than I expected - I've only ever played two of this style of game in my life, but would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like this game deserves more attention than its getting. I have been playing for years since the early access and never got bored even a second. They constantly updating the game and I appreciate the dev team <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, very chill and very organic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Want to relax and play at your own pace. This is it! Except if people get hungry... Or they don't like you. Or the king doesn't like you...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Foundation is a wonderfully calming city-building experience that stands out through its elegant style and engaging gameplay. Its visual approach, inspired by medieval landscapes, creates an inviting atmosphere that makes every session feel peaceful and grounded.\n\nOne of the game’s strongest features is the fully customizable design of special buildings. Being able to shape these structures piece by piece adds a rewarding layer of creativity, making your settlement feel truly personal.\n\nThe gameplay flows smoothly, encouraging careful planning without ever feeling stressful. It’s the kind of game you can sink into for hours, letting its gentle rhythm help you unwind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really charming city builder that rejects the grid system. certified.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if you want to sit back and relax i highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game for a laid back relaxing sim that has enough to keep you engaged but not so much that it is overwhelming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very hopeful to see more development for this game. Other than a few bugs it's procedural, modular, beautiful, and mostly intuitive. Wish there was a little more color coding in the tabs system they already have established but it really shows us where city building can go when entities in that city have  a hand shaping the environment. I want them to push that further, with an active night/day cycle / weather / more path types / and nods to fantasy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the game since early release. The first few play throughs were fun and the game mechanics are intriguing enough to keep me going. Each update seems to have refined and improved those mechanics to make it a very enjoyable relaxing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Foundation is a pleasantly engaging city-building experience that shines through its clear sense of progression and accessible mechanics. From the very beginning, the game guides you into growth at a comfortable pace, letting you expand your settlement naturally as new systems unlock. The progression feels rewarding without ever becoming overwhelming, and each new building or feature slots neatly into your existing village in a way that makes long-term planning feel intuitive.\r\n\r\nThe gameplay itself is straightforward and easy to grasp, making it approachable even for players who aren’t veterans of the genre. Most mechanics are explained through simple visual cues and logical cause-and-effect relationships, so you always have a clear idea of how your actions shape the development of your settlement. Managing resources, assigning villagers to jobs, and expanding your territory all feel smooth and well thought-out.\r\n\r\nOverall, Foundation offers a relaxing yet satisfying city-building loop, marked by intuitive design and steady, enjoyable progression. It’s a solid choice for anyone looking for a charming, easy-to-understand building game with a sense of growth that unfolds naturally the more you play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very relaxing. It feels so simple but it has many layers of complexity, making it engaging but rarely stressing you out. I'd recommend it, especially considering the developers are still supporting it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have spent many hours watching my cheese distribution network in a village I was working and it was any amazing way to spend part of a Saturday. If you want a relaxing and in-depth city builder I highly recommend the price to fun has been well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, Even after 1.0, the New QoL update is fantastic. Lot's of Freedom, the Dev's are listening!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying foundation, i backed this game a long time ago, andwith all the new stuff in the game it really is awesome.  i can play casually or be as meticulous/optomizey as i want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little game. I found it easy to lose time decorating and refining all the buildings types. I wish that the \"difficulty\" modes equated greater challenge, but I don't think that's what the developers were going for and I can accept that.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Too buggy. Villagers complain that there are not enough houses for them to live in but for some reason they don't build any more houses despite having enough dedicated space marked. Looking through forums and boards show it's a common bug and many users are just 'guessing' around how to solve it but nothing really works realiably. It's just a pain to start a new game all the time or rebuild everything for no reason. It's obviously a bug that villagers don't build any more houses despite the need for them.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Note that this is a very soft no. \r\n\r\nThe game itself is nice. Graphics wise a bit simple but with the amount of things going on, on screen, it is not that bad. \r\n\r\nGameplay is good but has a bit of a learning curve where not everything is intuitive, you suddenly get missions asking you to build things you havent unlocked yet. This would be fine if it was once in a while but sometimes you get multiple in a row which cloggs up the quest log. \r\n\r\nUnlocking things is also not intuitive at all. Where some you need to set up your resources and grow, where others is to make sure you build additions to an existing building to make it grander, though this is not exactly explained anywhere. \r\n\r\nAnother gripe is that you need to paint where you want what to be. Such as painting zones for woodcutting so they dont cut the entire forest and a zone to build houses automatically. Which sounds great, but I sometimes have that even though you painted an area for housing it is not populated. At first I though it maybe was due to lack of resouces (food/water/services) but that didnt change it.\r\n\r\nThis is causing a lot of frustration as you lack the control. \r\n\r\nThat said I still played 6 hours in 2 days, so I did enjoy it, but the bugs shoot the game in the foot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Post launch this game has become so boring. You genuinely need another activity on a separate monitor to mitigate the wait time in this game. Ironically in my opinion it was in a much better state at beta. It's a pitty as otherwise its a decent game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is a great game, and I REALLY want to love and play it, but simply can't.\n\nThis game HARD CRASHES my entire system repeatedly. Not a CTD, a Blue Screen Restart, with the accompanied sounds of something electrical having an aneurysm. I have an AMD Radeon RX 5700, which isn't exactly old. 5.5 years, as of writing this. Appoximately 3 years old when I first purchased this game.\n\nThis game is really something special, and I haven't found a city builder that I enjoy as much as this one. Foundation just feels cozy. Calming. Everything from the visuals, to the gameplay, to the sound design is cozy and comfortable. I love watching the paths weave into existence naturally, only to eventually get turned into stone walkways.\n\nI just can't risk my system melting for no reason. Each time this happens, I can see my SSD's life flash before my eyes.\n\nDISCLAIMER: THIS GAME MAY POTENTIALLY DAMAGE YOUR COMPUTER DEPENDING ON THE AGE OF YOUR GRAPHICS CARD. AMD GRAPHICS CARDS ARE MOST AFFECTED.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is a good game but with the 1.0 update removed and changed things that has made me drop the game, removed day/night cycle? why just why!? removed the weather system? again why just why!? changed how the maps work and much smaller overall \nso yea disappointed",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game was fun at first and looks great. downside is you run out of money, tools, or happiness and you're done. I have to look up everything but you find out once you get stuck in a cycle of no gold or no tools, you have no way of reversing it, so you've wasted your time up to that point and just idle there while your gold goes up +20 from a trade but your defecit is -30 even when you take everyone out of work. The game has potential but since the last update isn't since ike July, there's really no point. I did better off not following the tutorial. Waste of time, Waste of money. Just watch videos of someone else playing if you're interested in this game. 2/10 from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is good, but the money mechanic is too annoyoing. Especially having to pay for creating buildings additionally to ressources. I always feel stuck that I cannot build what I want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, but the money mechanic is too annoyoing. Especially having to pay for creating buildings additionally to ressources. I always feel stuck that I cannot build what I want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great game, and I REALLY want to love and play it, but simply can't.\n\nThis game HARD CRASHES my entire system repeatedly. Not a CTD, a Blue Screen Restart, with the accompanied sounds of something electrical having an aneurysm. I have an AMD Radeon RX 5700, which isn't exactly old. 5.5 years, as of writing this. Appoximately 3 years old when I first purchased this game.\n\nThis game is really something special, and I haven't found a city builder that I enjoy as much as this one. Foundation just feels cozy. Calming. Everything from the visuals, to the gameplay, to the sound design is cozy and comfortable. I love watching the paths weave into existence naturally, only to eventually get turned into stone walkways.\n\nI just can't risk my system melting for no reason. Each time this happens, I can see my SSD's life flash before my eyes.\n\nDISCLAIMER: THIS GAME MAY POTENTIALLY DAMAGE YOUR COMPUTER DEPENDING ON THE AGE OF YOUR GRAPHICS CARD. AMD GRAPHICS CARDS ARE MOST AFFECTED.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a cute game but the gameplay leaves things to be desired. You spend an awful lot of time waiting for things to be built. There is an unlock tree and you can progress from wooden to stone things like bridges but you have to delete the wooden one and replace it with stone instead of having a way to upgrade the existing features, which often times will lead to the new bridge not working and no clear explanation why.  The trade economy is not well balanced. A lot of end game resources are behind one trade route that you cannot level for 2/3 challenge aspirations. That coupled with the limited size of the map make it pretty tedious to complete them. \n\nThe game has a lot of promise but I don't know that the devs are continuing work on the game which is unfortunate. If you get this game I would suggest getting it at a heavy discount and playing with mods even though it disables achievements because its a lot more enjoyable that way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hard to recommend this great game with how often it crashes. It's unplayable for me right now.\n\nEdit: I thought I fixed the crashing by putting the game on the lowest graphics settings, but that was short lived. In that save file, I had taken up maybe 1/4 of the map, and the growing size of my town was causing crashes due to the increased graphical demand. The game recently underwent a lot of QoL and resource usage updates, and now crashes every 5 minutes even when playing a brand new save file. So, my review will stay negative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Save your money and don't buy this game. Suffered crash issues and frankly the gameplay is shit. I would never recommend this game to anyone. Its way to tedious to play. I tried giving it another shot but its just not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for many this may be the game to play\nnot for me at all on multiple levels\n\nliterally no mouse capability other than zoom in and out\nNO, I do not recommend this game for the reasons below\n\nif you're like me and can't play with a keyboard for whatever reason this is not your game either\ncan't believe there is no mouse support in this game as complex as it is\nI cannot recommend it on any level because of this\n\nplease rethink your decision to exclude mouse users bc this is an accessibility issue for me and for many others \nyou will lose sales or get refunds on the basis of this\n\nbad decision building your own game engine and leaving out accessibility features like this\nbut meanwhile begging for steam awards nominations... I don't think so\nthink inclusive first\n\nadditionally, I have a great gaming pc that I play far more complex games than yours on and your game set my system on high for no reason and everything amped so I left immediately\n\nfrom what I've seen today, you have a lot of work left to do in fixes and updates\nI wish you all the best",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Opening village fortification to modify it immediately incurs a cost of a few coins even when no edits are made, but that's nothing really. After making a small actual modification (trying to extend the wall to attach it to the manor to create a continuous zone) it fails to really attach (didn't yesterday though) and after applying: the whole wall is rebuilt from scratch. That's about 230 wood, 50 tools, 150 stone etc. in early game for the third time for the same wall now because it's bugged.\n\nThere's just no point in playing the game anymore. Bunch of stupid bugs and features like this. Otherwise it wouldn't be too bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sever lack of vision from devs. Bottle neck resources like tools make it so that you can brick your game before it even really starts. The building system is clunky. You can spend all your effort building a multi tier building only to not use it and need reddit to make anything make sense and people are as confused as you are. Highly suggest running from this game - probably forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI is dogshit, your workers will have access to items but pathfinding or priorities prevent your folks from doing their job and not just bitching about it.  As others explain in more detail, there aren't enough UI elements to describe why the shit doesn't work, just over time, it will stop working and you'll have to cheat to progress.  Unbalanced, but cute slop.\n\nSimilarly, I noticed a bug that I could not buy quartz.  I had all the requisites, and an open slot in the warehouse, every time the trader came by they acted like they could not reach my warehouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They need to fix this FPS issue with dropping up and down once you start scaling FPS drops are horrible and i have a really strong custom build PC",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the UI scales is so small it makes it unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is \"open\" when i start steam and cant stop it even though the game isnt open. I installed it again recently but while its \"open\" it isnt and i regret ever getting it....not worth at this point just a nuisance",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "VERY VEERY slooooooooooooooooooooooooooooooooooooooooooooooooooooooooow! The villagers will leave if you don't fulfill a single need. Which will just likely be a citizen fat fuck not getting his cheese wheel out of the 3 food requirements they needs. Making you wait for another peasant to show up so I can promote them and replace them in one of my many goods sweat shops because if they leave then commoners get mad they don't have bowls and candles. They will even leave doing berry brewing because \"Lack of entertainment\" WHEN THEY ARE LITERALLY BREWING THE ALCOHOL!!!!! Just don't have citizens they are a waste of money and resources. Just have commoners as they require less and don't leave often. The game fails to tell you that you if something is wrong more often than not and will punish you for modding with no achievements. Even picking an easier or custom difficulty will lead to you not getting achievements. The game is just a lazy unity asset flip anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ok",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun at first because it's new and some of the building options are unique. The graphics are cute. The citizens interact with things you put down like benches. But play for any length of time and you'll tire of it. Perfecting the supply of food to people is impossible. The game doesn't offer any suggestions as to why people can't access food or goods. A person who the game says has no access to food will have a food stand right next to their house with food available. This is such a simple and fundamental part of a city builder that I finally just gave up on it.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "I like a lot of other city builders, and I wanted to like this game, but it just didn't click for me. \r\n\r\nFirst of all, I can't stand the little people's faces, they just look like marionettes and they have a blank, deer-in-the-headlights expression. There was an opportunity to add a little bit of life to them and I feel like that opportunity was missed. Every time I tried to stop building and just watch my bustling city, those eerie doll faces drove me crazy. \r\n\r\nMore importantly, the game swings from giving you little control, to giving you overwhelming precision. I can't place houses and paths, but I can precisely design fences and fountains. It seems weird that the same game that won't let me choose the basic layout of my city, also wants me to manually place weather vanes. And there are some unspoken rules that are frustrating. I spent 30 minutes customizing a tavern and no one used it, and it took me forever to realize I had to promote individual people to citizens before they could use it. If this is a mellow game with dynamic pathing, why do I have to to micro how they drink booze? \r\n\r\nOverall, I couldn't really figure out what niche the game would fill for me. I like mellow games and I like complex puzzles where I have to break out a notepad to solve logistics problems. But it felt like this game failed to succeed at either of those things.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Honestly, this game has the potential to be really, really good; but, has a lot of issues with almost every aspect of it. \r\n\r\nThe biggest problem all stems from a lack of explanation about why or when anything happens. You're expected to constantly manage incoming and outgoing money; but, it's not just \"this building costs 2 gold per month\" it's \"this building costs 2 gold per month, and then maybe more depending on some abstract variables that we will not tell you about nor will we explain them when the costs goes up unexpectedly.\"\r\n\r\nThe tutorial is horrible. Any \"advice\" you can get will lead you towards bankruptcy immediately. \"Set up trade for tools\" -> run out of money within a couple months. \"Make bread\" -> you'll need way too much space to do that at the point they tell you. \"Levy from your citizens\" -> everyone hates you now.\r\n\r\nThe AI pathing is neat at first. Your villagers will create pathways as they walk to work, meaning the roads develop dynamically. However, since they are set to find the most efficient path to where they want to go, you'll have villagers walking through each others front yards, rather than using the obvious straight road that goes right down the centre of your village. You can fix that by putting up fences; but, this all comes back to money. Even trying to decorate costs you a ton of money that you don't have.\r\n\r\nI'm aware some people have put in hundreds of hours, or watched walkthroughs on how to play. In my opinion, you shouldn't have to. The game doesn't need to hold your hand; but, it hides too much information from the player and blindsides them later.  \r\n\r\nOnto the good: There are a lot of different buildings and everything is pretty. The tech tree is long and things are thrown at you slowly, so you won't get overwhelmed as to what you can build next (the order of when or why you should is a different story.) Lots of customisation options; you can rename anything, place things wherever you want, and some buildings are pieced together instead of being just placed as one building.\r\n\r\nIf you like micromanaging and calculating income, this game is probably for you!\r\nIf you're like me, and want to make a cute village and see it flourish into a beautiful city, stay away.\r\n\r\n(Note: there is a creative mode; but, that of course takes the fun out of watching the village grow as you play.)",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "At the moment: Don't recommend. But I will keep an eye on it.\n\nI really wish this game was still in Early Access! Because then you could just focus on the potential and say: Man, this will be so good, once it's finished. But it isn't. So now you pay money for a thoroughly unfinished and unpolished game.\n\nIf they keep updating, fixing and polishing, I will return and rethink. But as it stands now: Buy something else.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Note that this is a very soft no. \r\n\r\nThe game itself is nice. Graphics wise a bit simple but with the amount of things going on, on screen, it is not that bad. \r\n\r\nGameplay is good but has a bit of a learning curve where not everything is intuitive, you suddenly get missions asking you to build things you havent unlocked yet. This would be fine if it was once in a while but sometimes you get multiple in a row which cloggs up the quest log. \r\n\r\nUnlocking things is also not intuitive at all. Where some you need to set up your resources and grow, where others is to make sure you build additions to an existing building to make it grander, though this is not exactly explained anywhere. \r\n\r\nAnother gripe is that you need to paint where you want what to be. Such as painting zones for woodcutting so they dont cut the entire forest and a zone to build houses automatically. Which sounds great, but I sometimes have that even though you painted an area for housing it is not populated. At first I though it maybe was due to lack of resouces (food/water/services) but that didnt change it.\r\n\r\nThis is causing a lot of frustration as you lack the control. \r\n\r\nThat said I still played 6 hours in 2 days, so I did enjoy it, but the bugs shoot the game in the foot.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game itself is a great concept with a lot of cool things, but the game performance is too terrible.  I can't play 5 minutes without it freezing or crashing.  The people walking are jerky and trying to rotate an object to where you want it takes forever.  I've tried various setting changes and nothing improves.   Seems like everyone is having this problem from the forums.  I thought the recent patch would fix these issues.  Really disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Back before I bought this game in early access, there were many promises on different roadmaps that are no longer accessible, such as the trello roadmap. Promises were made for future mac release, and it was confirmed on the discord servers that it was still in consideration. I had access to PC back then, in 2021-2022, but when I moved to mac recently, the promises were left unfulfilled and I haven't been able to play this game at all. If the devs make any promises, take them with a pinch of salt, as all mac users have been abandoned",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A Foundation with a Crumbling Base...\n\nWe’re in a genre where, honestly, it feels like we’ve seen just about everything—especially when it comes to pure city-building.\nGame series like Anno, The Settlers, Age of Empires, SimCity, and many more offer a much wider variety of mechanics and personalities to play around with.\n\nIn Foundation, I personally miss the core that makes a game truly enjoyable in the long run.\nMaybe it’s the familiar elements we’ve all seen a hundred times before, the bland characters, or the meaningless mechanics - like the military system. Why even have one if there’s no one to fight?\n\nIf I had to compare Foundation to anything, it would be The Settlers III.\nSimilar NPC route planning, no unnecessary mechanics, way more bustle and charm, NPCs that actually feel lively, a functioning military, and a wide variety of missions and factions...\nEven though the graphics can’t compete anymore (the game released back in 2000), the fun factor easily holds up. And if you sprinkle in just a dash of Anno for the city-building aspect, it makes it really hard for me to recommend Foundation.\n\nEspecially at a price still above €20 - even on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terribly unbalanced game. There's a constant shortage of everything, and once you're behind on your stock, it takes at least 5 to 10 in-game years to gather enough manpower to fix things. Tip: Make sure that at least one in every two buildings you place are farms.\n\nMake sure you have the Wiki open while playing, as there are many buildings with hidden conditions that the game itself doesn’t show.\n\nAdditionally, it's technically terribly optimized. With a 5070TI, 64GB RAM, and an AMD Ryzen 5 7600x, I can't get more than 35 FPS, and the game regularly freezes for 3 to 10 seconds.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I originally bought this game cause I love my building sims and i'm huge fan for anything medieval/fantasy, not to mention this game has unique artistic art style to it, so i thought i would enjoy this game, but that wouldn't be the case unfortunately.\n\nthere's a ton of restrictions regarding resources and building requirements that the game doesn't outright tell you from the start, which makes it annoying when managing certain buildings and maintaining your already scarce resources. This game also seems to lack essential building tools that would of been an integral part during the process of creation, like terraforming, prop deletion, or placeable/manual roads. and while a grid-less system sounds good on paper, its's unfortunately not well executed as you are still constraint by small sections of the map. The UI is also a bit difficult to navigate, since you have to go through many hoops and hurdles just to find the unlockables and resource management tabs.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Seems like  fun game, unfortunately couldn't even play it as it crashed every time i started a new game. My specs are enough to run it, ran it as admin and my drivers are up to date. \n\nSad",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too many irritating little intricacies/hidden requirements to make this a relaxing build sim.  Going back to farthest frontier.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really want to enjoy this game. In many aspects it is better than others, but it is unpolished. A map camera that doesnt move, naturally generating elements such as rocks that are destroyed when you have ever placed anything remotely close to them, without telling you they will be removed the next day... it turns what could be a beautiful game which you'd think was a focus with the nice art, no grid, clever path making system etc... into a land devoid of beauty, just buildings with a few small decorations dotted around.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Too buggy. Villagers complain that there are not enough houses for them to live in but for some reason they don't build any more houses despite having enough dedicated space marked. Looking through forums and boards show it's a common bug and many users are just 'guessing' around how to solve it but nothing really works realiably. It's just a pain to start a new game all the time or rebuild everything for no reason. It's obviously a bug that villagers don't build any more houses despite the need for them.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "promising for a single-player-only strategy/building sim, but the intracies of even early-mid-game building are not intuitive or solvable (manor house and how to outfit visitor/tax parts seems ridiculous).  Earlier less-obvious complexities with territory and fishing mechanics were figured out only by trial-and-error multiple start-from-scratch saves.  the guidance is helpful for only the most basic mechanics.  if it improves with further updates, I am open to revisiting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Moving buildings creates pathing errors and the plebs can't find moved buildings. instead buildings have to be deleted and rebuilt. very annoying",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Post launch this game has become so boring. You genuinely need another activity on a separate monitor to mitigate the wait time in this game. Ironically in my opinion it was in a much better state at beta. It's a pitty as otherwise its a decent game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The concept of the game is good, but has a couple of frustrating features towards the end game.  \r\n\r\nResource distribution is very hard to get right and can make the end game very annoying. Understanding consumption rates is nigh on impossible, requiring you to overproduce everything to avoid villagers leaving in droves. \r\n\r\nThere are good elements available for beautification, but houses automatically spawn out of zones, and villagers create their own paths, impacting how pretty you can make the housing and streets.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't recommend this game. The late game is very demorolising. The housing is so frustrating, don't even start me on how many my houses were downgraded out of blue. A waste of resources plugging holes all the damn times. Terrible balancing and output",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nice game, but almost torched my PC after latest update.. poor optimization, PC always hot as hell.. I can play BF6 with no issues for example..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I personally don't like it. tryed to start it up thrice and just get anoyed by how messy the building is. \r\nLet me point out some point i disliked.\r\n\r\n-Having to paint a part of the map(yes paint) so people build houses there, instead of making a pretty hosue district yourself . Its such disorder. frustrating. add to that the way to upgrade houses is to spam the same stuff all over that painted space, makes it even more messy.\r\n-it is very hard to plan ahead with limited space and buildings that keep getting bigger. GL putting down your first Church that in the end game will be atleast 5x as big.\r\n-Way to much custum stuff thats needed. Making buildings pretty and such all fine and good, but having to drop down 10 parts to complete a building instead of just placing one complete building feels like a hassle.And the bigger your town gets, the more parts you need to keep adding!\r\n-market, what is up with this? Whats wrong with a  standard market that have serveral spots, no we need to place down 1 stall for 1 resource again such a  hassle, whats wrong with a big complete market we can put down?\r\n\r\nI can go on and on like this. Its just terrible gameplay to much micromangement where it should not be needed. And it ruines the game for me. Would have loved an option to select between complete buildings and customize buildings, would have done alot of good for me. But so be it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Keeps crashing even after the update that was specific for the card I use. Cool game, just can't recommend if it's crashing when building a bridge.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a good game but with the 1.0 update removed and changed things that has made me drop the game, removed day/night cycle? why just why!? removed the weather system? again why just why!? changed how the maps work and much smaller overall \nso yea disappointed",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game was fun at first and looks great. downside is you run out of money, tools, or happiness and you're done. I have to look up everything but you find out once you get stuck in a cycle of no gold or no tools, you have no way of reversing it, so you've wasted your time up to that point and just idle there while your gold goes up +20 from a trade but your defecit is -30 even when you take everyone out of work. The game has potential but since the last update isn't since ike July, there's really no point. I did better off not following the tutorial. Waste of time, Waste of money. Just watch videos of someone else playing if you're interested in this game. 2/10 from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overall is a good game for city builder in medieval era. The biggest gripes about it is how the game is actually designed with the serf villagers eating all of the commoner required food. No matter how the city is built or structured, the serfs always seem to find the commoner food and eat it all and production cannot keep up with demand. The housing proximity is really obnoxious and not realistic - this feeds into the food issue and other raw resource production that takes up a lot of room. You can have a central city hub that expands outward with raw resource production but then serfs will complain there is no housing. If you put housing out in the middle of nowhere, they complain they cant get service or food - there is no way winning at that design. The last really obnoxious design is the paved roads. I get that paved roads deteriorate and need repair, that is fine. My issue is with how fast they degrade or at what threshold the pavers prioritize repairing versus making new paths for more citizens. It feels like the threshold should be much lower to like 15%-20% until they get prioritized to be repaired versus the what seems like 95% currently. Also, its STONE ROAD, it shouldn't need to be repaired so frequently.\n\nFun game to explore and play, but small design flaws make it very frustrating long term. If the food you produce has a value to it and it needs to be purchased, that should help take care of the serfs eating all of the refined food because they would be less able to purchase it so frequently, instead maybe being able to only purchase it once a month instead once per week, etc. It just needs a few tweaks to it then it would be much, much better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is really good but unplayable after getting a biggish city game just crashing and lose the save fix this and i will be back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Idea of a free building system and developing your small town to a bigger one is awesome! I can tell there are layers of developement in the growing of your town to a city.  So far great!\nU can try out the different styles and difficulties. \nFrom focusing more on villagers or more on religion or military style of even a balanced mix^^ \n\nUnf. Here comes the biggest hiccup. Atm the game is unplayable - Due to dropping of framerates - the screen gets stuck after each menu pop-up. Or has a loooong loading in time.\nThis happends with tiny towns of 25 villagers or the big ones with 245 villagers - (I did both)\n\nNo matter how good your pc is and how fast ur framrate is . After the last update there is no more day and night. And some other things are not quit right..\nOfc its still early in the game I'd wait to buy it (for now) until there is a big discount. Due that the game freezes up.\n\nOfc. I read on several different platforms that this is a major issue, the game itself is awesome but the latest update is terrible for the game play...\n\nAnd yes update your drivers to play the game, disable the cloud saves and yes lowering your graphics does work a tiny little bit... but that is a POOR sollution to keep playing it. After all that the game screen still freezes...\nMy trick at the time being is to use taskmanager to unfreeze the game and play for some minutes and repeat.\n\nAfter this mayor Bug or what ever Is repaired by the developers then Ill update this review. To YEA!! This is an awesome game^^",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, but the money mechanic is too annoyoing. Especially having to pay for creating buildings additionally to ressources. I always feel stuck that I cannot build what I want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great game, and I REALLY want to love and play it, but simply can't.\n\nThis game HARD CRASHES my entire system repeatedly. Not a CTD, a Blue Screen Restart, with the accompanied sounds of something electrical having an aneurysm. I have an AMD Radeon RX 5700, which isn't exactly old. 5.5 years, as of writing this. Appoximately 3 years old when I first purchased this game.\n\nThis game is really something special, and I haven't found a city builder that I enjoy as much as this one. Foundation just feels cozy. Calming. Everything from the visuals, to the gameplay, to the sound design is cozy and comfortable. I love watching the paths weave into existence naturally, only to eventually get turned into stone walkways.\n\nI just can't risk my system melting for no reason. Each time this happens, I can see my SSD's life flash before my eyes.\n\nDISCLAIMER: THIS GAME MAY POTENTIALLY DAMAGE YOUR COMPUTER DEPENDING ON THE AGE OF YOUR GRAPHICS CARD. AMD GRAPHICS CARDS ARE MOST AFFECTED.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a cute game but the gameplay leaves things to be desired. You spend an awful lot of time waiting for things to be built. There is an unlock tree and you can progress from wooden to stone things like bridges but you have to delete the wooden one and replace it with stone instead of having a way to upgrade the existing features, which often times will lead to the new bridge not working and no clear explanation why.  The trade economy is not well balanced. A lot of end game resources are behind one trade route that you cannot level for 2/3 challenge aspirations. That coupled with the limited size of the map make it pretty tedious to complete them. \n\nThe game has a lot of promise but I don't know that the devs are continuing work on the game which is unfortunate. If you get this game I would suggest getting it at a heavy discount and playing with mods even though it disables achievements because its a lot more enjoyable that way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hard to recommend this great game with how often it crashes. It's unplayable for me right now.\n\nEdit: I thought I fixed the crashing by putting the game on the lowest graphics settings, but that was short lived. In that save file, I had taken up maybe 1/4 of the map, and the growing size of my town was causing crashes due to the increased graphical demand. The game recently underwent a lot of QoL and resource usage updates, and now crashes every 5 minutes even when playing a brand new save file. So, my review will stay negative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Save your money and don't buy this game. Suffered crash issues and frankly the gameplay is shit. I would never recommend this game to anyone. Its way to tedious to play. I tried giving it another shot but its just not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for many this may be the game to play\nnot for me at all on multiple levels\n\nliterally no mouse capability other than zoom in and out\nNO, I do not recommend this game for the reasons below\n\nif you're like me and can't play with a keyboard for whatever reason this is not your game either\ncan't believe there is no mouse support in this game as complex as it is\nI cannot recommend it on any level because of this\n\nplease rethink your decision to exclude mouse users bc this is an accessibility issue for me and for many others \nyou will lose sales or get refunds on the basis of this\n\nbad decision building your own game engine and leaving out accessibility features like this\nbut meanwhile begging for steam awards nominations... I don't think so\nthink inclusive first\n\nadditionally, I have a great gaming pc that I play far more complex games than yours on and your game set my system on high for no reason and everything amped so I left immediately\n\nfrom what I've seen today, you have a lot of work left to do in fixes and updates\nI wish you all the best",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Opening village fortification to modify it immediately incurs a cost of a few coins even when no edits are made, but that's nothing really. After making a small actual modification (trying to extend the wall to attach it to the manor to create a continuous zone) it fails to really attach (didn't yesterday though) and after applying: the whole wall is rebuilt from scratch. That's about 230 wood, 50 tools, 150 stone etc. in early game for the third time for the same wall now because it's bugged.\n\nThere's just no point in playing the game anymore. Bunch of stupid bugs and features like this. Otherwise it wouldn't be too bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sever lack of vision from devs. Bottle neck resources like tools make it so that you can brick your game before it even really starts. The building system is clunky. You can spend all your effort building a multi tier building only to not use it and need reddit to make anything make sense and people are as confused as you are. Highly suggest running from this game - probably forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI is dogshit, your workers will have access to items but pathfinding or priorities prevent your folks from doing their job and not just bitching about it.  As others explain in more detail, there aren't enough UI elements to describe why the shit doesn't work, just over time, it will stop working and you'll have to cheat to progress.  Unbalanced, but cute slop.\n\nSimilarly, I noticed a bug that I could not buy quartz.  I had all the requisites, and an open slot in the warehouse, every time the trader came by they acted like they could not reach my warehouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They need to fix this FPS issue with dropping up and down once you start scaling FPS drops are horrible and i have a really strong custom build PC",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the UI scales is so small it makes it unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is \"open\" when i start steam and cant stop it even though the game isnt open. I installed it again recently but while its \"open\" it isnt and i regret ever getting it....not worth at this point just a nuisance",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "VERY VEERY slooooooooooooooooooooooooooooooooooooooooooooooooooooooooow! The villagers will leave if you don't fulfill a single need. Which will just likely be a citizen fat fuck not getting his cheese wheel out of the 3 food requirements they needs. Making you wait for another peasant to show up so I can promote them and replace them in one of my many goods sweat shops because if they leave then commoners get mad they don't have bowls and candles. They will even leave doing berry brewing because \"Lack of entertainment\" WHEN THEY ARE LITERALLY BREWING THE ALCOHOL!!!!! Just don't have citizens they are a waste of money and resources. Just have commoners as they require less and don't leave often. The game fails to tell you that you if something is wrong more often than not and will punish you for modding with no achievements. Even picking an easier or custom difficulty will lead to you not getting achievements. The game is just a lazy unity asset flip anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ok",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun at first because it's new and some of the building options are unique. The graphics are cute. The citizens interact with things you put down like benches. But play for any length of time and you'll tire of it. Perfecting the supply of food to people is impossible. The game doesn't offer any suggestions as to why people can't access food or goods. A person who the game says has no access to food will have a food stand right next to their house with food available. This is such a simple and fundamental part of a city builder that I finally just gave up on it.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "I like a lot of other city builders, and I wanted to like this game, but it just didn't click for me. \r\n\r\nFirst of all, I can't stand the little people's faces, they just look like marionettes and they have a blank, deer-in-the-headlights expression. There was an opportunity to add a little bit of life to them and I feel like that opportunity was missed. Every time I tried to stop building and just watch my bustling city, those eerie doll faces drove me crazy. \r\n\r\nMore importantly, the game swings from giving you little control, to giving you overwhelming precision. I can't place houses and paths, but I can precisely design fences and fountains. It seems weird that the same game that won't let me choose the basic layout of my city, also wants me to manually place weather vanes. And there are some unspoken rules that are frustrating. I spent 30 minutes customizing a tavern and no one used it, and it took me forever to realize I had to promote individual people to citizens before they could use it. If this is a mellow game with dynamic pathing, why do I have to to micro how they drink booze? \r\n\r\nOverall, I couldn't really figure out what niche the game would fill for me. I like mellow games and I like complex puzzles where I have to break out a notepad to solve logistics problems. But it felt like this game failed to succeed at either of those things.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Honestly, this game has the potential to be really, really good; but, has a lot of issues with almost every aspect of it. \r\n\r\nThe biggest problem all stems from a lack of explanation about why or when anything happens. You're expected to constantly manage incoming and outgoing money; but, it's not just \"this building costs 2 gold per month\" it's \"this building costs 2 gold per month, and then maybe more depending on some abstract variables that we will not tell you about nor will we explain them when the costs goes up unexpectedly.\"\r\n\r\nThe tutorial is horrible. Any \"advice\" you can get will lead you towards bankruptcy immediately. \"Set up trade for tools\" -> run out of money within a couple months. \"Make bread\" -> you'll need way too much space to do that at the point they tell you. \"Levy from your citizens\" -> everyone hates you now.\r\n\r\nThe AI pathing is neat at first. Your villagers will create pathways as they walk to work, meaning the roads develop dynamically. However, since they are set to find the most efficient path to where they want to go, you'll have villagers walking through each others front yards, rather than using the obvious straight road that goes right down the centre of your village. You can fix that by putting up fences; but, this all comes back to money. Even trying to decorate costs you a ton of money that you don't have.\r\n\r\nI'm aware some people have put in hundreds of hours, or watched walkthroughs on how to play. In my opinion, you shouldn't have to. The game doesn't need to hold your hand; but, it hides too much information from the player and blindsides them later.  \r\n\r\nOnto the good: There are a lot of different buildings and everything is pretty. The tech tree is long and things are thrown at you slowly, so you won't get overwhelmed as to what you can build next (the order of when or why you should is a different story.) Lots of customisation options; you can rename anything, place things wherever you want, and some buildings are pieced together instead of being just placed as one building.\r\n\r\nIf you like micromanaging and calculating income, this game is probably for you!\r\nIf you're like me, and want to make a cute village and see it flourish into a beautiful city, stay away.\r\n\r\n(Note: there is a creative mode; but, that of course takes the fun out of watching the village grow as you play.)",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "At the moment: Don't recommend. But I will keep an eye on it.\n\nI really wish this game was still in Early Access! Because then you could just focus on the potential and say: Man, this will be so good, once it's finished. But it isn't. So now you pay money for a thoroughly unfinished and unpolished game.\n\nIf they keep updating, fixing and polishing, I will return and rethink. But as it stands now: Buy something else.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Note that this is a very soft no. \r\n\r\nThe game itself is nice. Graphics wise a bit simple but with the amount of things going on, on screen, it is not that bad. \r\n\r\nGameplay is good but has a bit of a learning curve where not everything is intuitive, you suddenly get missions asking you to build things you havent unlocked yet. This would be fine if it was once in a while but sometimes you get multiple in a row which cloggs up the quest log. \r\n\r\nUnlocking things is also not intuitive at all. Where some you need to set up your resources and grow, where others is to make sure you build additions to an existing building to make it grander, though this is not exactly explained anywhere. \r\n\r\nAnother gripe is that you need to paint where you want what to be. Such as painting zones for woodcutting so they dont cut the entire forest and a zone to build houses automatically. Which sounds great, but I sometimes have that even though you painted an area for housing it is not populated. At first I though it maybe was due to lack of resouces (food/water/services) but that didnt change it.\r\n\r\nThis is causing a lot of frustration as you lack the control. \r\n\r\nThat said I still played 6 hours in 2 days, so I did enjoy it, but the bugs shoot the game in the foot.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game itself is a great concept with a lot of cool things, but the game performance is too terrible.  I can't play 5 minutes without it freezing or crashing.  The people walking are jerky and trying to rotate an object to where you want it takes forever.  I've tried various setting changes and nothing improves.   Seems like everyone is having this problem from the forums.  I thought the recent patch would fix these issues.  Really disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Back before I bought this game in early access, there were many promises on different roadmaps that are no longer accessible, such as the trello roadmap. Promises were made for future mac release, and it was confirmed on the discord servers that it was still in consideration. I had access to PC back then, in 2021-2022, but when I moved to mac recently, the promises were left unfulfilled and I haven't been able to play this game at all. If the devs make any promises, take them with a pinch of salt, as all mac users have been abandoned",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A Foundation with a Crumbling Base...\n\nWe’re in a genre where, honestly, it feels like we’ve seen just about everything—especially when it comes to pure city-building.\nGame series like Anno, The Settlers, Age of Empires, SimCity, and many more offer a much wider variety of mechanics and personalities to play around with.\n\nIn Foundation, I personally miss the core that makes a game truly enjoyable in the long run.\nMaybe it’s the familiar elements we’ve all seen a hundred times before, the bland characters, or the meaningless mechanics - like the military system. Why even have one if there’s no one to fight?\n\nIf I had to compare Foundation to anything, it would be The Settlers III.\nSimilar NPC route planning, no unnecessary mechanics, way more bustle and charm, NPCs that actually feel lively, a functioning military, and a wide variety of missions and factions...\nEven though the graphics can’t compete anymore (the game released back in 2000), the fun factor easily holds up. And if you sprinkle in just a dash of Anno for the city-building aspect, it makes it really hard for me to recommend Foundation.\n\nEspecially at a price still above €20 - even on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terribly unbalanced game. There's a constant shortage of everything, and once you're behind on your stock, it takes at least 5 to 10 in-game years to gather enough manpower to fix things. Tip: Make sure that at least one in every two buildings you place are farms.\n\nMake sure you have the Wiki open while playing, as there are many buildings with hidden conditions that the game itself doesn’t show.\n\nAdditionally, it's technically terribly optimized. With a 5070TI, 64GB RAM, and an AMD Ryzen 5 7600x, I can't get more than 35 FPS, and the game regularly freezes for 3 to 10 seconds.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I originally bought this game cause I love my building sims and i'm huge fan for anything medieval/fantasy, not to mention this game has unique artistic art style to it, so i thought i would enjoy this game, but that wouldn't be the case unfortunately.\n\nthere's a ton of restrictions regarding resources and building requirements that the game doesn't outright tell you from the start, which makes it annoying when managing certain buildings and maintaining your already scarce resources. This game also seems to lack essential building tools that would of been an integral part during the process of creation, like terraforming, prop deletion, or placeable/manual roads. and while a grid-less system sounds good on paper, its's unfortunately not well executed as you are still constraint by small sections of the map. The UI is also a bit difficult to navigate, since you have to go through many hoops and hurdles just to find the unlockables and resource management tabs.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Seems like  fun game, unfortunately couldn't even play it as it crashed every time i started a new game. My specs are enough to run it, ran it as admin and my drivers are up to date. \n\nSad",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too many irritating little intricacies/hidden requirements to make this a relaxing build sim.  Going back to farthest frontier.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really want to enjoy this game. In many aspects it is better than others, but it is unpolished. A map camera that doesnt move, naturally generating elements such as rocks that are destroyed when you have ever placed anything remotely close to them, without telling you they will be removed the next day... it turns what could be a beautiful game which you'd think was a focus with the nice art, no grid, clever path making system etc... into a land devoid of beauty, just buildings with a few small decorations dotted around.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Too buggy. Villagers complain that there are not enough houses for them to live in but for some reason they don't build any more houses despite having enough dedicated space marked. Looking through forums and boards show it's a common bug and many users are just 'guessing' around how to solve it but nothing really works realiably. It's just a pain to start a new game all the time or rebuild everything for no reason. It's obviously a bug that villagers don't build any more houses despite the need for them.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "promising for a single-player-only strategy/building sim, but the intracies of even early-mid-game building are not intuitive or solvable (manor house and how to outfit visitor/tax parts seems ridiculous).  Earlier less-obvious complexities with territory and fishing mechanics were figured out only by trial-and-error multiple start-from-scratch saves.  the guidance is helpful for only the most basic mechanics.  if it improves with further updates, I am open to revisiting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Moving buildings creates pathing errors and the plebs can't find moved buildings. instead buildings have to be deleted and rebuilt. very annoying",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Post launch this game has become so boring. You genuinely need another activity on a separate monitor to mitigate the wait time in this game. Ironically in my opinion it was in a much better state at beta. It's a pitty as otherwise its a decent game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The concept of the game is good, but has a couple of frustrating features towards the end game.  \r\n\r\nResource distribution is very hard to get right and can make the end game very annoying. Understanding consumption rates is nigh on impossible, requiring you to overproduce everything to avoid villagers leaving in droves. \r\n\r\nThere are good elements available for beautification, but houses automatically spawn out of zones, and villagers create their own paths, impacting how pretty you can make the housing and streets.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't recommend this game. The late game is very demorolising. The housing is so frustrating, don't even start me on how many my houses were downgraded out of blue. A waste of resources plugging holes all the damn times. Terrible balancing and output",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nice game, but almost torched my PC after latest update.. poor optimization, PC always hot as hell.. I can play BF6 with no issues for example..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I personally don't like it. tryed to start it up thrice and just get anoyed by how messy the building is. \r\nLet me point out some point i disliked.\r\n\r\n-Having to paint a part of the map(yes paint) so people build houses there, instead of making a pretty hosue district yourself . Its such disorder. frustrating. add to that the way to upgrade houses is to spam the same stuff all over that painted space, makes it even more messy.\r\n-it is very hard to plan ahead with limited space and buildings that keep getting bigger. GL putting down your first Church that in the end game will be atleast 5x as big.\r\n-Way to much custum stuff thats needed. Making buildings pretty and such all fine and good, but having to drop down 10 parts to complete a building instead of just placing one complete building feels like a hassle.And the bigger your town gets, the more parts you need to keep adding!\r\n-market, what is up with this? Whats wrong with a  standard market that have serveral spots, no we need to place down 1 stall for 1 resource again such a  hassle, whats wrong with a big complete market we can put down?\r\n\r\nI can go on and on like this. Its just terrible gameplay to much micromangement where it should not be needed. And it ruines the game for me. Would have loved an option to select between complete buildings and customize buildings, would have done alot of good for me. But so be it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Keeps crashing even after the update that was specific for the card I use. Cool game, just can't recommend if it's crashing when building a bridge.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a good game but with the 1.0 update removed and changed things that has made me drop the game, removed day/night cycle? why just why!? removed the weather system? again why just why!? changed how the maps work and much smaller overall \nso yea disappointed",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game was fun at first and looks great. downside is you run out of money, tools, or happiness and you're done. I have to look up everything but you find out once you get stuck in a cycle of no gold or no tools, you have no way of reversing it, so you've wasted your time up to that point and just idle there while your gold goes up +20 from a trade but your defecit is -30 even when you take everyone out of work. The game has potential but since the last update isn't since ike July, there's really no point. I did better off not following the tutorial. Waste of time, Waste of money. Just watch videos of someone else playing if you're interested in this game. 2/10 from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overall is a good game for city builder in medieval era. The biggest gripes about it is how the game is actually designed with the serf villagers eating all of the commoner required food. No matter how the city is built or structured, the serfs always seem to find the commoner food and eat it all and production cannot keep up with demand. The housing proximity is really obnoxious and not realistic - this feeds into the food issue and other raw resource production that takes up a lot of room. You can have a central city hub that expands outward with raw resource production but then serfs will complain there is no housing. If you put housing out in the middle of nowhere, they complain they cant get service or food - there is no way winning at that design. The last really obnoxious design is the paved roads. I get that paved roads deteriorate and need repair, that is fine. My issue is with how fast they degrade or at what threshold the pavers prioritize repairing versus making new paths for more citizens. It feels like the threshold should be much lower to like 15%-20% until they get prioritized to be repaired versus the what seems like 95% currently. Also, its STONE ROAD, it shouldn't need to be repaired so frequently.\n\nFun game to explore and play, but small design flaws make it very frustrating long term. If the food you produce has a value to it and it needs to be purchased, that should help take care of the serfs eating all of the refined food because they would be less able to purchase it so frequently, instead maybe being able to only purchase it once a month instead once per week, etc. It just needs a few tweaks to it then it would be much, much better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game is really good but unplayable after getting a biggish city game just crashing and lose the save fix this and i will be back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Idea of a free building system and developing your small town to a bigger one is awesome! I can tell there are layers of developement in the growing of your town to a city.  So far great!\nU can try out the different styles and difficulties. \nFrom focusing more on villagers or more on religion or military style of even a balanced mix^^ \n\nUnf. Here comes the biggest hiccup. Atm the game is unplayable - Due to dropping of framerates - the screen gets stuck after each menu pop-up. Or has a loooong loading in time.\nThis happends with tiny towns of 25 villagers or the big ones with 245 villagers - (I did both)\n\nNo matter how good your pc is and how fast ur framrate is . After the last update there is no more day and night. And some other things are not quit right..\nOfc its still early in the game I'd wait to buy it (for now) until there is a big discount. Due that the game freezes up.\n\nOfc. I read on several different platforms that this is a major issue, the game itself is awesome but the latest update is terrible for the game play...\n\nAnd yes update your drivers to play the game, disable the cloud saves and yes lowering your graphics does work a tiny little bit... but that is a POOR sollution to keep playing it. After all that the game screen still freezes...\nMy trick at the time being is to use taskmanager to unfreeze the game and play for some minutes and repeat.\n\nAfter this mayor Bug or what ever Is repaired by the developers then Ill update this review. To YEA!! This is an awesome game^^",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, but the money mechanic is too annoyoing. Especially having to pay for creating buildings additionally to ressources. I always feel stuck that I cannot build what I want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great game, and I REALLY want to love and play it, but simply can't.\n\nThis game HARD CRASHES my entire system repeatedly. Not a CTD, a Blue Screen Restart, with the accompanied sounds of something electrical having an aneurysm. I have an AMD Radeon RX 5700, which isn't exactly old. 5.5 years, as of writing this. Appoximately 3 years old when I first purchased this game.\n\nThis game is really something special, and I haven't found a city builder that I enjoy as much as this one. Foundation just feels cozy. Calming. Everything from the visuals, to the gameplay, to the sound design is cozy and comfortable. I love watching the paths weave into existence naturally, only to eventually get turned into stone walkways.\n\nI just can't risk my system melting for no reason. Each time this happens, I can see my SSD's life flash before my eyes.\n\nDISCLAIMER: THIS GAME MAY POTENTIALLY DAMAGE YOUR COMPUTER DEPENDING ON THE AGE OF YOUR GRAPHICS CARD. AMD GRAPHICS CARDS ARE MOST AFFECTED.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a cute game but the gameplay leaves things to be desired. You spend an awful lot of time waiting for things to be built. There is an unlock tree and you can progress from wooden to stone things like bridges but you have to delete the wooden one and replace it with stone instead of having a way to upgrade the existing features, which often times will lead to the new bridge not working and no clear explanation why.  The trade economy is not well balanced. A lot of end game resources are behind one trade route that you cannot level for 2/3 challenge aspirations. That coupled with the limited size of the map make it pretty tedious to complete them. \n\nThe game has a lot of promise but I don't know that the devs are continuing work on the game which is unfortunate. If you get this game I would suggest getting it at a heavy discount and playing with mods even though it disables achievements because its a lot more enjoyable that way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hard to recommend this great game with how often it crashes. It's unplayable for me right now.\n\nEdit: I thought I fixed the crashing by putting the game on the lowest graphics settings, but that was short lived. In that save file, I had taken up maybe 1/4 of the map, and the growing size of my town was causing crashes due to the increased graphical demand. The game recently underwent a lot of QoL and resource usage updates, and now crashes every 5 minutes even when playing a brand new save file. So, my review will stay negative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Save your money and don't buy this game. Suffered crash issues and frankly the gameplay is shit. I would never recommend this game to anyone. Its way to tedious to play. I tried giving it another shot but its just not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for many this may be the game to play\nnot for me at all on multiple levels\n\nliterally no mouse capability other than zoom in and out\nNO, I do not recommend this game for the reasons below\n\nif you're like me and can't play with a keyboard for whatever reason this is not your game either\ncan't believe there is no mouse support in this game as complex as it is\nI cannot recommend it on any level because of this\n\nplease rethink your decision to exclude mouse users bc this is an accessibility issue for me and for many others \nyou will lose sales or get refunds on the basis of this\n\nbad decision building your own game engine and leaving out accessibility features like this\nbut meanwhile begging for steam awards nominations... I don't think so\nthink inclusive first\n\nadditionally, I have a great gaming pc that I play far more complex games than yours on and your game set my system on high for no reason and everything amped so I left immediately\n\nfrom what I've seen today, you have a lot of work left to do in fixes and updates\nI wish you all the best",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Opening village fortification to modify it immediately incurs a cost of a few coins even when no edits are made, but that's nothing really. After making a small actual modification (trying to extend the wall to attach it to the manor to create a continuous zone) it fails to really attach (didn't yesterday though) and after applying: the whole wall is rebuilt from scratch. That's about 230 wood, 50 tools, 150 stone etc. in early game for the third time for the same wall now because it's bugged.\n\nThere's just no point in playing the game anymore. Bunch of stupid bugs and features like this. Otherwise it wouldn't be too bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sever lack of vision from devs. Bottle neck resources like tools make it so that you can brick your game before it even really starts. The building system is clunky. You can spend all your effort building a multi tier building only to not use it and need reddit to make anything make sense and people are as confused as you are. Highly suggest running from this game - probably forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI is dogshit, your workers will have access to items but pathfinding or priorities prevent your folks from doing their job and not just bitching about it.  As others explain in more detail, there aren't enough UI elements to describe why the shit doesn't work, just over time, it will stop working and you'll have to cheat to progress.  Unbalanced, but cute slop.\n\nSimilarly, I noticed a bug that I could not buy quartz.  I had all the requisites, and an open slot in the warehouse, every time the trader came by they acted like they could not reach my warehouse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They need to fix this FPS issue with dropping up and down once you start scaling FPS drops are horrible and i have a really strong custom build PC",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the UI scales is so small it makes it unplayable",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}