{
  "positive": [
    {
      "review": "BEST THIRD PERSON ZOMBIES CO-OP SHOOTER EVER!\n\nI have over 1K+ hours on Epic game store because it was exclusive on Epic only previously. As the game is too good, so I buy again on Steam.  If you wanna experient fluid intense breath-holding zombies mowing shooter, this is it! \n\nThis game unlike those brainless shooter, it actually requires critical thinking skill and in depth understanding of your class perks to play at max difficulty. Luckily, the game let you choose the level of difficulty before you start a match, so you can learn the game at your own pace.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of the most fun co-op zombie shooters out there. It captures the chaos of the movie perfectly huge swarms of zombies, fast pacing, and constant pressure that keeps every match exciting. The classes give you real variety, and leveling up weapons feels rewarding.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This works perfectly on steamdeck. I don't understand why it s still labeled as unsupported. I really wish you have a collaboration with left 4 dead and the witch, jockey, smoker and the others. That will be awesome as old school gamers gonna play this too..",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Play for the unique zombie horde battles and somewhat customized class setups.\n\nStay for(ever) the endless grind.  And I do mean endless.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is good when you need a fix for zombie games, despite it not having any open-world exploration and linear gameplay, there's still some mechanics that are fun and the RNG makes each map replayable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its very good game, before buying this device, i really want to play this game, then after all decision, i  buy this device then i download my dream game, thanks for always be my dream game, wwz...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's actually decent fun. Yeah it is a tad repetitive, but only in the same sense L4D2 is. Which isn't a bad thing by any means. The amount of zombies this game renders is actually pretty damn amazing. It's not too system intensive too if my Mini PC is any indicator of that. It's on sale quite often for as low as 10$, I'd say it's worth it. Little hit and miss on how supportive randys you play with are, but so far nothing devastating and you can turn off mic talk entirely. Obviously perfect with friends like most things in life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "just now experience this game after being in my library for so long collecting dust. Safe to say the game is just really laid back. Shooting zombies and leveling up your class to get more perks to Kill More zombies.. Yeah so its zombie killing game. Best to put it... this is like a younger brother for L4D. new mechanics ragdolls etc. But yeah it the end it mindless killing zombie game on the weekend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game in my opinion. But the fact these kunts didn't add a workshop to the game does my head in. Left 4 dead is my go to zombie game but this is alr.. just no mods is crazy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to be a l4d2 fan, at first i thought this game was underwhelming (mainly just the voice actor, i really like l4d va) but oh boy this game was so much fun even after +100 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good co-op fun, lots of zombie killing action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game excels because it understands what makes a co-op shooter fun: teamwork, specialization, and satisfying combat.\nthe class system is the of the game replay ability. where you are a medic keeping everyone alive, the vanguard tanking a lane, or he hellraiser clearing the swarm with C4, every role feels vital. the weapon specific upgrades and class perks truly make it different in how you approach each mission.\nthe addition of the melee system with dual weapons is a game changer, giving you a strong backup for when you get swamped. And of course the hundreds of zombies on screen at once is still the most impressive technical and emotional draw.\nits a high quality package that continually gets supported. of you have a dedicated squad, this is one of the best co-op experiences you can buy on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a superb game. The gameplay was entertaining and captivating from start to finish, and I felt completely engrossed in the universe. I think this is one of the best games I've played this year. ツ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really good for every player, fight hard, and stay alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game, this is my first time playing it on PC and I love it. (Originally played it on Playstation) Still a great game after years, I recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game during the Christmas sales in 2024 since Ive always wanted to try this once you start it is fun till you realise this game sometimes gets a little boring such as example: Finding lobbies that people wont leave or Leveling up | The positive side of this game is that it always gets updated New DLCS drop sometimes And you can always play with friends but there is a bit of a problem the graphics are sometimes shit and you will always get lag pings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sure its a semi copy of left for dead but the horde rushing in is cool to see every time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- Somehow this game crashes without closing the game or disabling inputs and manages to enhance performance.\n\n- Landmines in Jerusalem are near-invisible and I am colourblind.\n\n- How was there 1,000,000 zombies on a ship heading to Tokyo?\n\n- Please put me down juggernaut.\n\n11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy cooperative gameplay and epic battles against overwhelming odds, this game is definitely worth checking out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is kinda a mixed a bag. It's overall a good game, the visuals are stunning and captures the World War Z premise pretty well with all those waves of running zombies, but it has it's fair share of bugs and design flaws.\n\nWhat I hate the most is the invisible dmg trail that happens before you get overrun by zombies. It's just an invisible trigger block of heavy dmg that gets turned on when x zombies are breaking through certain defenses.\n\nThe bots teammates in this game will never reach the level of L4D. They are incredibly dumb and do only the minimum to survive. It's a pain in the butt to keep them alive on harder difficulties.\n\nThere is also a bunch of controversy like First Person being paywalled and how easy it is to obtain lvl 999 through obtaining modified save data.\n\nIf you plan to 100% this game then good luck with the dead multiplayer mode where the games offers a bunch of gamemodes focusing on team fights. You have to gather a bunch of people for that alone which req. time and patience.\n\nOk, not everything is bad. They did a good job on the replayability of this game though with all those level-up systems with your weapons or your class and daily/weekly challenges. It is very grindy to max out everything, just enjoy the process and do it at your own pace so you don't get burned out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An expected gem that kept giving, and continues to be enjoyable. I really hope we get a second entry. The brief time i had playing multiplayer with some friends was really fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The sheer amount of zombies and satisfaction of killing them is enough to make me recommend this to everyone. And adding the progression mechanics for weapons and classes gives you something to work towards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me use rocket launcher\nme see zombie pyramid\nme go BOOM\nme happy\n\nthis game is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright but do read the book the game is based on (same name)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a super laggy computer and this game is still super enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very combat mode game and very entertaining scenes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very beautiful. I hope we see more episodes of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really fun fast paced zombie shooter game that have to try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better to share joy with others than to enjoy it alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty darn good mutliplayer zombie horde shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this since it came out, may be repetitive but I don't mind that!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually enjoy playing this. ZOMBIESSSSSSSSSSSSSSSSSSS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you misjudge the wrong game, you are likely to find the right",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun zombie game hard to  beat really",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nasa diyos ang awa, nasa bisaya ang yawa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game and unique i recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play this game with your friends at night.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a Best Alternative for left 4 dead Series",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So fun to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Zombie blasting fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get to kill zombies again and again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best zeke game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very stress relieving",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kill zombies like there's no tomorrow!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have a game to kill my time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's so many zombies bro, waduh?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wheres brad pritt at?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steam Award 25",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Ice Cream GitGud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gema+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PURFECT MOVIE AND GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GooD PVE Zombie Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "zombah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wicked",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mmmm that's good World War Z",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "COOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh yeahhhh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yea",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ممتع",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MENDOZAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ehehehe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best Zombie Game Out There,Can Play In Both 1st And 2nd Person,Nice Animations,Graphics,Sounds And Gameplay! I Play Since The Release Of It (2019) And Keep Playing It Till This Very Day,Lets Hope That We Will Have A Sequel When They Stop Updating It.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⢀⣀⠤⠿⢤⢖⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⡔⢩⠂⠀⠒⠗⠈⠀⠉⠢⠄⣀⠠⠤⠄⠒⢖⡒⢒⠂⠤⢄⠀⠀⠀⠀\r\n⠇⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠈⠀⠈⠈⡨⢀⠡⡪⠢⡀⠀\r\n⠈⠒⠀⠤⠤⣄⡆⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠢⠀⢕⠱⠀\r\n⠀⠀⠀⠀⠀⠈⢳⣐⡐⠐⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠁⠇\r\n⠀⠀⠀⠀⠀⠀⠀⠑⢤⢁⠀⠆⠀⠀⠀⠀⠀⢀⢰⠀⠀⠀⡀⢄⡜⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠘⡦⠄⡷⠢⠤⠤⠤⠤⢬⢈⡇⢠⣈⣰⠎⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣃⢸⡇⠀⠀⠀⠀⠀⠈⢪⢀⣺⡅⢈⠆⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠶⡿⠤⠚⠁⠀⠀⠀⢀⣠⡤⢺⣥⠟⢡⠃⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀\r\nHere I will leave this beautiful Capybara, whoever passes by can pet it and give it a thumbs up (I need Steam Points).",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "[h3] Relaxing shoot 'em up, but a bit too repetitive. [/h3]\n\n\n[h1] Gameplay: [/h1]\nI give this game a positive review for its gameplay, content, playable characters, and weapons.\nHowever, the campaign is too short, and so much areas are in DLC too much expensive.\nThis game is not a cash grab, though.\n\nThe difficulty level ranges from very easy to incredibly hard.\nThe gameplay is really focused on the horde style, even the campaign, with each map's areas designed in horde style.\nThere are many shoot 'em up games, and this one offers some really good ones.\n\n[h1] Graphic design: [/h1]\nThe graphics are beautiful, the maps are amazing, it's sad that the developers didn't choose to make more use of them.\nThe graphics could have been a little goreier, with more blood and more zombie body parts—that's always welcome in shoot 'em up games.\n\n[h1] Playtime: [/h1]\nWe can raise our personal level very high; I've seen players above level 500, but the lack of maps makes this game quickly repetitive and clearly reduces its playtime.\n\n\n[h3] A good game, not too expensive but with a lot of DLC content. The developers didn't know how to exploit their creation as it deserves. [/h3]\n\n\n[h1] If you like Zombies games or Survivals games, come and discover what's available on steam. [/h1]\nhttps://store.steampowered.com/curator/45264994-SeniGaming-Survival-and-Zombies/",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Not a bad game, but no depth, worth getting on sale to spend a couple of hours with friends mowing down hordes of zombies. Don't expect much, and it won't dissapoint",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This works perfectly on steamdeck. I don't understand why it s still labeled as unsupported. I really wish you have a collaboration with left 4 dead and the witch, jockey, smoker and the others. That will be awesome as old school gamers gonna play this too..",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Picked this up on sale, harmless casual zombie horde destruction. Great with friends or randoms also great to see the game still receiving support and updates years after its release. Just recently perfected this game which was fun except for the PvP achievements but thankfully the friendly community helped me. Level design and visuals beautiful, I had limited performance issues, ran very well for me :)",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the most fun co-op zombie shooters out there. It captures the chaos of the movie perfectly huge swarms of zombies, fast pacing, and constant pressure that keeps every match exciting. The classes give you real variety, and leveling up weapons feels rewarding.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "BEST THIRD PERSON ZOMBIES CO-OP SHOOTER EVER!\n\nI have over 1K+ hours on Epic game store because it was exclusive on Epic only previously. As the game is too good, so I buy again on Steam.  If you wanna experient fluid intense breath-holding zombies mowing shooter, this is it! \n\nThis game unlike those brainless shooter, it actually requires critical thinking skill and in depth understanding of your class perks to play at max difficulty. Luckily, the game let you choose the level of difficulty before you start a match, so you can learn the game at your own pace.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Play for the unique zombie horde battles and somewhat customized class setups.\n\nStay for(ever) the endless grind.  And I do mean endless.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you enjoy games like Left 4 Dead or Back 4 Blood, then this is right up your alley. Typical zombie horde shooter. Find weapons, gather ammo, complete objectives, don't die! Best played Co-op with friends. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "THIS IS THE MOST UNDERRATED GAME I'VE PLAYED.\n\nThere I've said. Seriously. I cannot comprehend why this game is so f***ing overlooked. Maybe because it uses a bad movie title? But really, it should be considered just a standalone game on its own because that's exactly what it is.\nThere's only 5 words to aptly describe this game:\n\n[b]Left 4 Dead on Steroids[/b]\n\nAmongst all the insane number of zombie games out there, it's even more insane there's SO FEW ones that actually lets you experience simply full-on action instead of some survival hardcore premise. WWZ is like that successor to L4D2 we always wanted but never could have since Valve can't count to f****ing 3.  It's also a hell lot better than Back 4 Blood in just doing its own thing and with far better campaigns and zombie gore.\n\nEven though the zombie genre isn't new, WWZ has stood out with its absolute anarchy in letting loose as many freaking zombies as it can fit through your computer screen.  You can think of it like that Israel scene in the WWZ movie but adapted as a video game. Insanely fast moving zombies and such a s****t ton of them they form mountains atop each other... yeah... that's the kind of zombie fun I missed for too long. WWZ takes place in this unique timeline as well, where humanity is not all lost and still actively fighting the zombies. This explains all the military hardware available to you including airstrikes, mortars, machineguns and freaking rocket launchers.\n\nThe action is loud and fun and there's never much of a moment for a breather aside from the very start of the level. Zombies come at you from all directions during horde events and the amount of zombies you see charging at you from a distance is just breathtaking. Like seriously. This game can somehow fit thousands of zombies on screen at once... it's impressive. Sometimes I wonder how I even am able to kill these tens of thousands of zombies to begin with.\n\nThe campaign levels are also like L4D2 and incredibly solid... in fact, I'd say more than solid. It's liquid! What I mean by that is there's a shit ton of variety in each level, even with the same game mechanics persisting. True to its name, each level takes place in a completely different location and spans across multiple countries around the globe, something no other zombie game dares to do. You get to experience the tropics of South America, the cold winter in Russia, the city hellscape in the US and Japan and so on... \n\nThis splice of variety is incredibly refreshing as it takes across various places. The campaign flow is also incredibly varied as it's not just about running from point A to point B saferooms blindly like in L4D2. There are various objectives you must complete in each level and some aren't that straight forward, like one level set in winter where you need constantly activate heaters and memorize a small puzzle of order of switches to pull.\nAt the end of it all, each point in the campaign requires you to set up defenses to get ready for a king of the hill kind of battle against the bazillions of zombie hordes and even though it's basically the same thing every time, the killing of zombies never really gets old. The enemy variety is also incredibly diverse and even though I admit I dont really pay attention to each zombie, I never really felt like I was killing the same zombie twice the whole time despite the sheer amount of spawns.\n\nI think the only slight flaws of the game is \n1. The zombie gore which doesn't rival that of being as intricate as L4D2's. Nevertheless the gore is complex enough and impressive given how many damn zombies the game spawns at any one time. You can blow off their legs, limbs and heads which is heaps above the static crap fest that Back 4 Blood gave for their zombies.\n2. The AI bots can be abit dumb at times but by that I do mean... rarely. I've only had one instance where the AI bots failed me when I was being attacked by a hunter (or whatever zombie you call that) which pounced at me while the rest of bots didnt bother saving my ass. Apart from that, they're smart enough to stick close to you and are actually pretty on par with how you'd expect those same bots to act in L4D2. The AI bots are also programmed to do stealth kills if you're in stealth mode, which is really nice.\n\nWWZ does improve on L4D2 at least, especially in terms of progression. Whereas L4D2 had no progression system at all which made playing the game eventually meaningless, WWZ keeps things fresh by letting you upgrade your weapons and explore multiple different character classes, all with their own unique abilities and weapon specialisations. One class lets you deploy a drone while another lets you just go berserk on weapons for example.\n\nOverall, WWZ is a wonderful game and sadly quite underrated since it borrows the title of that movie which was heavily criticised for not being faithful to the book. I think the concept of exploring zombie battles around the world cannot be understated however and it's so great to see this game bring that concept to live finally.\n\nScore: 5/5",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Always makes me happy playing this game, updates also keeps on continuing in this game. my go to game for quick 30 minute game for relaxation. Never gets old.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's fun, just be sure you play with other players or friends. The AI teammates are dangerously incompetent on higher difficulties.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I like it the games entertaining and runs fine on a 5060ti but putting the first person view mode behind a FUCKING PAYWALL is unacceptable.\r\nFix that and you'll get a thumbs up.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "I thought the game was fine until I saw that to unlock weapon perks I'd have to wait for a specific map to be on the daily challenge rotation to get documents. This instantly killed my motivation to play because I'd either have to wait until there's a daily challenge for the map I need, then hopefully finish it before it changes maps, or spend forever changing the date and time until I can find the map and good mutations to compensate for the offline NPCs.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is boring.  There are tons of zombie games that do a better job in every aspect.  The only cool thing about this game is the zombie waves and those get boring fast.  Go buy Left for Dead 2 if you want a good coop FPS zombie game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not allowed to play online if you turn off the \"Mad Dog Games Privacy & Data collection\" option because you aren't agreeing to the terms of service. \nFirst person mode costs $10 extra dollars because you can only enable it with the Aftermath edition.\n\nThis game has like 50 characters and not a single one of them is memorable. They just say the same one liners every 30 seconds with zero variety. \nThe desync with hordes is actually horrendous. I've seen my teammates shooting at zombies and they would not die, and also they melee zombies that are on their screen but not mine. So I'm over here wondering if the zombies I'm shooting are actually real zombies. Zombie schizophrenia. \nThe music is also terrible and not memorable at all. \nThe only thing going for this game is the massive hordes that appear but thats about it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, Horde Mode XL is broken, at least on Tokyo. I’m surprised this is even in the game, as it happens consistently and not at random. On round 26, when rotating to the construction site, the timer will disappear and ultimately soft-lock the game. Objectives are also super buggy, sometimes loading 2 at a time and once again soft locking the game. Theres also an issue of players getting kicked mid-game, but \"thankfully\" you can join back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game on console, but the PC port has a lot of optimization issues and struggles with all 3 of my PC's ranging from mid-high to high end builds. Can't seem to get rid of the FPS stuttering and lag. In a game like this its vital, you lose track of nearby enemies even for a second and they teleport onto you when you stutter thats game over on harder difficulties.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but compared to other games of it's genre it's became boring much faster, most guns does not feel meaningfully different, all missions follow sceme of move forward untill defence of point location and do that same thing one more time. I'll say that locations are truly gorgeous, but because how similar all mitions at their core it's not enough to make them feel unique. Also class system feels samey. I really would want to like this game but it's just does not give me anything to hook onto.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has potential, but it feels unfinished and comes across as yet another generic zombie game. The controls are a bit odd and the mechanics feel strange, which makes me not want to play it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The teammate AI is so incredibly bad it actively makes the game harder. They will block your shots and dive headfirst into hordes then get downed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before I start this, I adore this game. I've played multiple days worth on xbox. Since I no longer have my xbox I decided to get it on here to try to play with my friends. Turns out... even through my PC specs are better than the minimum AND recommended specs it is unplayable. My screen is flashing the whole time (Assets just flicking constanstantly). Turns out, on my specific graphics card the game has issues. I hate that I can't play the game... because I love this game. If you have a major issue like this on a common graphics card you should state it. The community has made their own work arounds for the issue but if you download the 'fix' you can no longer play it online. Which is understandable, however this 'fix', and the associated issue has existed for more than 8 months. Idk, I expected better and I would generally recommend the game but with this big issue not getting fixed I can't in good conscious recommend it on PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Lets make a game on the worst book-to-movie adaptation ever made since American Sniper\" said the Russian, 3 years into their 2-week summer development",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Offline AI companions are practically worthless.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "first person camera is locked behind a DLC",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly worse than Back 4 Blood.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like it the games entertaining and runs fine on a 5060ti but putting the first person view mode behind a FUCKING PAYWALL is unacceptable.\r\nFix that and you'll get a thumbs up.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "This game has some serious issues. One is the dumbass AI. I will compare it to Left For Dead 2 since that AI is older and works better.\r\n\r\nIf you get knocked down the AI will sometimes get you up other times it just stays still and lets you bleed out. It sucks at taking down zombies and they cannot get better weapons literally they usually stay with the same weapons they had in the begging not even grabbing the best kind of destruction weapons that are great for taking down hordes or big boss zombies.\r\n\r\nThe variety of zombies is nice but when you have 5 of them bum rushing you its not a matter of skill if you can take them down its a matter of how long can you survive even with friends some modes are fucking impossible for even vets and mind you I platted this game on PS4 before I moved to PC and they just made the game so much worse. \r\n\r\nThey keep adding DLC missions that are 1/4th the game's price and those missions usually suck and I was supposed to get them when I bought the pass but nope the 2 missions since I have not gotten. It would be also a lot better of a game if their recomondations for your level was better. For instance at level 25 they recommend Hard Mode. Yeah no don't listen to them Hard Mode sucks cause you barely have anything that can don't most zombies don't even think to get up higher in difficulty without getting tons of your guns max level. Speaking of which leveling up weapons and classes is fucking AIDs.\r\n\r\nThis game use to be good but the greed, lack of bug fixes (like the AI which has always been an issue is that they suck overall), the fact that even at full power you can barely last long in horde sections and all the bad changes has ruined this game. I wish I could get all my time back more than my money since this game has now turned awful.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I thought the game was fine until I saw that to unlock weapon perks I'd have to wait for a specific map to be on the daily challenge rotation to get documents. This instantly killed my motivation to play because I'd either have to wait until there's a daily challenge for the map I need, then hopefully finish it before it changes maps, or spend forever changing the date and time until I can find the map and good mutations to compensate for the offline NPCs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its a meh game. same thing over and over. swarms and little missions. noone has mics or communicates. i think the game is dead now.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Just Get Left 4 dead 2, 1000 More times Better and Balance. and plus You get more stuff in Left 4 Dead 2 than This that puts %70 of there maps Behind a Paid Wall which I ashamed of buying and the Zombies are bullet sponges for some reason. and plus Left 4 dead 2 Has Work shop so you will have Endless stuff and maps",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm so glad I bought this for 2.99 USD when it went on sale. Well, I think this game might actually be worth less than that. I'm not glad anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the game is a good time waster when you have 15 - 30 minutes to kill on some levels, there's been an increasing number of bad decisions on the devs part. \n\nIf you want a coop game where everybody and their mother DOESN'T use exploits constantly, look elsewhere or play solo, because they are everywhere thanks to that dumb sword. \n\nThe most recently released primary weapon, which it's been a few months, takes what seems to be THREE head shots PER basic zeke to kill it, when every other weapon takes one. That means even the basic pistol is stronger than a tier 2 primary weapon.\n\nThe addition of rats as an enemy had given the devs a good bit of flak for an enemy that not only made no sense, but was just irritating to deal with. The solution? leave the rats in and add an enemy that's resistant/immune to crowd control, and acts almost identical to the bull.\n\nAll and all, if you want the game, I strongly recommend waiting for a sale, because the devs clearly don't play their own game to see if the additions are fun or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is boring.  There are tons of zombie games that do a better job in every aspect.  The only cool thing about this game is the zombie waves and those get boring fast.  Go buy Left for Dead 2 if you want a good coop FPS zombie game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not allowed to play online if you turn off the \"Mad Dog Games Privacy & Data collection\" option because you aren't agreeing to the terms of service. \nFirst person mode costs $10 extra dollars because you can only enable it with the Aftermath edition.\n\nThis game has like 50 characters and not a single one of them is memorable. They just say the same one liners every 30 seconds with zero variety. \nThe desync with hordes is actually horrendous. I've seen my teammates shooting at zombies and they would not die, and also they melee zombies that are on their screen but not mine. So I'm over here wondering if the zombies I'm shooting are actually real zombies. Zombie schizophrenia. \nThe music is also terrible and not memorable at all. \nThe only thing going for this game is the massive hordes that appear but thats about it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, I bought the game for myself and the wife. I played for 50 minutes then got off for the night. Neither of us have ever been able to connect to the WWZ Services again. 1 hour is all i got out of this game for 2 people. I should be surprised, Epic games couldn't host this game either. Must just be a garbage waste of money game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you thinking of buying this game it is a good and fun game.\nHowever, you should wait for a sale and get the Aftermath edition first (there is first-person but it is locked on the base wwz). Second the grind is a lot (dont buy any perks on classes because prestige clears them out). And finally third if you are thinking about buying skin dlcs, you are not gonna have a good time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When there is a bug that forces your CPU to hit 100% load in the main menu it's just not worth it.\n\nI've tried all the 'fixes' that were suggested and nothing works, Unfortunately bug appeared after the refund window.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, Horde Mode XL is broken, at least on Tokyo. I’m surprised this is even in the game, as it happens consistently and not at random. On round 26, when rotating to the construction site, the timer will disappear and ultimately soft-lock the game. Objectives are also super buggy, sometimes loading 2 at a time and once again soft locking the game. Theres also an issue of players getting kicked mid-game, but \"thankfully\" you can join back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game on console, but the PC port has a lot of optimization issues and struggles with all 3 of my PC's ranging from mid-high to high end builds. Can't seem to get rid of the FPS stuttering and lag. In a game like this its vital, you lose track of nearby enemies even for a second and they teleport onto you when you stutter thats game over on harder difficulties.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but compared to other games of it's genre it's became boring much faster, most guns does not feel meaningfully different, all missions follow sceme of move forward untill defence of point location and do that same thing one more time. I'll say that locations are truly gorgeous, but because how similar all mitions at their core it's not enough to make them feel unique. Also class system feels samey. I really would want to like this game but it's just does not give me anything to hook onto.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ไอ้เกมเชี่ยนี้ แม่งพยายามทำยังไงก็ได้ ให้มึงอยู่ในเกมให้นานที่สุด เพื่อจะได้ไปหลอกนักลงทุนโง่ๆว่าเกมเรามีคนเล่นเยอะมาก โดยเกมแม่งจะทำยังไงก็ได้ให้มึงแพ้ในตอนสุดท้ายไม่ก็ตั้งแต่ตอนแรก ด้วยการยัดศัตรูจำนวนมหาศาล ที่เกิดรอบตัวมึง(คือหลายๆครั้งมันหล่นมาจากเพดาน) หรือไม่ก็ให้ npc ไปยืนอยู่หน้าจุดเกิดซอมบี้อย่างไม่มีเหตุผลเพื่อให้มิงเล่นยากมากขึ้น หรือซอมบี้ที่แม่งทำดาเมจได้โดยแค่เดินผ่าน(มันไม่ทำเอนิเมชั่นตอนวิ่งตี แม่งเลยให้ซอมบี้ออกท่าตี้ก่อนถึงตัวเรา) แล้วพวกตัวพิเศษแม่งก็เสือกคล้ายๆกัน คือ ซอมบี้ที่กระโดดมาสตันมึง ซอมบี้ที่อึดเหี้ยๆ ที่จะพ่นเมือกใส่หน้ามึงเพื่อที่มึงจะได้ยืนเฉยๆเช็ดหน้า ซอมบี้ที่อึดเหี้ยๆ ที่พุ่งเข้ามาสตันมึง และซอมบี้ที่อึดเหี้ยๆ ที่พุ่งเข้ามาสตันพวกมึงทุกคน หรือซอมบี้ที่ถ้าไม่ยิงหัวจนกว่าจะตาย ตอนมันตายจะปล่อยแก๊สทำดาเมจโซนพื้นที่ ตีธรรมดาก็ไม่ได้ และซอมบี้ที่จะวิ่งมาระเบิดใส่หน้ามึง และทั้งหมดนี้เกิดขึ้นในห้องที่เล็กเท่าปั้มน้ํามันเล็กๆ ไอ้สัส พ่อมึงตาย ไม่เคยเจอเกมเหี้ยเท่านี้เลย บอทแม่งก็เก็บของไม่ได้ กูต้องเสียยาไปฟรีๆ เพราะบอทเก็บของไรไม่ได้ แถมแม่งเล็งยิงห่าไรก็ไม่รู้ตัวที่อยู่ใกล้ๆแม่งปล่อย ไม่มีเพื่อนกูไม่เล่นหรอกไอ้เหี้ยๆ เกมหน้าหี",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a great zombie game but since th update it constantly crashes on steam deck so im going to play killing floor 2 instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Server lag/issue/bug and match glitches are everywhere after the update now...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The sheer amount of zombies in this game really takes the fun away. How they act and react compared to for ex. Back 4 Blood or the left 4 dead series just really gets on my nerves. \n\nFrom time to time it is fun but it just really is frustrating often.\nNot my personal cup of tea directly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game use to be very nice at the beginning, since the modify of weapons update wipe all weapon progress, now you have perks and skins for weapons not weapons with attachments like use to be so tomb down, i play over 400 hours on another platform when the game was launched, example basic pistol use to be at lvl 1 with 12 bullet chamber and with progress you could unlock it with attachments, better aim, bigger clip, now its basic 20 bullets clip no mater what skin you have there, i bought it again with hope they will fix this, other than this game is very fun to play solo or with friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is repetitive and boring, but the Swarm Engine impresses with hordes of zombies. In every other way, Space Marine 2 is better, making this feel like an experiment leading up to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Core gameplay loop is fun, but progression is absolutely glacial. A lot of little problems that add up to major annoyances over more playtime. One of the worst offenders is the game telling you that you have a minute to prepare your defenses for a big wave, only for enemies to immediately and consistently attack you through that minute, giving you no time to breathe or apply strategic thinking.\r\n\r\nProgression is WAY, WAY too slow. This is especially notable with weapons, as there's no guarantee you'll even see the weapon you like in a given co-op match, so actually unlocking things for them is difficult. \r\n\r\nIf this looks fun, just play Space Marine 2 instead. A lot better. \r\n\r\nP.S. I have not played the versus mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has potential, but it feels unfinished and comes across as yet another generic zombie game. The controls are a bit odd and the mechanics feel strange, which makes me not want to play it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game bug there are more unfixed bugs than zombies. Game crashes, dopping 50% of fps when rat special infected is on screen, dc's, invisible zombies, lod pop-in everywhere, performance issues with certain gpu drivers, (Nvidia and AMD), gun perks not working as intended/causing negative effects instead of bonuses, shader stuttering on both Vulkan and DX11, maps not spawning objectives in 20% of the time no fuel cans to find. NPC's like \"greengold\" go invisible when downed so you cannot revive them causing missions failure. Your character also constatly gets stuck on terrain and does a falling roll animation while you are trying to fight. The grind is worse here than runescape, I have 2k hours on Epic games before moving to steam, took me over 1.2k hours to get guns max level and classes prestige 5. The more they add to the game the more it breaks, the company has a zero effort policy when it comes to bugs in the discord repeatdly saying \"its a problem in the game engine we can't fix it\", bullshit its clearly the fact that they don't care about anything other than cash grab dlc's.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Time of review this game has no mouse sensitivity for aiming - devs aware years ago and chosen not to bother adding it. So a horde shooter requiring high sense to quickly scan the environment. But zombies need headshots which require low sense for ads aiming. Maybe fine using controller with crazy aim assist. Feels awful on k/m.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont buy this POS game. Horde mode disconnects EVERY SINGLE FUCKING GAME. I will get to about wave 15 and server just randomly disconnects.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The teammate AI is so incredibly bad it actively makes the game harder. They will block your shots and dive headfirst into hordes then get downed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before I start this, I adore this game. I've played multiple days worth on xbox. Since I no longer have my xbox I decided to get it on here to try to play with my friends. Turns out... even through my PC specs are better than the minimum AND recommended specs it is unplayable. My screen is flashing the whole time (Assets just flicking constanstantly). Turns out, on my specific graphics card the game has issues. I hate that I can't play the game... because I love this game. If you have a major issue like this on a common graphics card you should state it. The community has made their own work arounds for the issue but if you download the 'fix' you can no longer play it online. Which is understandable, however this 'fix', and the associated issue has existed for more than 8 months. Idk, I expected better and I would generally recommend the game but with this big issue not getting fixed I can't in good conscious recommend it on PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky, linear, bad animations, bad AI, no depth, robotic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant play game i played it 3 times now if i start the game up it just shuts my whole PC off and its only this game that dose it if they fix or help me fix this i'll change my review but i can get to main menu, click charters and guns but if i touch settings or start the match it kills it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was expecting something new in terms of gameplay but got another l4d copycat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally l4d2 but clunkier and more expensive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wants to be Left4Dead and I can see it sometimes being fun, other times it controls awful and is just VERY frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Lets make a game on the worst book-to-movie adaptation ever made since American Sniper\" said the Russian, 3 years into their 2-week summer development",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got booted off the game by some butt hurt level 999 that was probably a femboy\nnow i cant even play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The majority of the fan base is straight white men, but these brain-rotted developers still made every single playable character; a gay, brave, BIPOC. \nAnother slop producing studio that's putting ESG before the actual player base.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Offline AI companions are practically worthless.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly worse than Back 4 Blood.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like it the games entertaining and runs fine on a 5060ti but putting the first person view mode behind a FUCKING PAYWALL is unacceptable.\r\nFix that and you'll get a thumbs up.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "This game has some serious issues. One is the dumbass AI. I will compare it to Left For Dead 2 since that AI is older and works better.\r\n\r\nIf you get knocked down the AI will sometimes get you up other times it just stays still and lets you bleed out. It sucks at taking down zombies and they cannot get better weapons literally they usually stay with the same weapons they had in the begging not even grabbing the best kind of destruction weapons that are great for taking down hordes or big boss zombies.\r\n\r\nThe variety of zombies is nice but when you have 5 of them bum rushing you its not a matter of skill if you can take them down its a matter of how long can you survive even with friends some modes are fucking impossible for even vets and mind you I platted this game on PS4 before I moved to PC and they just made the game so much worse. \r\n\r\nThey keep adding DLC missions that are 1/4th the game's price and those missions usually suck and I was supposed to get them when I bought the pass but nope the 2 missions since I have not gotten. It would be also a lot better of a game if their recomondations for your level was better. For instance at level 25 they recommend Hard Mode. Yeah no don't listen to them Hard Mode sucks cause you barely have anything that can don't most zombies don't even think to get up higher in difficulty without getting tons of your guns max level. Speaking of which leveling up weapons and classes is fucking AIDs.\r\n\r\nThis game use to be good but the greed, lack of bug fixes (like the AI which has always been an issue is that they suck overall), the fact that even at full power you can barely last long in horde sections and all the bad changes has ruined this game. I wish I could get all my time back more than my money since this game has now turned awful.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I thought the game was fine until I saw that to unlock weapon perks I'd have to wait for a specific map to be on the daily challenge rotation to get documents. This instantly killed my motivation to play because I'd either have to wait until there's a daily challenge for the map I need, then hopefully finish it before it changes maps, or spend forever changing the date and time until I can find the map and good mutations to compensate for the offline NPCs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its a meh game. same thing over and over. swarms and little missions. noone has mics or communicates. i think the game is dead now.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Just Get Left 4 dead 2, 1000 More times Better and Balance. and plus You get more stuff in Left 4 Dead 2 than This that puts %70 of there maps Behind a Paid Wall which I ashamed of buying and the Zombies are bullet sponges for some reason. and plus Left 4 dead 2 Has Work shop so you will have Endless stuff and maps",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm so glad I bought this for 2.99 USD when it went on sale. Well, I think this game might actually be worth less than that. I'm not glad anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the game is a good time waster when you have 15 - 30 minutes to kill on some levels, there's been an increasing number of bad decisions on the devs part. \n\nIf you want a coop game where everybody and their mother DOESN'T use exploits constantly, look elsewhere or play solo, because they are everywhere thanks to that dumb sword. \n\nThe most recently released primary weapon, which it's been a few months, takes what seems to be THREE head shots PER basic zeke to kill it, when every other weapon takes one. That means even the basic pistol is stronger than a tier 2 primary weapon.\n\nThe addition of rats as an enemy had given the devs a good bit of flak for an enemy that not only made no sense, but was just irritating to deal with. The solution? leave the rats in and add an enemy that's resistant/immune to crowd control, and acts almost identical to the bull.\n\nAll and all, if you want the game, I strongly recommend waiting for a sale, because the devs clearly don't play their own game to see if the additions are fun or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is boring.  There are tons of zombie games that do a better job in every aspect.  The only cool thing about this game is the zombie waves and those get boring fast.  Go buy Left for Dead 2 if you want a good coop FPS zombie game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not allowed to play online if you turn off the \"Mad Dog Games Privacy & Data collection\" option because you aren't agreeing to the terms of service. \nFirst person mode costs $10 extra dollars because you can only enable it with the Aftermath edition.\n\nThis game has like 50 characters and not a single one of them is memorable. They just say the same one liners every 30 seconds with zero variety. \nThe desync with hordes is actually horrendous. I've seen my teammates shooting at zombies and they would not die, and also they melee zombies that are on their screen but not mine. So I'm over here wondering if the zombies I'm shooting are actually real zombies. Zombie schizophrenia. \nThe music is also terrible and not memorable at all. \nThe only thing going for this game is the massive hordes that appear but thats about it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, I bought the game for myself and the wife. I played for 50 minutes then got off for the night. Neither of us have ever been able to connect to the WWZ Services again. 1 hour is all i got out of this game for 2 people. I should be surprised, Epic games couldn't host this game either. Must just be a garbage waste of money game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you thinking of buying this game it is a good and fun game.\nHowever, you should wait for a sale and get the Aftermath edition first (there is first-person but it is locked on the base wwz). Second the grind is a lot (dont buy any perks on classes because prestige clears them out). And finally third if you are thinking about buying skin dlcs, you are not gonna have a good time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When there is a bug that forces your CPU to hit 100% load in the main menu it's just not worth it.\n\nI've tried all the 'fixes' that were suggested and nothing works, Unfortunately bug appeared after the refund window.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, Horde Mode XL is broken, at least on Tokyo. I’m surprised this is even in the game, as it happens consistently and not at random. On round 26, when rotating to the construction site, the timer will disappear and ultimately soft-lock the game. Objectives are also super buggy, sometimes loading 2 at a time and once again soft locking the game. Theres also an issue of players getting kicked mid-game, but \"thankfully\" you can join back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game on console, but the PC port has a lot of optimization issues and struggles with all 3 of my PC's ranging from mid-high to high end builds. Can't seem to get rid of the FPS stuttering and lag. In a game like this its vital, you lose track of nearby enemies even for a second and they teleport onto you when you stutter thats game over on harder difficulties.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but compared to other games of it's genre it's became boring much faster, most guns does not feel meaningfully different, all missions follow sceme of move forward untill defence of point location and do that same thing one more time. I'll say that locations are truly gorgeous, but because how similar all mitions at their core it's not enough to make them feel unique. Also class system feels samey. I really would want to like this game but it's just does not give me anything to hook onto.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ไอ้เกมเชี่ยนี้ แม่งพยายามทำยังไงก็ได้ ให้มึงอยู่ในเกมให้นานที่สุด เพื่อจะได้ไปหลอกนักลงทุนโง่ๆว่าเกมเรามีคนเล่นเยอะมาก โดยเกมแม่งจะทำยังไงก็ได้ให้มึงแพ้ในตอนสุดท้ายไม่ก็ตั้งแต่ตอนแรก ด้วยการยัดศัตรูจำนวนมหาศาล ที่เกิดรอบตัวมึง(คือหลายๆครั้งมันหล่นมาจากเพดาน) หรือไม่ก็ให้ npc ไปยืนอยู่หน้าจุดเกิดซอมบี้อย่างไม่มีเหตุผลเพื่อให้มิงเล่นยากมากขึ้น หรือซอมบี้ที่แม่งทำดาเมจได้โดยแค่เดินผ่าน(มันไม่ทำเอนิเมชั่นตอนวิ่งตี แม่งเลยให้ซอมบี้ออกท่าตี้ก่อนถึงตัวเรา) แล้วพวกตัวพิเศษแม่งก็เสือกคล้ายๆกัน คือ ซอมบี้ที่กระโดดมาสตันมึง ซอมบี้ที่อึดเหี้ยๆ ที่จะพ่นเมือกใส่หน้ามึงเพื่อที่มึงจะได้ยืนเฉยๆเช็ดหน้า ซอมบี้ที่อึดเหี้ยๆ ที่พุ่งเข้ามาสตันมึง และซอมบี้ที่อึดเหี้ยๆ ที่พุ่งเข้ามาสตันพวกมึงทุกคน หรือซอมบี้ที่ถ้าไม่ยิงหัวจนกว่าจะตาย ตอนมันตายจะปล่อยแก๊สทำดาเมจโซนพื้นที่ ตีธรรมดาก็ไม่ได้ และซอมบี้ที่จะวิ่งมาระเบิดใส่หน้ามึง และทั้งหมดนี้เกิดขึ้นในห้องที่เล็กเท่าปั้มน้ํามันเล็กๆ ไอ้สัส พ่อมึงตาย ไม่เคยเจอเกมเหี้ยเท่านี้เลย บอทแม่งก็เก็บของไม่ได้ กูต้องเสียยาไปฟรีๆ เพราะบอทเก็บของไรไม่ได้ แถมแม่งเล็งยิงห่าไรก็ไม่รู้ตัวที่อยู่ใกล้ๆแม่งปล่อย ไม่มีเพื่อนกูไม่เล่นหรอกไอ้เหี้ยๆ เกมหน้าหี",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a great zombie game but since th update it constantly crashes on steam deck so im going to play killing floor 2 instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Server lag/issue/bug and match glitches are everywhere after the update now...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The sheer amount of zombies in this game really takes the fun away. How they act and react compared to for ex. Back 4 Blood or the left 4 dead series just really gets on my nerves. \n\nFrom time to time it is fun but it just really is frustrating often.\nNot my personal cup of tea directly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game use to be very nice at the beginning, since the modify of weapons update wipe all weapon progress, now you have perks and skins for weapons not weapons with attachments like use to be so tomb down, i play over 400 hours on another platform when the game was launched, example basic pistol use to be at lvl 1 with 12 bullet chamber and with progress you could unlock it with attachments, better aim, bigger clip, now its basic 20 bullets clip no mater what skin you have there, i bought it again with hope they will fix this, other than this game is very fun to play solo or with friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is repetitive and boring, but the Swarm Engine impresses with hordes of zombies. In every other way, Space Marine 2 is better, making this feel like an experiment leading up to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Core gameplay loop is fun, but progression is absolutely glacial. A lot of little problems that add up to major annoyances over more playtime. One of the worst offenders is the game telling you that you have a minute to prepare your defenses for a big wave, only for enemies to immediately and consistently attack you through that minute, giving you no time to breathe or apply strategic thinking.\r\n\r\nProgression is WAY, WAY too slow. This is especially notable with weapons, as there's no guarantee you'll even see the weapon you like in a given co-op match, so actually unlocking things for them is difficult. \r\n\r\nIf this looks fun, just play Space Marine 2 instead. A lot better. \r\n\r\nP.S. I have not played the versus mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has potential, but it feels unfinished and comes across as yet another generic zombie game. The controls are a bit odd and the mechanics feel strange, which makes me not want to play it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game bug there are more unfixed bugs than zombies. Game crashes, dopping 50% of fps when rat special infected is on screen, dc's, invisible zombies, lod pop-in everywhere, performance issues with certain gpu drivers, (Nvidia and AMD), gun perks not working as intended/causing negative effects instead of bonuses, shader stuttering on both Vulkan and DX11, maps not spawning objectives in 20% of the time no fuel cans to find. NPC's like \"greengold\" go invisible when downed so you cannot revive them causing missions failure. Your character also constatly gets stuck on terrain and does a falling roll animation while you are trying to fight. The grind is worse here than runescape, I have 2k hours on Epic games before moving to steam, took me over 1.2k hours to get guns max level and classes prestige 5. The more they add to the game the more it breaks, the company has a zero effort policy when it comes to bugs in the discord repeatdly saying \"its a problem in the game engine we can't fix it\", bullshit its clearly the fact that they don't care about anything other than cash grab dlc's.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Time of review this game has no mouse sensitivity for aiming - devs aware years ago and chosen not to bother adding it. So a horde shooter requiring high sense to quickly scan the environment. But zombies need headshots which require low sense for ads aiming. Maybe fine using controller with crazy aim assist. Feels awful on k/m.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont buy this POS game. Horde mode disconnects EVERY SINGLE FUCKING GAME. I will get to about wave 15 and server just randomly disconnects.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The teammate AI is so incredibly bad it actively makes the game harder. They will block your shots and dive headfirst into hordes then get downed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before I start this, I adore this game. I've played multiple days worth on xbox. Since I no longer have my xbox I decided to get it on here to try to play with my friends. Turns out... even through my PC specs are better than the minimum AND recommended specs it is unplayable. My screen is flashing the whole time (Assets just flicking constanstantly). Turns out, on my specific graphics card the game has issues. I hate that I can't play the game... because I love this game. If you have a major issue like this on a common graphics card you should state it. The community has made their own work arounds for the issue but if you download the 'fix' you can no longer play it online. Which is understandable, however this 'fix', and the associated issue has existed for more than 8 months. Idk, I expected better and I would generally recommend the game but with this big issue not getting fixed I can't in good conscious recommend it on PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky, linear, bad animations, bad AI, no depth, robotic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant play game i played it 3 times now if i start the game up it just shuts my whole PC off and its only this game that dose it if they fix or help me fix this i'll change my review but i can get to main menu, click charters and guns but if i touch settings or start the match it kills it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was expecting something new in terms of gameplay but got another l4d copycat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "literally l4d2 but clunkier and more expensive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wants to be Left4Dead and I can see it sometimes being fun, other times it controls awful and is just VERY frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Lets make a game on the worst book-to-movie adaptation ever made since American Sniper\" said the Russian, 3 years into their 2-week summer development",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got booted off the game by some butt hurt level 999 that was probably a femboy\nnow i cant even play the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The majority of the fan base is straight white men, but these brain-rotted developers still made every single playable character; a gay, brave, BIPOC. \nAnother slop producing studio that's putting ESG before the actual player base.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Offline AI companions are practically worthless.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly worse than Back 4 Blood.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like it the games entertaining and runs fine on a 5060ti but putting the first person view mode behind a FUCKING PAYWALL is unacceptable.\r\nFix that and you'll get a thumbs up.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "This game has some serious issues. One is the dumbass AI. I will compare it to Left For Dead 2 since that AI is older and works better.\r\n\r\nIf you get knocked down the AI will sometimes get you up other times it just stays still and lets you bleed out. It sucks at taking down zombies and they cannot get better weapons literally they usually stay with the same weapons they had in the begging not even grabbing the best kind of destruction weapons that are great for taking down hordes or big boss zombies.\r\n\r\nThe variety of zombies is nice but when you have 5 of them bum rushing you its not a matter of skill if you can take them down its a matter of how long can you survive even with friends some modes are fucking impossible for even vets and mind you I platted this game on PS4 before I moved to PC and they just made the game so much worse. \r\n\r\nThey keep adding DLC missions that are 1/4th the game's price and those missions usually suck and I was supposed to get them when I bought the pass but nope the 2 missions since I have not gotten. It would be also a lot better of a game if their recomondations for your level was better. For instance at level 25 they recommend Hard Mode. Yeah no don't listen to them Hard Mode sucks cause you barely have anything that can don't most zombies don't even think to get up higher in difficulty without getting tons of your guns max level. Speaking of which leveling up weapons and classes is fucking AIDs.\r\n\r\nThis game use to be good but the greed, lack of bug fixes (like the AI which has always been an issue is that they suck overall), the fact that even at full power you can barely last long in horde sections and all the bad changes has ruined this game. I wish I could get all my time back more than my money since this game has now turned awful.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I thought the game was fine until I saw that to unlock weapon perks I'd have to wait for a specific map to be on the daily challenge rotation to get documents. This instantly killed my motivation to play because I'd either have to wait until there's a daily challenge for the map I need, then hopefully finish it before it changes maps, or spend forever changing the date and time until I can find the map and good mutations to compensate for the offline NPCs.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its a meh game. same thing over and over. swarms and little missions. noone has mics or communicates. i think the game is dead now.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Just Get Left 4 dead 2, 1000 More times Better and Balance. and plus You get more stuff in Left 4 Dead 2 than This that puts %70 of there maps Behind a Paid Wall which I ashamed of buying and the Zombies are bullet sponges for some reason. and plus Left 4 dead 2 Has Work shop so you will have Endless stuff and maps",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm so glad I bought this for 2.99 USD when it went on sale. Well, I think this game might actually be worth less than that. I'm not glad anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the game is a good time waster when you have 15 - 30 minutes to kill on some levels, there's been an increasing number of bad decisions on the devs part. \n\nIf you want a coop game where everybody and their mother DOESN'T use exploits constantly, look elsewhere or play solo, because they are everywhere thanks to that dumb sword. \n\nThe most recently released primary weapon, which it's been a few months, takes what seems to be THREE head shots PER basic zeke to kill it, when every other weapon takes one. That means even the basic pistol is stronger than a tier 2 primary weapon.\n\nThe addition of rats as an enemy had given the devs a good bit of flak for an enemy that not only made no sense, but was just irritating to deal with. The solution? leave the rats in and add an enemy that's resistant/immune to crowd control, and acts almost identical to the bull.\n\nAll and all, if you want the game, I strongly recommend waiting for a sale, because the devs clearly don't play their own game to see if the additions are fun or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is boring.  There are tons of zombie games that do a better job in every aspect.  The only cool thing about this game is the zombie waves and those get boring fast.  Go buy Left for Dead 2 if you want a good coop FPS zombie game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not allowed to play online if you turn off the \"Mad Dog Games Privacy & Data collection\" option because you aren't agreeing to the terms of service. \nFirst person mode costs $10 extra dollars because you can only enable it with the Aftermath edition.\n\nThis game has like 50 characters and not a single one of them is memorable. They just say the same one liners every 30 seconds with zero variety. \nThe desync with hordes is actually horrendous. I've seen my teammates shooting at zombies and they would not die, and also they melee zombies that are on their screen but not mine. So I'm over here wondering if the zombies I'm shooting are actually real zombies. Zombie schizophrenia. \nThe music is also terrible and not memorable at all. \nThe only thing going for this game is the massive hordes that appear but thats about it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, I bought the game for myself and the wife. I played for 50 minutes then got off for the night. Neither of us have ever been able to connect to the WWZ Services again. 1 hour is all i got out of this game for 2 people. I should be surprised, Epic games couldn't host this game either. Must just be a garbage waste of money game.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}