{
  "positive": [
    {
      "review": "nice pixel art, nice simple controls (it just uses left, right, the a button for resource management, and a sprint button). its a nice easy cozy game that doesnt require lots of quick reflex button pressing. altho i did use cheats to give myself stamina and super sprint, since the mounts seemed annoying to use otherwise. if i can ever get the dlcs for cheap, i'd like to try them.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Awesome visual and gameplay style !\nThe Olympus DLC is a must !",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been loving this kind of games ever since their first game gifted on Epic Games.\r\nYou can always comeback to relax a bit an play even on busy days, cuz its so easy to play, it doesn't take so much of your time to learn.\r\nI've found myself playing almost a whole day without noticing, this game is so good, I wish I could play it with someone else",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Simple and cozy game. It's very suitable for \"lazy\" gaming - in the bed with a controller, using splitscreen.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Это самая расслабляющая для меня игра. Бегаю из стороны в сторону, слушаю прекрасную музыку, наслаждаюсь визуалом. Спасибо вам за дополнения, за фестивали, за развитие игры. С меня покупка всех частей и DLC. Желаю вам успехов.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The 10 Kingdom event gave this game a new life and fun after all these years of being around in the market. I hope the devs will do something more in the near future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got this game as a great and affordable option for split screen coop. At first I could tell that the game ran at only half speed. After submitting a help form, they reached back out to me pretty quickly, and I found out that, at least on my setup, only using a single display did the trick.\r\n\r\nThe game so far has been super! A simple yet classic TD experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game.  vey addictive.  Great art style.  gameplay loop while basic, with very basic controls is extremely satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game! Easy to learn yet challenging to figure out, especially the side challenges. You won't be disapointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is still a game that receives much love both from players and the devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember when I heard about the first game in this series all those years ago and truly wished to play it. Even as I got older, though I had forgotten the exact name I still remembered it and wished to play it dearly.\nEverytime I saw the word kingdom in a game I would get my hopes up only to be so very disappointed. Now that I've played it, although not the original, this is nothing how the younger me imagined it, simply because this is so much better than I could ever have conceived.\nWith how well it was improved from the original it has unmistakably earned it's own right to be on my shelf of childhood wishes that not only came true but were truly exceeded. Thank you for putting so much creativity and fun into this game. I adore it and truly cherish the fun (and alot of anger) it has given me.\nI love the regular gameplay and absolutely adore the DLCs, of which I will be begging to get for Christmas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really really really addictive. You find yourself saying \"just one more day\" and that turns into a whole evening of rallying to destroy another portal or sail to another land.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing this game off and on for a few years. its fun, cozy, and can be challenging at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I appreciate how simple and yet dynamic the gameplay is, also the visual style is stunning and I love the immersive sounds and soundtrack. The atmosphere is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have so much nostalgia for this series\nvery fun to game and talk with a friend in vc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game! Just peaceful aesthetic and ambience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A relaxing game I keep coming back to after years. Pleasant graphics, easy music, and satisfying building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very worthwhile game, once U sit down to beat it, you lose track of time and it's already 3 am. Can be very challenging if you're a beginner or returning after a long time. Imo playing in co-op is very much recommended to not get bored after beating every DLC, it speeds up game progression and saves u ungodly amount of hours, but probably I just need to get the list of things in my head on order to make it faster. Main mechanics differ from New Lands which is kinda confusing at first, but it doesn't mean it's bad. You can see that they put some effort into the gameplay and it's not copy paste of the other game lt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is (imo) the best kingdom building and tower defense 2D pixel graphic game there is!!!\r\nI have all the games from this franchise and I hope they release many more. \r\nBig love and kudos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "followed this game online for years,trying it was as good as watching t, INSANE GAMEEEEEEEEEEEEE, soothing music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good free-to-play game with some flaws.\n\nI’ll start first with the combat:\nIt feels like Naraka combat with Sekiro’s posture break and Wukong’s talent/weapon system, which is a good thing.\nThere are some issues, though.\n\nThe feedback on deflecting isn’t satisfying enough for me, purely in terms of audio and visual.\nI can’t even tell sometimes if I successfully deflected because the audio and visual feedback aren’t that good.\nThe visual cue is passable, but the audio cue for attacks is nowhere to be found.\nIf you want a good example of perfect audio and visual cues/feedback, I highly recommend checking out E33 or Sekiro (GOAT).\n\nVisuals are good.\nThe introduction of the story is cinema.\n\nLast thing: dark patterns.\nThe game’s login rewards counts the day you missed, but the cap for your level doesn't.\nSo I’ve gotta wait for some days to level up. It should be a global cap, not a player cap.\nIf someone who started the game earlier can hit level 50 today, then someone who also started today should be able to hit that level too.\n\nMonetization so far seems to be purely cosmetics.\n\nOverall, it’s enjoyable and a great game. I would recommend checking it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just an amazing game! The environmental design is top notch, and the gameplay is relaxed yet fun. There's moments of fear running from the Greed when you're caught out at night, and lots of planning going into your kingdom's design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been one of my most played games. I really enjoy spending some time in it with my friends. The soundtrack is very lovely as well. To the point I purchased the soundtrack standalone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is an interesting combination of cozy and challenging. The artstyle is beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly easy to pick up, yet the game loop is delightfully addictive. It's the perfect \"just one more day\" strategy game that balances simplicity with satisfying depth. Absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, almost every new feature and expanded mechanic in this version of Kingdom makes the game even better than the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is something special for me. The game itself is beautiful and relaxing. I love this type of strategy game, where there are important decisions to be made, but not on a huge scale. I love learning new things in this game. The MUSIC, however, is what holds an especially special place in my heart. I actually found the music for this game before I played any version of it. The music is what sold me on the game itself initially. I love the music by Amos Roddy for the main game and several of the variants. I also love the music by Kalandra for the Norse Lands variant. Both of these soundtracks are pretty constant plays in our household. My son loves the song Skogtroll on the Norse Lands so much that it has been played hundreds of times on car rides, but it has never worn out its welcome. I would recommend both this game and the soundtracks.\r\n\r\nFavorite Songs: Skogtroll, Valkyrja, Mischievous Alchemy, Driftwood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend showed me this game on his PS, and I must say I was hooked instantly. It’s cute, it's relaxing and it draws you in with its interesting gameplay, storytelling and cute graphics. I can recommend it for spending spare time to relax and build your kingdom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game just like the other Kingdom games; lots of new features that can make every playthrough unique, difficulty selection for casual enjoyers as well as the addition of co-op and challenge maps.\r\n\r\n(Compared to the Classic and New Lands) The music is different but it's pretty good. The style is somewhat maintained, but I did notice that they removed the noise/dithering and pixel-perfect resolution (that's not a big issue though). For me, this game is too easy even on hardest difficulty [spoilers]because there are certain permanent powerups and animals you can ride that massively drop the difficulty, especially if you use power moves[/spoilers]. Regardless, it's still fun to come back to this game every now and then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "although simple, it's fun to play and always updated, thank you devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually beautiful imo and its a nice game to play if you want to relax",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played much co-op but that's OK because this is great as a single-player game as well. I played a lot of this game streaming to my phone while sitting with a new puppy in the evenings while she calmed down enough to go to bed. Two years later, she is now conditioned to go to bed any time she hears the music. It is also my favourite game to play when winding down or while rewatching old favourite TV shows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game. I played all of the kingdom games. I like the atmosphere. Especially this game is great with gf or a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game continues to frustrate me after months of playing it, but I keep coming back. I really like this game despite that. Reading some of the negative comments, I have a couple of comments of my own. I think this game is meant to be a little cryptic and does require experimentation. I found that to be quite fun. As for some of the less obvious game mechanics there are always hints or visual clues that help with trying to figure out a puzzle, or the type of hermit that lives in a hut. As for killing greed monsters being tedious, as you increase the difficulty it becomes less about killing the greeds and more about trying to survive each night. With every playthough you have to find ways to progress faster, keep increasing defenses constantly while maximizing farm land, it can get intense especially playing solo. \nI like the campaigns and all the different mythologies with variations in playstyles like special weapons and culture appropriate units. Personally my favorite part of this game is the environment. Combined with the music and sounds of nature, after a loud day at work to start up the game and just enjoy the environment for a bit, it's so relaxing and peaceful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always come back to this game. The gameplay loop is just a lot of fun, and the simple controls, combined with gorgeous visuals and music, just makes it such a nice game to chill with. I own it on Switch and PC, and love to play it while watching movies. It's a great game for simple multitasking, though fun and rewarding on its own too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely gorgeous, even though pixelated.\nPretty good atmosphere and soundtrack as well,\nuntil your lil town gets destroyed obviously.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple minimal controls, but outstanding gameplay. Pixel graphics are excellent. Not much of a tutorial as you are supposed to figure things out yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a wonderful game. Lovely atmosphere and perfect to play with a friend;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fairly basic game but very solid mechanics. Graphics and music have a really nice and relaxing style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and very enjoyable game, the whole franchise has been a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does not take a complex gameplay to be fully engaged and into the atmosphere. My heart was beating evertime I lost the crown and you feel the adrenaline when destroying portals. Truly, you are the king.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game fun. Buy game. DLC decent fun too. Buy game and DLC.\r\nPlay game. Fun.\r\nPlay DLC. Fun.\r\nLeave review. Fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful cooperative experience with simple controls, beautiful visual design and great developer support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, after such a long time trying different types of games and ideas, i personally fell in peace with this game. Great graphics, a theme that would totally be stuck in my memory, relaxing but also challenging. Truly a combination of what i was looking for towards a game, simple but with enough details to keep you occupied for a very long time. I can't wait to see what new the developers of the game will come up with.\r\n\r\n10/10 i would recommend it to everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Simple, relaxing and a huge time sink to play solo or with a friend [/h1]\n\nKingdom Two crowns is beautiful and atmospheric when it comes to presentation, the relaxing soundtrack and satisfying sound design paired with simple game play you could find yourself trying it out for a few minutes to spending hours building your kingdom and going to different islands, this experience is even better if played with a friend, additionally there is two great free DLC content to claim besides having the base game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple, yet addictive game! Wasn't much of a tutorial to let you know what to do though. Overall very fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play it. Just, play it. Certain things can seem a bit confusing at first but oh my god, once you understand this game it is so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have played in years, Simple mechanics and beautiful art and music makes the perfect cozy game...that's until the greed steal your crown for the 5th time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game its so comforting and especially when you play with someone i would def recommend !!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and simple gameplay loop. Build and defend while advancing through the islands. A great and chill time waster with a partner. Only wish you could actually unlock stuff through gameplay like costumes which are all currently microtransactions/DLC. Would also like there to be more civilizations/campaigns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "outstanding game massive amounts of replayability beautiful pixal art graphics wonderful story behind it and over all very well made. yes i would recommend this game for any game that sometimes likes to sit down and have a nice relaxing game play without complications.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is by far one of my favorites ever made. The amount of work put into the pixel art is evident and absolutely beautiful. The gameplay can be challenging but not in a way that deters a player, but rather challenges their strategy and management skills. It’s incredibly satisfying and lends itself well to multiple replays after one’s initial play-through, especially if you’re teaching friends how to play for the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t enjoy this game much as a solo experience, but it hits a nice niche for co-op without being overly complicated to get into. The DLC also offers a refreshing variety that meaningfully changes the setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont really remember when i started playing, but i know i started on the switch, and even before that ive watched loads of playthroughs of new lands and classic.\ngot more than 200 hours on the switch but since i wanted to support the devs ive bought every game and pack of kingdom\nthis game is something that just makes me happy playing it, the visuals, sounds, gameplay, everything is just in my eyes perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I kept forgetting to review this game because I kept forgetting to stop playing it. It's a really good at being both peaceful and challenging, good for unwinding. I would like a difficulty mode that is hard but the dog is safe. Otherwise, really enjoyed this one and the shogun and dead lands expansions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very dear to me. I've been a fan of the series for a while, I used to play new lands with my little sibling so I was extremely excited to see the multiplayer version. This is definitely the best one out of the series, it's more developed, has more npcs, more mounts and more islands, as well as more end game content. I have not played the endgame much, I prefer to start over after a while instead. \n\nMy only critism would be that it could be a bit more challenging, as after you figure out a couple of things (or if it's your second playthrough) it feels a bit easy.  However I still enjoy it and find it worth a replay. The art(environment, the river/sea, change of seasons) is gorgeous and the music is great. When you're not in action I find it quite peaceful to just watch the villagers doing their own thing.\n\nIt is possible to beat it in single player or enter splitscreen to use the other character just as a money pouch but it is a lot of fun with two players. I definitely recommend you to give it a go if you enjoy resource management and some strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time i logged in and started playing, then after 9hrs straight i realised i had to sleep also. Amazing chill game no complicated stuffs, no complex keys just AWSD or Arrow keys if your lefty get tired. Its one of the games if you just want to relax take a break and enjoy and the times flies by.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kingdom Two Crowns is highly geared to a very, very specific audience. I really like tower defense, and I really like resource management so this game was a hit for me despite some pretty heavy flaws.\r\n\r\nThe first is time. You're running back and forth, back and forth, back and forth, looking for resources/waiting for your peasants to spawn them after finding free ones in the land around you. As islands get larger that problem does too, unless you're playing with a friend which helps mitigate it. It's also very repetitive not only in gameplay loop as mentioned but also in the environment. It's all predetermined spots for where you're building and what. That can create some small challenges(ex. you can't keep cutting and building right in front of enemy portals, or the spawn point for a wall is inconvenient by taking up a lot of empty space best used for wild grass yielding rabbits/whatever takes it's place in other expansions) but that fades away into tedium too.\r\n\r\nThe games built-in timer(the intensity and breed of Greed that attack your base) is pretty solid until you endgame an island where the enemies are all the basic weaker form in a really straightforward quest.\r\n\r\nThe devs have a surprising amount of extra content and DLC which are mostly texture reworks with the same mechanics. Which is fine! They look great just like the base game! but there's only so much you can get out of it. I liked Kingdom Two Crowns as my 'I need something idle to do with my hands while I watch something' game, and I think I've exhausted that for myself. I would prefer this around $10 USD/50% off.\r\n\r\nTips and tricks for the interested:\r\n\r\n-The game has a very bad time of explaining mechanics. You have limited space in the pouch in the top right of the screen for your currency, Greed spawn nightly to attack, anything that costs Gems(spawning from large, ornate chests. Not on your first island) has some ability you should probably look up, you cannot attack Greed spawn points until you have a more organized militia\r\n\r\n-Get off that first island as soon as possible because to create a militia to fight Greed spawn points, you need stone. Stone mines are available on the second island and carry across all islands once you unlock it\r\n\r\n-My favorite mount is the Bear, until you attack an islands ultimate Greed spawner. Then I swap to something a little faster, like my original mount\r\n\r\n-Get as many people as you can to generate archers, and clear land so that it becomes wild grassland attracting rabbits they hunt daily for coins\r\n\r\n-Winter changes mechanics, I advise having pike men not only for defense but for small coin gain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Winter is [strike]ass[/strike] boring, paid DLC achivements on the main game are [strike]ass[/strike] unfair\r\nEverything else is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought, this game looks cool, maybe I'll like it. I decided I'd start it but switch to another game I'm playing. And 10 minutes in I had no idea what was happening and on the second day in game, I lost my first crown. My second crown lasted 110 days. And my entire day off disappeared as well. It's such a simple game. But it is the perfect example of \"just one more day\", until it's two hours past your bedtime and you have to be up in 6 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games are good and all simple and easy but the problem is the save system.\nToday, all my saves are gone.\nThe game is 11/10, but the save system? It’s 0/10. If it happens once, it can happen anytime again.\n\nI’ve completed everything, bought Olympus and Norse, and wanted to play again, but all my saves are gone. It feels like I bought a brand-new game.\n\nToday I wanted to show my completed save to my friends to introduce the other factions and units like ninjas and talk about them but I can’t do that because my saves are gone.\ni can recommend but be weary about the saves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is addicting in its simplicity and changed styles and combat options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am incredibly annoyed that there are no \"ARE YOU SURE YOU WANTS TO SAILS TO THE NEXT ISLAND DURING THE WINTERS??\" warning before letting me sails.\r\nI fucked my whole runs and wasted hours, cause it'll gets harder and harder as days passed so the best option is to replay the whole god damn things.\r\n\r\nAnyway I hope that dev made it so you can plays with other players without needing them to be my friends cause my friends don't own this games and pls add that warning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite co-op games! Kingdom finds the perfect balance between building sims, tower defense, and exploration. Simple in it's design but intentional with mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cozy and relaxing game! Its great for unwinding and having some chill fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely adore this game! it is incredible charming, cute and quite fun. it has a very simple game-play, that somehow managed to be quite deep, and still require tactical thinking and decision making.\nI've loved seeing how far this game has come, its continued updates. The Devs have put a lot of love into this game, and I am thankful cus I think it is incredible!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pleasant, calm, sometimes a bit stressful, perfect for playing with a girlfriend.\nMore of a game to pass the time than a thrill.\nBeautiful pixel art.\nThe game has add-ons that change the atmosphere and some mechanics, but it's essentially the same game.\nExploring the game, including the add-ons, is rewarding.\nYou can come back to it time and time again.\nI recommend it.\n\nPL\nPrzyjemna, spokojna, czasem lekko stresująca, można pograć z dziewczyną. \nGra bardziej dla zabicia czasu niż mocnych wrażeń. \nPiękny pixelart. \nGra ma dodatki które zmieniają klimat oraz niektóre mechaniki, ale co do zasady to ta sama gra.\nOdkrywanie gry, w tym dodatków, sprawia satysfakcję. \nMożna do niej wracać co jakiś czas.\nPolecam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game and it has a lot of potential. However, with the Norse Lands DLC, it is super buggy, with shield huts sometimes never generating and with trees glitching out and not being able to be cut down. I have had to completely restart my play through because of these bugs. Hopefully they get patched before you see this post :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful art style and atmosphere but gets very repetitive by the 3rd island.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so vague. so great. underneath its giving cookie clicker. \n\nwhen its so addictive youve been playing 30 hours straight an feel unwell.\n\n play call of olympus only. i wish i did that. i did cursed and then lost 90 percent all the gems but thats permo if not olympus :EyelessGhost::ShockedBoguin::Dogeface:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Pixel game- art style and everything, dlcs are amazing and fleshed out\r\n\r\nMust buy for anyone\r\n\r\n20/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beat the base game playing entirely co-op, and wow what an absolute gem of a game.\nThere is no tutorialization for anything, but it adds to the experience. You figure everything out as you go - which upgrades do what, etc.\nVery enjoyable, relaxing experience with a friend or partner to just kick back and chat while you expand your kingdom. There are stressful moments, and you'll probably die but you'll have a good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, simple game. Nice strategy. Also, the baddies make my heart jump, so it's exciting too. Especially great is the 2-player aspect. This was MADE to be 2-player, and it's wonderful to strategize (or terrorize) your friend as you try to make the best island, but also have to allocate resources between y'all to do it. (am also guilting of sending a marauding army or two their way...ooops)\r\n\r\nThat being said, I've binged this alone too, so it still rocks 1p.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my primary comfort games. It's both so simple, yet every once in a while humbles the hell out of you while you admire the scenery the whole way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't game much at all anymore, but this is the one game I return to for comfort and leisure. The music is mesmerizing at times, hopeful yet hauntingly nostalgic, and this combined with the pixel animation captures a magic from years gone by. Spending time in Kingdom is like revisiting the digital forests I played in during my youth. I highly recommend Kingdom Two Crowns to anyone who wishes to discover afresh the magic of games from yesteryear. I consider it a true work of digital art, and a love letter to sidescrolling games of the past. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a good game!!!! Interesting mechanics, exciting, addicting very fun 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deceptively simple looking, insanely addicting. Beautiful pixel art, music, and COINS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kingdom Two Crowns is one of those rare games that perfectly blends simplicity and depth. You start with almost nothing, just a crown and a horse, and slowly build an entire kingdom from scratch. The pixel art is stunning, the music is soothing, and the atmosphere somehow feels both relaxing and tense at the same time.\r\n\r\nI love how the game encourages exploration and careful planning rather than fast reflexes. Every coin you spend matters, every decision changes the flow of your kingdom’s life. And the co-op mode? Absolutely fantastic — building and defending together makes it even more memorable.\r\n\r\nIf you enjoy strategy, management, or just a beautiful game to get lost in, Kingdom Two Crowns is a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the simplistic nature of the game--- it is 2D, goals are clear and if u ever get really confused the wiki is there to guide you. And even though it is a pixelated 2D game, it still offers so much to explore, I have not yet made it to exploring all islands (I tend to reset a lot) but I feel that I keep learning more and more even tho I first played this game a while ago on my phone. I really enjoy the game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still on the fence.\r\n\r\nIt's like the original kingdom game, but they added new currencies and a ton of other extra things.  Not sure if better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a fan since the first Kingdom. It's so cozy and relaxing and at the same time provides a good challenge.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great couch co-op. Easy to learn, fun, beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only thing I dislike is that it explains very little to you. Like how winter will eventually come and you should be prepared for it by using a banker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play norse lands in cursed. ( only clear the cliff side portals and finish about 2nd winter comes or you won't anyways :) )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, this is pretty Greedy thing.\nYou know nothing, you'll learn everything.\nYou'll see the little things, little sounds.\nAnd this is awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome alone, even better with a friend. Shout-out to everyone else who played co-op and adopted a side each forever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game but whenever the people try to give me coins for my already full bag, I scream",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best couch-coop, hope the devs keep up the good work, we love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even thou 2D was all where it all started I would not have believed that in 2025 I would be playing a 2D game that is so compelling as this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple, but entertaining and intense",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun with a friend or a chill solo experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most relaxing game until the breeders come out to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogo incrível para jogar com amigo no multiplayer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 168 hours played, and would play more if I had any content left. I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games I ever played! simple but perfect!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game for £17 a single day before it went on sale for £4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really good game with high replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gentle relaxing ride in the countryside.  Minimal murder.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is OK for the first couple hours, but once you've figured out the mechanics it's literally the exact same thing on every single island. You don't get to decide where to build things, the spots and buildings are pre-defined. You go from one island to another and fight the exact same enemy over and over. It's quite boring once you've destroyed the first few islands.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Kingdom Two Crowns is built for a specific fanbase, and only that fanbase and that's okay. It's gorgeous, polished, and atmospheric but the gameplay design is infuriating.\n\nMy main gripe is that the 'challenge' of this game comes not from any sense of difficulty, but intentionally bad game design that you'll spend more time fighting than enjoying. \n\n- Gold (main currency) you can only carry very limited amounts of, is very easy to obtain and very difficult to store. This results in massive amounts of gold despawning as you travel back and forth across the island. I *cannot* overstate how infuriating this becomes after your farmers toss well over 50 gold at you and it all despawns.\n- Can take up to 5 full minutes to run all the way across the islands that you'll be managing, which will be a very frequent and necessary occurrence. Doesn't help that they gave your mounts stamina mechanics, which serve only to slow this further.\n- The Peasant AI is very stupid. They'll gather far from jobsites, and bunch up right outside the outer walls so if the walls fall they'll suffer losses. Low self preservation instinct, meaning that you'll have to plan their jobs so their done by nightfall so they don't get jumped. Really most of the strategy for this game ends up being timing the day/night cycle, and micromanaging jobs to make sure the AI doesn't do anything stupid.\n- The game does not explain anything about itself, which isn't always a bad thing, but it serves only to hide the lack of variety in the game. After 6 hours of very similar gameplay, I looked online to see that there wasn't much I hadn't already seen. I can't confirm, but from what I understand the other 'Themes' don't drastically change the base game either.\n\nIt's a cute game, and I adore the aesthetics, but all that glitters is not gold. Graphics isn't gameplay and this game doesn't hold its own. Its minimal UI and lack of info or tutorials just hide the fact that there just isn't much here.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "the most unimaginative game studio ever lol played quite a few asset flips that they have put out. i wonder if they got anymore aces up their pockets or if they are just going to keep beating a dead horse.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The beautiful artstyle is initially had me hooked, but the overly simplistic yet restrictive mechanics were enough to make me uninstall. I'm not really that familiar with tower defense games but this one has very restrictive building mechanics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When did the game menu get so ugly? I booted up the game for the first time in awhile and there's giant ads plastered over the start screen to buy a bunch of DLC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game for a long time where my safegame went corrupted due to the ingame cross platform sync feature... like 10hr are gone... nice...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has great visuals, but it's let down by its punishing nature and unclear mechanics.\n\nIt heavily penalizes you for small mistakes — yours or even an NPC's, without providing clear guidance. For example, buildings and NPCs don't have any descriptions of their purpose, leaving you to guess why you need to upgrade them or give them a particular profession. There's also no way to undo most of your actions, that prevents you from experimenting and learning the game yourself.\n\nTo finally understand the game's logic and stop feeling punished, I had to restart multiple times and rely on external online tutorials. I think this shouldn't be necessary to enjoy a game.\n\nAnother major issue is the early-game economy. You're often left with nothing to do but wait for residents to generate income until farmers are available, which is especially frustrating at the beginning of each new island.\n\nOverall, I expected a much more player-friendly experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not a bad game, it's just repetitive and quickly becomes boring. It doesn't become harder on the next island, it becomes more repetitive. I was pushing through, hoping it will get better, and finished the game not even realising. There's no real end to the game either, you just have to clear.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I pretty much disliked everything that happened in this game after the first 5 minutes. The gameplay felt like a generic mobile game. Progression was linear and grindy, and it felt like the game was single-note through and through. You expand left and right, just repeating the same actions to build up a pre-planned city (you don't choose where anything goes, the game sets it up a pre-defined setup). I looked at gameplay videos from later in the game, but it looks like the rest of the game is the same thing. The full game costs $20, but I felt like it wasn't worth the $5 sale price I paid. Very quickly refunded this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix the insane bugs like paying coins for nothing and consistently disconnecting after riding the boat without being able to rejoin and the game might be more fun than frustrating. The constant game breaking bugs are certainly ruining the game for me. It has such a good concept and OST but it's just infurating how it currently is...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Setting up the controls is a nightmare; you can't remap keys. Even after all this effort, sometimes the second player can't interact with buildings, and sometimes the game freezes every few seconds in split-screen mode. (alt tab fixes it temporarily) so refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too cozy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is OK for the first couple hours, but once you've figured out the mechanics it's literally the exact same thing on every single island. You don't get to decide where to build things, the spots and buildings are pre-defined. You go from one island to another and fight the exact same enemy over and over. It's quite boring once you've destroyed the first few islands.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Not worth your time.  After 10 years it still has the same game breaking bug of letting the boat sail off without you.  \r\n\r\nThis means your campaign progress is now corrupted and you have to start all over.\r\n\r\nStarting over can be fun, but i'd like to finish the fucking game first.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Honestly feels like a mobile game. There is nothing to do except spend your coins and slowly watch stuff go up. It hardly even feels like a video game with how non-interactive it is.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "it's not the worst game i've ever played but it wears thin fast. the game has you manage some resource (money and gems) to build a base/acquire special objectives, and eventually lead assaults on the big bad. sounds cool on paper, the problem is that you will be doing a lot of running back and forth for several hours. there's decision making, upgrades to be found, and ultimately bigger and more dangerous battles, but the loop does not carry the game for that many hours.\n\nif you want a taste go play their earlier, free version of kingdom and see if the loop satisfies you. if it does then by all means go for this. if it doesn't, don't buy this!",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Kingdom Two Crowns is built for a specific fanbase, and only that fanbase and that's okay. It's gorgeous, polished, and atmospheric but the gameplay design is infuriating.\n\nMy main gripe is that the 'challenge' of this game comes not from any sense of difficulty, but intentionally bad game design that you'll spend more time fighting than enjoying. \n\n- Gold (main currency) you can only carry very limited amounts of, is very easy to obtain and very difficult to store. This results in massive amounts of gold despawning as you travel back and forth across the island. I *cannot* overstate how infuriating this becomes after your farmers toss well over 50 gold at you and it all despawns.\n- Can take up to 5 full minutes to run all the way across the islands that you'll be managing, which will be a very frequent and necessary occurrence. Doesn't help that they gave your mounts stamina mechanics, which serve only to slow this further.\n- The Peasant AI is very stupid. They'll gather far from jobsites, and bunch up right outside the outer walls so if the walls fall they'll suffer losses. Low self preservation instinct, meaning that you'll have to plan their jobs so their done by nightfall so they don't get jumped. Really most of the strategy for this game ends up being timing the day/night cycle, and micromanaging jobs to make sure the AI doesn't do anything stupid.\n- The game does not explain anything about itself, which isn't always a bad thing, but it serves only to hide the lack of variety in the game. After 6 hours of very similar gameplay, I looked online to see that there wasn't much I hadn't already seen. I can't confirm, but from what I understand the other 'Themes' don't drastically change the base game either.\n\nIt's a cute game, and I adore the aesthetics, but all that glitters is not gold. Graphics isn't gameplay and this game doesn't hold its own. Its minimal UI and lack of info or tutorials just hide the fact that there just isn't much here.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Tried it out on the free weekend.\n\nI was doing pretty dang well until I ran into a bug that caused some buildings to start building but then not ever get finished. In my case it was an archer tower and wall which also caused the shield totem to also break. This made it so I could never progress on one side of this island.\n\nRestarting and re-verifying doesn't fix it and apparently it's a long time bug. Which considering this game came out '18 and it's '25 and this still hasn't been fixed?\n\nI had a great time playing this but this bug totally killed my momentum and enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] 🪙 Free to Play Review — I rode back and forth for an hour and had enough 🪙 [/h1]\n\nManage, expand, defend, earn gold, spend gold, die, and learn the mechanics.\nIt is an infinite loop, simple and tedious at the same time.\n\nI have played the original games before:\n• [b]23.3 hours[/b]  in [i]Kingdom: Classic[/i]\n• [b]68.8 hours[/b] in [i]Kingdom: New Lands[/i]\n\nThat was nearly a decade ago, when I was in my early 20s and had time to waste on silly indie games.\nToday, as a guy in my 30s, this formula just does not click anymore. The gameplay feels extremely limited. You move left or right, pick up a couple of beggars, chop some trees, and repeat. There is very little agency or variation, and the loop gets old fast.\n\nSure, [i]Kingdom Two Crowns[/i] can be a nice detox from high-octane FPS and competitive shooters. The pixel art, water reflections, and music are all beautiful. But after a while, your patience and your fingers start to hurt from holding down [b]A/D + Shift[/b] just to move around.\n\nAfter all these years, I expected more quality-of-life improvements.\nFor example:\n• Double-tapping [b]A[/b] or [b]D[/b] could make your ruler automatically move instead of holding the key down for minutes.\n• A game speed or delta-time option (like [i]Stronghold[/i] with “+” or “–”) would help a lot.\n\nUnfortunately, the pacing is still painfully slow and linear. The game wants you to play in a specific way, across several islands. You can only cut a few trees at once, and not from the middle of a forest, only from the edges. It feels restrictive and outdated.\n\nCharming concept and presentation, but it gets boring very quickly.\nYou spend most of your time running from one side of the map to the other on a slow horse, even when upgraded.\nAfter about 20 minutes, you have seen 90% of what the game offers.\n\nThe simplicity of only using four buttons is nice, but it also makes the whole experience feel shallow.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "the most unimaginative game studio ever lol played quite a few asset flips that they have put out. i wonder if they got anymore aces up their pockets or if they are just going to keep beating a dead horse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Permanently losing gems from mobs and no way to defend after 3rd island from boss is kinda ass. Just lost around 7 hours of my life. Game was fun till this shit happend. Good luck",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have always loved the Kingdom games, but in all of them there is very little effort to make the game less repetitive. Within an hour your eyes glaze over and the game-play no longer feels intriguing. Not to mention the only thing the game teaches you about the mechanics and environment is how to use coins, placing it nicely among the many games that require you have a wiki open at all times, lest you make a mistake and lose hours of progress.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is an idler, masked as a laid back strategy game.\r\nOnce you calculate your resources the worng way, you need an exuberant amount of time to get back to a point that is fun to play at.\r\nThe game is robbing you of time by having you travel ridiculous distances, which serves no other purpose than to prolong the gametime.\r\n\r\nOne can see, that this game is a relaxing one for mayn players. For me it is tedious and needlesly frustrating.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The beautiful artstyle is initially had me hooked, but the overly simplistic yet restrictive mechanics were enough to make me uninstall. I'm not really that familiar with tower defense games but this one has very restrictive building mechanics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When did the game menu get so ugly? I booted up the game for the first time in awhile and there's giant ads plastered over the start screen to buy a bunch of DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i like the gameplay loop and general design of the game but ultimately its too slow, too linear and has too many AI mishaps to recommend unless it is on sale",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool concept and very charming but gets boring very fast. By 2 hours in I was bored, it never changes and is super repetitive. The default mount is also super slow, which makes the game drag, so much running slowly back and forth, probably spent most the game just running from one side of the map to the other. Make the horse 3x as fast and the game is much better, but still repetitive.\n\nEdit: can now confirm its definitely better multiplayer. Honestly the only way this game is fun at all. I will probably get like 10 good hours out of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You need to play the game a few times to beat it (or many?) because almost nothing is explained. So you have to experiment. The runs however can take hours, so this means you might lose hours of progress because the game didn't explain something important to you, rather than the game being difficult.\n\nYou can't directly control your units, and sometimes this can be really, really annoying especially if you don't understand how they work.\n\nI personally don't like that because I feel it doesn't respect the player's time, because if things were properly explained you would need to die much less. Or, you can look up details about the game and that will save you those deaths too, but if the game design depends on you reading other people's guides to not waste a lot of time, I consider that bad game design.\n\nHowever if you are OK with the above, you probably will enjoy the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game for a long time where my safegame went corrupted due to the ingame cross platform sync feature... like 10hr are gone... nice...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has great visuals, but it's let down by its punishing nature and unclear mechanics.\n\nIt heavily penalizes you for small mistakes — yours or even an NPC's, without providing clear guidance. For example, buildings and NPCs don't have any descriptions of their purpose, leaving you to guess why you need to upgrade them or give them a particular profession. There's also no way to undo most of your actions, that prevents you from experimenting and learning the game yourself.\n\nTo finally understand the game's logic and stop feeling punished, I had to restart multiple times and rely on external online tutorials. I think this shouldn't be necessary to enjoy a game.\n\nAnother major issue is the early-game economy. You're often left with nothing to do but wait for residents to generate income until farmers are available, which is especially frustrating at the beginning of each new island.\n\nOverall, I expected a much more player-friendly experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While there is no \"railroad\" per-se in Kingdom Two Crowns, the gameplay loop of expanding your kingdom and traveling between islands can feel slow and repetitive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Confuses tedium for gameplay, and timewasting for difficulty.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "10 years must be highly enough to optimize a pixel art game to not suddenly exterminate VM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sooo glitchy.  I played vanilla some years back and it was both stable and enjoyable. As per recent comments from other players, this thing is way too glitchy now. Tried playing the dark lands dlc but gave up a little ways into island four. I was on multiplayer which maybe made a difference but regardless, this thing should be totally bug free at this point. Uninstalling and won't be coming back. Spend your money elsewhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a game released in 2018, with many DLCs, it's amazing how buggy it is. Maybe focus on bug fixes for a bit instead of releasing more DLCs that are essentially re-skins? I ran into some immediately after starting the game, which caused me to have to restart the campaign twice. Then ran into a different one that caused me to lose my crown while much farther along and doing pretty well. I don't mind losing from my own mistakes and learning from it, but losing and having to start over from a bug is just terrible. While the game itself could be fun at times, the gameplay does get pretty repetitive. I did buy it when it was super on sale, but I wouldn't recommend it at the original price at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My girlfriend and I played this together and it was more like Boredom: Two Crowns. We thought it was cute but literally our first play nothing happened and we ended up so rich we were just spamming the button to drop coins all the time. Bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not a bad game, it's just repetitive and quickly becomes boring. It doesn't become harder on the next island, it becomes more repetitive. I was pushing through, hoping it will get better, and finished the game not even realising. There's no real end to the game either, you just have to clear.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do you like Idle games with questionable gameplay? Then this game is for you, because you will spend 70% of your time (95% if winter) farming coins so you can do....anything? in this game.\n\nWhich is not the reason for the negative review, the reason is the negative progression system and absolutely no explanations of how the game works outside of wiki.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "started the game, was kinda boring and got hit with an ad for dlc immdately upon pausing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix the insane bugs like paying coins for nothing and consistently disconnecting after riding the boat without being able to rejoin and the game might be more fun than frustrating. The constant game breaking bugs are certainly ruining the game for me. It has such a good concept and OST but it's just infurating how it currently is...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a very pretty, very simple, very tedious game. You are the monarch of nothing and must build your kingdom from the ground up. There isn't anything in terms of customization because this is more of a tower defense game. You have 2 mechanics: walking left and right to pick up gold, and pressing down to spend it on upgrades. You can't control the archers, or farmers, or even the builders. It's like rimworld in a way but without the depth and complexity that comes with it. You can spend 4 gold to send a squad in a direction that either gets them killed or they destroy a portal. There are 2 kinds of mounts: ones that are better at running, and ones that generate gold. \n\nThat is pretty much the game. If you spend more than 5$ on this you have wasted your money. I spent 3$ and my experience was mediocre.\n\nGood for podcast though. So that's a plus.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can't play multiplayer without making some random account now?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too cozy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is OK for the first couple hours, but once you've figured out the mechanics it's literally the exact same thing on every single island. You don't get to decide where to build things, the spots and buildings are pre-defined. You go from one island to another and fight the exact same enemy over and over. It's quite boring once you've destroyed the first few islands.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Not worth your time.  After 10 years it still has the same game breaking bug of letting the boat sail off without you.  \r\n\r\nThis means your campaign progress is now corrupted and you have to start all over.\r\n\r\nStarting over can be fun, but i'd like to finish the fucking game first.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Kingdom Two Crowns is built for a specific fanbase, and only that fanbase and that's okay. It's gorgeous, polished, and atmospheric but the gameplay design is infuriating.\n\nMy main gripe is that the 'challenge' of this game comes not from any sense of difficulty, but intentionally bad game design that you'll spend more time fighting than enjoying. \n\n- Gold (main currency) you can only carry very limited amounts of, is very easy to obtain and very difficult to store. This results in massive amounts of gold despawning as you travel back and forth across the island. I *cannot* overstate how infuriating this becomes after your farmers toss well over 50 gold at you and it all despawns.\n- Can take up to 5 full minutes to run all the way across the islands that you'll be managing, which will be a very frequent and necessary occurrence. Doesn't help that they gave your mounts stamina mechanics, which serve only to slow this further.\n- The Peasant AI is very stupid. They'll gather far from jobsites, and bunch up right outside the outer walls so if the walls fall they'll suffer losses. Low self preservation instinct, meaning that you'll have to plan their jobs so their done by nightfall so they don't get jumped. Really most of the strategy for this game ends up being timing the day/night cycle, and micromanaging jobs to make sure the AI doesn't do anything stupid.\n- The game does not explain anything about itself, which isn't always a bad thing, but it serves only to hide the lack of variety in the game. After 6 hours of very similar gameplay, I looked online to see that there wasn't much I hadn't already seen. I can't confirm, but from what I understand the other 'Themes' don't drastically change the base game either.\n\nIt's a cute game, and I adore the aesthetics, but all that glitters is not gold. Graphics isn't gameplay and this game doesn't hold its own. Its minimal UI and lack of info or tutorials just hide the fact that there just isn't much here.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Honestly feels like a mobile game. There is nothing to do except spend your coins and slowly watch stuff go up. It hardly even feels like a video game with how non-interactive it is.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Tried it out on the free weekend.\n\nI was doing pretty dang well until I ran into a bug that caused some buildings to start building but then not ever get finished. In my case it was an archer tower and wall which also caused the shield totem to also break. This made it so I could never progress on one side of this island.\n\nRestarting and re-verifying doesn't fix it and apparently it's a long time bug. Which considering this game came out '18 and it's '25 and this still hasn't been fixed?\n\nI had a great time playing this but this bug totally killed my momentum and enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] 🪙 Free to Play Review — I rode back and forth for an hour and had enough 🪙 [/h1]\n\nManage, expand, defend, earn gold, spend gold, die, and learn the mechanics.\nIt is an infinite loop, simple and tedious at the same time.\n\nI have played the original games before:\n• [b]23.3 hours[/b]  in [i]Kingdom: Classic[/i]\n• [b]68.8 hours[/b] in [i]Kingdom: New Lands[/i]\n\nThat was nearly a decade ago, when I was in my early 20s and had time to waste on silly indie games.\nToday, as a guy in my 30s, this formula just does not click anymore. The gameplay feels extremely limited. You move left or right, pick up a couple of beggars, chop some trees, and repeat. There is very little agency or variation, and the loop gets old fast.\n\nSure, [i]Kingdom Two Crowns[/i] can be a nice detox from high-octane FPS and competitive shooters. The pixel art, water reflections, and music are all beautiful. But after a while, your patience and your fingers start to hurt from holding down [b]A/D + Shift[/b] just to move around.\n\nAfter all these years, I expected more quality-of-life improvements.\nFor example:\n• Double-tapping [b]A[/b] or [b]D[/b] could make your ruler automatically move instead of holding the key down for minutes.\n• A game speed or delta-time option (like [i]Stronghold[/i] with “+” or “–”) would help a lot.\n\nUnfortunately, the pacing is still painfully slow and linear. The game wants you to play in a specific way, across several islands. You can only cut a few trees at once, and not from the middle of a forest, only from the edges. It feels restrictive and outdated.\n\nCharming concept and presentation, but it gets boring very quickly.\nYou spend most of your time running from one side of the map to the other on a slow horse, even when upgraded.\nAfter about 20 minutes, you have seen 90% of what the game offers.\n\nThe simplicity of only using four buttons is nice, but it also makes the whole experience feel shallow.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game can be fun. Its a scroll side type of game. You're defenseless, only having your mount about you. You cannot fight, you cannot run. Eventually, you'll run out of room to run to. And the little purple minions will consume you.\r\n\r\nHowever, despite that, you do have coins, you have a kingdom to build. You have land to conquer, and room to explore. The game, and its music slowly grows on you, but its limited by the vison of the developers. Its fun, exciting at times, but frustrating as well. You see, the game lacks quality of life changes that's needed to really enjoy the game.\r\n\r\nYes, you could mod the game, but the developers update the game so much it breaks the mods entirely. In truth, from what i've learned in terms of mod support, it seems the developers don't want people to add changes that would naturally improve the game. But also make it easier. \r\n\r\nThe quality changes the game lacks is simple.\r\n1. When your defenders are attacked, they should not take one punch then just give up.\r\n2. There's points in the game where its actually harder to get civilians because of the slow spawn rates per tents. Yes you can purchase them for five coins, but often times, especially during winter, your low on coins. \r\n3. When you lose a wall, the snowball effect begins.  Your only defense is the archers posted in the tower, and there's no hotkey to put archers in the tower, you just either have to spam archers, or hope they get up there on their own. \r\n\r\nThe list goes on and on. Now,  there  were some mods to change this, the one that allows civlians to walk freely without you having to buy them, that mod works at the moment. (At the time of me writing this 12/2/2025). \r\n\r\nAfter you destroy a portal, the game gets boring, because there's no mods that work because the devs want to keep the game like they created it. You want a harder experience? Can't get a mod for that. You want a deeper sack (No pun intended) A mod would fix that, and there's one out there that does exist, buts its busted because of the recent updates.\r\n\r\nSo there you have it. I would only purchase this game on sale. And only on sale until the devs realize that the mods are for the community, and not for them",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the most unimaginative game studio ever lol played quite a few asset flips that they have put out. i wonder if they got anymore aces up their pockets or if they are just going to keep beating a dead horse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Permanently losing gems from mobs and no way to defend after 3rd island from boss is kinda ass. Just lost around 7 hours of my life. Game was fun till this shit happend. Good luck",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have always loved the Kingdom games, but in all of them there is very little effort to make the game less repetitive. Within an hour your eyes glaze over and the game-play no longer feels intriguing. Not to mention the only thing the game teaches you about the mechanics and environment is how to use coins, placing it nicely among the many games that require you have a wiki open at all times, lest you make a mistake and lose hours of progress.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The beautiful artstyle is initially had me hooked, but the overly simplistic yet restrictive mechanics were enough to make me uninstall. I'm not really that familiar with tower defense games but this one has very restrictive building mechanics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When did the game menu get so ugly? I booted up the game for the first time in awhile and there's giant ads plastered over the start screen to buy a bunch of DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i like the gameplay loop and general design of the game but ultimately its too slow, too linear and has too many AI mishaps to recommend unless it is on sale",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool concept and very charming but gets boring very fast. By 2 hours in I was bored, it never changes and is super repetitive. The default mount is also super slow, which makes the game drag, so much running slowly back and forth, probably spent most the game just running from one side of the map to the other. Make the horse 3x as fast and the game is much better, but still repetitive.\n\nEdit: can now confirm its definitely better multiplayer. Honestly the only way this game is fun at all. I will probably get like 10 good hours out of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You need to play the game a few times to beat it (or many?) because almost nothing is explained. So you have to experiment. The runs however can take hours, so this means you might lose hours of progress because the game didn't explain something important to you, rather than the game being difficult.\n\nYou can't directly control your units, and sometimes this can be really, really annoying especially if you don't understand how they work.\n\nI personally don't like that because I feel it doesn't respect the player's time, because if things were properly explained you would need to die much less. Or, you can look up details about the game and that will save you those deaths too, but if the game design depends on you reading other people's guides to not waste a lot of time, I consider that bad game design.\n\nHowever if you are OK with the above, you probably will enjoy the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game for a long time where my safegame went corrupted due to the ingame cross platform sync feature... like 10hr are gone... nice...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has great visuals, but it's let down by its punishing nature and unclear mechanics.\n\nIt heavily penalizes you for small mistakes — yours or even an NPC's, without providing clear guidance. For example, buildings and NPCs don't have any descriptions of their purpose, leaving you to guess why you need to upgrade them or give them a particular profession. There's also no way to undo most of your actions, that prevents you from experimenting and learning the game yourself.\n\nTo finally understand the game's logic and stop feeling punished, I had to restart multiple times and rely on external online tutorials. I think this shouldn't be necessary to enjoy a game.\n\nAnother major issue is the early-game economy. You're often left with nothing to do but wait for residents to generate income until farmers are available, which is especially frustrating at the beginning of each new island.\n\nOverall, I expected a much more player-friendly experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While there is no \"railroad\" per-se in Kingdom Two Crowns, the gameplay loop of expanding your kingdom and traveling between islands can feel slow and repetitive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Confuses tedium for gameplay, and timewasting for difficulty.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "10 years must be highly enough to optimize a pixel art game to not suddenly exterminate VM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sooo glitchy.  I played vanilla some years back and it was both stable and enjoyable. As per recent comments from other players, this thing is way too glitchy now. Tried playing the dark lands dlc but gave up a little ways into island four. I was on multiplayer which maybe made a difference but regardless, this thing should be totally bug free at this point. Uninstalling and won't be coming back. Spend your money elsewhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a game released in 2018, with many DLCs, it's amazing how buggy it is. Maybe focus on bug fixes for a bit instead of releasing more DLCs that are essentially re-skins? I ran into some immediately after starting the game, which caused me to have to restart the campaign twice. Then ran into a different one that caused me to lose my crown while much farther along and doing pretty well. I don't mind losing from my own mistakes and learning from it, but losing and having to start over from a bug is just terrible. While the game itself could be fun at times, the gameplay does get pretty repetitive. I did buy it when it was super on sale, but I wouldn't recommend it at the original price at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My girlfriend and I played this together and it was more like Boredom: Two Crowns. We thought it was cute but literally our first play nothing happened and we ended up so rich we were just spamming the button to drop coins all the time. Bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not a bad game, it's just repetitive and quickly becomes boring. It doesn't become harder on the next island, it becomes more repetitive. I was pushing through, hoping it will get better, and finished the game not even realising. There's no real end to the game either, you just have to clear.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game difficulty can ramp up very fast on the later days and if you don't know that you can ruin entire runs even if you reset the day count. my friend and I's run was wasted when on day 15 on island 4 4 spawner bosses attacked the base and were just unstoppable once they destroyed the first line of defense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do you like walking to and fro with as little info as posssible? Then, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I pretty much disliked everything that happened in this game after the first 5 minutes. The gameplay felt like a generic mobile game. Progression was linear and grindy, and it felt like the game was single-note through and through. You expand left and right, just repeating the same actions to build up a pre-planned city (you don't choose where anything goes, the game sets it up a pre-defined setup). I looked at gameplay videos from later in the game, but it looks like the rest of the game is the same thing. The full game costs $20, but I felt like it wasn't worth the $5 sale price I paid. Very quickly refunded this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix the insane bugs like paying coins for nothing and consistently disconnecting after riding the boat without being able to rejoin and the game might be more fun than frustrating. The constant game breaking bugs are certainly ruining the game for me. It has such a good concept and OST but it's just infurating how it currently is...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Setting up the controls is a nightmare; you can't remap keys. Even after all this effort, sometimes the second player can't interact with buildings, and sometimes the game freezes every few seconds in split-screen mode. (alt tab fixes it temporarily) so refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too cozy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is OK for the first couple hours, but once you've figured out the mechanics it's literally the exact same thing on every single island. You don't get to decide where to build things, the spots and buildings are pre-defined. You go from one island to another and fight the exact same enemy over and over. It's quite boring once you've destroyed the first few islands.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Not worth your time.  After 10 years it still has the same game breaking bug of letting the boat sail off without you.  \r\n\r\nThis means your campaign progress is now corrupted and you have to start all over.\r\n\r\nStarting over can be fun, but i'd like to finish the fucking game first.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Kingdom Two Crowns is built for a specific fanbase, and only that fanbase and that's okay. It's gorgeous, polished, and atmospheric but the gameplay design is infuriating.\n\nMy main gripe is that the 'challenge' of this game comes not from any sense of difficulty, but intentionally bad game design that you'll spend more time fighting than enjoying. \n\n- Gold (main currency) you can only carry very limited amounts of, is very easy to obtain and very difficult to store. This results in massive amounts of gold despawning as you travel back and forth across the island. I *cannot* overstate how infuriating this becomes after your farmers toss well over 50 gold at you and it all despawns.\n- Can take up to 5 full minutes to run all the way across the islands that you'll be managing, which will be a very frequent and necessary occurrence. Doesn't help that they gave your mounts stamina mechanics, which serve only to slow this further.\n- The Peasant AI is very stupid. They'll gather far from jobsites, and bunch up right outside the outer walls so if the walls fall they'll suffer losses. Low self preservation instinct, meaning that you'll have to plan their jobs so their done by nightfall so they don't get jumped. Really most of the strategy for this game ends up being timing the day/night cycle, and micromanaging jobs to make sure the AI doesn't do anything stupid.\n- The game does not explain anything about itself, which isn't always a bad thing, but it serves only to hide the lack of variety in the game. After 6 hours of very similar gameplay, I looked online to see that there wasn't much I hadn't already seen. I can't confirm, but from what I understand the other 'Themes' don't drastically change the base game either.\n\nIt's a cute game, and I adore the aesthetics, but all that glitters is not gold. Graphics isn't gameplay and this game doesn't hold its own. Its minimal UI and lack of info or tutorials just hide the fact that there just isn't much here.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Honestly feels like a mobile game. There is nothing to do except spend your coins and slowly watch stuff go up. It hardly even feels like a video game with how non-interactive it is.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Tried it out on the free weekend.\n\nI was doing pretty dang well until I ran into a bug that caused some buildings to start building but then not ever get finished. In my case it was an archer tower and wall which also caused the shield totem to also break. This made it so I could never progress on one side of this island.\n\nRestarting and re-verifying doesn't fix it and apparently it's a long time bug. Which considering this game came out '18 and it's '25 and this still hasn't been fixed?\n\nI had a great time playing this but this bug totally killed my momentum and enjoyment of this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] 🪙 Free to Play Review — I rode back and forth for an hour and had enough 🪙 [/h1]\n\nManage, expand, defend, earn gold, spend gold, die, and learn the mechanics.\nIt is an infinite loop, simple and tedious at the same time.\n\nI have played the original games before:\n• [b]23.3 hours[/b]  in [i]Kingdom: Classic[/i]\n• [b]68.8 hours[/b] in [i]Kingdom: New Lands[/i]\n\nThat was nearly a decade ago, when I was in my early 20s and had time to waste on silly indie games.\nToday, as a guy in my 30s, this formula just does not click anymore. The gameplay feels extremely limited. You move left or right, pick up a couple of beggars, chop some trees, and repeat. There is very little agency or variation, and the loop gets old fast.\n\nSure, [i]Kingdom Two Crowns[/i] can be a nice detox from high-octane FPS and competitive shooters. The pixel art, water reflections, and music are all beautiful. But after a while, your patience and your fingers start to hurt from holding down [b]A/D + Shift[/b] just to move around.\n\nAfter all these years, I expected more quality-of-life improvements.\nFor example:\n• Double-tapping [b]A[/b] or [b]D[/b] could make your ruler automatically move instead of holding the key down for minutes.\n• A game speed or delta-time option (like [i]Stronghold[/i] with “+” or “–”) would help a lot.\n\nUnfortunately, the pacing is still painfully slow and linear. The game wants you to play in a specific way, across several islands. You can only cut a few trees at once, and not from the middle of a forest, only from the edges. It feels restrictive and outdated.\n\nCharming concept and presentation, but it gets boring very quickly.\nYou spend most of your time running from one side of the map to the other on a slow horse, even when upgraded.\nAfter about 20 minutes, you have seen 90% of what the game offers.\n\nThe simplicity of only using four buttons is nice, but it also makes the whole experience feel shallow.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game can be fun. Its a scroll side type of game. You're defenseless, only having your mount about you. You cannot fight, you cannot run. Eventually, you'll run out of room to run to. And the little purple minions will consume you.\r\n\r\nHowever, despite that, you do have coins, you have a kingdom to build. You have land to conquer, and room to explore. The game, and its music slowly grows on you, but its limited by the vison of the developers. Its fun, exciting at times, but frustrating as well. You see, the game lacks quality of life changes that's needed to really enjoy the game.\r\n\r\nYes, you could mod the game, but the developers update the game so much it breaks the mods entirely. In truth, from what i've learned in terms of mod support, it seems the developers don't want people to add changes that would naturally improve the game. But also make it easier. \r\n\r\nThe quality changes the game lacks is simple.\r\n1. When your defenders are attacked, they should not take one punch then just give up.\r\n2. There's points in the game where its actually harder to get civilians because of the slow spawn rates per tents. Yes you can purchase them for five coins, but often times, especially during winter, your low on coins. \r\n3. When you lose a wall, the snowball effect begins.  Your only defense is the archers posted in the tower, and there's no hotkey to put archers in the tower, you just either have to spam archers, or hope they get up there on their own. \r\n\r\nThe list goes on and on. Now,  there  were some mods to change this, the one that allows civlians to walk freely without you having to buy them, that mod works at the moment. (At the time of me writing this 12/2/2025). \r\n\r\nAfter you destroy a portal, the game gets boring, because there's no mods that work because the devs want to keep the game like they created it. You want a harder experience? Can't get a mod for that. You want a deeper sack (No pun intended) A mod would fix that, and there's one out there that does exist, buts its busted because of the recent updates.\r\n\r\nSo there you have it. I would only purchase this game on sale. And only on sale until the devs realize that the mods are for the community, and not for them",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the most unimaginative game studio ever lol played quite a few asset flips that they have put out. i wonder if they got anymore aces up their pockets or if they are just going to keep beating a dead horse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Permanently losing gems from mobs and no way to defend after 3rd island from boss is kinda ass. Just lost around 7 hours of my life. Game was fun till this shit happend. Good luck",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have always loved the Kingdom games, but in all of them there is very little effort to make the game less repetitive. Within an hour your eyes glaze over and the game-play no longer feels intriguing. Not to mention the only thing the game teaches you about the mechanics and environment is how to use coins, placing it nicely among the many games that require you have a wiki open at all times, lest you make a mistake and lose hours of progress.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The beautiful artstyle is initially had me hooked, but the overly simplistic yet restrictive mechanics were enough to make me uninstall. I'm not really that familiar with tower defense games but this one has very restrictive building mechanics",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When did the game menu get so ugly? I booted up the game for the first time in awhile and there's giant ads plastered over the start screen to buy a bunch of DLC.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i like the gameplay loop and general design of the game but ultimately its too slow, too linear and has too many AI mishaps to recommend unless it is on sale",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool concept and very charming but gets boring very fast. By 2 hours in I was bored, it never changes and is super repetitive. The default mount is also super slow, which makes the game drag, so much running slowly back and forth, probably spent most the game just running from one side of the map to the other. Make the horse 3x as fast and the game is much better, but still repetitive.\n\nEdit: can now confirm its definitely better multiplayer. Honestly the only way this game is fun at all. I will probably get like 10 good hours out of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You need to play the game a few times to beat it (or many?) because almost nothing is explained. So you have to experiment. The runs however can take hours, so this means you might lose hours of progress because the game didn't explain something important to you, rather than the game being difficult.\n\nYou can't directly control your units, and sometimes this can be really, really annoying especially if you don't understand how they work.\n\nI personally don't like that because I feel it doesn't respect the player's time, because if things were properly explained you would need to die much less. Or, you can look up details about the game and that will save you those deaths too, but if the game design depends on you reading other people's guides to not waste a lot of time, I consider that bad game design.\n\nHowever if you are OK with the above, you probably will enjoy the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game for a long time where my safegame went corrupted due to the ingame cross platform sync feature... like 10hr are gone... nice...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has great visuals, but it's let down by its punishing nature and unclear mechanics.\n\nIt heavily penalizes you for small mistakes — yours or even an NPC's, without providing clear guidance. For example, buildings and NPCs don't have any descriptions of their purpose, leaving you to guess why you need to upgrade them or give them a particular profession. There's also no way to undo most of your actions, that prevents you from experimenting and learning the game yourself.\n\nTo finally understand the game's logic and stop feeling punished, I had to restart multiple times and rely on external online tutorials. I think this shouldn't be necessary to enjoy a game.\n\nAnother major issue is the early-game economy. You're often left with nothing to do but wait for residents to generate income until farmers are available, which is especially frustrating at the beginning of each new island.\n\nOverall, I expected a much more player-friendly experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While there is no \"railroad\" per-se in Kingdom Two Crowns, the gameplay loop of expanding your kingdom and traveling between islands can feel slow and repetitive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Confuses tedium for gameplay, and timewasting for difficulty.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "10 years must be highly enough to optimize a pixel art game to not suddenly exterminate VM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sooo glitchy.  I played vanilla some years back and it was both stable and enjoyable. As per recent comments from other players, this thing is way too glitchy now. Tried playing the dark lands dlc but gave up a little ways into island four. I was on multiplayer which maybe made a difference but regardless, this thing should be totally bug free at this point. Uninstalling and won't be coming back. Spend your money elsewhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a game released in 2018, with many DLCs, it's amazing how buggy it is. Maybe focus on bug fixes for a bit instead of releasing more DLCs that are essentially re-skins? I ran into some immediately after starting the game, which caused me to have to restart the campaign twice. Then ran into a different one that caused me to lose my crown while much farther along and doing pretty well. I don't mind losing from my own mistakes and learning from it, but losing and having to start over from a bug is just terrible. While the game itself could be fun at times, the gameplay does get pretty repetitive. I did buy it when it was super on sale, but I wouldn't recommend it at the original price at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My girlfriend and I played this together and it was more like Boredom: Two Crowns. We thought it was cute but literally our first play nothing happened and we ended up so rich we were just spamming the button to drop coins all the time. Bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not a bad game, it's just repetitive and quickly becomes boring. It doesn't become harder on the next island, it becomes more repetitive. I was pushing through, hoping it will get better, and finished the game not even realising. There's no real end to the game either, you just have to clear.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game difficulty can ramp up very fast on the later days and if you don't know that you can ruin entire runs even if you reset the day count. my friend and I's run was wasted when on day 15 on island 4 4 spawner bosses attacked the base and were just unstoppable once they destroyed the first line of defense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do you like walking to and fro with as little info as posssible? Then, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I pretty much disliked everything that happened in this game after the first 5 minutes. The gameplay felt like a generic mobile game. Progression was linear and grindy, and it felt like the game was single-note through and through. You expand left and right, just repeating the same actions to build up a pre-planned city (you don't choose where anything goes, the game sets it up a pre-defined setup). I looked at gameplay videos from later in the game, but it looks like the rest of the game is the same thing. The full game costs $20, but I felt like it wasn't worth the $5 sale price I paid. Very quickly refunded this one.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}