{
  "positive": [
    {
      "review": "It's the best old game ever. Especially if you want to tell a story, not just play one.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very food game.great story and action",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great FUN game with great role-playing options",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a gem.\nIt's an awesome remaster to a classic game, which is still constantly getting updates from the devs and the community, basically for free, with essentially unlimited content.\nI am glad I gave it a second try because 'teenager me' was too slow to understand the mechanics back in the day!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NWN is, by far, my favorite game of all time because it isn't merely a game. It's D&D 3E DM's dream and a source of infinite adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in the dungeon to start...love the mechanics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review is meant mostly for people who already own the classic NWN Diamond Edition.\n\nOverall, I'd recommend this version, but certainly not at full price.  Wait until there's a deep discount.  I got the enhanced edition as part of bundle, so it worked out to just be a couple bucks for NWNEE and all its DLC.  I'd say paying that much is a great deal.\n\nThere are enhancements for the single-player experience, but they're a bit minor.  I like how the UI can be scaled for modern, high resolution monitors, and I was honestly a bit surprised when ultrawide support just worked out of the box.  Switching to the desktop and back works fine, which isn't always the case for older games.\n\nThe real draw for SP players, I think, is that most of the stuff going on at NW Vault is for the enhanced edition.  I want to eventually try out some of those mods, but I've been poking around the OC (\"Wailing Death\" campaign) without any mods to get an idea of what has visibly changed.  So far, not a lot, but I'm still only mid-level and haven't had the opportunity run into too many of those old, frustrating bugs and issues from the Diamond Edition.  I also have yet to try the newish DLC and the MP servers.\n\nIt's NWN, so it's pretty fun.  I really wish that the enhanced version had been further enhanced in visible ways, but I got it cheap enough to say that I'm satisfied.  If by some chance you're looking at this game but don't own the classic, unenhanced version -- yeah, grab it.  There's piles of content, both official and unofficial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As good as I remember and the newer lighting really helps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neverwinter Nights is a classic RPG that still holds up thanks to its strong foundation. The graphics, while dated by modern standards, carry a certain charm that adds to the nostalgic sentiment. The story is engaging, weaving a rich fantasy world that keeps you invested from start to finish. Most impressive is the underlying system which is is deep, flexible, and rewarding which makes every playthrough feel unique. Altogether, it’s a game that blends emotion, visuals, narrative, and mechanics into an experience worth revisiting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Found this game trough online mentions of spicy custom content.\n An older game that is slowly getting a tune-up by the current developer.\n A 2D( map navigation, not graphics) top-down mouse driven( WASD movement&follow camera available), main character and AI followers(optionally), real time with pause(with an underlying turn system) RPG, intended as a rules simulator for DND 3rd edition( minus the spells that would be hard to code or practically useless for combat\\CRPG gameplay), with a separate saving system for charactes and ongoing games and a large selection of user content.\n\n Comes with an editor, scripting capable but by default the item weight and value gets auto calculated, so it is easiest to make new DnD campaigns, rather than build new gameplay.\n The first campaign that comes with the game is more a techdemo( it is still a full, multichapter campaign) and not everybody enjoys it, so feel free to ignore it.\n Has a long running and decently active online community and a wiki.\n Several currently active online servers, for roleplay and hack'n'slash dungeoneering mostly, in addition to single player campaigns and user created 'gamemodes'.\n Tends to have no voiceacting beyond combat, so adding text to NPCs is cheaper for the map creator, but you might encounter the rare audio file or cinematic.\n Character creation is based on DnD 3ed, so some value traps and anti-synergies, but campaigns are usually not designed for optimally built characters, I had decent success without copying a build, just had to rest more. Characterbuilder goodness.\n User interface could use some work, is being slowly worked on(you can have max 2 chat boxes, locked to each other, but custom filtered).\n\n The main advantage of this purchase is that when a campaign is complete, another can be dowloaded, so people with an internet connection are unlikely to run out of story.\n If you are looking for any DnD related games, |Dungeons and Dragons online| (MMORPG using DnD module content) and the demo of |The quest for the golden candelabra| (pathfiner combat simulator) are others I had good experience with,\n but if you liked Baldurs gate or Diablo, check this game out on youtube( I mean skip into playtroughs, not trailers, the screenshots on this page are a little more zoomed in than how I prefer playing).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is such an underrated classic that so many have never heard of. Playing BG3 made me miss how much of a masterpiece this game was and cause me to come back to it decades later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another well done remaster of a classic D&D game.  \r\n\r\nIt also lets you make an unexpectedly amazing warrior: Start as a Half Orc sorcerer or bard, non-good.  aim for the requirements for Pale Master and Red Dragon Disciple.  take levels of both and get all the tasty stat and AC bonuses.  Pick up heavy armor and weapon mastery feats of your choice.  Become unstoppable tank with massive physical damage output and an AC pushing 40+. the dragon disciple and pale master abilities are just icing on the cake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in 2025, Neverwinter Nights remains a worthy adventure for fans of D&D. Everything from the writing to the production quality to the (literal) depth of the adventure, and the character development that occurs along the way, makes it a compelling game you'll want to experience for dozens of hours. I'm a particular fan of Hordes of the Underdark, that starts out with --another-- literal bang, and never lets up. If you're looking for an opportunity to experience D&D for the first time this is a great starting point. Also note, this can be played on an iPad, making it an excellent time displacement tool for long airplane flights or drives (when you're not at the wheel).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the single best greatest environment for any role players dream. I have almost 100 hours in just roleplaying alone. I dont actually know what the game is about. anyways play sigil and ravenloft! 5/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the old-style of \"Advamced Dungeons and Dragons\" (be it on paper or digital), than you'll love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember having this game on my PC many years ago. I played the original intro over and over, trying out different characters and classes. I never beat it, and this time, will make an honest attempt.  but the feel of a D&D 3rd edition game, a successor to the original Baldur Gate games and the predecessor to the newest edition of Baldur's Gate, makes it a must have for die hard fans of D&D.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best D&D experience online. \nIt's the best old game ever. Especially if you want to tell a story, not just play one.\nOne kind of game that let you feel good nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love they keep updating and fixing this game with new features and to work on modern systems. One of the classics that is a must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neverwinter Nights is the epitome of a classic game. Yes, she's old: the graphics are dated, especially by today's standards, and the gameplay itself isn't anything super special. But what sets Neverwinter Nights above everything else is the storytelling. Rich, immersive, interesting, with a real sense that there's something big at stake and you're answering the call to adventure. \n\nThere's a reason this is a classic. If you're coming back to it after playing it when it first released, you're gonna love it. If you're a younger gamer who hasn't tried one of the foundational games of the PC gaming world, give it a try. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic in its own. It implements the rules of tabletop RPGs very well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the original when it was first released and the enhanced edition means I can play it again without weird resolution hacks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the enchanced version, it keeps the game alive and received here an there updates means they care for it.\r\n\r\nI playes only the Official Game and the Expansions and loved the Stories.\r\nI will try the other - like the premium ones and come back with additional feedback.\r\n\r\nWhat I don't like is that are still some bugs left but maybe they will resolve in time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The OG is back with more modules and updates.\n\nWhile the gameplay feels old, this still holds up well in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old game. Beamdog has done a great job on keeping the game up to date to run on current hardware. Having played this when it was originally released they have done a great job on maintaining this game. If you are looking for a DnD game that is enjoyable to play with a lot of community support then this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Baldur's Gate 3, then this is for you: good gameplay and a cool art style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it off & on since day one, lost my CDs and forgot about it until a friend told me it was available on Steam.  WELL WORTH the purchase!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neverwinter Nights is basically a D&D sandbox disguised as an old-school RPG, and its real magic isn’t the original campaign—it’s everything around it. The story mods (modules) are the heart of the game. The community has built an absurd number of adventures: full-length campaigns, tight dungeon crawls, story-heavy epics, solo-focused modules, my favorites are Dance with Rogues and Tyrants of the Moonsea. These fan-made stories easily rival or surpass the official campaign in writing, role-playing options, and encounter design. If you’re willing to dig through mod lists, NWN can keep you busy for years. The character builder is catnip for min-maxers. You can tinker with races, classes, prestige classes, feat choices, and spell picks in detail, planning builds level-by-level. A lot of the fun is just theorycrafting: “What if I make a Dex-based monk/rogue/shadowdancer who lives entirely off sneak attacks and concealment?” Attacks of opportunity, feats, saving throws, spell DCs, buffs, stacking rules—it’s all here, mostly faithful, and it actually matters in combat. If you know tabletop 3E, you’ll feel right at home; if you don’t, the game quietly teaches you the logic of the system as you go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clocked up all my playtime 400 hours plus on a Android tablet thought id leave a positive review here as they've just updated android version to have all the dlc today!! \n\nGreat game, absolutely tons and tons of gameplay. Online multiplayer is still very much alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun I have had in a single game. \r\n\r\nThe community content is second to none.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic. Still love the aesthetics, the gameplay, the community. So good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A timeless masterpiece. The game I enjoyed the most in my whole life, without any question.\r\n\r\nA fair warning however must be provided to those who approach this game nowadays.\r\n\r\nNeverwinter Nights is and had always been a toolbox to play Dungeons and Dragons online.\r\n\r\nIts campaigns and modules are well done but they are far from memorable. What is on the other hand impressive are the numerous custom modules and additional content developed by its community over the years. \r\n\r\nPlayers can download hundreds of adventures, many of which of very good quality, for free from the Neverwinter Vault or the Steam Workshop and play them to their heart's content.\r\n\r\nThis alone makes the game memorable and amazing.\r\n\r\nAnd then there is online play. Servers are not as numerous as on release, but there are still up to a thousand of concurrent online players, which for a twenty years old game is very flattering. A special aspect of the online element is also that most of these servers are meant to be In Character, so this provides a very fascinating experience to any Dungeons and Dragons fan, and any tabletop roleplayer in general. There is nothing more immersive than actually roleplaying your character with other people, and to this day I have never found a place where to do this better than in Neverwinter Nights.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing hits quite like NWN. The dungeons and dragons mechanics with real time combat, the aurora tool-set, persistent world multiplayer *CHEFS KISS*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its realy fun game for lovers of rp and character creation, i will say i think u need friends to start it, to help guide u., i doubt ide of enjoyed this game if i learnt the basics alone! but once u know what u need to its super fun!! very chaotic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a classic. Play it. It's second edition so it's hard, but it's so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The toolset is stable and relatively quick. What more could you ask for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definetly got dumped when i was 17 for playing this game way to much on a role play server i'm 35 now 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A wonderful game with a lot of paths to choose....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/10 with the toolset and flawless linux support!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good old rpg thats still a lot of fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It takes some time to get into but it's fun afterwards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I`m not sure why even bother writing a review for.. *check notes* 23 year old game, but here we are...\nFirst of all I bought this game because my friend suggested that we would play it in coop for nostalgia sake.. he meant second game( At that time, it wasn`t re-released yet ),  yeah...\n\nAnyway UI is completely outdated, controls are clunky and  original campaign is lackluster, so keep that in mind before even thinking launching this game. \nThings drastically change to the better both storywise and technical side when you start story addons Shadows of the Undrentide and Hoards of the Underdark to a point that it feels like different game. Not only you actually have control over your companions, but you can finely have more then 1 ( only in Hoards of the Underdark ) and they have more to say from time to time and within dialogues, also to note story of addons are somewhat connected and you should use same character for it( Technically you can even use same character from original one, but that feels wrong storywise since you start as apprentice in first addon ).  \n\nOverall game is decent and worth playing if you can overlook old graphics and horrible UI controls with close to none hand holding. Probably would be even more interesting in coop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "base game content kinda meh like a true 5/10), most dlc is okay (7/10), with some dlc being absolutely terrible(2/10), but most modded/online modules are amazing, like truely amazing, like a true 10/10 amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its alright I guess",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "mods keep the game alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still Fun to play in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games to visit Faerum",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "make remake of this game, now!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game of my life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "childhood memories, 3.5e go brrrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg, timeless classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone needs to play this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still playing it in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "iz gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good 2000 rpg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been a fav of mine for many years now!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't play the base campaign it's worthless.\n\nYou should buy this game for the Aurora Toolset and play the modules (custom campaigns) other players have created with it.\n\nStrongly recommend trying out the Swordflight module by Rogueknight333. \nIt is on par with the best DnD games out there.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "What can I say? Simply the best CRPG out there. 23 years old and counting... I recently got it on Steam, when I left Windows for Linux, so the hours played is certainly not correct. I used to use the BioWare launcher and later, the Beamdog launcher. That's 23 years of playtime\n\nI've had the time of my life playing on Persistent Worlds and later make my own PW's to create and host. This is why it's still going strong - everybody gets the option to create their own type of Fantasy world, but not only that - the choice to play your adventures with friends. And, why not be a DM and make up a story on the spot for your buddies to experience.\n\nAnd, if that isn't enough you  can find hundreds of hundreds of adventures that people have made.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Great game. A classic with large online community",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's the best old game ever. Especially if you want to tell a story, not just play one.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you're a fan of D&d in any form you will enjoy this game. It has a lot of very cool content and good graphics for a Dungeon Crawler 7 out of 10 stars.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I bought the game only to play adwr custom module, so I can't really say anything about the default campaign.\r\n\r\nObviously, I'm not gonna review the custom module here, so the only thing I can comment is the framework the game provides for these custom modules from D&D perspective (from the player's side), and I have to say that I was really positively surprised. For such an old game, the world can be very detailed with many scripts, mechanics and stuff happening around. It's lacking a bit on the \"DM narration\", so it functions more like a computer game, not a D&D campaign, but even now in 2025, the framework is still capable to provide very enjoyable experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Found this game trough online mentions of spicy custom content.\n An older game that is slowly getting a tune-up by the current developer.\n A 2D( map navigation, not graphics) top-down mouse driven( WASD movement&follow camera available), main character and AI followers(optionally), real time with pause(with an underlying turn system) RPG, intended as a rules simulator for DND 3rd edition( minus the spells that would be hard to code or practically useless for combat\\CRPG gameplay), with a separate saving system for charactes and ongoing games and a large selection of user content.\n\n Comes with an editor, scripting capable but by default the item weight and value gets auto calculated, so it is easiest to make new DnD campaigns, rather than build new gameplay.\n The first campaign that comes with the game is more a techdemo( it is still a full, multichapter campaign) and not everybody enjoys it, so feel free to ignore it.\n Has a long running and decently active online community and a wiki.\n Several currently active online servers, for roleplay and hack'n'slash dungeoneering mostly, in addition to single player campaigns and user created 'gamemodes'.\n Tends to have no voiceacting beyond combat, so adding text to NPCs is cheaper for the map creator, but you might encounter the rare audio file or cinematic.\n Character creation is based on DnD 3ed, so some value traps and anti-synergies, but campaigns are usually not designed for optimally built characters, I had decent success without copying a build, just had to rest more. Characterbuilder goodness.\n User interface could use some work, is being slowly worked on(you can have max 2 chat boxes, locked to each other, but custom filtered).\n\n The main advantage of this purchase is that when a campaign is complete, another can be dowloaded, so people with an internet connection are unlikely to run out of story.\n If you are looking for any DnD related games, |Dungeons and Dragons online| (MMORPG using DnD module content) and the demo of |The quest for the golden candelabra| (pathfiner combat simulator) are others I had good experience with,\n but if you liked Baldurs gate or Diablo, check this game out on youtube( I mean skip into playtroughs, not trailers, the screenshots on this page are a little more zoomed in than how I prefer playing).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A wonderful little engine for playing seemingly endless amounts of community campaigns. \r\n\r\nHowever, I only played the original campaign which has it's issues, especially the extremely slow first chapter. If you get through it, you get a pretty cozy fantasy story, and if you love the Forgotten Realms, you won't be disappointed, but I reckon I could have beaten a game with a lot less hours if I didn't have to practically force myself to play it during the first two chapters of the game.\r\n\r\nIt most certainly feels like a step back from the lively city of Baldur's Gate 2 or the untamed and dangerous wilderness of BG1, but I still had my fun in this little \"proof of concept\" campaign. Expansions are better from what I hear and so are many custom campaigns, so if you get filtered by the first chapter's MMORPG-like tedium, maybe give those a chance before giving up on the game.\r\n\r\nStill, I had fun and at the end of the day I'm just happy to have more pre-5E forgotten realms games when D&D still had a cozy feel.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I recommend this because it really is good. I remember this game from when my father used to play it during my childhood, which was quite a long time ago, and now after so many years  since it turns out the game is from 2002  I still recommend it, because it truly feels interesting and nostalgic, for its time, also very dynamic and high-quality.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i used to play this years back and found it was on steam its a old game but you can spend hours building a character, the steam version still has a few glitches and is not as good as the old windows version but is still playable and will give some good old rpg memories",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "very food game.great story and action",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is very well done. I had the original games way back at release and all the expansions. This remake lets you play again on modern hardware and retains all the awesomeness of how they originally were but with new content and lots of interesting community made things to add. Recommended highly whether you want to play the old games again on modern systems or if you're new to it and want to try it, it'll give many hours of awesomeness!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is a gem.\nIt's an awesome remaster to a classic game, which is still constantly getting updates from the devs and the community, basically for free, with essentially unlimited content.\nI am glad I gave it a second try because 'teenager me' was too slow to understand the mechanics back in the day!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's like Diablo or Divinity 2 but if you could mod it like Elder Scrolls or Fallout. Nearly Endless depth it seems like. There's a mod that turns it into a Star Wars game btw. ;o",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A fine representation of small party 3rd edition Dungeons & Dragons. It offers a variety of character options, and is wonderful for DMs to create game content. People have been doing so for over twenty years! Worth the money and lots of fun.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is like stepping into a fantasy sitcom—full of epic quests, quirky characters, and enough dragons to make your backyard growl. It’s so immersive, I lost track of time and woke up confused in my own kitchen. Perfect for anyone who loves heroics, humor, and pretending they’re a legendary adventurer without leaving their couch!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great FUN game with great role-playing options",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When this game first released all the way back in 2002 on a disk not even !online! I purchased it! I have loved the graphics and storyline from day one and the online server expansions made me fall in love even more totally recommend this game to other lovers of DnD based games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NWN is, by far, my favorite game of all time because it isn't merely a game. It's D&D 3E DM's dream and a source of infinite adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in the dungeon to start...love the mechanics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review is meant mostly for people who already own the classic NWN Diamond Edition.\n\nOverall, I'd recommend this version, but certainly not at full price.  Wait until there's a deep discount.  I got the enhanced edition as part of bundle, so it worked out to just be a couple bucks for NWNEE and all its DLC.  I'd say paying that much is a great deal.\n\nThere are enhancements for the single-player experience, but they're a bit minor.  I like how the UI can be scaled for modern, high resolution monitors, and I was honestly a bit surprised when ultrawide support just worked out of the box.  Switching to the desktop and back works fine, which isn't always the case for older games.\n\nThe real draw for SP players, I think, is that most of the stuff going on at NW Vault is for the enhanced edition.  I want to eventually try out some of those mods, but I've been poking around the OC (\"Wailing Death\" campaign) without any mods to get an idea of what has visibly changed.  So far, not a lot, but I'm still only mid-level and haven't had the opportunity run into too many of those old, frustrating bugs and issues from the Diamond Edition.  I also have yet to try the newish DLC and the MP servers.\n\nIt's NWN, so it's pretty fun.  I really wish that the enhanced version had been further enhanced in visible ways, but I got it cheap enough to say that I'm satisfied.  If by some chance you're looking at this game but don't own the classic, unenhanced version -- yeah, grab it.  There's piles of content, both official and unofficial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As good as I remember and the newer lighting really helps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neverwinter Nights is a classic RPG that still holds up thanks to its strong foundation. The graphics, while dated by modern standards, carry a certain charm that adds to the nostalgic sentiment. The story is engaging, weaving a rich fantasy world that keeps you invested from start to finish. Most impressive is the underlying system which is is deep, flexible, and rewarding which makes every playthrough feel unique. Altogether, it’s a game that blends emotion, visuals, narrative, and mechanics into an experience worth revisiting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is such an underrated classic that so many have never heard of. Playing BG3 made me miss how much of a masterpiece this game was and cause me to come back to it decades later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another well done remaster of a classic D&D game.  \r\n\r\nIt also lets you make an unexpectedly amazing warrior: Start as a Half Orc sorcerer or bard, non-good.  aim for the requirements for Pale Master and Red Dragon Disciple.  take levels of both and get all the tasty stat and AC bonuses.  Pick up heavy armor and weapon mastery feats of your choice.  Become unstoppable tank with massive physical damage output and an AC pushing 40+. the dragon disciple and pale master abilities are just icing on the cake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in 2025, Neverwinter Nights remains a worthy adventure for fans of D&D. Everything from the writing to the production quality to the (literal) depth of the adventure, and the character development that occurs along the way, makes it a compelling game you'll want to experience for dozens of hours. I'm a particular fan of Hordes of the Underdark, that starts out with --another-- literal bang, and never lets up. If you're looking for an opportunity to experience D&D for the first time this is a great starting point. Also note, this can be played on an iPad, making it an excellent time displacement tool for long airplane flights or drives (when you're not at the wheel).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the single best greatest environment for any role players dream. I have almost 100 hours in just roleplaying alone. I dont actually know what the game is about. anyways play sigil and ravenloft! 5/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the old-style of \"Advamced Dungeons and Dragons\" (be it on paper or digital), than you'll love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember having this game on my PC many years ago. I played the original intro over and over, trying out different characters and classes. I never beat it, and this time, will make an honest attempt.  but the feel of a D&D 3rd edition game, a successor to the original Baldur Gate games and the predecessor to the newest edition of Baldur's Gate, makes it a must have for die hard fans of D&D.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best D&D experience online. \nIt's the best old game ever. Especially if you want to tell a story, not just play one.\nOne kind of game that let you feel good nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love they keep updating and fixing this game with new features and to work on modern systems. One of the classics that is a must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neverwinter Nights is the epitome of a classic game. Yes, she's old: the graphics are dated, especially by today's standards, and the gameplay itself isn't anything super special. But what sets Neverwinter Nights above everything else is the storytelling. Rich, immersive, interesting, with a real sense that there's something big at stake and you're answering the call to adventure. \n\nThere's a reason this is a classic. If you're coming back to it after playing it when it first released, you're gonna love it. If you're a younger gamer who hasn't tried one of the foundational games of the PC gaming world, give it a try. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic in its own. It implements the rules of tabletop RPGs very well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the original when it was first released and the enhanced edition means I can play it again without weird resolution hacks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the enchanced version, it keeps the game alive and received here an there updates means they care for it.\r\n\r\nI playes only the Official Game and the Expansions and loved the Stories.\r\nI will try the other - like the premium ones and come back with additional feedback.\r\n\r\nWhat I don't like is that are still some bugs left but maybe they will resolve in time.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally unplayable. I have tried multiple version of proton, I have tried modifying launch options. Either the game doesn't launch, or it crashes while waiting to load.\n\nI tried to get a refund from steam support but I spent so long troubleshooting it that they denied me a refund.\n\nGOG's Linux version works fine, it's just Steam. Do not buy here, buy from GOG.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unless you're an ardent D&D aficionado, then I would not recommend this game. The graphics, given it's age, are very dated, the systems are basic, character and/or companion movement is wonky, and the story is mediocre.\r\n\r\nIn the end it's a dungeon crawler, that gets very repetitious and would probably be better served if they cut content and shortened it up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't tell any difference from the original version... some say improved graphic, but at least i couldn't tell any difference...\n\n---------------------\n\nseem more buggy then the original..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh at its best.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}