{
  "positive": [
    {
      "review": "very good game to train aim consistency and reflexes",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☑ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Definetly helps improve your aiming in fps games. Totally recommend for other people who are looking to get serious into fps games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love using aimlabs as a warmup for any comp game out there not to mention the partnerships they have. \nRiots partner ship with them and there custom tracker allows you to easily replay that 1v9 clutch you missed just slightly and freshen up on any of the maps. \nAimlabs will always be my go to aim trainer with warmups and workout that actively make you better and teach you what you needa know to improve your aiming and gameplay.\nAimlabs and logitech are also always giving away hella stuff also and the leaderboards are modded very well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% would recommend, I've seen a noticeable improvement since I started playing, I believe if you consistently train as I do (About 1.5 Hours a day) on GOOD tasks such as Sixshot, Spidershot/Microshot, Strafetrack, and Spheretrack you'll see a significant improvemnet over the span of around 2 months! Hope you all give Aimlabs a try and see improvement in your own aim too! ;3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Buen AimTrainer Tanto Como Practicar y como calentar, tiene una gran variedad de videojuegos para jugar pero siento que no es tan completo como otros como kovaaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im starting to get really good at shooting cyan dots, my aim in games is yet to improve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "severely improves mouse control, put the time and grind into it (not more than 1.5 hours a day though) and you'll be golden",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Returning to FPS games after a few years and upgrading all my peripherals at the same time, I feel that Aimlabs has definetely helped me to get my aim more consistent and reliable in games. Also testing your aiming skills in different scenarios and training with increasing difficulty is also fun at least for me. I dont think this will make you aiming god in any game, but it can definetely help in getting your aim more consistent and increase your skill with the mouse at least to a pretty high poin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "here would be where i would start 20 min for a month try out sens randomizer and try out drills. Then make your own playlist specialised for the game you want to work on and do that every day. It sucks but its like working out your first time sucks put music on and play. Over time you will add more workpouts because you start to enjoy it.  They offer so much for free and i am debating getting premium. Aim/ crosshair placment dose not make you good at a game lick cod but it dose make you able to hit nasty flicks. It is satifying and i have noticed gains. Consitancy is the only way you will make gains. 5 min a day is better than 1 hour a week. Consitancy is key. This is your key to starting. Hope you enjoy this like i did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Builds consistency and allows you to test independent variables whether its game-based or biological",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not a game, it's therapy for my terrible aim. It works. Doing a 10-minute routine before hopping into a real shooter makes a noticeable difference. It's boring as hell, but it's a necessary evil for anyone trying to be competitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definetly helps improve your aiming in fps games. Totally recommend for other people who are looking to get serious into fps games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning graphics and visuals \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aim Lab's is a LEGIT aim trainer with a ton of features.\r\nTrain for your \"Personal game\". Train in general.\r\nIt's One of the best Free aim trainers. With paid (AI features / Premium content ) If you want to take it to the next level.\r\nGreat product.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great tool to help improve at shooters and in general just mouse movement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yah its fine if only sens discover was for free it will be the most appreciate thing\noverall good experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would say it's what you expect from aim trainer, there are some parts that is behind a pay wall but I never felt that I needed them tbh.\r\nI just need it for warmup before gaming and it have ALOT of tasks and playlist, you can just creat your own playlist and train on whatever you need to train for, overall recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best aim trainer to improve your aim more efficiently be more consistant then you can see the difference in your gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice aim trainer for FPS games like valorant and csgo and even apex legends.. Its free so it won't harm your wallet, so that's a plus. Go try it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game to practice, Don't over work your wrist and arm though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very intresting game and i would recommend it. The story of the game is very good and amazing, the plot twist was crazy and the Graphics are just master piece. If u want a story game that is free and has a wonderful atmosphere, play this. 10 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aimlabs – The Best Aim Trainer!\r\n\r\nIf you want to get better at aiming in FPS games, Aimlabs just makes sense. It gives you all kinds of training scenarios—flick shots, tracking, target switching, you name it. You get real feedback and detailed stats, so you always know exactly what’s working and what isn’t.\r\n\r\nThe scenarios are straightforward, and you can tweak them however you like. Some workouts feel almost like a game, but they still push you to improve your reflexes and precision—skills you absolutely need for FPS games. Plus, Aimlabs is super easy to use, and there’s even a free version, so anyone can try it out.\r\n\r\nHonestly, I’ve seen a real difference in my own aim since I started using Aimlabs regularly. If you want to step up your game, I’d definitely give it a shot.\r\n\r\nPros:\r\n\r\nTop-notch aim training\r\n\r\nYou can customize the practice\r\n\r\nClear stats and feedback\r\n\r\nFree to use\r\n\r\nCons:\r\n\r\nDoesn’t cover every single in-game situation\r\n\r\nYou’ll still need to play real matches to see full progress\r\n\r\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for practicing and improving your skills in games such as CS:GO or Valorant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With Recent updates and improvements, aimlabs is awesome aim trainer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "free to play game that sends you mice if you're good at it. \r\n\r\n11/10, love my free pro x superlight 2, thanks aimlabs <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aim Lab is one of the best tools out there for improving your aim across any FPS game. The training tasks cover everything—from flicking and tracking to reaction time and precision—so it’s easy to focus on exactly what you want to improve. The progress tracking is also super helpful; seeing your stats go up over time is really motivating.\n\nThe customization options are great too. You can adjust almost everything to match the sensitivity and feel of the game you normally play, which makes the practice much more effective. Plus, the community-made playlists keep the experience fresh.\n\nWhether you’re a casual player trying to get more consistent or a competitive player aiming for high-level performance, Aim Lab is definitely worth using. It’s free, lightweight, and actually helps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aim Lab is hands-down one of the best tools to improve your aiming skills across FPS games. The variety of tasks helps you train every aspect of aim—flicks, tracking, speed, precision, reaction time, everything.\n\nThe progress tracking is super motivating, and the customization lets you tailor every scenario to match the game you play (Valorant, CS2, Apex, etc.). The devs keep updating it, and it runs smoothly even on low-end PCs.\n\nWhether you're a beginner trying to get better or an experienced player looking to stay sharp, Aim Lab is absolutely worth having.\nFree, effective, and fun. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "that game really help u to get better at shooting really nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only played it as a warm up/aim training before jumping into my main game (OW, Valorant, CSGO), yet I still somehow managed to get almost 400h on it, that should tell you enough about Aim Labs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely the best aim trainer game you could ever get. If you're willing to dive deeper into their assistance services, then you can pay their premium package.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been using it for a bit, really simple to use. the interface is clean and easy to figure out. opens fast, doesn't slow down my pc. you can change the crosshair however you like. tried it on a bunch of games and it worked fine. nothing complicated, just does what it says.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aimlabs is such a great app you can get it for free on Steam, it helps me to get my aim better and you can choose anykind shooting games where you own it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does its function really well and has taught me so much in terms of in game situations and tracking as well as  flicking. Really recommend as an alternative to kovaak but if u do have enough for kovaak ,please buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it is vital for improving your aim, hand to eye coordination and quick flicks. It's a must have for shooter games players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good practice, aim labs plus is worth it over kovaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I downloaded Aimlabs to get better at FPS games.\r\nNow I’m a god at shooting colorful floating orbs… and still whiff full mags on a guy standing completely still in Counter-Strike.\r\nPros:\r\n\r\n\r\nTells me I’m in the “top 3%” while I hard-stare at my Bronze rank.\r\n\r\n\r\n“Just one more scenario” has replaced “just one more game.”\r\n\r\n\r\nMy tracking on tiny dots is insane. My tracking on enemies? Not found.\r\n\r\n\r\nFree therapy in the form of graphs showing exactly how bad I am.\r\n\r\n\r\nRobot voice is the only one that believes in me anymore.\r\n\r\n\r\nCons:\r\n\r\n\r\n99% accuracy in Aimlabs, 9% accuracy in real matches.\r\n\r\n\r\nI now know 437 ways to miss a target.\r\n\r\n\r\nFriend: “Yo, you playing?”\r\nMe: “No, I’m training.” Proceeds to get one-tapped in Valorant pistol round.\r\n\r\n\r\nEvery session ends with “You improved!” and my brain replying “Liar.”\r\n\r\n\r\nOverall:\r\nAimlabs turned me from a potato into a slightly seasoned wedge.\r\n10/10\r\nWould grind flicks, queue ranked, and instantly get humbled again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aim labs, and aim training in general is what you make of it. You can spend 1,000 hours in it and make no progress or spend 100 hours on it and double your cs rank. The key is getting started and staying consistent, which is great because aim labs is free and tracks your days scores and favorite scenarios. When people compare it to Kovvaks it may fall short. Aim labs is free and needs to monitize itself with skins, ai assistants, etc, its live service but that also means its continuously being worked on. Kovvaks is sleek, comfortable, and optimal, and $15 isn't a lot of money for a hobby you'll be spending 100s of hours on. But theres nothing wrong with aim labs, if you want to improve you need to seek the improvement from within, and use the tools you have. And Aim labs has 1v1s so I can destroy my friends so 10/10 would reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aimlabs can be a useful tool in your toolbox—especially if you want to sharpen the mechanical side of aiming (tracking, flicks, consistency). But:\r\n\r\nIt won’t replace playing the game itself or working on broader skills like positioning, map awareness, movement, crosshair placement.\r\n\r\nUse it as a warm-up or supplementary diet, not the main meal.\r\n\r\nIf you’re tight on time (with montages, work at BLS, workouts etc.), focus first on in-game practice (deathmatch, aim duels) and then add Aimlabs if you feel your aim specifically is a limiting factor.\r\n\r\nBe cautious if you’re considering the paid version—only get it if you’re sure you’ll use the extra features regularly and it’s giving you measurable benefit.\r\n\r\nOverall: I’d rate Aimlabs for you as 7/10. It’s worth it — but only if used smartly and in balance with other practice. If you treat it as a silver bullet, you’ll probably be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game for players who want to learn aim and other \"helper features\" to play Shooter games and improve.\n8/10 (my aim is still bad) but it helped a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play sixshot and headshot standard and your aim will be like pro player trust me i played this game for 80 hrs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend playing this for free and I do not recommend spending money on it, and I'll break down why. There's an \"aim sensitivity finder\" that the ads claim will improve your aim 49% faster if you use it, right? But think about how that data's taken. Aimlabs Pro is a bundle. If you get the sens finder, you get that whole bundle, so anyone who's using the sens finder is using the rest of that bundle too. That's a pretty huge bias. On top of that you have selection bias where maybe half the people who don't buy the bundle just straight up don't improve at all or even play for more than an hour. And on top of that, maybe the oldheads who don't want to spend money just don't improve as much, because they have less room to do so. New players who buy the shiny subscription might \"improve way faster\" just because they start at rock bottom. Aim trainers are good though, not just for practice but for adjusting your setup, warming up, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gooooood for valorant\r\naimlaabs plus is worth it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for people who are bad at aiming and if people play this it wouldn't be so rage bait when your teammates cant aim in CS2 or Valorant",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant training, clear analytics, and proper improvement to my aim. Well worth the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aim Labs is a good program for practicing aim in shooting games. It has many exercises that work on accuracy, reaction time, and tracking. You can focus on the areas you need to improve, and it shows your progress over time so you can see how you are getting better.\n\nThe program can be adjusted to match the settings of the games you play. There are also different playlists created by the community, which helps keep the exercises varied. I have played similar aim-training games in the browser before, but this one is available with different game modes for esports titles like Counter-Strike, Valorant, R6S, and more. I have also used Refrag.gg long ago, which is a paid program for practicing Counter-Strike.\n\nIn conclusion, Aim Labs is helpful for both casual and competitive players. It is free, easy to run on most computers, and can help improve aiming skills with regular practice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(I have about 23 hours on my alt account)\n*At least for TF2 and Deadlock I didnt seem to notice a big increase in aim, but tbh I already practice a lot in those games. I think a newer gamer would find this very helpful. At least the free edition, doesnt really offer anything that would help me in the games i play, because those games have such different weapons and movement systems. Its better to just focus practicing within some of those games. \n-Deadlock for example, it already has built in systems to help you see how slow your soul denials are, with input lag, server lag, ect. There is no way to practice dash jump sliding into a wall jump heavy melee while trying to keep someone off your tail. So, some skills will always need to be practiced within the game. \n-TF2 has a lot of movement tech that can never really be practiced outside of that game, PLUS the community servers do an insane job and letting you practice.\n\nIF your game is \"Click first = win\" then yeah, AIMLABs will help you a good bit. But so many games have such different settings/lag/responce, I will always recommend in game training.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good free source for building skill and confidence in your aim. Good for warmups and any FPS player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think aimlabs is very easily the best aim trainer, I have  bought and tried multiple other aimtrainers (for e.g. kovaaks, aimbeasts, 3d aim trainer) and i've not had such a great user experience and actual functional use with those than i have with aimlabs, even though aimlabs is free compared to aimbeasts and kovaaks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even without aimlabs+ i still is good for training \r\nneeds to update roblox games list tho (no rivals D: )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good apps, but you need to buy premium for a bettter training.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great software if you hard stuck in game this app will absolutely help you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 great for training my goon wrist graphics are good too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "helpful, but better off playing the game you're training for more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You know you're getting a little too good when you have this,\n\nand everyone is judging you\n\nEveryone.\n\nWould recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for warming up your aim and learning the fundamentals of mouse aim if you're new to PC gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YES KING UMM DAT DIH SO GUUD YESSS YES YES.  good app made me a lot better r6 and ow2 i do recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for a warm up session before you go into Games of CS or Valorant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although the amount of monetization is overwhelming, their community support is top tier. There is almost always someone in their discord that will answer your questions/concerns/provide aim tips/ban cheaters(with sufficient proof of course).\r\nanother massive pro is that it is free\r\n\r\nCons:\r\nThe Menus needs a major overhaul.\r\nWeird stutters/hiccups when navigating the UI\r\nJust weird little bugs here and there like not being able to exit out of replays or certain parts of menus don't register clicks unless you click on something else before re-clicking on the first object, etc...\r\n\r\nhighly recomend trying it though, it is free, what is there to lose?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely helpful if you feel like you suck at aiming, i went from not having a chance against the average player to above average within a few hours of training, i havent used it for a long time but definately will get better the longer i consistently use this daily, very helpfull, fun, interactive, and all that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good free aim trainer, improved my aim drastically and made me able to compete and make money via esports",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yo, I just hopped into Aimlabs for my daily masochism session, and it's like a virtual firing squad where bots multiply faster than my regrets—training your aim to frag noobs while your social life flatlines in the corner! Clicking through Gridshot hoverboards and Spidershot nightmares, watching my accuracy climb from \"potato\" to \"barely competent\" as AI whispers \"git gud\" via analytics—feels empowering until a leaderboard peek reveals cheaters hoarding prizes like they buried their victims. Playlists for Valorant or CS vibes? Cloned physics make it transfer seamlessly, but one whiffed flick and you're screaming at ghosts.\n\nFall 2025's got Dropshot battle royale chaos and Dodgebot revenge boss fights, with Logitech skins for that premium sweat—7k+ players grinding daily like it's therapy for our trigger fingers. 9/10. Free aim heaven—your KD lives, but your sleep schedule gets a dirt nap!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice little game to practice your aim in a variety of games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played a lot from different accounts, helped me improve at fps games A LOT.\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good aim trainer. DONT EVER IGNORE TRACKING, ALWAYS PRACTICE YOUR TRACKING.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for aim training, be sure to watch some tutorials on YT and what is the purpose of the training categories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helped me hard carry egirls, definitely recommend this if you wanna use steam as a dating app.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for improving aim i went from bronze 1 to bronze 2 in valorant in the span of only a year!!👍👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great aim trainer — clean, responsive, and packed with useful drills for every FPS.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best things that happened to me, improved my aim like crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "how to destroy karplani tunnels I recommend it to everyone 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played for 2 hours, got carpal tunnel. 10/10 would play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good warm-up tool, I recommend it to all my friends. All 2 of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still trying it out, kind of overwhelming but seems to improve my aim a bit. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game\n(it improved my aim)\n(i can't stop playing shooter games)\n(master 2 rank in OG - beta ranked)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok and it will help aim but its just a bad version of kovaaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aimlabs, the only aim trainer that matters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "id recommend this to valorant players who cant hit a shot to save their fking lives.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amlaebs is lyfe lfie no fun no aimlab aimbelabs make lyfe so funnn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Point and click, a nice warmup",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Aim trainer for FPS games..... Please play Once....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good AimLabs need buy more for game it 10/10 games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best aim trainers! unfortunately not a lot of them out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's pretty good if you want a free alternative to kovaaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would like my teammates to use it, my mental health would be much better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect to get worse at any FPS game you have played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, Aimlabs is indeed a good \"program\" to improve your aim. However, I personally would prefer Kovaaks and for reflexes osu! to be honest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "verry good training game shoot like a monster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really helps my tracking, I play it everyday now with biley guide",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good to train aim ngl,getting better lately",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My aim was running on a potato now that i've played its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good tool For all the controller uncs out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing aim trainer much better than competition while being free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work, my aim is still terrible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For free its really good to practice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice app for me for prer before the cs2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you go here to get good at any fps and some point or another you will have to do this to improve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for aim training and reflexes",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "it says free to play but to practice for certain games you have to pay for plus, dont waste your time downloading. you would be better off practicing in whatever shooting range your game provides.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything in this game is locked behind a shitty membership system. Do not touch this garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "20 Gigs download for an aiming train application with bare minimum graphics. \nTried to enter through the \"PLAY OFFLINE\" option but could not because it still requires internet connection.\n\nUninstalling and forgetting its existence.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall, the free portion is not bad but I am giving it a not recommended as the subscription is not worth it yet it seems to be pushed so much. The aim sensitivity finder also sucks. The subscription would be worth it if there was better features but overall its meh. Solid aim trainer, but don't waste your money on the subscription like I did. It was a dumb choice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Making the login process obnoxious is a great way to lose potential customers before they even experience the software.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Have to pay monthly subscription in order to see your stats, like how many scenarios you have played etc..\r\nAlso their game chat is locked behind subscription...\r\n\r\nWould recommend KovaaK's instead, also much better community",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's be real, aimlabs isn't necessary at all. It's just an overhyped and overrated aim trainer that advertises itself to make you a better player, while in reality it's almost stealing your time. Also it's like amazon trying to steal your fucking money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to love back in the day but I'm very disappointed in the route they took with paywalling everything. There's so much flashy stuff on this app but none of it actually seems to matter it's just the equivalent of Discord Nitro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When I first got it 4 years ago or so it was good. Now it's a slow mess for no reason at all. All of the things they've added are completely unnecessary for an aim trainer. I hesitate even opening it now because it feels like bloatware for my PC every time I do, they haven't even optimized it well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It COULD BE a good tool but the program is more interested in stealing your money. 10 dollars a month to adjust your sensitivity! WTF! This pos feels more like a scam and/or a ripoff. And adding cosmetics and score board to justify the price is freakng stpd. This feels more like a scam than anything else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For being free its okay, however i give a big thumbs down since its a subscription based program. I am not a fan of this practice. Im the pay once and use it type of person. But thats not the reason for the negative, if i crash in the menus while just trying to go from lesson to lesson  and the app itself just freezes on screen crashing itself, its just poorly designed and optimized. I cant in good faith say these devs deserve any money, its absurd to pay something monthly. I can get behind 50 or 20 bucks but 10 bucks a month. You think your WOW or what idk. I aint rich, sure i want my aim to get better but its not worth more then a game value at best. And for that reason as a shark i would say. For that reason, I'm out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to really enjoy aimlabs, it was simple to use and I loved it, now it's riddled with ads and monthly subscriptions, there's no fluidity in the ui and the settings are a nightmare along with no easy use of mouse adjustment for the sensitivity which is the whole point of an aim trainer, just disapointing overall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i payed for a month now i cant login it gets laggy and it not straightf forward for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dog shit aim trainer. How u gonna make an aim trainer so unoptimized that even the lobby is stuttery. You cant get high scores cause the game just stutters the whole time. it never used to be this bad but with the most recent updates its almost unplayable. Ig its back to kovaks for me. L aim trainer dont even bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are so many bugs in the task and playlist editor, that it was impossible to create a custom playlist that contains my own customized tasks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wan to practice your general aim, is ok. But if you like playing a specific game like cs, the best way to make you aim better is by paying that game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When the game launches it asks you weather you want to create an account or play offline with \"some features\" unavalable, I chose not to create an account because I don't see a reason to, however just a few clicks later I realized that for whatever reason the devs have made it so you actually CANNOT USE the aim-trainer gamemode if you're not logged in. I am very disappointed to say the least, and also a bit confused.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My nervous system cannot handle those trainings.\n\nBut worst of all is that app menus are completely broken in terms of performance. Never seen a game where you click on a button and waiting for 15-20 seconds till something will change on the screen as it's tries to load other menu.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "çok fazla ödemeli şey gelmiş ve çok fazla hatası var ben genede el ısındırması olarak kullanıyorum",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like the idea of the game the problem is that i can’t connect my discord account to play it. So its bad for me and i would like to this bug to be fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the love of god please fix custom tasks crashing right at the end. This forces the player to close the game and it also might not save the data from that particular run. Very frustrating and I just had it happen to me twice in a row on the same task. Also not the first this has happened. It's free so you lose nothing by using it but I can't recommend paying for it. Also the UI is awkward.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "somehow every update makes it worse or more annoying advertising something I don't want like AI. only worth it at free99",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Solid tool, but it’s so limited in the standard version and it contains many microtransactions, so I don’t recommend it. 4/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy as fuck, login but never save any settings, login for what ?. Don't even save favorites map.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to warmup, way to go. \nIf you want to improve, no way to go.\n\nPros: \n- You can shoot \n- many trainings\n\nCons: \n- Pay to get any feedback (not once, but monthly).\n- Some trainings are rough, because as a colourblind person, I can barely see half-transparent with no shadow and flat texture of blue ball on blue background.\n- People are cheating to be first on the leaderboard, hahaha.\n- Forcing me to use other language (my locale, but translation is sooooo baaaad. Let me try to give you an  example of how it sounds like: \"Do game/make options/tokens/go exit\"\n- I have to google how to change language, because I couldn't find it.\n- I was doing some recommended tasks and they gave me shooting donuts from donkin donuts. Wow, so pro! \n- Trainings are not telling you what to do and they have some secret namings like VT30S8C2 now figure out if you have follow, shoot, follow and shoot, follow and not shoot, shoot from one corner to the other etc. After one training got 0% (wow!), then after three trials I figure out what I have to do. Then Aimlab congratz me and said that I increased my skill by 95%. Man I'm the GOAT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seriously? 20 gigs? For an aim trainer..? \nInsane bloat and enshittification. \n\nYou can literally just go online for this. Or find another, free, without any subscriptions, login requirements, or stupid microtransactions, aim trainer on Steam, mind you.\nPiece of shit. Plus this likely can't run on mildly old hardware due to the obscene and COMPLETELY unnecessary hardware requirements and \"great graphics\".\n\nIf you want to get good at aiming, don't install this game. It's a waste of storage space.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Impressive how clunky they have made the UI, it is a disaster! Forcing us to register an account to save settings as a means of data collection is a practice i will gladly avoid. Easy uninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completely useless, same as maps in Steam, only paid. There is no AI there, just ordinary calculations and advice like “make the sense lower...”",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is constantly using mouse instead of the controller what i wanted to use it for - really useless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's be honest.. Is this REALLY going to help your aim long term? Probably not. Is it going to help you warm up before matches? Probably. Are you going to go pro by wasting hours of your day on this? Absolutely not. Did they find a way to charge microtransactions... For a damn aim trainer? Yep.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bough this game a long time ago. BEFORE, they added all this bullshit paid stuff. \nEvery single page. Every single thing is almost always behind some kind of pay wall. \n\nI might as well just blow cans in my backyard then try and deal with the PAY PAY PAY PAY PAY PAY P YAP AYP APY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spent 50 minutes of trying to get the right settings/sens, and 10 minutes of playing...\n\nAll that just to make my aim worse.. AVOID and just use an 'IN-GAME AIM TRAINER'\n\n(even with the specific game settings, your sens wont be the same and you'll just be training with a different sensitivity than you use in game)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great idea, super dumb skeezy scammy execution.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bugy. I press restart button my cursor disappears and I find myself on another level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this used to be good, i came back after a few years cos i was getting back into tf2 and back then this game had helped me with my aim... now its subscription based slop that doesn't actually teach you anything, and hell no im not making an account, i used to be able to just drop in.. no, screw this, im getting this off of my account.. sad thing is i remember paying for this. scummy behavior. i will not be coming back, save yourselves the time and money and just play with tf2 bots, csgo/cs2 casual and just learn by playing the games you want to master. this has become nothing more than a scam ridden microtransaction hell.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My custom tasks/playlists got deleted with the last update\nVery visually bloated compared to a few years ago\nMore and more things behind a paywall\n\nOverall very enshitified product.\nUninstalling and migrating to \"3D Aim Trainer\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HEY, ITS NOT FREE ANYMORE. ONLY USE THIS TO HELP ME FIND MY SENSITIVITY. WAS ALWAYS FREE, BUT HEY NOW LET'S PUT IT BEHIND A PAYWALL. STUPID SUBSCRIPTIONS EVERYWHERE, LET ME OWN SOMETHING FOR ONCE",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "UI is a fucking disaster and the whole thing seems to be built from the ground up to try to sell you a subscription.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage. Dosent support all resuutions/stretch. Pop ups like on a wierd website begging for ur money get kovaaks!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They started as good aim trainer, but now it's overloaded mess. UI is crazy, I can't find fast what I need. In every whone I see subscribtion on pro version that I don't wan't. They lie in ad pro that it will improve your skill and etc. Horrible :c",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This pissed me off so bad I had to google how to leave a steam review, because even that has a bunch of hurdles, can only do it from the store page and the game has to be shut down to do it. \n\nIn terms of aim training, I think tracking is definitely one of the most powerful aiming skills that will have you improve the most. However, trying the tracking games had me foaming at the mouth.\n\nWorst of all, in those garbage minigames that are poorly designed and don't do what they are supposed to, you can't even leave comments leaving feedback or reviews. Your opinion is unimportant and there is no way to share it.\n\nthey are made so stupid and frustrating. A lot of them make you lose points if you don't stop firing every time you don't slip off target. That's a brain dead stupid and frustrating addition some low iq people made. \n\nI think it just adds extra stipulations to playing, making it more difficult to play, just to create avenues to make your score go down, and to venues for autistic people to get really high scores playing in weird and unnatural ways that doesn't benefit anyone just for the sake of having a really high score on this minigame alone and nothing else anywhere ever. \n\nSame thing with the tracking behavior of the targets. They will go dominantly left or right until you move 5 feet on your mouse pad, making it difficult to play, making you make judging decisions, if its a good time to skate your mouse or if you're gonna lose too many points. Again. This goofy, stupid, tracking behavior, just makes you bad at this tracking minigame, which has no bearing on any game ever. The point of aim labs is to create similar environments where you can hone in your skills. Not create a unique goofy environment where you hone skills that make you annoyed, make your wrist cramp, and help you nowhere. Most shooting games, people die in seconds, so where would it ever be useful to track for 5 mouse pads straight right over 25 seconds? How hard is it to measure total travel and keep the target in a range? \n\nsoooo stupid, and so frustrating!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fell off hard with the money hungry Online pay2play bs just like Xbox 360 and PS4... Literally a low polly low effort aim trainer... WTAF!!!!! Todays economy be hitting hard apparently. But F off and miss me with thiss BS. There used to be free trainer for Arma and pay day. But now you need to give these people who make polygons apear (not so) randomly a pay day. The only thing I wanted to give my thumbs up for this was the fact they have only free valorant training... Ni- Like I am playing Valorant. Who the F even plays any other pegging royale than Minecraft. Do I need to blame the kids, economy or the Devs? Good joke, Good shit post but very unfunny. Perfect rage bait of a free game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "menu is straight up ai slop. and monetized to death",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit aimtrainer that takes up 15+GB, get Kovaaks instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Quit trying to sell me shit with ads and subscriptions.  Also, what do I care what the pros are doing as far as an aim routine?  I'm fucking bronze.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunky UI too slow and unresponsive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "vro im not paying for aimlabs+ anymore let it go quit messaging me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't lock previously free functions behind a paywall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played it for 10 hours and i'm still platinum in overwatch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my friend said my aim sucks ass, i tried it. and my aim still is bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ugh. its just become enshittified. How the mighty have fallen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "paywalls for basic features lmao",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you're serious about gaming, this is useless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "6 hours. But 5 hour my friend played. But me immortal :) . Dont recommend this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3D Aim Trainer and Kovaak are better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make a subscription to find my sensitivity. No thx",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you will lose your soul. do anything else with your time, PLEASE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Game because my aim is still bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Najbardziej zmarnowane 42 minuty mojego życia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit, makes u pay after 3 days",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stupid damn login process.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shit makin me self conscious about my aim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pure pain and misery when u get to emerald",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "me shoot gun badj k twt \r\nhaving stronk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps crashing randomly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is to hard :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just hyped game not working",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Could I get some aim training with my bloat?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fallen so far it's insane",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "10$ to find your sensitivity :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fk you for requiring me to make an account",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not good aim training at all, boring as heck also",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its like math",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash get kovacks instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pretty much waste of time honestly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth your time anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only performative man play this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aimlabs? More like paylabs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its \"free\" :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lagging too much",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sub based bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very bad very very bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kovaaks better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aged like milk.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fort palidhje",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay 2 learn nothing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do i win?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "veche strelqm po ptici",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts ass 🥀",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bloatware",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "thumb down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "zabremenqh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "17GB",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "BADDDDDDDDDDDDDDDDDDDDDD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this game free is extremely misleading. You cannot do half the available stuff without a monthly subscription",
      "voted_up": false,
      "votes_helpful": 69
    }
  ]
}