{
  "positive": [
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☑ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I've had Beasts of Bermuda, for a while now. But only recently the past year really got into it, and I always find myself coming back now. \n\nThe game has incredible customization options when it comes to skins, and the Devs are constantly adding new skins to different creatures to give even more variety to play around with. I've seen so many beautiful players, that make every skin you come across on another player feel unique. \n\nGameplay is also fantastic, some hitboxes can be hard to learn and adjust to with the constant growing this game has. And while I think some hitboxes need a slight adjustment, overall PvP always feels fair and balanced. Abilities that every creature has feel unique in combat situations, and give every playable its own fighting and hunting style. I've found the balancing in this game is far superior to other Dinosaur Survival games, as it more is dependent on what you build and a players experience. Granted you will lose fights if its a bad matchup, but thats ok! Just reincarnate and try again, with a new build in the talent tree or learning from the experience. \n\nThe trials in the game are a fun way to keep you occupied and moving around while you grow, and they are a bonus to your creature for the time spent doing them. Giving a better roll on possible inherits to your talent tree when your dino inevitably dies and you reincarnate it. And I love the fact you have multiple slots so you can play different things on the same server with your friends, and don't lose your creature completely after hours sunk into it like other Dinosaur Survival games. \n\nWeather system in the game is really good, with natural disasters that can happen from varying levels of flooding. To even tornados and dry storms that cause forest fires. Making it a fun and often exelerating experience trying to find shelter or high ground, as you watch the water coming up in a flood.\n\nThe community is great, both on Officials and Community Servers. I've had a few issues with other players, but nothing out of the normal from conflicting personalities and gameplay styles when it comes to online gaming. And when you want to find people to play with? Theirs the built in group finder, making it easy to find packmates or a herd to join. The map size is perfect for the amount of players, you can often find others whether to socialize or PvP. \n\nUpdates are put out rather quickly, with every few months a new creature being added to the roster. Adding to the growing ecosystem and balancing of the roster. Glitches and bugs are often patched out extremely quickly once they are reported.\n\nWith even the Official Servers having set rules, makes the game feel more balanced and fair for every player. And the Mod team is incredibly responsive when you put in tickets in their Discord server, often very fast acting about issues you bring to them in tickets. \n\nThe only two issues, I have with Beasts of Bermuda at this current moment in time. Is the newly implemented chat censors, that should have a toggle, not be automatic. And the fact sometimes the Mods don't agree on how rules should be percieved or handled. I've seen many times that Mods handling tickets, often don't deal out the same consequences or agree if something is a rulebreak. I believe the Mod team should put a more direct understanding on the rules we are given, rather then having it so vague and then having unfair punishments or no punishments delivered on situations. \n\nBut overall I highly recommend Beasts of Bermuda, it's a very fun game solo or with friends. Many of the people you meet in the game are always more then willing to help new players, and explain mechanics. The global chat is a nice way to talk with everyone and make friends on servers, even when not directly playing together as the same creature.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Whether or not i should recommend Beasts of bermuda is a bit tricky, on one hand, out of the three big names in the dinosaur survival genre (The isle, path of titans and this game, beasts of bermuda)  it is without a doubt the one that feels the most like a finished game and has a lot of nice QOL that the other games don't.  \r\n\r\nOn the other it is somewhat difficult to get enjoyment out of due to endless growth meaning newer players or experienced players without an already started creature are kind of surpressed by people who put many hours and for lack of a better word dictate the actions of players around them,   this is particularly true on the official servers where clans are present and bully the smaller players around them\r\n\r\nSince the last time i played the other servers (community servers/non officials), their populations have been less than ideal,  however if you are adamant on playing this game and are a dinosaur enthusiast you will likely have more fun than someone who isn't all that interested in dinosaurs whatsoever.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "chill game, went across continents for a booty call and ended up tragically passing away before i got to tap, overall very fun to play with friends and honestly havent run into any issues with bans or roleplayers. very fun game gameplay loop and customization is nice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Yep its addicting. Especially for collector players like me who love to collect all the rarities and hardest shineys LOL",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Beast of Bermuda could improve by balancing its survival mechanics, optimizing performance, and offering clearer tutorials for new players. Adding new creatures like\nAmargasaurus – A mid-sized sauropod with unique defensive sail spines, offering a tanky but not overpowered herbivore option.\nSuchomimus – A lighter, fish-focused spinosaurid that could expand semi-aquatic gameplay without overlapping too much with bigger apex predators.\nDeinonychus – A fast, coordinated pack-hunter that could bring more group-play mechanics and agile combat.\nPachyrhinosaurus – A bulky, defensive ceratopsian that isn’t just “another Trike,” offering alternative herd strategies.\nPlesiosaurus (or another marine reptile) – To deepen the ocean biome and make sea gameplay more than just mosasaurs dominating the water.\nSpinosaurus – A powerful semi-aquatic predator that dominates rivers and coastlines but is less effective on land than other apexes.\nCarnotaurus – A fast, aggressive mid-tier predator with high burst speed and stamina efficiency, great for hit-and-run tactics.\nQuetzalcoatlus – A massive flyer focused on long-distance travel, scouting, and territorial control, rather than pure combat.\nIguanodon – A versatile herd herbivore with both bipedal and quadrupedal movement styles for flexibility.\nFinally, creating a better-designed map with balanced resources, varied biomes, and stronger landmarks would enhance exploration and overall playability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so before i get into how good this game is as a dino sim, i must iterate that it takes forever to grow to 10.0 (max growth) however the skill trees, the idol farming, the pvp and mechanics are pretty great in my opinion. the isle was my main dino game for a long time, but once i hopped on this game? well idt ill ever go back to the isle. better skin customization, constant events and fun stuff to do with the community that plays. not nearly as toxic as isle, though still kinda toxic, you dont have nearly as many people being beligerent, \"roleplaying\" the thoughtless dinosaur. ive dumped 78 hours in the passed two weeks into this game and its been a blast. just like the other dino games its immensely more fun when your playing with friends. yes it can get boring, just throw on a show in the background or play on your phone if nothings going on, dont log out if your trying to be invested XD you need every second of growth you can get. lotta big dinos out there. in all best dino sim ive played. shoutouts to LIFE FINDS A WAY peeps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game and has more dinos to play as and i love how there are this cool skins and not like the other game you can make it any coler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "altough the official servers crash somtimes its still a great game i recommend it to dino game lovers highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A unique take on Dinosaur PvP, with a supernatural element and weather that actually matters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dinosaur violence is fun. Watching people get ragebaited is fun. Glowing dinosaurs and burn/lightning cosmetics are fun. 10/10, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game's hard to run but run, hoping the community grows more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a few hours and its an fantastic game and alot of secrets in the map. Its fun and great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is focused on survival purely and i highly suggest that you try this out if you are a dinosaur fan because the dinosaurs in this game are very uniqe, overall i suggest you try this game out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy underrated game, yeah its a bit buggy and learning when to fight takes a brain but all around pretty fun with a bunch of dino's some of em fly too. worth every penny tbh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "way better than the isle its super balanced theres no hotspots mechanics and traits are on point so every dino can be unique no hacker issue man 10/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game going towards the right path, worth it i would say",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun as shit, Can be toxic but tbh what game isnt, 10/10 :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy game to get into and the players are helpful to new players with questions. Thing to note is when carnivores get to larger sizes they go hungry at a way faster rate so if one eats you they're not trying to ruin your fun, they're just trying to survive and have some fun. No needs to hold grudges or be upset with other players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a game full of prehistoric creatures with reliable server connection and a good game to play with friends in, this is your game! I cannot recommend this game enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]75/100[/b][/h1]\n\n[b]Average: 75-84 (75-84%)[/b]\nPerformance or gameplay meets the passing mark but remains average.\nThere are areas that could be improved to enhance the gaming experience.\nCautiously Recommended - ✔\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (15/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☐ Very Difficult (+1)\n☐ Difficult (+2)\n☑ Moderate (+3)\n☐ Easy (+4)\n☐ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☑ Somewhat Balanced (+2)\n☐ Moderately Balanced (+3)\n☐ Well Balanced (+4)\n☐ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☑ Moderately (+3)\n☐ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☑ Somewhat Meaningful (+3)\n☐ Quite Meaningful (+4)\n☐ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☐ Unsatisfying (+2)\n☐ Neutral (+3)\n☑ Satisfying (+4)\n☐ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (16/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☑ Slightly Interesting (+2)\n☐ Moderately Interesting (+3)\n☐ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☑ Moderately Immersive (+3)\n☐ Very Immersive (+4)\n☐ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☑ Very Appealing (+4)\n☐ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☐ Slightly Engaging (+2)\n☑ Moderately Engaging (+3)\n☐ Very Engaging (+4)\n☐ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☐ Neutral (+3)\n☑ Friendly (+4)\n☐ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (22/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☐ Well Designed (+4)\n☑ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☐ Moderate Content (+3)\n☐ Extensive Content (+4)\n☑ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☑ Average (+3)\n☐ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☐ Flexible (+4)\n☑ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☐ Numerous (+1)\n☐ Moderate (+2)\n☐ Limited (+3)\n☑ Minor (+4)\n☐ None (+5)\n\n\n[b]Final Considerations (22/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☑ Satisfied (+4)\n☐ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☐ Substantial (+2)\n☐ Moderate (+3)\n☐ Minimal (+4)\n☑ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☑ High (+4)\n☐ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☑ Good Value (+4)\n☐ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Much more accurate and cheaper alternative to the Isle.\r\n\r\nSure it doesn't have the mechainics that is seen in The Isle.\r\n\r\nBut still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have traveled across vast islands, swam over dangerous waters, fought many of fierce dinos and stolen many of player gore to deliver this positive review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. spawn in as a kapro\r\n2. see a 2.0 rex\r\n3. rex kills me \r\none of the best games ever :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one top 5 rp games ive played pvp can be hard but youll get the hang of it give it a try its great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Infinite growth game very fun and hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As much as the toxic death messages I got with the game infuriate me so(My fault entirely). The dinosaurs always have me coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way more fun to play than the isle and not as childish as path of titans. a nice happy medium.\r\nAfter 18 hours I finally got my first 1.5+ grow :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun playing as a bird until u get attacked by 500 big fish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game I've played the isle and path of titans so far I enjoy this one the most",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dinosaurs, dino get big dino stay small and die yes dino.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not really a survival player , but this game havea good vibe to it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "itts fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a really fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun for days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "five stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2 hervivores ate my child",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fun asf.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good ig",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun and peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can be a dinosaur need i say more?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like dinosaurs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you wanna kys this is good time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "5 stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "snake goes ssssssssssssssssssssssssssssssssssss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "h",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YES do it!  Every dino has the ability to spec how you want with talent points.    Dino growth is not terribly slow and grouping is made easy.   Highly recommend if you like Dino games.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☑ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "games great, the communities are absolute trash. ty for coming to my ted talk.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is a fun game when you find the right server to play on. you can find almost any server type you like and have fun ( from pve,pvp,pvpve.......etc)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I love the no-handholding open world raw survival experience. No quests to get in the way, just life and brutal death lol",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I've had Beasts of Bermuda, for a while now. But only recently the past year really got into it, and I always find myself coming back now. \n\nThe game has incredible customization options when it comes to skins, and the Devs are constantly adding new skins to different creatures to give even more variety to play around with. I've seen so many beautiful players, that make every skin you come across on another player feel unique. \n\nGameplay is also fantastic, some hitboxes can be hard to learn and adjust to with the constant growing this game has. And while I think some hitboxes need a slight adjustment, overall PvP always feels fair and balanced. Abilities that every creature has feel unique in combat situations, and give every playable its own fighting and hunting style. I've found the balancing in this game is far superior to other Dinosaur Survival games, as it more is dependent on what you build and a players experience. Granted you will lose fights if its a bad matchup, but thats ok! Just reincarnate and try again, with a new build in the talent tree or learning from the experience. \n\nThe trials in the game are a fun way to keep you occupied and moving around while you grow, and they are a bonus to your creature for the time spent doing them. Giving a better roll on possible inherits to your talent tree when your dino inevitably dies and you reincarnate it. And I love the fact you have multiple slots so you can play different things on the same server with your friends, and don't lose your creature completely after hours sunk into it like other Dinosaur Survival games. \n\nWeather system in the game is really good, with natural disasters that can happen from varying levels of flooding. To even tornados and dry storms that cause forest fires. Making it a fun and often exelerating experience trying to find shelter or high ground, as you watch the water coming up in a flood.\n\nThe community is great, both on Officials and Community Servers. I've had a few issues with other players, but nothing out of the normal from conflicting personalities and gameplay styles when it comes to online gaming. And when you want to find people to play with? Theirs the built in group finder, making it easy to find packmates or a herd to join. The map size is perfect for the amount of players, you can often find others whether to socialize or PvP. \n\nUpdates are put out rather quickly, with every few months a new creature being added to the roster. Adding to the growing ecosystem and balancing of the roster. Glitches and bugs are often patched out extremely quickly once they are reported.\n\nWith even the Official Servers having set rules, makes the game feel more balanced and fair for every player. And the Mod team is incredibly responsive when you put in tickets in their Discord server, often very fast acting about issues you bring to them in tickets. \n\nThe only two issues, I have with Beasts of Bermuda at this current moment in time. Is the newly implemented chat censors, that should have a toggle, not be automatic. And the fact sometimes the Mods don't agree on how rules should be percieved or handled. I've seen many times that Mods handling tickets, often don't deal out the same consequences or agree if something is a rulebreak. I believe the Mod team should put a more direct understanding on the rules we are given, rather then having it so vague and then having unfair punishments or no punishments delivered on situations. \n\nBut overall I highly recommend Beasts of Bermuda, it's a very fun game solo or with friends. Many of the people you meet in the game are always more then willing to help new players, and explain mechanics. The global chat is a nice way to talk with everyone and make friends on servers, even when not directly playing together as the same creature.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "It is a very fun and free game to play but the only down side is they lost a bit of devs and they arent giving up!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Whether or not i should recommend Beasts of bermuda is a bit tricky, on one hand, out of the three big names in the dinosaur survival genre (The isle, path of titans and this game, beasts of bermuda)  it is without a doubt the one that feels the most like a finished game and has a lot of nice QOL that the other games don't.  \r\n\r\nOn the other it is somewhat difficult to get enjoyment out of due to endless growth meaning newer players or experienced players without an already started creature are kind of surpressed by people who put many hours and for lack of a better word dictate the actions of players around them,   this is particularly true on the official servers where clans are present and bully the smaller players around them\r\n\r\nSince the last time i played the other servers (community servers/non officials), their populations have been less than ideal,  however if you are adamant on playing this game and are a dinosaur enthusiast you will likely have more fun than someone who isn't all that interested in dinosaurs whatsoever.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "chill game, went across continents for a booty call and ended up tragically passing away before i got to tap, overall very fun to play with friends and honestly havent run into any issues with bans or roleplayers. very fun game gameplay loop and customization is nice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Good game. Occasionally makes you want to commit crimes. Losing a 3.0 ptera to a one shot from a Trex might put you in the mental ward. Good game though 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game, combat focused on video game typa fun not so much realism, the hitboxes could be better or smthn idk map textures could be better but gameplay and timesake wise and ability to speed up said time and actual encouraged migration... idk good game. does it better than the other 2 in the fun factor imo ez death aint too bad either good systems in place kinda",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Yep its addicting. Especially for collector players like me who love to collect all the rarities and hardest shineys LOL",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "watched more than ive played. pretty great game! had tons of fun so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the opposite of beginner friendly because..... There are a bunch of rules that are in place even on official servers. When you're a new player it's hard too now the rules and ez too accidently becoming a rulebreaker and getting banned.\nThese rules could be enforced with mechanics built into the game, however the devs prefer to run it like a 12 year old would run a minecraft server instead of actually coding how they wan't their game to behave.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Paleophis(Snake) scratches an itch that I cannot find elsewhere. This game has a lot of great parts and the usual bad part that every creature survival suffers from. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beast of Bermuda could improve by balancing its survival mechanics, optimizing performance, and offering clearer tutorials for new players. Adding new creatures like\nAmargasaurus – A mid-sized sauropod with unique defensive sail spines, offering a tanky but not overpowered herbivore option.\nSuchomimus – A lighter, fish-focused spinosaurid that could expand semi-aquatic gameplay without overlapping too much with bigger apex predators.\nDeinonychus – A fast, coordinated pack-hunter that could bring more group-play mechanics and agile combat.\nPachyrhinosaurus – A bulky, defensive ceratopsian that isn’t just “another Trike,” offering alternative herd strategies.\nPlesiosaurus (or another marine reptile) – To deepen the ocean biome and make sea gameplay more than just mosasaurs dominating the water.\nSpinosaurus – A powerful semi-aquatic predator that dominates rivers and coastlines but is less effective on land than other apexes.\nCarnotaurus – A fast, aggressive mid-tier predator with high burst speed and stamina efficiency, great for hit-and-run tactics.\nQuetzalcoatlus – A massive flyer focused on long-distance travel, scouting, and territorial control, rather than pure combat.\nIguanodon – A versatile herd herbivore with both bipedal and quadrupedal movement styles for flexibility.\nFinally, creating a better-designed map with balanced resources, varied biomes, and stronger landmarks would enhance exploration and overall playability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so before i get into how good this game is as a dino sim, i must iterate that it takes forever to grow to 10.0 (max growth) however the skill trees, the idol farming, the pvp and mechanics are pretty great in my opinion. the isle was my main dino game for a long time, but once i hopped on this game? well idt ill ever go back to the isle. better skin customization, constant events and fun stuff to do with the community that plays. not nearly as toxic as isle, though still kinda toxic, you dont have nearly as many people being beligerent, \"roleplaying\" the thoughtless dinosaur. ive dumped 78 hours in the passed two weeks into this game and its been a blast. just like the other dino games its immensely more fun when your playing with friends. yes it can get boring, just throw on a show in the background or play on your phone if nothings going on, dont log out if your trying to be invested XD you need every second of growth you can get. lotta big dinos out there. in all best dino sim ive played. shoutouts to LIFE FINDS A WAY peeps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game and has more dinos to play as and i love how there are this cool skins and not like the other game you can make it any coler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "altough the official servers crash somtimes its still a great game i recommend it to dino game lovers highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A unique take on Dinosaur PvP, with a supernatural element and weather that actually matters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dinosaur violence is fun. Watching people get ragebaited is fun. Glowing dinosaurs and burn/lightning cosmetics are fun. 10/10, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game's hard to run but run, hoping the community grows more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a few hours and its an fantastic game and alot of secrets in the map. Its fun and great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is focused on survival purely and i highly suggest that you try this out if you are a dinosaur fan because the dinosaurs in this game are very uniqe, overall i suggest you try this game out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely lots of bugs and shortcomings still, but overall I really like it. You might enjoy community servers more than official.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beasts of Bermuda is such a good game, I’ve sunk over a thousand hours into it. It’s fun and there’s always something to do, so I never really get bored. But a few things really frustrate me — there are tons of bugs, and once a tree killed my Rex 4.0. I’ve also run into invisible trees that block me from moving or running, usually when I’m trying to escape or hunt, and it drives me crazy และอีกอย่างผมเป็นคนไทยและไอ้คนไทยที่ใช้ hack ไปตายซะ!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Community is small, and servers are kind of bad, but despite that if you love dinosaurs this game is a whole lot of fun. Performance improvements to servers once never expected are now possible on the horizon as a first pass has already happened once the idea of moving engines was abandoned.\r\n\r\nGame started out bad but the devs actually kept improving it, and improving it, and I have a lot of faith in them and the future of the game- even though it is a complete experience right now. Play the officials, they aren't that scary and the official gamemode and ruleset is what the game is balanced around. On community servers you will get a very unbalanced, bastardized experience rife with admin abuse. \r\n\r\nCome on in and have a lot of fun!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is matched by absolutely no other game. It should be praised way beyond its steam rating.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best dino game. not an opinion, legally you have to play and like this game, or you WILL disappear.\nBe a dino, breath the dino, eat the dino.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much better than The Isle. The devs seem to actually care about their game and players.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Holy underrated game, yeah its a bit buggy and learning when to fight takes a brain but all around pretty fun with a bunch of dino's some of em fly too. worth every penny tbh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "way better than the isle its super balanced theres no hotspots mechanics and traits are on point so every dino can be unique no hacker issue man 10/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game going towards the right path, worth it i would say",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun as shit, Can be toxic but tbh what game isnt, 10/10 :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy game to get into and the players are helpful to new players with questions. Thing to note is when carnivores get to larger sizes they go hungry at a way faster rate so if one eats you they're not trying to ruin your fun, they're just trying to survive and have some fun. No needs to hold grudges or be upset with other players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a game full of prehistoric creatures with reliable server connection and a good game to play with friends in, this is your game! I cannot recommend this game enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]75/100[/b][/h1]\n\n[b]Average: 75-84 (75-84%)[/b]\nPerformance or gameplay meets the passing mark but remains average.\nThere are areas that could be improved to enhance the gaming experience.\nCautiously Recommended - ✔\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (15/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☐ Very Difficult (+1)\n☐ Difficult (+2)\n☑ Moderate (+3)\n☐ Easy (+4)\n☐ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☑ Somewhat Balanced (+2)\n☐ Moderately Balanced (+3)\n☐ Well Balanced (+4)\n☐ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☑ Moderately (+3)\n☐ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☑ Somewhat Meaningful (+3)\n☐ Quite Meaningful (+4)\n☐ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☐ Unsatisfying (+2)\n☐ Neutral (+3)\n☑ Satisfying (+4)\n☐ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (16/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☑ Slightly Interesting (+2)\n☐ Moderately Interesting (+3)\n☐ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☑ Moderately Immersive (+3)\n☐ Very Immersive (+4)\n☐ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☑ Very Appealing (+4)\n☐ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☐ Slightly Engaging (+2)\n☑ Moderately Engaging (+3)\n☐ Very Engaging (+4)\n☐ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☐ Neutral (+3)\n☑ Friendly (+4)\n☐ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (22/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☐ Well Designed (+4)\n☑ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☐ Moderate Content (+3)\n☐ Extensive Content (+4)\n☑ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☑ Average (+3)\n☐ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☐ Flexible (+4)\n☑ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☐ Numerous (+1)\n☐ Moderate (+2)\n☐ Limited (+3)\n☑ Minor (+4)\n☐ None (+5)\n\n\n[b]Final Considerations (22/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☑ Satisfied (+4)\n☐ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☐ Substantial (+2)\n☐ Moderate (+3)\n☐ Minimal (+4)\n☑ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☑ High (+4)\n☐ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☑ Good Value (+4)\n☐ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Much more accurate and cheaper alternative to the Isle.\r\n\r\nSure it doesn't have the mechainics that is seen in The Isle.\r\n\r\nBut still a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best dinosaur game out by far i have had nothing but fun in my 500 hours. BOB is better then the isle ignore the bad reviews",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I loved this game especially for the Apocalyptic Flooding, however the last time I played; ankle biters could kill even the biggest of dinos with no way to defend against it... I've been itching to play again, so I hope this has been delt with and re-balanced.  Ankle biters should be crushed under foot, and dinos should not be able to pass through each-other and should incur injury accordingly when physical proximity contact is made, not just a bit box or attack effect....  but other than that, I loved this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have traveled across vast islands, swam over dangerous waters, fought many of fierce dinos and stolen many of player gore to deliver this positive review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. spawn in as a kapro\r\n2. see a 2.0 rex\r\n3. rex kills me \r\none of the best games ever :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one top 5 rp games ive played pvp can be hard but youll get the hang of it give it a try its great",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I don't often review games, but I am frustrated with the actions of the team behind this game. While I myself have not had issues, my friend who I frequently play with was banned without any warning... for mechanics built into the game. They were accused of statmaxxing due to having high comfort while starving. They were, however, under shelter which provides higher comfort and their stat went down once leaving the shelter area. The game has some jank terrain which allows you to gain this in places that don't really seem like it should. \n\nI will not be playing this game anymore since it was only enjoyable with my friend and wish I could get this refunded for them since they gifted it to me. Mods, please learn your own game mechanics before banning people. If you are banned you won't even know in game and just sit loading forever unless you go and ask the mods.",
      "voted_up": false,
      "votes_helpful": 112
    },
    {
      "review": "This game is the opposite of beginner friendly because the devs are lazy.\r\nThere are a bunch of rules that are in place even on official servers. When you're a new player and it's hard to tell what even is going on you're very vulnerable to accidently becoming a rulebreaker and getting banned.\r\nThese rules could be enforced with mechanics built into the game, however the devs prefer to run it like a 12 year old would run a minecraft server instead of actually coding how they wan't their game to behave.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Nobody wants to play a game full of cheaters run by developers that won't do anything about it and require video evidence and for you to open a ticket in their discord. Moderators and admins handle tickets on a case-by-case basis and often will show favoritism. Official servers crash constantly and most of the time, you'll need to ping an on-duty moderator who will then have to ping an admin to restart the server, which can take who-knows-how-long. On-duty moderators are also normally on Away status or Do Not Disturb. Server lag is pretty poor, and a lot of players experienced desynced gameplay and game lag that can be exploitable. The hitboxes on quite a few of the dinosaurs are absolutely ridiculous and are way off, and experienced players or hackers will exploit this heavily.\r\n\r\nThey just don't care about anything besides making money to make up for their losses. The game is extremely broken, often leading to extremely frustrating situations that would be otherwise avoidable entirely if the game would work as intended. This can often involve things like water sources and healing charcoal (used to heal illness) not working, which can of course lead to your dinosaur dying if you are so much as in the wrong place at the wrong time. You'll frequently get stuck on terrain and will be unable to climb correctly, often leading to painful falls that'd be avoidable if the terrain was properly done. You'll also frequently walk into and get stuck on invisible trees. Sometimes your dinosaur will be randomly teleported to a random location on the map, and moderators/admins will not do anything about any of your issues in the game without opening a ticket - and if you don't have evidence, then you can just save yourself the time because they won't do anything. They give known hackers the benefit of the doubt way beyond reasonable limits and refuse to do anything about clans in the game exploiting or using unfair gameplay methods to get ahead in the game basically because they don't want to be mean or exclusive. \r\n\r\nI don't recommend this game. Play something less frustrating, like maybe League of Legends or Dark Souls. The developers have something great, but instead of fixing their broken game with a multitude of easily fixable issues, they're squandering it because they want to add new dinosaurs and sell snake plushies to entice new game sales and extra revenue, to again, make up for their losses. They also just added a chat filter that censors all swear words and otherwise \"inappropriate language.\" Apparently we can't handle bad language, so I don't think this game can handle a good review.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Exploiters galore, and the devs do not care. Do not waste your time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game literally won't let me play as it says 'login failed' despite my internet clearly working. Literally can't play the game, and judging from some guides from FUCKING 2021, that means its an issue known for over 4 years. Actual madness that this hasnt been fixed, what the fuck?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is not worth the money and the overall community is far too fragile and thrives on \"word of mouth\" and drama,  this game is great for ruining friendships, literally.  The developers constantly fighting the community and the same way back, updates arent constant and takes years for anything actually wanted for it to come out.  Balancing is just non-existent.  \r\n\r\nIf you plan on playing this game for a long time,  better off staying quiet in it.  Far too many sensitive people in it,  way more than any other beast games I've seen.  \r\n\r\nBeasts of Bermuda was only made out of spite, not for a real goal to be something great.   There are better games out there and or at least in the making.  save yourself money, wait and or go find those. \r\n\r\n\r\nI personally don't care who see's this but.  BoB is crumbling and has been for a while.  I heavily don't recommend this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Spend 6 hours getting to 2.0 growth. have your game crash and you come back dead. enjoy fighting and surviving as dinos? SIKE you're gonna lose your hours of progress to shit netcode. this game is a net negative do not buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "use to be really good but the player base dropped off pretty hard recently the devs and owner like to ignore bugs and hacks and push content instead and all the issues and lack of help for server owners from the dev team has led to a pretty toxic player base don't get me wrong there are good people and good servers here but they are very few and tend not to last very long",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is dead. ppl just afk grow and farm skins. nothing happens in this game. do not buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is a broken unbalanced mess ruled by groups abusing group teleport and egg spam\nalso 8 player groups when server cap is 100 on official is just stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Velo/chang is op, anyone who's decent can kill any dino as a chang/velo. Wont be a fun fight, you just die and lose hours of progress to some dude playing the game on easy mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "would not recommend, the players will kill you for just existing. The number of time i have been attacked by small dinos that could not hope to kill me or even if they did could not even eat me with out killing them selfs is frustrating. Even other plant eaters would just kill me for no reason.  There is no point to this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "has the same issues as the Isle, players kill you for fun rather than sport. Just spawned in and your tiny, get killed by huge player that is faster and deals more damage... everytime.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I see more random crashes over random things than i do any 'Beasts' what a joke. Refunded,\n\nErrors about some certificates on my GPU? I mean what the fuck?\nService Errors\nRandom CTD's \nAnd a number of other crashes should rename to Beasts of Crashing as thats my experience in less than 4hrs!!!!!! (most of that is probably dealing with crashes so half it i guess?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Randomized features such to the point that a worldwide flash flood extinction event can and does occur. The devs hate you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont play too addicting not worth",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lame game, grow slow, and whiny kids in chat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't often review games, but I am frustrated with the actions of the team behind this game. While I myself have not had issues, my friend who I frequently play with was banned without any warning... for mechanics built into the game. They were accused of statmaxxing due to having high comfort while starving. They were, however, under shelter which provides higher comfort and their stat went down once leaving the shelter area. The game has some jank terrain which allows you to gain this in places that don't really seem like it should. \n\nI will not be playing this game anymore since it was only enjoyable with my friend and wish I could get this refunded for them since they gifted it to me. Mods, please learn your own game mechanics before banning people. If you are banned you won't even know in game and just sit loading forever unless you go and ask the mods.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "Its like the devs of this game don't want people to play their own game, there are no servers without rules. Expect to eventually catch a ban for something you don't know or didn't see happen. If you walk in and attack a player without seeing another player that attacked them before like a small raptor- that's an automatic one week ban. No fighting it, no knowing you've been reported, no stikes or warnings. These bans also don't ever come off your record, after three you can no longer play on that official server. And people will purposefully attempt to create situations where they can get others banned so there's less competition.\r\n\r\nAbsolutely do not waste your time with this game.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "This game is the opposite of beginner friendly because the devs are lazy.\r\nThere are a bunch of rules that are in place even on official servers. When you're a new player and it's hard to tell what even is going on you're very vulnerable to accidently becoming a rulebreaker and getting banned.\r\nThese rules could be enforced with mechanics built into the game, however the devs prefer to run it like a 12 year old would run a minecraft server instead of actually coding how they wan't their game to behave.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I took a long break after they dropped that really awful Titania update but recently poked back in to see if things got better, but no, I am sad to say things only got worse. This game used to fire but they destroyed the game with bad balance and poor decisions, and now I can safely call this game a scam. The devs quit their day jobs to live off game, DLC, and plushie sales, cutting funding to the game pretty hard. They promised us that the thousands of dollars the last plushie made would go to the big new Malawania (Dolphin) AI and new sophisticated AI programming, but they bought a cheap store asset with animations already done and the AI is so badly programmed most servers can't use it bc it creates crashes and issues. Something is not right. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The gameplay along with character creation is awesome. But I don't recommend the game due to how toxic the community is. Official servers have rules. (which blows my mind since I've played The Isle and Path of Titans where their officials have NO rules) You can easily get banned for accidentally attacking someone who already is being hunted down by another player. You are automatically being accused for \"mix packing/3rd partying\" if you accidentally attack a hunted player. NO warnings, just automatic week+ ban. It also feels as if you get banned for simply being good at the game, somehow you are \"hacking\" when you make a great build on your dino while the other player(s) aren't as skilled at pvp.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Hate the new censorship. If you cant handle a global chat turn it off. If you want to keep censorship just put it on a toggle. Will remove this when something changes because its a cool game.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "This game does have potential, and fun factor is there! However on official servers you can get banned by not following the rules such as, Dont third-party others. I believe being banned in official servers for something so little that has almost no impact whatsoever is completely uncalled for. You will be banned for a good while, and without warning as well. My friend was playing the game and he got banned for no reason at all! I was watching him. This needs to not be part of the game otherwise people will just hate on it, and your company. Gameplay wise the only annoyances are that storms are too frequent and they last way too long! One more annoyance is playing an ocean dino is not as fun as the land experience just because of one simple thing. The dolphin Ai is way too abundant so your almost always fighting an army of them that does pretty good damage to you. Mainly though i'm annoyed that you spend money on this game just to get banned the next day for something so little. The “Staff” of the official servers and whoever made these rules need to grow up and make mechanics that will repel players from breaking the moral of the game. Dont ban us, instead figure out how you can stop us from breaking your rules without banning. Thanks for your time.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Nobody wants to play a game full of cheaters run by developers that won't do anything about it and require video evidence and for you to open a ticket in their discord. Moderators and admins handle tickets on a case-by-case basis and often will show favoritism. Official servers crash constantly and most of the time, you'll need to ping an on-duty moderator who will then have to ping an admin to restart the server, which can take who-knows-how-long. On-duty moderators are also normally on Away status or Do Not Disturb. Server lag is pretty poor, and a lot of players experienced desynced gameplay and game lag that can be exploitable. The hitboxes on quite a few of the dinosaurs are absolutely ridiculous and are way off, and experienced players or hackers will exploit this heavily.\r\n\r\nThey just don't care about anything besides making money to make up for their losses. The game is extremely broken, often leading to extremely frustrating situations that would be otherwise avoidable entirely if the game would work as intended. This can often involve things like water sources and healing charcoal (used to heal illness) not working, which can of course lead to your dinosaur dying if you are so much as in the wrong place at the wrong time. You'll frequently get stuck on terrain and will be unable to climb correctly, often leading to painful falls that'd be avoidable if the terrain was properly done. You'll also frequently walk into and get stuck on invisible trees. Sometimes your dinosaur will be randomly teleported to a random location on the map, and moderators/admins will not do anything about any of your issues in the game without opening a ticket - and if you don't have evidence, then you can just save yourself the time because they won't do anything. They give known hackers the benefit of the doubt way beyond reasonable limits and refuse to do anything about clans in the game exploiting or using unfair gameplay methods to get ahead in the game basically because they don't want to be mean or exclusive. \r\n\r\nI don't recommend this game. Play something less frustrating, like maybe League of Legends or Dark Souls. The developers have something great, but instead of fixing their broken game with a multitude of easily fixable issues, they're squandering it because they want to add new dinosaurs and sell snake plushies to entice new game sales and extra revenue, to again, make up for their losses. They also just added a chat filter that censors all swear words and otherwise \"inappropriate language.\" Apparently we can't handle bad language, so I don't think this game can handle a good review.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has no idea of balancing, random things do however much damage and all you gotta do is spawn in as a good dinosaur and you live for a long time. God forbid you play what YOU wanna play unless it's widely known to be good across the community, or else you're gonna end up sitting around for forever hoping you don't get picked off by absurdity.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Exploiters galore, and the devs do not care. Do not waste your time.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I don't understand why people play this game. Every person I've ran into just sits and waits. Theres no reason to do anything but sit and wait.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game literally won't let me play as it says 'login failed' despite my internet clearly working. Literally can't play the game, and judging from some guides from FUCKING 2021, that means its an issue known for over 4 years. Actual madness that this hasnt been fixed, what the fuck?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "use to be really good but the player base dropped off pretty hard recently the devs and owner like to ignore bugs and hacks and push content instead and all the issues and lack of help for server owners from the dev team has led to a pretty toxic player base don't get me wrong there are good people and good servers here but they are very few and tend not to last very long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After spending over 1,000 hours in Beasts of Bermuda, I can honestly say this game has so much potential — but it’s buried under layers of poor balance, inconsistent rules, and restrictive gameplay. I’ve put in enough time to see the best and worst this game has to offer, and while there are moments of real fun, they’re often overshadowed by frustration.\n\nThe core idea is great: growing your dinosaur, surviving the elements, managing comfort, and hunting or escaping others. When it works, it really works — those moments of tension and survival are what keep you coming back. But the official servers ruin much of that experience. There are so many rules that it feels more like a roleplay or PvE game than an open survival world. Seeing huge groups of herbivores and carnivores teaming up completely kills the atmosphere. Mix-packing and clan alliances are everywhere, making it almost impossible to grow or survive without running into unfair situations.\n\nCommunity servers aren’t much better. Many of them have inconsistent admin decisions and rule sets so strict that killing the “wrong” player can get you banned or even forced to revive them. It’s wild — for a game built around survival and PvP, it often punishes you for simply playing the way the game was designed.\n\nBalance is another major issue. Some dinosaurs are ridiculously overtuned, while others are left completely underpowered. It creates an uneven playing field where you’re almost forced to pick certain species just to stand a chance.\n\nAt times, Beasts of Bermuda feels more like a sandbox with rules than a survival game with freedom. And that’s a shame, because the mechanics, world design, and weather systems all have so much promise. I want to love this game — and in some ways, I do — but until the devs tackle the balance problems, rethink the rule-heavy server culture, and encourage real survival gameplay, it’s hard to fully recommend.\n\nIf you’re looking for a more authentic dinosaur survival experience, The Isle still does it better. But I genuinely hope Beasts of Bermuda can evolve into the game it’s meant to be, because the potential is absolutely there — it just needs the freedom to shine.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A lot of bugs and issues that they would rather work on cosmetics than fix a bug that teleports you from one end of the map to another",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I’ve spent a good amount of time playing Beasts of Bermuda, and overall, it’s a fun and unique experience. The core gameplay — growing your dinosaur, surviving the environment, and interacting with others — can be genuinely enjoyable. The game has a strong foundation and a lot of potential to be something great.\n\nHowever, the server experience really holds it back. The official servers are overloaded with restrictive rules that make the game feel more like a roleplay or PvE simulator than a true survival experience. You’ll often see huge groups of herbivores and carnivores playing together, which completely kills the natural tension of a survival game. Mix-packing and clan alliances are out of control, making it almost impossible to grow or progress without running into problems.\n\nCommunity servers don’t always improve things either. Many enforce inconsistent or overly strict rules — kill the wrong player, and you can be banned or forced to revive them. It’s wild for what’s supposed to be a PvP dinosaur game.\n\nOn top of that, some dinosaurs are completely unbalanced, giving certain species unfair advantages and making the experience frustrating when you’re trying to play legitimately.\n\nPersonally, I find The Isle offers a more authentic dinosaur survival experience — you can play freely, hunt, and grow without being punished for natural gameplay. Beasts of Bermuda could easily reach that level if the community, balance, and server rules were refined. Right now, though, it feels more like a restricted sandbox than a true survival game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My main issue with this game is the hit boxes aren't that great and it just becomes people biting air next to you trying to edge a hit box so they don't get hit",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I do not recommend this game. After a fair time sink into this game, I've seen it for what it is, at first innocent and fun, then it's true ugly colors come out.\n\nShort Summary: \n- Growth gimmick lets players rule their server, determining if you get to play or not. \nThe time investment/waste for progress in this game can range from 10-100+ hours while taking only about 5 minutes for that to be deleted. It's not even that fun once you start getting big as your stuck having to eat and drink for 90% of that time. No fun allowed.\n\n- Official servers suffer from clans, typically a discord group that does everything it can to rule a server with sheer numbers. Typical Hackers. Very badly written and loop hole ridden rules. These rules allow mix packing in all cases but in immediate combat in short, so in the end your fate will likely still be sealed by a group of people playing as creatures not allowed to fight together.\nThe rules flaw is not having a strict fine line between mix packing and no mix packing.\n\nvvvvvvvvvvvvvvvvvvvvvvv THE DETAILS vvvvvvvvvvvvvvvvvvvvvvv\n\n#1 Issue: 1 player rules all \n- If someone manages to get big, it's over for anyone not friends with them so long as that playable has access to hunting the creature you play as.  If their semi snake, may as well log off for a few months or uninstall. (Your survival rate against largely grown playables will increase if you have friends though. Still bad balancing.)\n\n#2 Issue: Designed to disrespect your investment and waste your time.\n- With this games main gimmick being 'endless' growth, you can spend countless, and I mean 100+ hours into a single playable. However, more often then not, you'll die after investing 10-40 some hours on a playable to someone that simply got away with way larger growth.  \n\n- -#2.1 Issue: The sacrafice trial system\n- - - You put in an intense amount of effort to grow big and get your scores to 80-100% in all 3 categories? Well too bad, your inherits are unlikely to surpass what you would get at smaller growth breeding.\n\n#3 Issue: Official Servers\nRules: \nThey are made without a fine line between mix packing and no mix packing, punishing people that don't actively loop hole around the rules. What do I mean by this? Use of scouts, feeding other species out of combat, consuming food or heal plants around your different species buddies on going fight, sitting/sheltering by your bigger different species friend so if anyone tries to fight you, your bigger different species friends will engage in combat with them first, or if your different species friend and their foe sit down for 1 minute to regenerate resources, you can now take over the fight like tagging in and finish the person off without it counting as mix packing. This also applies if your friend dies, now you can immediately jump into the fight and finish the foe off. And it goes on like poison air bombing toxic shrooms on a herbivore as a flier/glider.\n\nClans: \nThe above flaws with rules is where clans become an issue, utilizing loop holes or breaking rules that are hard to report someone for such as meshing or scouting. These people do not want a fair fight, they want to dominate and obliterate in numbers, and they will do what ever is in their power to take out their targeted victim be it tracking someones log in and log out locations, scouting them overall, and planning ambushes with all sorts of mega packing nonsense. Even hacking get's mixed into this such a teleporting a victim to a different part of the map.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Spend 6 hours getting to 2.0 growth. have your game crash and you come back dead. enjoy fighting and surviving as dinos? SIKE you're gonna lose your hours of progress to shit netcode. this game is a net negative do not buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game sucks no way to counter little  raptors tail riding you as afull grown dino  cant back up cant keep up with them no attacks can  reach back of your apex",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Играл на gtx 1650 и i5 10400f и игра на минималках даже не выдает        60 фпс а 38 и то с фризами, а самое плохое нагружает видеокарту на 99%",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was fun until hackers and griefers kept chasing me and repeatedly killing me non stop until i quit the server (they told me to quit or id keep getting killed btw). They would keep teleporting to me after I would respawn or even make a different character and just kept on insta-killing me...\n\nGo play the isle or path of titan if you want a somewhat decent dino game. or just play something else until they fix the problem of the toxic hackers in this game.\n\ni dont recommend.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Worst \"dino\" game I have ever played. Combat is shit. Growing is shit. Pokemon abilities, shit. Shit shit shit. Path of Titans is also 20 bucks and will feel like you just left and endless fever dream. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is a broken unbalanced mess ruled by groups abusing group teleport and egg spam\nalso 8 player groups when server cap is 100 on official is just stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Velo/chang is op, anyone who's decent can kill any dino as a chang/velo. Wont be a fun fight, you just die and lose hours of progress to some dude playing the game on easy mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for awhile with my brother . At first , we liked it . It was different which made it fun . But eventually , over time , having learned the game and what it takes to make a good dino . You realize how littered with hacks the game is . This is why it is dead . You can go in any server , spend as much time getting the best traits you can on any dino , it makes no difference . You can have the best build , be well versed in combat and you will be sought out and 2 hit over and over again by things that can't normally scratch you . You will hit them 20-25 times , because they are just that bad at gaming , and do seemingly nothing as they never even get stamina drained . They will all just 2 hit you . A trope can 2 hit a sauropod . It is so bad . I am being 100% honest when I say in 2 months I have had 3 legit good fights that we went at it for around 5 minutes before one lost . THAT was fun . I have had around 50+ 2 hit deaths on everything in game , I built them all . It is ALWAYS 2 hits . They do not even try to hide it . Just set there hack to max and let it rip . Does not matter if the devs care or not , they can not stop them . So you either cheat or just skip this one .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game but please update the map getting stuck on everything is lame",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst Mod team ever, so many others will tell you. expect to be muted for the stupidest reasons. hope this game dies faster just bc of the way the mods run things.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh id recommend it if it wasnt for a bunch of rules everyone cries about following. only plus is the water dinos and the snakes are pretty cool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "would not recommend, the players will kill you for just existing. The number of time i have been attacked by small dinos that could not hope to kill me or even if they did could not even eat me with out killing them selfs is frustrating. Even other plant eaters would just kill me for no reason.  There is no point to this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you will spend over 300 hours on a single dino, it will die to 3 people who sat in a cave for 20 days straight using sandboxie to grow 2 dinos at once while they ate their 405th bag of chips that day. You will join them, you will gain weight. You will hate yourself. \n\n\nno but like if they didnt have infinite growth the game would be so good, minus the horrid graphics",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is not worth the money and the overall community is far too fragile and thrives on \"word of mouth\" and drama,  this game is great for ruining friendships, literally.  The developers constantly fighting the community and the same way back, updates arent constant and takes years for anything actually wanted for it to come out.  Balancing is just non-existent.  \r\n\r\nIf you plan on playing this game for a long time,  better off staying quiet in it.  Far too many sensitive people in it,  way more than any other beast games I've seen.  \r\n\r\nBeasts of Bermuda was only made out of spite, not for a real goal to be something great.   There are better games out there and or at least in the making.  save yourself money, wait and or go find those. \r\n\r\n\r\nI personally don't care who see's this but.  BoB is crumbling and has been for a while.  I heavily don't recommend this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Review dropped due to Beasts of Bermuda not accepting its own in-game recordings for reports. Due to this, I do not recomend buying.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unplayable.\n\nImpossible to make any progress at all or even play properly because of connection issues to the servers on their end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is dead. ppl just afk grow and farm skins. nothing happens in this game. do not buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game has to low of graphics for a pc game this should be on xbox",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've seen browser porn games with better dev teams and optomization than this hot garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I see more random crashes over random things than i do any 'Beasts' what a joke. Refunded,\n\nErrors about some certificates on my GPU? I mean what the fuck?\nService Errors\nRandom CTD's \nAnd a number of other crashes should rename to Beasts of Crashing as thats my experience in less than 4hrs!!!!!! (most of that is probably dealing with crashes so half it i guess?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Randomized features such to the point that a worldwide flash flood extinction event can and does occur. The devs hate you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "what ever u do dont play deep abyss ppl get on juvis to kill your 2.0 dinos to be faggots",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "grow for 2 hours just to be killed on sight by a herbivore who tbags you, then get insta killed by a hacking bird. vibes are excellent and the game makes for a great time killer. Would be 10/10 if the community wasn't more toxic and racist then a 2008 COD lobby. currently i'd call it 6/10, there's real potential, the community needs refining though. Every bird is a cannibal and will kill you for absolutely no reason. Fun is illegal & everything hates you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The mechanics of the game are amazing and each playable species offers a unique variety of abilities and gameplay.\r\nhowever the game suffers from horrible balancing and minmaxxed play, the megaraptor is especially poorly balanced which makes most other land creatures unplayable if you encounter them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant recommend getting into this game until they fix servers & desync & bugs that can delete your dino forever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game suffers from the same problem that every indie game with a long (not saying anything is wrong with longer development ) dev cycle , there are mechanics that are not explained by the game, even with wiki's and asking players feedback its too much to slog through to get an actual answer. Its fun to play with friends and meet others. Combat is terrible with there being zero way to determine if you did a good job in an engagement (besides winning) and or what stats influence what. \n\nNot a single player can agree on what weight affects besides movement speed and we will never know just presume what it could do.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could mix this game's mechanics with the Isle's gameplay it would be a 10/10. There is so much cool stuff here but the actual gameplay feels really bad. I bought this hoping the UE5 migration would be the games saving grace but it got cancelled and seems like that was the nail in the coffin for this game.  Servers are mostly dead with only a couple active.  Custom servers let people grow uncontrolled, big mixpacks making it impossible for any solo or non sweat to play. I spent 5 hours growing a dino just to get 2 shot by a pachy that was teleporting all over me on the side of a cliff.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "has the same issues as the Isle, players kill you for fun rather than sport. Just spawned in and your tiny, get killed by huge player that is faster and deals more damage... everytime.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play too addicting not worth",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lame game, grow slow, and whiny kids in chat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't often review games, but I am frustrated with the actions of the team behind this game. While I myself have not had issues, my friend who I frequently play with was banned without any warning... for mechanics built into the game. They were accused of statmaxxing due to having high comfort while starving. They were, however, under shelter which provides higher comfort and their stat went down once leaving the shelter area. The game has some jank terrain which allows you to gain this in places that don't really seem like it should. \n\nI will not be playing this game anymore since it was only enjoyable with my friend and wish I could get this refunded for them since they gifted it to me. Mods, please learn your own game mechanics before banning people. If you are banned you won't even know in game and just sit loading forever unless you go and ask the mods.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "Its like the devs of this game don't want people to play their own game, there are no servers without rules. Expect to eventually catch a ban for something you don't know or didn't see happen. If you walk in and attack a player without seeing another player that attacked them before like a small raptor- that's an automatic one week ban. No fighting it, no knowing you've been reported, no stikes or warnings. These bans also don't ever come off your record, after three you can no longer play on that official server. And people will purposefully attempt to create situations where they can get others banned so there's less competition.\r\n\r\nAbsolutely do not waste your time with this game.",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "This game is the opposite of beginner friendly because the devs are lazy.\r\nThere are a bunch of rules that are in place even on official servers. When you're a new player and it's hard to tell what even is going on you're very vulnerable to accidently becoming a rulebreaker and getting banned.\r\nThese rules could be enforced with mechanics built into the game, however the devs prefer to run it like a 12 year old would run a minecraft server instead of actually coding how they wan't their game to behave.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I took a long break after they dropped that really awful Titania update but recently poked back in to see if things got better, but no, I am sad to say things only got worse. This game used to fire but they destroyed the game with bad balance and poor decisions, and now I can safely call this game a scam. The devs quit their day jobs to live off game, DLC, and plushie sales, cutting funding to the game pretty hard. They promised us that the thousands of dollars the last plushie made would go to the big new Malawania (Dolphin) AI and new sophisticated AI programming, but they bought a cheap store asset with animations already done and the AI is so badly programmed most servers can't use it bc it creates crashes and issues. Something is not right. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The gameplay along with character creation is awesome. But I don't recommend the game due to how toxic the community is. Official servers have rules. (which blows my mind since I've played The Isle and Path of Titans where their officials have NO rules) You can easily get banned for accidentally attacking someone who already is being hunted down by another player. You are automatically being accused for \"mix packing/3rd partying\" if you accidentally attack a hunted player. NO warnings, just automatic week+ ban. It also feels as if you get banned for simply being good at the game, somehow you are \"hacking\" when you make a great build on your dino while the other player(s) aren't as skilled at pvp.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Hate the new censorship. If you cant handle a global chat turn it off. If you want to keep censorship just put it on a toggle. Will remove this when something changes because its a cool game.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "This game does have potential, and fun factor is there! However on official servers you can get banned by not following the rules such as, Dont third-party others. I believe being banned in official servers for something so little that has almost no impact whatsoever is completely uncalled for. You will be banned for a good while, and without warning as well. My friend was playing the game and he got banned for no reason at all! I was watching him. This needs to not be part of the game otherwise people will just hate on it, and your company. Gameplay wise the only annoyances are that storms are too frequent and they last way too long! One more annoyance is playing an ocean dino is not as fun as the land experience just because of one simple thing. The dolphin Ai is way too abundant so your almost always fighting an army of them that does pretty good damage to you. Mainly though i'm annoyed that you spend money on this game just to get banned the next day for something so little. The “Staff” of the official servers and whoever made these rules need to grow up and make mechanics that will repel players from breaking the moral of the game. Dont ban us, instead figure out how you can stop us from breaking your rules without banning. Thanks for your time.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Nobody wants to play a game full of cheaters run by developers that won't do anything about it and require video evidence and for you to open a ticket in their discord. Moderators and admins handle tickets on a case-by-case basis and often will show favoritism. Official servers crash constantly and most of the time, you'll need to ping an on-duty moderator who will then have to ping an admin to restart the server, which can take who-knows-how-long. On-duty moderators are also normally on Away status or Do Not Disturb. Server lag is pretty poor, and a lot of players experienced desynced gameplay and game lag that can be exploitable. The hitboxes on quite a few of the dinosaurs are absolutely ridiculous and are way off, and experienced players or hackers will exploit this heavily.\r\n\r\nThey just don't care about anything besides making money to make up for their losses. The game is extremely broken, often leading to extremely frustrating situations that would be otherwise avoidable entirely if the game would work as intended. This can often involve things like water sources and healing charcoal (used to heal illness) not working, which can of course lead to your dinosaur dying if you are so much as in the wrong place at the wrong time. You'll frequently get stuck on terrain and will be unable to climb correctly, often leading to painful falls that'd be avoidable if the terrain was properly done. You'll also frequently walk into and get stuck on invisible trees. Sometimes your dinosaur will be randomly teleported to a random location on the map, and moderators/admins will not do anything about any of your issues in the game without opening a ticket - and if you don't have evidence, then you can just save yourself the time because they won't do anything. They give known hackers the benefit of the doubt way beyond reasonable limits and refuse to do anything about clans in the game exploiting or using unfair gameplay methods to get ahead in the game basically because they don't want to be mean or exclusive. \r\n\r\nI don't recommend this game. Play something less frustrating, like maybe League of Legends or Dark Souls. The developers have something great, but instead of fixing their broken game with a multitude of easily fixable issues, they're squandering it because they want to add new dinosaurs and sell snake plushies to entice new game sales and extra revenue, to again, make up for their losses. They also just added a chat filter that censors all swear words and otherwise \"inappropriate language.\" Apparently we can't handle bad language, so I don't think this game can handle a good review.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has no idea of balancing, random things do however much damage and all you gotta do is spawn in as a good dinosaur and you live for a long time. God forbid you play what YOU wanna play unless it's widely known to be good across the community, or else you're gonna end up sitting around for forever hoping you don't get picked off by absurdity.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Exploiters galore, and the devs do not care. Do not waste your time.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I don't understand why people play this game. Every person I've ran into just sits and waits. Theres no reason to do anything but sit and wait.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game literally won't let me play as it says 'login failed' despite my internet clearly working. Literally can't play the game, and judging from some guides from FUCKING 2021, that means its an issue known for over 4 years. Actual madness that this hasnt been fixed, what the fuck?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "use to be really good but the player base dropped off pretty hard recently the devs and owner like to ignore bugs and hacks and push content instead and all the issues and lack of help for server owners from the dev team has led to a pretty toxic player base don't get me wrong there are good people and good servers here but they are very few and tend not to last very long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After spending over 1,000 hours in Beasts of Bermuda, I can honestly say this game has so much potential — but it’s buried under layers of poor balance, inconsistent rules, and restrictive gameplay. I’ve put in enough time to see the best and worst this game has to offer, and while there are moments of real fun, they’re often overshadowed by frustration.\n\nThe core idea is great: growing your dinosaur, surviving the elements, managing comfort, and hunting or escaping others. When it works, it really works — those moments of tension and survival are what keep you coming back. But the official servers ruin much of that experience. There are so many rules that it feels more like a roleplay or PvE game than an open survival world. Seeing huge groups of herbivores and carnivores teaming up completely kills the atmosphere. Mix-packing and clan alliances are everywhere, making it almost impossible to grow or survive without running into unfair situations.\n\nCommunity servers aren’t much better. Many of them have inconsistent admin decisions and rule sets so strict that killing the “wrong” player can get you banned or even forced to revive them. It’s wild — for a game built around survival and PvP, it often punishes you for simply playing the way the game was designed.\n\nBalance is another major issue. Some dinosaurs are ridiculously overtuned, while others are left completely underpowered. It creates an uneven playing field where you’re almost forced to pick certain species just to stand a chance.\n\nAt times, Beasts of Bermuda feels more like a sandbox with rules than a survival game with freedom. And that’s a shame, because the mechanics, world design, and weather systems all have so much promise. I want to love this game — and in some ways, I do — but until the devs tackle the balance problems, rethink the rule-heavy server culture, and encourage real survival gameplay, it’s hard to fully recommend.\n\nIf you’re looking for a more authentic dinosaur survival experience, The Isle still does it better. But I genuinely hope Beasts of Bermuda can evolve into the game it’s meant to be, because the potential is absolutely there — it just needs the freedom to shine.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A lot of bugs and issues that they would rather work on cosmetics than fix a bug that teleports you from one end of the map to another",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I’ve spent a good amount of time playing Beasts of Bermuda, and overall, it’s a fun and unique experience. The core gameplay — growing your dinosaur, surviving the environment, and interacting with others — can be genuinely enjoyable. The game has a strong foundation and a lot of potential to be something great.\n\nHowever, the server experience really holds it back. The official servers are overloaded with restrictive rules that make the game feel more like a roleplay or PvE simulator than a true survival experience. You’ll often see huge groups of herbivores and carnivores playing together, which completely kills the natural tension of a survival game. Mix-packing and clan alliances are out of control, making it almost impossible to grow or progress without running into problems.\n\nCommunity servers don’t always improve things either. Many enforce inconsistent or overly strict rules — kill the wrong player, and you can be banned or forced to revive them. It’s wild for what’s supposed to be a PvP dinosaur game.\n\nOn top of that, some dinosaurs are completely unbalanced, giving certain species unfair advantages and making the experience frustrating when you’re trying to play legitimately.\n\nPersonally, I find The Isle offers a more authentic dinosaur survival experience — you can play freely, hunt, and grow without being punished for natural gameplay. Beasts of Bermuda could easily reach that level if the community, balance, and server rules were refined. Right now, though, it feels more like a restricted sandbox than a true survival game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My main issue with this game is the hit boxes aren't that great and it just becomes people biting air next to you trying to edge a hit box so they don't get hit",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I do not recommend this game. After a fair time sink into this game, I've seen it for what it is, at first innocent and fun, then it's true ugly colors come out.\n\nShort Summary: \n- Growth gimmick lets players rule their server, determining if you get to play or not. \nThe time investment/waste for progress in this game can range from 10-100+ hours while taking only about 5 minutes for that to be deleted. It's not even that fun once you start getting big as your stuck having to eat and drink for 90% of that time. No fun allowed.\n\n- Official servers suffer from clans, typically a discord group that does everything it can to rule a server with sheer numbers. Typical Hackers. Very badly written and loop hole ridden rules. These rules allow mix packing in all cases but in immediate combat in short, so in the end your fate will likely still be sealed by a group of people playing as creatures not allowed to fight together.\nThe rules flaw is not having a strict fine line between mix packing and no mix packing.\n\nvvvvvvvvvvvvvvvvvvvvvvv THE DETAILS vvvvvvvvvvvvvvvvvvvvvvv\n\n#1 Issue: 1 player rules all \n- If someone manages to get big, it's over for anyone not friends with them so long as that playable has access to hunting the creature you play as.  If their semi snake, may as well log off for a few months or uninstall. (Your survival rate against largely grown playables will increase if you have friends though. Still bad balancing.)\n\n#2 Issue: Designed to disrespect your investment and waste your time.\n- With this games main gimmick being 'endless' growth, you can spend countless, and I mean 100+ hours into a single playable. However, more often then not, you'll die after investing 10-40 some hours on a playable to someone that simply got away with way larger growth.  \n\n- -#2.1 Issue: The sacrafice trial system\n- - - You put in an intense amount of effort to grow big and get your scores to 80-100% in all 3 categories? Well too bad, your inherits are unlikely to surpass what you would get at smaller growth breeding.\n\n#3 Issue: Official Servers\nRules: \nThey are made without a fine line between mix packing and no mix packing, punishing people that don't actively loop hole around the rules. What do I mean by this? Use of scouts, feeding other species out of combat, consuming food or heal plants around your different species buddies on going fight, sitting/sheltering by your bigger different species friend so if anyone tries to fight you, your bigger different species friends will engage in combat with them first, or if your different species friend and their foe sit down for 1 minute to regenerate resources, you can now take over the fight like tagging in and finish the person off without it counting as mix packing. This also applies if your friend dies, now you can immediately jump into the fight and finish the foe off. And it goes on like poison air bombing toxic shrooms on a herbivore as a flier/glider.\n\nClans: \nThe above flaws with rules is where clans become an issue, utilizing loop holes or breaking rules that are hard to report someone for such as meshing or scouting. These people do not want a fair fight, they want to dominate and obliterate in numbers, and they will do what ever is in their power to take out their targeted victim be it tracking someones log in and log out locations, scouting them overall, and planning ambushes with all sorts of mega packing nonsense. Even hacking get's mixed into this such a teleporting a victim to a different part of the map.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Spend 6 hours getting to 2.0 growth. have your game crash and you come back dead. enjoy fighting and surviving as dinos? SIKE you're gonna lose your hours of progress to shit netcode. this game is a net negative do not buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game sucks no way to counter little  raptors tail riding you as afull grown dino  cant back up cant keep up with them no attacks can  reach back of your apex",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Играл на gtx 1650 и i5 10400f и игра на минималках даже не выдает        60 фпс а 38 и то с фризами, а самое плохое нагружает видеокарту на 99%",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was fun until hackers and griefers kept chasing me and repeatedly killing me non stop until i quit the server (they told me to quit or id keep getting killed btw). They would keep teleporting to me after I would respawn or even make a different character and just kept on insta-killing me...\n\nGo play the isle or path of titan if you want a somewhat decent dino game. or just play something else until they fix the problem of the toxic hackers in this game.\n\ni dont recommend.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Worst \"dino\" game I have ever played. Combat is shit. Growing is shit. Pokemon abilities, shit. Shit shit shit. Path of Titans is also 20 bucks and will feel like you just left and endless fever dream. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is a broken unbalanced mess ruled by groups abusing group teleport and egg spam\nalso 8 player groups when server cap is 100 on official is just stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Velo/chang is op, anyone who's decent can kill any dino as a chang/velo. Wont be a fun fight, you just die and lose hours of progress to some dude playing the game on easy mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for awhile with my brother . At first , we liked it . It was different which made it fun . But eventually , over time , having learned the game and what it takes to make a good dino . You realize how littered with hacks the game is . This is why it is dead . You can go in any server , spend as much time getting the best traits you can on any dino , it makes no difference . You can have the best build , be well versed in combat and you will be sought out and 2 hit over and over again by things that can't normally scratch you . You will hit them 20-25 times , because they are just that bad at gaming , and do seemingly nothing as they never even get stamina drained . They will all just 2 hit you . A trope can 2 hit a sauropod . It is so bad . I am being 100% honest when I say in 2 months I have had 3 legit good fights that we went at it for around 5 minutes before one lost . THAT was fun . I have had around 50+ 2 hit deaths on everything in game , I built them all . It is ALWAYS 2 hits . They do not even try to hide it . Just set there hack to max and let it rip . Does not matter if the devs care or not , they can not stop them . So you either cheat or just skip this one .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game but please update the map getting stuck on everything is lame",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst Mod team ever, so many others will tell you. expect to be muted for the stupidest reasons. hope this game dies faster just bc of the way the mods run things.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh id recommend it if it wasnt for a bunch of rules everyone cries about following. only plus is the water dinos and the snakes are pretty cool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "would not recommend, the players will kill you for just existing. The number of time i have been attacked by small dinos that could not hope to kill me or even if they did could not even eat me with out killing them selfs is frustrating. Even other plant eaters would just kill me for no reason.  There is no point to this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you will spend over 300 hours on a single dino, it will die to 3 people who sat in a cave for 20 days straight using sandboxie to grow 2 dinos at once while they ate their 405th bag of chips that day. You will join them, you will gain weight. You will hate yourself. \n\n\nno but like if they didnt have infinite growth the game would be so good, minus the horrid graphics",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is not worth the money and the overall community is far too fragile and thrives on \"word of mouth\" and drama,  this game is great for ruining friendships, literally.  The developers constantly fighting the community and the same way back, updates arent constant and takes years for anything actually wanted for it to come out.  Balancing is just non-existent.  \r\n\r\nIf you plan on playing this game for a long time,  better off staying quiet in it.  Far too many sensitive people in it,  way more than any other beast games I've seen.  \r\n\r\nBeasts of Bermuda was only made out of spite, not for a real goal to be something great.   There are better games out there and or at least in the making.  save yourself money, wait and or go find those. \r\n\r\n\r\nI personally don't care who see's this but.  BoB is crumbling and has been for a while.  I heavily don't recommend this",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Review dropped due to Beasts of Bermuda not accepting its own in-game recordings for reports. Due to this, I do not recomend buying.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Unplayable.\n\nImpossible to make any progress at all or even play properly because of connection issues to the servers on their end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is dead. ppl just afk grow and farm skins. nothing happens in this game. do not buy.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}