{
  "positive": [
    {
      "review": "What if the game was called \"Sexlands\" and we could have sex with the monsters and bandits",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Borderlands deserves praise for being the Grandfather of the looter shooter genre and it's really fun as a co-op shooter but it's been surpassed by other entries in the franchise and other games in the genre since.\r\n\r\nThe story here is pretty weak and just acts as a way to get you to move from location to location shooting things. The ending is pretty anticlimactic but it's core gameplay is still fun enough to justify playing through with a buddy.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun game, difficult but not impossible. Good storyline, funny, and enjoyable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The one that started it all. Soft story beats, but fun gameplay with cool abilities and gun/grenade modifiers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game! Only gripe I have is this game definitely shows its age even though it's GOTY Enhanced. This is a must-play if you're a fan of the other games!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(2025) Dear people of the future, you might want to start with BL2 instead. This game has great story, but the gameplay was advanced by 2009 standards, not 2025 standards. Just be ready for a slower game. Worth it if you can stick through it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "83/100 Solid first person looter-shooter than stands up well in 2025.  \n\nCel-shaded graphics provide a unique look and it's fun to play.  A few niggles, like 99% of the guns being useless for anything other than selling, and not being able to use the mouse in all interface areas such as scrolling to read quest descriptions.  The claptrap robots are funny.  \n\nQuick tip - if you keep accidentally entering what looks like console mode in the middle of a gun battle, rebind T (talk/chat) to a different key like \"]\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Happy they made the visuals better. My only problem is when I am an hour or so into the game, I start to lag a bit. Not many graphic options to try and change that. But it feels good to get to the roots of BL and enjoy the original. Major thumbs up from me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I decided to play this game after I played Borderlands 3, and now I get it. Why people love the older games, more challenging gameplay, fun characters.You can see this game has soul. If you are a fan of the series, give it a try, even though this one is a little clunky compared to the new ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What started it all. The truest most raw borderlands experience you will get. Definite recommend for anyone who hasnt played it by now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still an amazing game 16 years later. All things considered, I personally feel it has aged remarkably well. When it comes to graphics, though, it's possible that GOTY Enhanced will be the reason that many players who would've otherwise skipped BL1 actually give it a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands is an amazing game that is rich in action and story telling. This is not just a shooting game. This is an unforgettable experience. I got this game because the art style is unique and the world building is just beautiful. Even though, this is not an open world game, I get the open world vibe somehow. The art style, the story, the characters, the weapons, the enemies and the world are so enjoyable. I'll definitely play the sequel, borderlands 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The main game is good and just as fun to play as the other borderland games, very good coop experience and diff guns and stuff, but the dlcs are very boring and bad, same maps no checkpoints, have to drive through long high way over and over, because of that, main game solid 7.5/10 overall 6/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it through with my wife, both of us had a great time. For those wondering how to do local multiplayer on PC we used Nucleus Co-op to bypass the usual issue of not having splitscreen, 8/10 rating from me as a brand new player of the game/series in 2026.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game with up to date graphics and mechanics that was there from the Pre-Sequel. The game takes it time to make you feel like a badass and has the army shooter 7th gen consoles look. Green, Brown, and Gray everywhere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands is a looter shooter that's cranky has lame jokes and a lot of shooting only eclipsed by the looting. This is a remake of the original first borderlands game. It is exactly the same, just four new weapons, some new unique's and very slightly better graphics. Of course there's a few new bugs and a few fixed bugs from the original. Some nice shortcuts that was never meant to be has been plugged, but if you have played the original BL you won't find anything new. If you haven't played BL or just played BL2 or 3 then this is more of the game. A little more primitive, a little more jokes, but basically just more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "English:\nEven though this is a remaster of a title from 2009, playing it in 2025, I can confidently say it puts many modern games to shame. The loot system is incredibly fun; you find gear everywhere. The game felt a bit easy for me, mainly because I didn't realize I could use a car at first, so I walked everywhere, fought constant enemies, and got over-leveled with great gear. I haven't finished it yet, but I'm near the end. I haven't played the original version, but this Enhanced edition does have quite a few small bugs. Honestly, if the gameplay wasn't so fluid and fun, these bugs would be unbearable, but the game is just that good. It runs perfectly on my 5000 series card with no visual glitches. It earned that Game of the Year title for a reason and still holds up perfectly today.\n\nTürkçe:\nOyun aslında 2009 yapımı eski bir oyunun cilalanmış hali olsa da, 2025 yılında bile günümüzdeki birçok oyuna resmen taş çıkarıyor. Loot sistemi çok eğlenceli, her yerden bir şeyler topluyorsunuz. Zorluk konusunda oyun bana biraz kolay geldi; başta araba olduğunu bilmediğim için yürüyerek gezdim, önüme geleni kesip hızlıca kasıldım ve iyi loot yapınca oyun iyice rahatladı. Henüz bitirmedim ama sonlarına yaklaştım. Orijinal versiyonu oynamadım ama bunda çok fazla irili ufaklı bug var. Eğriye eğri doğruya doğru; oyun bu kadar eğlenceli olmasa ve yağ gibi akmasa bu buglar çekilmezdi. 5000 serisi kartla oynarken hiçbir görsel sorun yaşamadım. Oyunun 'Game of the Year' (Yılın Oyunu) unvanını boşuna almadığı belli, hala taş gibi ve günümüzde sıkılmadan oynanıyor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. Weapons feel good, good soundtrack. fun characters/story/atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this because of NOSTALGIA, but it's a good game, nevertheless.\nThere are some annoying bugs, one is how a waypoint gets tagged on its own, leading off the map.\nI don't really know what was remastered, because the game feels exactly the same as I remember from the original.\nThis game is meant to be played by a 4 people team, even though it's possible to play alone - but the experience is worse while playing alone.\nThere aren't many players at all, almost nothing available on server browser, and also no one joins a public game.\nI would recommend it, marking it 6/10 because it feels really dated and it has some weird issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if game doesnt work due to initialization error on loading, go into the game folder :\nD:\\SteamLibrary\\steamapps\\common\\BorderlandsGOTYEnhanced\\Binaries\\Win64 OR manage/ browse local folder\nand click on BorderlandsGOTY.exe to run the game. I know its not perfect but fffk this company and its useless frontends but at least it will make it playable or just yo ho ho that 100% works and runs better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you haven't given this series a chance, please do. It's one of my all-time favorites. This was my fourth time fully replaying the main campaign. Once again I couldn't get through all the dlc. Moxxi's Underdome Riot just keeps going on and on doing the same thing every time. Zombie Island of Doctor Ned is great. Secret Armory of General Knoxx is alright. I can't ever recall playing Claptrap's Robot Revolution so it's either extremely forgettable or I've never touched it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The car physics and geometry are a little janky, but overall I had a fun time playing this game with my best friend Nick!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first the game is almost too easy- go here, do this, kill this guy and bring back his loot. Then you get thrown into the mixer real quick...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent gunplay amzaing amposthere and great dlc so overall a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a little clunky and the frames can be pretty annoying, but its an old game. And besides, this is where it all started.\r\n\r\nThe humor is fun, the gunplay is pretty cool, the fights are interesting, and the music is gorgeous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legendary Classic from when developers actually cared, what more is there to say. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, comical, and gory. Hundreds of guns, weapons and upgrades that you don't need to buy. You just go through each level and buy and sell all kinds of loot. Part funny, part scary. All intriguing and fun. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "None of the Borderlands games has really captured the spirit of this one. While they are all pretty good titles, the first game will remain my favorite entry in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As is the case with most of this franchise the BL1 GOTY Enhanced is an awesome play! I will say though the Underdome achievements make 100% in this game a rough time consuming task. Happy to help anyone whenever I can with it though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The vault opens again — sharper, smoother, still insane.\nBorderlands: Game of the Year Enhanced is a remastered version of the original looter-shooter that started it all. With updated visuals, quality-of-life improvements, and all four DLCs included, it’s the best way to revisit Pandora — or experience it for the first time.\n\nPros:\n- Visual upgrades: Sharper textures, improved lighting, and 4K support breathe new life into the cel-shaded chaos.\n- All DLCs included: Zombie Island, Mad Moxxi’s Underdome, General Knoxx, and Claptrap’s Revolution — all here.\n- Mini-map and inventory tweaks: Small changes that make a big difference in usability.\n- Still hilarious: The humor, characters, and loot-driven madness hold up surprisingly well.\nCons:\n- Dated mission design: Lots of fetch quests and backtracking.\n- AI and gunplay: Not as tight or refined as later entries.\n- Co-op quirks: Occasional bugs and connection hiccups in multiplayer.\n\nThis is the definitive version of a cult classic. If you loved the original or want to see where the Borderlands mayhem began, this Enhanced edition is the way to go. Just be ready for some old-school grind and jank.\n\nRecommended for: Borderlands fans, co-op squads, loot goblins\nNot recommended for: Players who expect modern pacing or tight FPS mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands GOTY is one of the best older games i've ever played. whether its with friends or by yourself there is always something to do. 1 million quests later and eventually youll beat the game. PLease buy it and try the game. Its worth it.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff. runs great on the deck. A game that hasnt aged in both art style and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 1 = decent game, and you get to start from the beginning.\r\nBorderlands 2 = Great game, Best story of the all IMO\r\nBorderlands pre-sequal = meh game, feels empty, short and unbalanced character design. \r\nBorderlands 3 = Great game, interesting customisation options, good story.\r\nBorderlands 4 = Can I even run it ????",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's basically just the original borderlands but with even worse multiplayer netcode and literally all the bugs from the original plus a few extras as some free extra content.\n\nOther than that, this is objectively the better version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old school shooters like this bring back memories of a simpler time in FPS gaming.  I played every BL game over the years except the first, and I'm experiencing BL1 for the first time with this remaster.  Coming off Borderlands 4 the controls feel a little bit sluggish with no mantling, no jump dash, and the occasional clipping into environment geometry.  But it holds up pretty well for a game from the XB360 / PS3 era. More than anything I'm enjoying the nostalgia of playing an FPS during that 2000s time period when skill trees weren't overly complex and you didn't have to wait 5 minutes to load up due to a weekly update and shader recompilation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I took about 150 hours to finish the game and really enjoyed almost every minute. The game felt satisfying and the gun-play enjoyable, but the ending was incredibly disappointing and didn't feel like it wrapped the game up very well. Regardless of that, I would absolutley recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While Borderlands 2 is better in almost every way, the original is still an enjoyable time and is almost quaint.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than 3, not as good as 2, but with this being the first game out in the series it's actually pretty good, and this version just makes it more playable.\r\nThe only two games in the series worth the time and money are this and the 2nd one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good fun, I recommend using God mode cheat otherwise you'll get bogged down with ridiculously hard bosses (unless that floats your boat).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, back when Gearbox was a good dev and Randy Pitchford wasnt a turd.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to a certain someone I am obsessed with the Borderlands franchise. You know who you are. ;)\n10/10 and five stars",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "just as awesome as i remember it, im one of the weirdos that always prerfrered 1 to 2 so i love it, although i feel like they could of made it so much better than they did",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OG barebone Borderlands that is kinda harder in the beginning than 2 IMO but still good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun shoot'em up with RPG elements like leveling, skills, and loot progression.  The characters are funny and the missions are decent.  The main story has been pretty good so far.  It's a little whacky.  The world is pretty and the music is good.  \r\nThe only downside so far is backtracking through the levels when you finish a mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game, loads of playability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "+ claptrap genocide\r\n- my fat queen Ellie is missing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still amazing after all these years.  Works/looks great on an UW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old but gold and the enhanced version is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the old graphics feels so nice to play this again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well this is addicting.\n\nFuck you, Randy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a reason it's a classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sex physics GOTY Enhanced",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Nostalgia creeping in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its old but ok so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "where it all began! amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yup, you know what it is and it holds up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best one in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its borderlands 1 enough said",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best of this series.....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still good in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you should play this its sooooooo good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "big fan of the pandora",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LETS GO!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretyyyyyy good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Memory leak L",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "steam award 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sum light",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brown",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me ggon ths gaem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yumy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "96%",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "✔",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "677",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "https://youtube.com/shorts/UNhT-TDT84Y?si=T37w6pygrwtnjK5z",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyable game overall, even after 16 years, but the Enhanced Edition has a nasty memory leak in DX9 — after an hour it tanked to 10 FPS or something which is hilarious. Switched to DX11 and it’s been smooth ever since. If your framerate dies over time, try \"-dx11\" in launch options.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "What if the game was called \"Sexlands\" and we could have sex with the monsters and bandits",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "This game has become my favorite game to play lately! It is time to give a comprehensive review\n\nBorderlands Game of the Year Enhanced is a fantastic reminder of why this series became a cornerstone of the looter-shooter genre. While I wasn't there to play the original when it first came out, I have heard from others that the remastered visuals and improved performance of this version give it a fresh coat of paint without compromising the charm and grit that defined the original. I played from start to finish, and it’s impressive how well its core loop—shoot, loot, and repeat—still hooks you in.\n\nWhat stands out most is how satisfying the gun play remains. Every weapon feels distinct, from explosive shotguns to electric sniper rifles, and the sheer variety of loot keeps experimentation fun. But my go to weapon has always been the revolver weapons. My Lv19 Masher has legit carried me the moment I got it up to Lv44. \n\nThe RPG-style leveling and skill trees add meaningful depth to each character, encouraging different builds and playstyles. My first run was with the soldier but I ended up getting stuck on a level and made a new save with Siren and it was so much better playing as her. Maybe a bit too good. Having an on demand ability that gives you a moment of invisibility and invulnerability while also regenerating your hp? Yeah perfectly balanced. In addtion, I wasn't able to play the co-op because I prefer playing the game solo. \n\nThat said, some aspects definitely show their age. Mission design can be repetitive, and the story, while serviceable, lacks the polish and pacing improvements found in later entries as I heard from other reviewers. But the world of Pandora still oozes personality, from its wild bandits to its grimy humor and eccentric NPCs. I am looking forward to playing the other games and learning more about the story.\n\nIn the end, Borderlands GOTY Enhanced is a great way to experience where it all began. It’s not perfect, but it’s still a blast to play—especially if you enjoy that addictive mix of action, loot, and irreverent charm. Whether you’re a returning fan or a newcomer curious about the series’ roots, this version is absolutely worth picking up.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Borderlands is the game that started it all; the looter shooter and it was conceived from the idea of mixing Halo with Diablo. I first played this at release in 2009 and imo has aged like a fine whiskey. This version is a remaster of that game with some QOL improvements and enhanced graphics. Only complaint is it has a shitty memory leak that still hasn’t been addressed (this version). When you’ve been playing for long periods of time, the frame rate can suddenly drop to sub 30 fps. It didn’t happen a lot during my play through, but it’s there. There are community patches you can download if it’s something that’s frequently happening to you. Overall, it’s still worth playing, especially as an entry point to the series.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "For reference, I played this solo. It's... fine. Pretty repetitive and guns are so-so. Has it's moments. Got stale enough for me to not feel like playing through the DLCs. 6/10.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Amazing looter shooter with a few blemishes  \r\n\r\nThere are two parts to this review, the base game and then the DLCs. First, the base game is peak, with almost perfect looter shooter mechanics, amazing drops even early on, good weapon feedback, and a pretty good art style that holds up even today. Only negatives are nitpicking, like maybe some difficulty spikes and the story/mission structure (could be more creative), but overall it's an amazing journey, but then we come to the DLCs.\r\n\r\nDLCs are a mixed bag for me. It has good level aesthetic variation, which the base game could use, and does have some good endgame loot, but personally I feel like it comes with more issues of its own instead of fixing issues of the base game. \r\n\r\nMad Moxi—Loved the 1st 5-wave mission, hate the 20-wave  \r\n\r\nDr. Ned/Zed - Love the aesthetics and enemies, but there is too much backtracking, and the Brainsssss mission is just mind-numbing. \r\n\r\nGeneral Knoxx - Love the enemies and loot but has one of the worst bosses (Crawmerax) and more backtracking but with more distance and obstacles.\r\n\r\nClaptrap revolution—pretty good all around. Just hated the last RNG mission but got lucky and only had to grind for 3-4 hrs. \r\n\r\nI would still recommend the game today, as it still holds up decently well; it's just that if you're going for 100%, it can sour the experience in the DLC section. I was going to give it \"9/10,\" but with DLC and everything, it's \"7/10.\" Still fun and amazing as long as you know where to look.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Borderlands 1 was an incredible game when it first came out. It offered a delightful change from the monotonous and repetitive games of its time. The addition of cartoony graphics to the realistic Mad Max-esque atmosphere created a truly captivating atmosphere. Andalso the lore details they presented throughout the game created a unique atmosphere.\r\n\r\nWith each new game, new mechanics and features were introduced to the Borderlands series. Because Borderlands 1 lacked none of these, we play it in its rawest form. If you're a new Borderlands player, you might not notice these. But when you look back at the first game after all these years, you feel like certain things were missing, leaving you feeling a sense of emptiness. For example, not being able to use a fill ammo key at vending machines or being unable to move freely for a second wind.\r\n\r\nI think it has some positive aspects compared to later games (especially Borderlands 4). First of all, I think the game's art style is quite noticeable. I think this style has been toned down and dumbed down considerably over the years. Perhaps it's because the development team has changed a lot, breaking away from its original style, or perhaps it's because of the advancements in graphic technologies. But the most important aspect of the game style is its atmosphere. The bold lines around objects and the deep blue sky immerse you in an interesting environment.\r\n\r\nI loved the map designs. You can almost imagine yourself traversing \"living\" areas. There are no civilians around, only enemies. However, these maps are included with details that reflect the possible civilians' lives and work. Garbage dumps, massive tractors, and visible factories make the game feel like you're navigating a real world.\r\n\r\nOf course, there are some issues stemming from the inexperience of the first game. First among these are the enemy types and the unbalanced nature of the elements. When you enter an area where there seem to be no enemies at first, suddenly enemies start spawning from all sides. You're caught in the middle of a sea of enemies unprepared. You lose the opportunity to approach from afar or use tactical approaches, and you find yourself trying to escape the enemies that suddenly gather around you.\r\n\r\nSkag, Spiderant, and Scythid all have fundamentally similar attack methods. They run at you when they see you, and they leap at you from a certain distance. This makes things even more challenging. Imagine 10 Spiderants jumping at you from different directions at once. Considering that enemies like Rakk, Psycho, Crabworm, and Guardian can also get right up to you and attack, the game becomes more of a \"constantly dodging back\" game than a \"serious gunfight.\"\r\n\r\nOne reason for this may be that the game is designed for co-op with friends rather than solo play. Kiting enemies with multiple players can make the game much easier. But of course, since you can't do this solo, it makes progressing alone much more difficult. On the other hand, I think the bosses in the game die too easily. I don't even have as much trouble against the important bosses as I do with the  radom mobs I encounter. This makes me think the game's balance hasn't been adjusted properly.\r\n\r\nThe game itself was released in 2009, and the \"Game of the Year Edition\" in 2010. In 2019, they released a remastered version called \"Borderlands Game of the Year Enhanced.\" They adapted Borderlands' graphics to the 4K era and introduced the minimap and character customization from Borderlands 2. However, they didn't seem to make any other improvements. You'll encounter a lot of bugs in the game, and I'd expect them to be fixed. Some are obvious, like getting stuck on the edge of objects. The mouse sensitivity settings in the game are also very poor, requiring you to modify the game files. While this would be somewhat understandable if the game were released in 2009, we're talking about a \"modernized\" update in 2019.\r\n\r\n5: Below average - It may not appeal to everyone, but there are interesting ideas from time to time.\r\n(8 if we talk about the year the original game was released)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Borderlands deserves praise for being the Grandfather of the looter shooter genre and it's really fun as a co-op shooter but it's been surpassed by other entries in the franchise and other games in the genre since.\r\n\r\nThe story here is pretty weak and just acts as a way to get you to move from location to location shooting things. The ending is pretty anticlimactic but it's core gameplay is still fun enough to justify playing through with a buddy.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Recently, I rediscovered this masterpiece by accident on Steam. I remembered playing Borderlands 2 a long time ago but unfortunately never finished it. With the release of Borderlands 4, I thought it might be a fun time to revisit this franchise and dive back into the universe.\n\nSo here I am, after my first playthrough with Roland. Yes, the game might not have the best storytelling I have ever seen, and sometimes the fights can feel a bit monotonous. But for a game originally released in 2009, it still has its moments in 2025.\nConsidering that Borderlands might have sparked the loot-shooter hype, it is (in a historical context) one of the greatest and craziest games out there.\n\nSo obviously for historical reasons, I started my second playthrough, and I can now confidently say that with Borderlands I have had the most fun playing video games in a long time ….",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Gameplay is quite dated now, but still love the atmosphere and characters",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Play the original cus this has a bad memory leak issue. but besides that its good",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "6.5/10 - 50 hours in. It's a good game and I'd recommend it. But they definitely didn't put in the time and effort they could to fix problems. The first is that the screen resolution/fps resets every time i load it. Another is when playing with others it is always extremely laggy unless you're the host no matter how good the hosts and your own connection are. The minimap can also just completely stop working for players who join as well as waypoints place randomly on the map. The gun aim feels iffy and the rewards through playthrough one feel underwhelming. With that being said, you can definitely still have fun and i'll continue to play and do the DLC!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I've owned this game for years for about 13 years, and I have only just decided to hunker down and finish it. Loads of fun, takes me back to my late teenage years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Has aged pretty well, the memory leak is a real bummer, but the game remains enjoyable all these years later. It's always fun to go back and play the first game in a series, it really puts things in perspective of how much things have evolved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, difficult but not impossible. Good storyline, funny, and enjoyable.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Take-Two Terms of Service\nUpdate on February 28, 2025 - Applies to all Borderlands games, yes, even the 13+ year old games that we've all been playing without issue.\n\nUnilaterally adding a new Terms of Service to a 13 year old game that makes the use of mods a bannable offense and makes it so that they can ban you for sharing bugs or exploits. While I doubt they will use this power they bestowed upon themselves against anyone in BL2 it will certainly be in use for BL4. Randy called people who displayed bugs or mods \"Internet Terrorists\" and now that company can ban you from all Borderlands games new and old.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Has a memory leak that doesn't exist in the original game and that they never bothered fixing.  Also removed the original, which still runs fine on modern systems, from sale forcing players to pay a premium for this broken version.  But hey, it has a silly hat for each of the original vault hunters...\n\nAt least it includes the original game, so if you buy this just play that.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "It's been two years since this game re-released, and they still haven't fixed the bug that bricks your keyboard input randomly for 5-10 seconds. Randy Pitchford you are a clown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't recommend anything Randy Pitchford has slapped his impotent dick on, but there's still a memory leak in this \"ENHANCED\" edition years later. That's crazy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "decent game but as of right now the launcher is broken, so you have to bypass by running the game as admin.\nplease fix this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "By the standards of 2025, this game is an endless, unrewarding grind. It's just not enjoyable. There's no sense of accomplishment if your time is worth anything. I played the Xbox 360 version and dumped time into that for the sake of playing with friends. It just hasn't aged well. If I wanted to feel like I was working after an already long day working, I'd get a second job and at least get paid for my efforts. I just can't recommend this game in a day and age when most people don't have the spare time required to let an update download before they can play, let alone play a game that just feels like a full time job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Multiplayer runs extremely poor; regularly below 20 FPS + 1 to 2 second action delays. Even on low graphics  settings and Enable Voice disabled on all players, these issues persist. I now understand why everyone is saying to play the standard GOTY instead of the enhanced GOTY. Thanks for destroying this would've-been-amazing remaster, Gearbox...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is glitchy at best, some elements cause physics issues, game is moody when trying to snipe, which doesn't damage the enemy but alerts them, and their shots reach you easier than you reach them, these issues were not in the original version",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "runs like crap for coop. for no reason. 6 year old reddit posts indicate disabling voice chat on it fixed it. Has not fixed it for my friends and I. either way, the fact that this is still so broken and still being sold is an insult. Screw 2k and gearbox for doing this. Fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game and by extension this franchise could have been one of my all time favorites but sadly this release has so many unfixed issues from constant stuttering, memory leaks which the devs (in response to fan backlash) simply told us to \"just restart the game even now and then bro\" and a plethora of other stuff \n\nGet it with a cheap key you can find many for around 3-4 bucks 10 just ain't worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it comes to, I feel like this is a game designed only to be enjoyed in a certain scenario in a specific timeframe in mind; Playing it with your friends in the late 2000s because Borderlands 2 or most other modern looter shooters don't exist yet, and outside of that context, its kinda boring past the early hours of playtime.\n\nWhile the initial atmosphere at the start of the game is alright, a fairly desolute sci-fi wasteland, it gets pretty repetitive after a bit, especially once it all gets replaced with a trash city aesthetic for most of the last third of the game, and most content, story or side quests regardless, is both tedious and unsubstantial.\n\nThe main story missions are pretty much an excuse to just run around, shoot things, and head to the next area, with dialogue ranging from dry to unfunny, and side missions are usually laid out in the most annoying way possible, due to the single mission marker available at all times, leading to constant mindnumbing backtracking like because the third marked audio log of five of them was actually located midway between the first and second logs' position. And if it doesn't have that form of tedium, high chance you will still need to backtrack a fair distance just to hand in the quest, and that includes main story missions.\n\nI had to resort to just resetting the game via the main menu at points due to it being sometimes minutes faster than just walking/driving to certain waypoints.\n\nIt doesn't help that there is quite a lack of polish on some basic things, main characters that have no lip sync or are generally silent during story progress, awkwardly presented cutscenes that never seem to start or end right, or just odd level design that screams rushed and unfinished. I can give it a slight pass for the time and Gearbox's team size at the time, but nowadays it just does not feel like a tight and quality-checked product overall.\n\nI suppose the main focus then would be the gameplay, and the randomized guns, but its very unpolished and lacking, especially in comparison to the later games in the series. \n\nMost enemies just boil down to either some melee type thing running at you and failing to keep up as you run away, or aimbot bandits able to pinpoint hit you for quite a lot of damage across the map, making most tactics boil down to either taking cover to a jank and limited degree while you deal chip damage to them, or running up to them, one-shotting via headshots or blindly tanking the bullets, and using the 'kill or die' health state to easily get point blank headshots without much penalty. Now play like that for 30+ hours.\n\nGuns are weirdly underdeveloped for the most part, while they feel okay-ish if the ones you are currently wielding are up-to-par with stats, it really does feel you have the bog-standard shooter loadout (pistol, shotgun, machine gun, etc.) with slight deviations in scope zoom or reloading style on the most recent guns you have looted. Even then, most of them have very unreliable accuracy until maybe late New Game Plus where you've grind the weapon specializations quite a bit, though I suppose this is to vaguely make more important class-to-weapon type specializations according to their style and skills.\n\nAfter that, all the interesting weapons that try to break the mold are either quickly out-stated or extremely gimmicky, or locked off to the endgame stuff of New Game Plus where I feel most peoples excitement on the game would have burnt out unless they really want to grind them out via the limited options available at the game, and even then, there really isn't a lot to do that either hasn't been completed already, or is just aimlessly wondering the dull wastelands and trashfills shooting the same bandits you've been doing for dozens of hours. I just don't think there is remotely enough content in the game to warrant the gun randomization mechanic, much less burn hours of your life farming Borderlands 1 for more weapons that all feel the same for the most part.\n\nI would have hoped the DLCs would spice things up a little, added quite a bit of worthy content, but beyond their theming, they really are just more Borderlands for the most part, or much worse.\n\nThe Underdome is a tedious, godawfully difficult wave-based arena that might have one of the worst forms of achievement grinds I have ever seen (complete 300 rounds I think), but even forcing myself to do the bare minimum of 75 similar playing rounds for a single skill point (and you can do that again on New Game Plus if you REALLY want to) is just egregious time wasting for no benefit.\n\nZombie Island DLC is a zombie-themed DLC for Borderlands.\n\nOkay, seriously though, the Zombie DLC is near whats in the title, you get zombies. You shoot more zombies. Its got an alright campy horror vibe going on, but if you really feel like what you needed was a bunch of slow moving easily killed zombies in Borderlands to keep you going, then uh...I could recommend Left 4 Dead or something else that might keep you and your friends awake while playing.\n\nGeneral Knoxx DLC seems like an actual expansion more in line with normal Borderland's content, but is hampered by a lack of fast travel points and being fairly forgettable outside the limited armory you can access at the end of it, as well as some additional endgame farms to do, but I wouldn't really bother with all that, as by the time I think you would finally be doing all that, 99% of the game is probably done at that point, or so trivial at that point that grinding for 0.1% stronger guns seems incredibly pointless to me.\n\nThe Claptrap DLC idea seems fine, essentially being a last hurray of all the things you've dealt with in Borderlands + DLC with a Claptrap reskin, but its fairly short and small all things considered, but it still is more Borderlands in the truest sense, and doesn't add much to the final package of the game.\n\nOverall, I would just say either play a later Borderlands game, or consider some other choice for multiplayer.\n\nAlso, there is a memory leak problem in this version of the game that slowly eats your frames after what I believe is enough level transitions, so I hope you enjoy constantly full restarting the game every few teleports via fast travel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is so damn repetitive, ive forced myself to pla 9 HOLE HOURS (yes, thats A LOT for the experience i had) i was the hole time in that \"its gonna get fun anytime soon\" BUT IT NEVER DID",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam version does not support local co-op without serious workarounds. Why in the world would I want to play a looter shooter without local co-op?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go to hell borderlands. 34 hours just to crawl up the destroyers urethra and not get any fucking loot.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant even play the game, doesnt even launch or start great game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DIS GAME DONT EVEN WORK BRUH FIX YUR GAME,..,.,,.,.,.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ads in a 10 year old game ive already paid for? cringe",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Broken launcher, I am disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fix the memory leak its been several years",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "overcooked 2 is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BUGGY AS HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Take-Two Terms of Service\nUpdate on February 28, 2025 - Applies to all Borderlands games, yes, even the 13+ year old games that we've all been playing without issue.\n\nUnilaterally adding a new Terms of Service to a 13 year old game that makes the use of mods a bannable offense and makes it so that they can ban you for sharing bugs or exploits. While I doubt they will use this power they bestowed upon themselves against anyone in BL2 it will certainly be in use for BL4. Randy called people who displayed bugs or mods \"Internet Terrorists\" and now that company can ban you from all Borderlands games new and old.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 95
    },
    {
      "review": "Has a memory leak that doesn't exist in the original game and that they never bothered fixing.  Also removed the original, which still runs fine on modern systems, from sale forcing players to pay a premium for this broken version.  But hey, it has a silly hat for each of the original vault hunters...\n\nAt least it includes the original game, so if you buy this just play that.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I don't think this has aged well. I played it at launch with a group of friends and it was a lot of fun. There really hadn't been anything like it before. Returning back to it, it's a pretty empty world with minimal story. There's not much variation in weapons and the skills are underwhelming. Borderlands 2 just does everything better and so it should. If you have friends to play with and want to start the story from the start then by all means go for it. It's still going to be fun with company. If you're solo I'd suggest reading/watching a summary and starting with 2 at least.\n\nI also don't understand what was enhanced about this version. The graphics are near identical just a little brighter. People still have static faces when they speak. General Knoxx still has zero fast travel points and wastes your time with backtracking in what would otherwise be a good DLC. Moxxi's Underdome still doesn't give experience for any kills in what takes literally hours of mindless killing. The launcher doesn't even work.\n\nTannis and Scooter are at least genuinely entertaining characters.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "It's been two years since this game re-released, and they still haven't fixed the bug that bricks your keyboard input randomly for 5-10 seconds. Randy Pitchford you are a clown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Borderlands Game of the Year Enhanced is UHD version of Borderlands. I played the original Borderlands way back in 2009 and I have really fond memories of it. The original 4 player looter-shooter game that had us all hooked instantly and was the birth place of the genre in my opinion. (I know a game came before it but I forgot it's name).\n\nDoes it stand out in 2025? Is it worth it? Below I will let you know, so let's get to it!\n\n[h1][b] Cons [/b][/h1] \n⚫The gameplay is very outdated now. Compare it to Borderlands 2, BL2 blows it out the water in comparison and that's pretty old itself. \n⚫No real \"farming\" for the \"GAZILLION\" guns they advertise on the trailer. Again, compare it to BL2 and you will see what I mean.\n⚫The \"ENHANCED\" version of Borderlands has a MEMORY LEAK issue that has been here since day 1 and Gearbox/2K do not care about fixing it. That's 2 years and no fix for this yet. They tell you to \"Quit your game and relaunch it\" to solve this. How lazy.\n⚫Don't expect to slide or mantle, as I said - gameplay is pretty dated.\n⚫The gunplay is VERY dated also. \n⚫Gearbox lies about the final boss being better. It's still a boring bullet sponge with no challenge at all.\n\n[h1][b] Pro's [/b][/h1] \n⚫They added a Borderlands 2 type Minimap. This, this was sorely needed. All of us OG fans know the struggle.\n⚫You can now mark items as junk to sell them in vending machines or lock them/favourite them to stop you accidentally selling them. I cannot tell you how many times I sold my main guns.\n⚫They added SHIFT support which gives you 75 golden keys AND 2 legendary guns! This helped me get a start on TVHM!\n⚫The original 4 vault hunters - Lilith, the Siren. Roland, the soldier. Brick, the Berserker and Mordecai, the Hunter. These characters paved the path for future stories and other characters that got introduced. \n⚫You get to play all 4 DLC for free - The Zombie Island of Dr. Ned, Mad Moxxi's Underdome riot, The Secret Armory of General Knoxx and Claptrap's New Robot Revolution. All of which adds countless hours of playtime!\n\n[h1][b] My Verdict [/b][/h1] \nIt's been a long time since I last played Borderlands and to see it get a \"remaster\" all these years later, it breaks my heart to say - it's not worth it. It's dated. I get it's a remaster of a 2009 game and not a \"REMAKE\" but there are tonnes of games like Borderlands that are just better nowadays and, give you more bang for your buck.\n\nThe main issues why I cannot recommend the game is because of Gearbox's inability to fix the MEMORY LEAK issue and the outdated gameplay. If you wanted a Borderlands, buy Borderlands 2 GOTY, trust me... it's better in almost every single way.\n\nAt the end of the day, if the gameplay was as good as I remembered it to be and there was no memory leak issue - game would be a 8/10 but sadly I just can't recommend it over Borderlands 2 or the countless other Looter Shooters out there nowadays.\n\n[h1][b] 4/10 - A memory leak issue since day 1 not fixed and dated gunplay can make Borderlands a real slog. Let's be honest and not base it on nostalgia [/b][/h1]",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "killed the destroyer then logged off and was immediately greeted with a borderlands 4 ad covering the entire screen prompting to its store page.\n\n\npiss off you greasy slime ball randy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Gearbox is not the same company that made this game. Avoid this and all of the products from them as they are using it as data collecting spyware. No borderlands games need anti cheat.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ADDITIONAL INFORMATION: This game's multiplayer doesn't work, the net code is absolutely awful. Also there's a major issue with memory leaks, idk what it is with incompetent developers \"enhancing\" games and somehow making them worse.\n\nDo not buy if you want to play with friends, the original works just fine.\n\nGot forced to play this game by a friend and I lowkey felt like I was in some kind of CIA torture scenario being sweated for information.\n\nMan, there is almost nothing about this game I actually like, it feels dated as all hell, the gun play is awful, the story is non existent, the skill trees are lack luster.\nIt's like a tech demo for Borderlands as a series. \nJust play any other borderlands game and experience a infinitely superior game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Every Borderlands games has become a billboard advertisement for the newest game that's released and the new terms sounds like the game is stealing private data too.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't recommend anything Randy Pitchford has slapped his impotent dick on, but there's still a memory leak in this \"ENHANCED\" edition years later. That's crazy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "nah.. not many enemy types and the weapons are too weak. its basically Mailman Simulator",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was very fun from PT1 to PT2, but the game has so much glaring bugs, and frustrating ways to die:\r\n\r\n- Getting killed because you got stuck on something and unable to be unstuck.\r\n- Game respawns you in a bad spot under heavy fire, only to be killed over and over.\r\n- Missing items when joining another game.\r\n- Weapons not regenerating ammo for some when its the same weapon type.\r\n- Missing extremely rare buy it happens, with but portion of money disappearing when loading a game.\r\n- Waypoints sometimes not displaying or not displayed properly.\r\n- Assassins force swapping your main weapon to a random one in your inventory.\r\n\r\nThe game was fun from play through 1 to 2, but after hitting level 69, the game has just become so frustrating to play from T Bone Junction onwards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "decent game but as of right now the launcher is broken, so you have to bypass by running the game as admin.\nplease fix this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "By the standards of 2025, this game is an endless, unrewarding grind. It's just not enjoyable. There's no sense of accomplishment if your time is worth anything. I played the Xbox 360 version and dumped time into that for the sake of playing with friends. It just hasn't aged well. If I wanted to feel like I was working after an already long day working, I'd get a second job and at least get paid for my efforts. I just can't recommend this game in a day and age when most people don't have the spare time required to let an update download before they can play, let alone play a game that just feels like a full time job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Multiplayer runs extremely poor; regularly below 20 FPS + 1 to 2 second action delays. Even on low graphics  settings and Enable Voice disabled on all players, these issues persist. I now understand why everyone is saying to play the standard GOTY instead of the enhanced GOTY. Thanks for destroying this would've-been-amazing remaster, Gearbox...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe I went in with too high of an expectation since this is *the* Borderlands, but the game was so clunky and repetitive to play that my friend and I gave up after three hours.\n\nAll quests are unvoiced, received through a wall of text in a very dated UI (and not in a charming way – it feels visually noisy and unpolished). 99% of them are “go to this place and shoot things”. There is almost no variety and the gameplay feels too clunky to sustain my drive to complete these just for the hell of it, since the other motivator – the story – feels like a side dish that the server forgot to bring you. It's tiring. There's no point in doing any of these quests except to get loot and level up, which again, would be fun if the actual gameplay was fun.\n\nAs it stands, the saving grace of Borderlands 1 is the art direction. The characters, environments and items all have heaps of personality and creativity poured into them. I was pleasantly surprised at some of the more cartoonish proportions they went with on the character designs and I would love to hang out more in this world, just not in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Runs like garbage on modern systems, have to do lots of file editing and tampering to try and fix it, And it still doesn't solve all the issues.\nBuy the original version (NOT ENHANCED) from a key retailer as it is far superior and runs like a dream.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "J'adore Borderlands. Je l'ai fait à l'époque de sa sortie et j'en garde un bon souvenir.\r\nCette version \"Enhanced\" n'a d'améliorée que le nom.\r\nOk les textures et le framerate sont là (parfois), mais le jeu est cassé comme jamais:\r\n- framerate qui chute et passe de 165 à 19 fps sans raison,\r\n- FPS locké à 90 en coop \r\n- chat vocal buggé qui prend trop de ressource en coop provoquant des lags (il faut le désactivé à chaque lancement),\r\n- bugs de collisions, de textures, de suivis de quêtes (marqueurs fantômes, objectifs qui se mettent pas à jours),\r\n- balles qui ne touchent pas vos ennemis en coop (et parfois en solo) même à bout pourtant, etc.\r\n\r\nEntre l'état du jeu et la mise à jour des CLU à la discrète...c'est vraiment une honte en 2025 pour une légende comme BL.\r\nAprés quand on voit la qualité de a communication du PDG du studio digne d'une cour d'école de maternelle...je ne suis pas vraiment surpris.\r\nDommage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 1 but with better graphics; great! Until you hit about level 30 and the memory leak obliterates you. There is a fix for it, but that should not have been left up to the players to do. Frankly pathetic. Getting <20 FPS on a 4090.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's what you can expect from a game that is over 15 years old and that is fine.\n\nThe memory leak, however, is not fine and ruining any fun to be had. You have to restart every hour and a half at most.\nPerformance feels sloppy in general, with the game dropping frames all over the place. Even after a fresh restart I will drop a good 50 or so frames for a few seconds every now and again.\n\nRTX 4080S\nRyzen 7 7800X3D",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The worst version of any game ever conceived, and it's not even close. This is the worst by a landslide lmao but it's fun if you troubleshoot it yourself I guess. I still wish it didn't black screen my PC and make a loud ass noise while doing it to scare the fuck out of me (and also set me back some progress while doing it). I think borderlands 2 kinda blows and this one's way better so there's that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is glitchy at best, some elements cause physics issues, game is moody when trying to snipe, which doesn't damage the enemy but alerts them, and their shots reach you easier than you reach them, these issues were not in the original version",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sooo, the game it's okay, i mean, it's not fun at all but it's borderlands I guess... but god damn, what the fuck is wrong with this \"enhancement\": the performance is fucking awful, if i play for more than an hour the game drops to 10 fps, this shit has a serious memory leak.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "muted but appealing (imo) art style\nDLCs are entertaining but short\nestablishes the basics for the Borderlands franchise with a few mechanics that aren't in the rest of the games\nsets up a lot of context (for the rest of the games) and is in my opinion, crucial to play in order to enjoy and understand the complete story\nI have A LOT of nostalgia for this game\n\nbad memory leak issues that exist in every iteration of this game (why didn't they fix this????)\ngame loves to bottleneck and only use one core on your CPU, and no real definitive fix exists\nI have noticed that performance SEVERELY degrades with many enemies in your immediate area, probably due to the CPU bottleneck\n(this makes any arena cause massive drops in framerate, I have found that the large quantity of rounds in the greater challenges for underdome to be almost impossible under these conditions)\nknoxx DLC has NO fast travel points (other than the one you take to travel there), almost ruined the entire DLC for me, but other than that it is quite good\n\nPlay if you love borderlands, but please don't make it your first because you will absolutely be turned off from the ENTIRE franchise",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game did NOT age well.\r\nPretty much everything in it is skippable. Nothing in the story is anything you need to know for the future games, and with the new ones being so much better, playing this one is really just an excercise in masochism",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I HATED my time with Borderlands 1 especially in the first playthrough, this game aged like spoiled milk, I gave no fuck about the story nor its characters, Soundtrack and ambience were pretty nice tho.\r\nI was actually having some kind of fun in the second playthrough... until the Claptrap dlc with its final mission being a boss rush with all the bosses being so spongy that I just decided to give up and throw in the towel.\r\nGameplay was undercooked too especially compared to its sequels.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "publishers will update 20 year old games to add bullshit clauses and terrible launchers, but they won't update the game to make it actually run properly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck off, 2 years after release and it runs like fucking shit because they can't be bothered to fix a memory leak. And people are still happy about this? Straight up morons giving this a recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "runs like crap for coop. for no reason. 6 year old reddit posts indicate disabling voice chat on it fixed it. Has not fixed it for my friends and I. either way, the fact that this is still so broken and still being sold is an insult. Screw 2k and gearbox for doing this. Fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game and by extension this franchise could have been one of my all time favorites but sadly this release has so many unfixed issues from constant stuttering, memory leaks which the devs (in response to fan backlash) simply told us to \"just restart the game even now and then bro\" and a plethora of other stuff \n\nGet it with a cheap key you can find many for around 3-4 bucks 10 just ain't worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it comes to, I feel like this is a game designed only to be enjoyed in a certain scenario in a specific timeframe in mind; Playing it with your friends in the late 2000s because Borderlands 2 or most other modern looter shooters don't exist yet, and outside of that context, its kinda boring past the early hours of playtime.\n\nWhile the initial atmosphere at the start of the game is alright, a fairly desolute sci-fi wasteland, it gets pretty repetitive after a bit, especially once it all gets replaced with a trash city aesthetic for most of the last third of the game, and most content, story or side quests regardless, is both tedious and unsubstantial.\n\nThe main story missions are pretty much an excuse to just run around, shoot things, and head to the next area, with dialogue ranging from dry to unfunny, and side missions are usually laid out in the most annoying way possible, due to the single mission marker available at all times, leading to constant mindnumbing backtracking like because the third marked audio log of five of them was actually located midway between the first and second logs' position. And if it doesn't have that form of tedium, high chance you will still need to backtrack a fair distance just to hand in the quest, and that includes main story missions.\n\nI had to resort to just resetting the game via the main menu at points due to it being sometimes minutes faster than just walking/driving to certain waypoints.\n\nIt doesn't help that there is quite a lack of polish on some basic things, main characters that have no lip sync or are generally silent during story progress, awkwardly presented cutscenes that never seem to start or end right, or just odd level design that screams rushed and unfinished. I can give it a slight pass for the time and Gearbox's team size at the time, but nowadays it just does not feel like a tight and quality-checked product overall.\n\nI suppose the main focus then would be the gameplay, and the randomized guns, but its very unpolished and lacking, especially in comparison to the later games in the series. \n\nMost enemies just boil down to either some melee type thing running at you and failing to keep up as you run away, or aimbot bandits able to pinpoint hit you for quite a lot of damage across the map, making most tactics boil down to either taking cover to a jank and limited degree while you deal chip damage to them, or running up to them, one-shotting via headshots or blindly tanking the bullets, and using the 'kill or die' health state to easily get point blank headshots without much penalty. Now play like that for 30+ hours.\n\nGuns are weirdly underdeveloped for the most part, while they feel okay-ish if the ones you are currently wielding are up-to-par with stats, it really does feel you have the bog-standard shooter loadout (pistol, shotgun, machine gun, etc.) with slight deviations in scope zoom or reloading style on the most recent guns you have looted. Even then, most of them have very unreliable accuracy until maybe late New Game Plus where you've grind the weapon specializations quite a bit, though I suppose this is to vaguely make more important class-to-weapon type specializations according to their style and skills.\n\nAfter that, all the interesting weapons that try to break the mold are either quickly out-stated or extremely gimmicky, or locked off to the endgame stuff of New Game Plus where I feel most peoples excitement on the game would have burnt out unless they really want to grind them out via the limited options available at the game, and even then, there really isn't a lot to do that either hasn't been completed already, or is just aimlessly wondering the dull wastelands and trashfills shooting the same bandits you've been doing for dozens of hours. I just don't think there is remotely enough content in the game to warrant the gun randomization mechanic, much less burn hours of your life farming Borderlands 1 for more weapons that all feel the same for the most part.\n\nI would have hoped the DLCs would spice things up a little, added quite a bit of worthy content, but beyond their theming, they really are just more Borderlands for the most part, or much worse.\n\nThe Underdome is a tedious, godawfully difficult wave-based arena that might have one of the worst forms of achievement grinds I have ever seen (complete 300 rounds I think), but even forcing myself to do the bare minimum of 75 similar playing rounds for a single skill point (and you can do that again on New Game Plus if you REALLY want to) is just egregious time wasting for no benefit.\n\nZombie Island DLC is a zombie-themed DLC for Borderlands.\n\nOkay, seriously though, the Zombie DLC is near whats in the title, you get zombies. You shoot more zombies. Its got an alright campy horror vibe going on, but if you really feel like what you needed was a bunch of slow moving easily killed zombies in Borderlands to keep you going, then uh...I could recommend Left 4 Dead or something else that might keep you and your friends awake while playing.\n\nGeneral Knoxx DLC seems like an actual expansion more in line with normal Borderland's content, but is hampered by a lack of fast travel points and being fairly forgettable outside the limited armory you can access at the end of it, as well as some additional endgame farms to do, but I wouldn't really bother with all that, as by the time I think you would finally be doing all that, 99% of the game is probably done at that point, or so trivial at that point that grinding for 0.1% stronger guns seems incredibly pointless to me.\n\nThe Claptrap DLC idea seems fine, essentially being a last hurray of all the things you've dealt with in Borderlands + DLC with a Claptrap reskin, but its fairly short and small all things considered, but it still is more Borderlands in the truest sense, and doesn't add much to the final package of the game.\n\nOverall, I would just say either play a later Borderlands game, or consider some other choice for multiplayer.\n\nAlso, there is a memory leak problem in this version of the game that slowly eats your frames after what I believe is enough level transitions, so I hope you enjoy constantly full restarting the game every few teleports via fast travel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the highlights are good. very occasionally the game will throw a Headstone Mine or a Prison to worm through that has careful. linear fps quality design. Most of the time the game has to heavily lean on the psychological allure of numbers for its fun. It works until the very end of the campaign when you fall off the level-appropriate loot curve. Writing is abstractly good, it communicates an apocalypse where the only thing living in between the dry rocks are the most stubborn weeds, where hope is so absent and life is so fruitless that the prominent rational reaction is to laugh. You need that bleakness for the absurdity to work.\n\nThe dlc's aren't good. knox has a good dungeon if you turn off voices I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is so damn repetitive, ive forced myself to pla 9 HOLE HOURS (yes, thats A LOT for the experience i had) i was the hole time in that \"its gonna get fun anytime soon\" BUT IT NEVER DID",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam version does not support local co-op without serious workarounds. Why in the world would I want to play a looter shooter without local co-op?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play the game, doesnt even launch or start great game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work (crashes) on Ryzen 7900 and RTX 4070 Ti Super",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DIS GAME DONT EVEN WORK BRUH FIX YUR GAME,..,.,,.,.,.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken launcher, I am disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overcooked 2 is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BUGGY AS HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Take-Two Terms of Service\nUpdate on February 28, 2025 - Applies to all Borderlands games, yes, even the 13+ year old games that we've all been playing without issue.\n\nUnilaterally adding a new Terms of Service to a 13 year old game that makes the use of mods a bannable offense and makes it so that they can ban you for sharing bugs or exploits. While I doubt they will use this power they bestowed upon themselves against anyone in BL2 it will certainly be in use for BL4. Randy called people who displayed bugs or mods \"Internet Terrorists\" and now that company can ban you from all Borderlands games new and old.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 95
    },
    {
      "review": "Has a memory leak that doesn't exist in the original game and that they never bothered fixing.  Also removed the original, which still runs fine on modern systems, from sale forcing players to pay a premium for this broken version.  But hey, it has a silly hat for each of the original vault hunters...\n\nAt least it includes the original game, so if you buy this just play that.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I don't think this has aged well. I played it at launch with a group of friends and it was a lot of fun. There really hadn't been anything like it before. Returning back to it, it's a pretty empty world with minimal story. There's not much variation in weapons and the skills are underwhelming. Borderlands 2 just does everything better and so it should. If you have friends to play with and want to start the story from the start then by all means go for it. It's still going to be fun with company. If you're solo I'd suggest reading/watching a summary and starting with 2 at least.\n\nI also don't understand what was enhanced about this version. The graphics are near identical just a little brighter. People still have static faces when they speak. General Knoxx still has zero fast travel points and wastes your time with backtracking in what would otherwise be a good DLC. Moxxi's Underdome still doesn't give experience for any kills in what takes literally hours of mindless killing. The launcher doesn't even work.\n\nTannis and Scooter are at least genuinely entertaining characters.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "It's been two years since this game re-released, and they still haven't fixed the bug that bricks your keyboard input randomly for 5-10 seconds. Randy Pitchford you are a clown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Borderlands Game of the Year Enhanced is UHD version of Borderlands. I played the original Borderlands way back in 2009 and I have really fond memories of it. The original 4 player looter-shooter game that had us all hooked instantly and was the birth place of the genre in my opinion. (I know a game came before it but I forgot it's name).\n\nDoes it stand out in 2025? Is it worth it? Below I will let you know, so let's get to it!\n\n[h1][b] Cons [/b][/h1] \n⚫The gameplay is very outdated now. Compare it to Borderlands 2, BL2 blows it out the water in comparison and that's pretty old itself. \n⚫No real \"farming\" for the \"GAZILLION\" guns they advertise on the trailer. Again, compare it to BL2 and you will see what I mean.\n⚫The \"ENHANCED\" version of Borderlands has a MEMORY LEAK issue that has been here since day 1 and Gearbox/2K do not care about fixing it. That's 2 years and no fix for this yet. They tell you to \"Quit your game and relaunch it\" to solve this. How lazy.\n⚫Don't expect to slide or mantle, as I said - gameplay is pretty dated.\n⚫The gunplay is VERY dated also. \n⚫Gearbox lies about the final boss being better. It's still a boring bullet sponge with no challenge at all.\n\n[h1][b] Pro's [/b][/h1] \n⚫They added a Borderlands 2 type Minimap. This, this was sorely needed. All of us OG fans know the struggle.\n⚫You can now mark items as junk to sell them in vending machines or lock them/favourite them to stop you accidentally selling them. I cannot tell you how many times I sold my main guns.\n⚫They added SHIFT support which gives you 75 golden keys AND 2 legendary guns! This helped me get a start on TVHM!\n⚫The original 4 vault hunters - Lilith, the Siren. Roland, the soldier. Brick, the Berserker and Mordecai, the Hunter. These characters paved the path for future stories and other characters that got introduced. \n⚫You get to play all 4 DLC for free - The Zombie Island of Dr. Ned, Mad Moxxi's Underdome riot, The Secret Armory of General Knoxx and Claptrap's New Robot Revolution. All of which adds countless hours of playtime!\n\n[h1][b] My Verdict [/b][/h1] \nIt's been a long time since I last played Borderlands and to see it get a \"remaster\" all these years later, it breaks my heart to say - it's not worth it. It's dated. I get it's a remaster of a 2009 game and not a \"REMAKE\" but there are tonnes of games like Borderlands that are just better nowadays and, give you more bang for your buck.\n\nThe main issues why I cannot recommend the game is because of Gearbox's inability to fix the MEMORY LEAK issue and the outdated gameplay. If you wanted a Borderlands, buy Borderlands 2 GOTY, trust me... it's better in almost every single way.\n\nAt the end of the day, if the gameplay was as good as I remembered it to be and there was no memory leak issue - game would be a 8/10 but sadly I just can't recommend it over Borderlands 2 or the countless other Looter Shooters out there nowadays.\n\n[h1][b] 4/10 - A memory leak issue since day 1 not fixed and dated gunplay can make Borderlands a real slog. Let's be honest and not base it on nostalgia [/b][/h1]",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "killed the destroyer then logged off and was immediately greeted with a borderlands 4 ad covering the entire screen prompting to its store page.\n\n\npiss off you greasy slime ball randy.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Gearbox is not the same company that made this game. Avoid this and all of the products from them as they are using it as data collecting spyware. No borderlands games need anti cheat.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ADDITIONAL INFORMATION: This game's multiplayer doesn't work, the net code is absolutely awful. Also there's a major issue with memory leaks, idk what it is with incompetent developers \"enhancing\" games and somehow making them worse.\n\nDo not buy if you want to play with friends, the original works just fine.\n\nGot forced to play this game by a friend and I lowkey felt like I was in some kind of CIA torture scenario being sweated for information.\n\nMan, there is almost nothing about this game I actually like, it feels dated as all hell, the gun play is awful, the story is non existent, the skill trees are lack luster.\nIt's like a tech demo for Borderlands as a series. \nJust play any other borderlands game and experience a infinitely superior game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Every Borderlands games has become a billboard advertisement for the newest game that's released and the new terms sounds like the game is stealing private data too.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't recommend anything Randy Pitchford has slapped his impotent dick on, but there's still a memory leak in this \"ENHANCED\" edition years later. That's crazy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "nah.. not many enemy types and the weapons are too weak. its basically Mailman Simulator",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was very fun from PT1 to PT2, but the game has so much glaring bugs, and frustrating ways to die:\r\n\r\n- Getting killed because you got stuck on something and unable to be unstuck.\r\n- Game respawns you in a bad spot under heavy fire, only to be killed over and over.\r\n- Missing items when joining another game.\r\n- Weapons not regenerating ammo for some when its the same weapon type.\r\n- Missing extremely rare buy it happens, with but portion of money disappearing when loading a game.\r\n- Waypoints sometimes not displaying or not displayed properly.\r\n- Assassins force swapping your main weapon to a random one in your inventory.\r\n\r\nThe game was fun from play through 1 to 2, but after hitting level 69, the game has just become so frustrating to play from T Bone Junction onwards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "decent game but as of right now the launcher is broken, so you have to bypass by running the game as admin.\nplease fix this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "By the standards of 2025, this game is an endless, unrewarding grind. It's just not enjoyable. There's no sense of accomplishment if your time is worth anything. I played the Xbox 360 version and dumped time into that for the sake of playing with friends. It just hasn't aged well. If I wanted to feel like I was working after an already long day working, I'd get a second job and at least get paid for my efforts. I just can't recommend this game in a day and age when most people don't have the spare time required to let an update download before they can play, let alone play a game that just feels like a full time job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Multiplayer runs extremely poor; regularly below 20 FPS + 1 to 2 second action delays. Even on low graphics  settings and Enable Voice disabled on all players, these issues persist. I now understand why everyone is saying to play the standard GOTY instead of the enhanced GOTY. Thanks for destroying this would've-been-amazing remaster, Gearbox...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe I went in with too high of an expectation since this is *the* Borderlands, but the game was so clunky and repetitive to play that my friend and I gave up after three hours.\n\nAll quests are unvoiced, received through a wall of text in a very dated UI (and not in a charming way – it feels visually noisy and unpolished). 99% of them are “go to this place and shoot things”. There is almost no variety and the gameplay feels too clunky to sustain my drive to complete these just for the hell of it, since the other motivator – the story – feels like a side dish that the server forgot to bring you. It's tiring. There's no point in doing any of these quests except to get loot and level up, which again, would be fun if the actual gameplay was fun.\n\nAs it stands, the saving grace of Borderlands 1 is the art direction. The characters, environments and items all have heaps of personality and creativity poured into them. I was pleasantly surprised at some of the more cartoonish proportions they went with on the character designs and I would love to hang out more in this world, just not in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Runs like garbage on modern systems, have to do lots of file editing and tampering to try and fix it, And it still doesn't solve all the issues.\nBuy the original version (NOT ENHANCED) from a key retailer as it is far superior and runs like a dream.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "J'adore Borderlands. Je l'ai fait à l'époque de sa sortie et j'en garde un bon souvenir.\r\nCette version \"Enhanced\" n'a d'améliorée que le nom.\r\nOk les textures et le framerate sont là (parfois), mais le jeu est cassé comme jamais:\r\n- framerate qui chute et passe de 165 à 19 fps sans raison,\r\n- FPS locké à 90 en coop \r\n- chat vocal buggé qui prend trop de ressource en coop provoquant des lags (il faut le désactivé à chaque lancement),\r\n- bugs de collisions, de textures, de suivis de quêtes (marqueurs fantômes, objectifs qui se mettent pas à jours),\r\n- balles qui ne touchent pas vos ennemis en coop (et parfois en solo) même à bout pourtant, etc.\r\n\r\nEntre l'état du jeu et la mise à jour des CLU à la discrète...c'est vraiment une honte en 2025 pour une légende comme BL.\r\nAprés quand on voit la qualité de a communication du PDG du studio digne d'une cour d'école de maternelle...je ne suis pas vraiment surpris.\r\nDommage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 1 but with better graphics; great! Until you hit about level 30 and the memory leak obliterates you. There is a fix for it, but that should not have been left up to the players to do. Frankly pathetic. Getting <20 FPS on a 4090.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's what you can expect from a game that is over 15 years old and that is fine.\n\nThe memory leak, however, is not fine and ruining any fun to be had. You have to restart every hour and a half at most.\nPerformance feels sloppy in general, with the game dropping frames all over the place. Even after a fresh restart I will drop a good 50 or so frames for a few seconds every now and again.\n\nRTX 4080S\nRyzen 7 7800X3D",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The worst version of any game ever conceived, and it's not even close. This is the worst by a landslide lmao but it's fun if you troubleshoot it yourself I guess. I still wish it didn't black screen my PC and make a loud ass noise while doing it to scare the fuck out of me (and also set me back some progress while doing it). I think borderlands 2 kinda blows and this one's way better so there's that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is glitchy at best, some elements cause physics issues, game is moody when trying to snipe, which doesn't damage the enemy but alerts them, and their shots reach you easier than you reach them, these issues were not in the original version",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sooo, the game it's okay, i mean, it's not fun at all but it's borderlands I guess... but god damn, what the fuck is wrong with this \"enhancement\": the performance is fucking awful, if i play for more than an hour the game drops to 10 fps, this shit has a serious memory leak.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "muted but appealing (imo) art style\nDLCs are entertaining but short\nestablishes the basics for the Borderlands franchise with a few mechanics that aren't in the rest of the games\nsets up a lot of context (for the rest of the games) and is in my opinion, crucial to play in order to enjoy and understand the complete story\nI have A LOT of nostalgia for this game\n\nbad memory leak issues that exist in every iteration of this game (why didn't they fix this????)\ngame loves to bottleneck and only use one core on your CPU, and no real definitive fix exists\nI have noticed that performance SEVERELY degrades with many enemies in your immediate area, probably due to the CPU bottleneck\n(this makes any arena cause massive drops in framerate, I have found that the large quantity of rounds in the greater challenges for underdome to be almost impossible under these conditions)\nknoxx DLC has NO fast travel points (other than the one you take to travel there), almost ruined the entire DLC for me, but other than that it is quite good\n\nPlay if you love borderlands, but please don't make it your first because you will absolutely be turned off from the ENTIRE franchise",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game did NOT age well.\r\nPretty much everything in it is skippable. Nothing in the story is anything you need to know for the future games, and with the new ones being so much better, playing this one is really just an excercise in masochism",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I HATED my time with Borderlands 1 especially in the first playthrough, this game aged like spoiled milk, I gave no fuck about the story nor its characters, Soundtrack and ambience were pretty nice tho.\r\nI was actually having some kind of fun in the second playthrough... until the Claptrap dlc with its final mission being a boss rush with all the bosses being so spongy that I just decided to give up and throw in the towel.\r\nGameplay was undercooked too especially compared to its sequels.\r\n\r\n4/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "publishers will update 20 year old games to add bullshit clauses and terrible launchers, but they won't update the game to make it actually run properly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck off, 2 years after release and it runs like fucking shit because they can't be bothered to fix a memory leak. And people are still happy about this? Straight up morons giving this a recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "runs like crap for coop. for no reason. 6 year old reddit posts indicate disabling voice chat on it fixed it. Has not fixed it for my friends and I. either way, the fact that this is still so broken and still being sold is an insult. Screw 2k and gearbox for doing this. Fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game and by extension this franchise could have been one of my all time favorites but sadly this release has so many unfixed issues from constant stuttering, memory leaks which the devs (in response to fan backlash) simply told us to \"just restart the game even now and then bro\" and a plethora of other stuff \n\nGet it with a cheap key you can find many for around 3-4 bucks 10 just ain't worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When it comes to, I feel like this is a game designed only to be enjoyed in a certain scenario in a specific timeframe in mind; Playing it with your friends in the late 2000s because Borderlands 2 or most other modern looter shooters don't exist yet, and outside of that context, its kinda boring past the early hours of playtime.\n\nWhile the initial atmosphere at the start of the game is alright, a fairly desolute sci-fi wasteland, it gets pretty repetitive after a bit, especially once it all gets replaced with a trash city aesthetic for most of the last third of the game, and most content, story or side quests regardless, is both tedious and unsubstantial.\n\nThe main story missions are pretty much an excuse to just run around, shoot things, and head to the next area, with dialogue ranging from dry to unfunny, and side missions are usually laid out in the most annoying way possible, due to the single mission marker available at all times, leading to constant mindnumbing backtracking like because the third marked audio log of five of them was actually located midway between the first and second logs' position. And if it doesn't have that form of tedium, high chance you will still need to backtrack a fair distance just to hand in the quest, and that includes main story missions.\n\nI had to resort to just resetting the game via the main menu at points due to it being sometimes minutes faster than just walking/driving to certain waypoints.\n\nIt doesn't help that there is quite a lack of polish on some basic things, main characters that have no lip sync or are generally silent during story progress, awkwardly presented cutscenes that never seem to start or end right, or just odd level design that screams rushed and unfinished. I can give it a slight pass for the time and Gearbox's team size at the time, but nowadays it just does not feel like a tight and quality-checked product overall.\n\nI suppose the main focus then would be the gameplay, and the randomized guns, but its very unpolished and lacking, especially in comparison to the later games in the series. \n\nMost enemies just boil down to either some melee type thing running at you and failing to keep up as you run away, or aimbot bandits able to pinpoint hit you for quite a lot of damage across the map, making most tactics boil down to either taking cover to a jank and limited degree while you deal chip damage to them, or running up to them, one-shotting via headshots or blindly tanking the bullets, and using the 'kill or die' health state to easily get point blank headshots without much penalty. Now play like that for 30+ hours.\n\nGuns are weirdly underdeveloped for the most part, while they feel okay-ish if the ones you are currently wielding are up-to-par with stats, it really does feel you have the bog-standard shooter loadout (pistol, shotgun, machine gun, etc.) with slight deviations in scope zoom or reloading style on the most recent guns you have looted. Even then, most of them have very unreliable accuracy until maybe late New Game Plus where you've grind the weapon specializations quite a bit, though I suppose this is to vaguely make more important class-to-weapon type specializations according to their style and skills.\n\nAfter that, all the interesting weapons that try to break the mold are either quickly out-stated or extremely gimmicky, or locked off to the endgame stuff of New Game Plus where I feel most peoples excitement on the game would have burnt out unless they really want to grind them out via the limited options available at the game, and even then, there really isn't a lot to do that either hasn't been completed already, or is just aimlessly wondering the dull wastelands and trashfills shooting the same bandits you've been doing for dozens of hours. I just don't think there is remotely enough content in the game to warrant the gun randomization mechanic, much less burn hours of your life farming Borderlands 1 for more weapons that all feel the same for the most part.\n\nI would have hoped the DLCs would spice things up a little, added quite a bit of worthy content, but beyond their theming, they really are just more Borderlands for the most part, or much worse.\n\nThe Underdome is a tedious, godawfully difficult wave-based arena that might have one of the worst forms of achievement grinds I have ever seen (complete 300 rounds I think), but even forcing myself to do the bare minimum of 75 similar playing rounds for a single skill point (and you can do that again on New Game Plus if you REALLY want to) is just egregious time wasting for no benefit.\n\nZombie Island DLC is a zombie-themed DLC for Borderlands.\n\nOkay, seriously though, the Zombie DLC is near whats in the title, you get zombies. You shoot more zombies. Its got an alright campy horror vibe going on, but if you really feel like what you needed was a bunch of slow moving easily killed zombies in Borderlands to keep you going, then uh...I could recommend Left 4 Dead or something else that might keep you and your friends awake while playing.\n\nGeneral Knoxx DLC seems like an actual expansion more in line with normal Borderland's content, but is hampered by a lack of fast travel points and being fairly forgettable outside the limited armory you can access at the end of it, as well as some additional endgame farms to do, but I wouldn't really bother with all that, as by the time I think you would finally be doing all that, 99% of the game is probably done at that point, or so trivial at that point that grinding for 0.1% stronger guns seems incredibly pointless to me.\n\nThe Claptrap DLC idea seems fine, essentially being a last hurray of all the things you've dealt with in Borderlands + DLC with a Claptrap reskin, but its fairly short and small all things considered, but it still is more Borderlands in the truest sense, and doesn't add much to the final package of the game.\n\nOverall, I would just say either play a later Borderlands game, or consider some other choice for multiplayer.\n\nAlso, there is a memory leak problem in this version of the game that slowly eats your frames after what I believe is enough level transitions, so I hope you enjoy constantly full restarting the game every few teleports via fast travel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the highlights are good. very occasionally the game will throw a Headstone Mine or a Prison to worm through that has careful. linear fps quality design. Most of the time the game has to heavily lean on the psychological allure of numbers for its fun. It works until the very end of the campaign when you fall off the level-appropriate loot curve. Writing is abstractly good, it communicates an apocalypse where the only thing living in between the dry rocks are the most stubborn weeds, where hope is so absent and life is so fruitless that the prominent rational reaction is to laugh. You need that bleakness for the absurdity to work.\n\nThe dlc's aren't good. knox has a good dungeon if you turn off voices I guess.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}