{
  "positive": [
    {
      "review": "Creepy atmosphere and a solid old-school zombie survival vibe. Feels a bit clunky, but fun when you get into the grind.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "idea of the game is pretty much the same as the first one. there's more depth to the mission system, and there's now a car instead of an in base fast travel. no more classes, but there are skills to choose from. combat system is ok, but the melee is janky until u get used to it. this one is solid for what it is",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really good, and i hope more updates in the future :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sheer fact that this dev has continued to regularly update this game after so many years has earned my vote for the Labor of Love category. There's some mundane areas of gameplay, but overall it's a solid game, and I've encountered very few bugs in my time of playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alot more people should play this game imo, i truly love the lore of this game even tho it seems a bit hidden, it's an awesome story and i really wanna see more of this, to be honest there should be a movie but from my understanding it's a very small team working on this, so pls be patient and give this game the time and love it deserves, that's how i feel about this game :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "can not connect to the server right now tried everything to troubleshoot the problem but it still persists.. any advise would be greatly appreciated",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like the atmosphere of Silent Hill mixed with Resident Evil (the first games) and looot of looting then this game is for you! Everything you loot can be sold at the trader. Unlike other games, the trader is an actual auction house where players decide the prices! \nBeware the game will not hold hands from the first level, so is better to play with a friend and ask around other players!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a very cool and awesome game i love it alot sometimes when stalker comes i get a lil jumpscare but ive seen monsters that i didnt think i would see wich made the game alot more awesome iam very appriciated",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game! lots of fun in co-op, and i really enjoyed the dark graphics, without being too overdone",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i invite my noob friend in this game bcs he love zombie games like RE, World war z. or king like zombie survival game. then i recommend this game base as him love.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "a good mindless zombie game. can get hard very quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really did not know about this game and I am happy to find it. It is such a cool game and it is free. It is for real a sweet deal. It is a game you can play during your weekends and chill around. I first played it for 4.5 hours and it felt like I just played it for 30 minutes. Time be wilding. XD!\n\nI downloaded this game a long time ago, and just ignored it because I judged the book by it's cover, and I am insanely glad I tried it today. So much fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game just waiting for my armor and gear!! maybe your own outpost",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's acceptable, but it definitely falls short compared to Dead Frontier 1 with its top-down style. I expect that Dead Frontier 3 will be an improvement if it's developed. I only recommend playing as a time waster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dead Frontier 2 — динамичный шутер в стиле зомби с открытым миром. Игра предлагает яркие графические эффекты, разнообразные миссии и возможность играть в команде. Сюжет заставляет бороться с апокалипсисом, а механика стрельбы и выживания напоминает Left 4 Dead, но с элементами RPG. Однако, сложность баланса и частые технические сбои могут оттолкнуть новичков. Для любителей жанра — достойный выбор, но требует терпения к оптимизации.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to relax after work, would be nice to see some graphic upgrade, but overall game is great!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i keep getting disconnected every 5min whenever i open loot or try to consume something",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and a really good game in my opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love to play this games to killed people and make them bloods",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still a fun game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "бесплатная игрушка",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pretty hard and scary",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "dula na mo kay para naa koy ka party",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fye",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grind",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game might feel like it starts off kind of slow. Many of the weapons you have access to in the early game have low rates of fire. But at the same time, it's not too hard to deal with early-level zombies using these slightly underwhelming guns. So like I said, the start can feel a little slow...\n\nHOWEVER, it can offer a surprising amount of fun if you spend some time with it, get to understand it, grind for gear and levels, and start venturing into the higher-level areas.\n\nI often play it for a week or two and then take a break and rotate back to it again.\n\nYou can easily host a server with or without a password and have random people or your friends join.\n\nFor a free co-op zombie shooter with some vibes inspired by older zombie-type games, it really is pretty decent.\n\nOne of the crazy things is that the developer is, as far as I know, just one guy who has been actively working on the DF games since... well, probably before 2008 (DF1 open beta started sometime in 2008).\n\nUPDATE: I've had a chance to really experience some of the updates I've missed during one of my longer breaks from the game. They have added many QoL updates which makes the game even more fun. Navigating the in-game menus like inventory, storage, and marketplace, and even checking your food/drink/health/armor levels used to be somewhat tedious, but not enough to keep me away from the game. But now the interface has been modernized and optimized, and it looks and feels excellent.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The male zombie with the apron a baddie and the zombie in the red dress got a fatty.\r\n\r\nWould tap both, 100/10",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Its okay. I like the feel of the game, Its a true horror game with good varieties in enemies. However, it does get a little repetitive after awhile.\n\nAll in all, I recommend this game for horror fans.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Dead Frontier 2 is honestly worth the time if you grew up on the old Resident Evil games. It’s got that same vibe as RE1 and RE2 — dark hallways, ammo scarcity, slow zombies that still manage to keep you on edge. It feels like survival horror again, not just run-and-gun.\n\nWhat I like is that it’s simple at the core: loot, survive, and fight your way through tight, creepy spaces. It doesn’t try to be overly flashy, and that almost works in its favor. The atmosphere is heavy, the tension is real, and when you’re low on bullets you feel it. It scratches that classic horror itch I didn’t know I missed.\n\nSure, it’s rough around the edges — some areas repeat, the UI feels clunky, and the backtracking can make it feel like a “running simulator” if you’re solo. But once you link up with other players, it turns into this grimy, Resident Evil-inspired MMO where teamwork actually matters. It’s not pay-to-win, it’s free, and the dev is clearly putting in work to keep it alive.\n\nIf you liked the old school Resident Evil survival horror loop, Dead Frontier 2 is a solid throwback. Dark, stressful, and rewarding when you finally clear an area with just a few bullets left. Definitely worth a download and some hours of your time.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "it is a fun game to play if you have no money on steam but i wish the devs could allow you to have first person or fix on the way the zombies get in front of you where you have to turn more down left to shoot them even though your weapon is in their face and it would miss, also would be nice to have better markers for stuff or keep some stuff if you die and be able to edit difficulty from time to time for new players or returning players",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Creepy atmosphere and a solid old-school zombie survival vibe. Feels a bit clunky, but fun when you get into the grind.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "idea of the game is pretty much the same as the first one. there's more depth to the mission system, and there's now a car instead of an in base fast travel. no more classes, but there are skills to choose from. combat system is ok, but the melee is janky until u get used to it. this one is solid for what it is",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really good, and i hope more updates in the future :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The sheer fact that this dev has continued to regularly update this game after so many years has earned my vote for the Labor of Love category. There's some mundane areas of gameplay, but overall it's a solid game, and I've encountered very few bugs in my time of playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I Believe this is my first review ive ever left for a game. Thats because its been sitting in my library and I decided to play it after a few years of passing by it as I uninstall/ download game after game and this game is actually pretty good. It literally reminds me of RE1/ RE2 but as a mmo looter.  its pretty basic but I think its free and I could see myself dumping hours in this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Alot more people should play this game imo, i truly love the lore of this game even tho it seems a bit hidden, it's an awesome story and i really wanna see more of this, to be honest there should be a movie but from my understanding it's a very small team working on this, so pls be patient and give this game the time and love it deserves, that's how i feel about this game :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i love how this game is played out like resident evil a bit, it gives such an option and more exploration ingame, overall 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "can not connect to the server right now tried everything to troubleshoot the problem but it still persists.. any advise would be greatly appreciated",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[quote][i][b]SHORT REVIEW :[/b][/i] in the huge world of free-to-play zombie games, this is another pointless shoot and loot, while it keeps staying in its basic and rough form instead of being a decent alternative to other similar games. A no-price time-waster, with a nice player base that makes the experience less boring and more cheerful.[/quote]\n\n[i][b]> Gameplay ( 6.0 / 10 ) :[/b][/i] a typical third-person shooter with MMO mechanics: take quests in a safe zone, explore buildings for useful items and zombies to kill, go back to the base to receive quest rewards, sell what you don’t need and leave again for another mission.\n[i][b]Very basic levelling[/b][/i] system, skills give bonuses in combat. The “hunger” for experience is the only reason to bear all those same and boring quests. Weapons and shooting work pretty well, nice variety in weapons, but they all feel the same.\n[i][b]Looting[/b][/i] is totally random; you have to search hundreds of places for a tiny chance to find a useful item: for that, levels don’t matter at all.\nNice [i][b]players’ market[/b][/i] to sell/buy items, but the only ones worth trading are meds, ammo and food. [i][b]Crafting is limited[/b][/i] to a few items (most of them are only for paying users) and requires rare or expensive objects.\nThe [i][b]map is too big[/b][/i] and travelling is a [i][b]waste of time[/b][/i]. There is a car, but it works only as a teleport between three zones. Even moving inside buildings is annoying (loadings at every door, huge quantity of empty rooms).\n[i][b]Server issues[/b][/i] are quite frequent : a lot of lag, waiting for response, random disconnections and freezes.\n\n[i][b]> Narrative ( 6.3 / 10 ) :[/b][/i] same clichés and usual stories about experiments, viruses and strange mutations.\nWe can find notes and documents that give us experience points and provide information about the whole story. Most of the writings lack details and depth, looking like useless texts.\nGood [i][b]voice acting[/b][/i] for a reasonable number of lore items.\n\n[i][b]> Aesthetics ( 5.6 / 10 ) :[/b][/i] the game offers a nice view of a decadent world; textures and models have a decent quality, the look of zombies and bosses is quite unique. Most of them are clearly assets directly taken from the market, as they have [i][b]no personality or detail[/b][/i].\n[i][b]The map is uselessly huge, empty and repetitive[/b][/i]. Most of the locations are the same (probably some kind of random generation of rooms).\n[i][b]Visual effects[/b][/i], like meteo or fog, look nice, but used to reduce rendering distance and improve not so good performance. They tried to give the world a gloomy aesthetic, but the feeling is of a world abandoned to laziness.\n\n[i][b]> Sound ( 5.0 / 10 ) :[/b][/i] the sound design has been left to the [i][b]bare minimum[/b][/i]. Apart from the good sampling of weapons and zombie noises, DF2 doesn’t even try to fill the emptiness of its world. No ambient sounds, just a few objects reproducing the same audio tracks (like fires or radios). Some other sounds, like a random screaming woman, are instead very annoying, and it would have been better not to put them at all.\nSame negative thoughts for the music too, lacking in variety and suffering from repetitiveness.\n\n[i][b]> Challenge ( 5.8 / 10 ) :[/b][/i] as many other free MMOs, DF2 tries to stretch as much as possible the whole game experience. Half the time you spend it on travelling, the other half is spent killing dozens of zombies that get in your way.\nThere are [i][b]puzzles[/b][/i] inside rooms, but they are very silly and easy to solve.\nThe total randomness in items means [i][b]no real progression or ability[/b][/i], only too much grinding to find what you need. In fact, the difficulty of the game is to find the best weapons’ stats and trying to level up as quickly as possible.\nMost [i][b]zombies are idiots[/b][/i], and they hit you only due to some bug or error (like a tiny chair blocking your way). Bosses take time to beat because you need to hit-and-run for five minutes while spreading tons of ammo.\nAt least there are [i][b]periodic events[/b][/i] (like weekend exp boost or daily public zombie bosses) that help us earn more experience and give a small variety to the usual boredom.\n\n[b][i][u]> Overall Rating ( 5.7 / 10 ) < [/u][/i][/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "In the crumbling outskirts of Wolfstable Police Station, where shadows stretched longer than the nights and the stench of rot clung to the cracked concrete like a curse, three unlikely survivors emerged—not as lone wolves, but as a pack.\n\nTheir names were Abraham Kirk, Bahdek Kirk, and Prabhat Kirk—no blood relation, yet all bore the same last name like a worn badge of fate. Before the outbreak, they were strangers. But in the gnawing grip of the undead apocalypse, they would become something more: brothers not by blood, but by bond, survival, and something deeper—being Indian in a land far from home.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Cool game I've ever played. Stalker is really bad, when you see him just run, man....",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It's like playing Resident Evil Outbreak but only better!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dead Frontier 2 is one of those games you try on a whim and end up losing hours to without really noticing. It’s not flashy, it’s not trying to be something it isn’t, but it nails the atmosphere better than most big zombie titles out there.\n\nThe world feels properly grim. Every building you step into is dark, cramped, and full of that uneasy silence that makes you think twice before opening the next door. It’s the kind of game where even looting a bathroom stall feels tense because you genuinely don’t know what’s waiting on the other side.\n\nCombat hits a nice balance between clunky and satisfying. Guns feel powerful but precious, and melee weapons feel like desperate last resorts, which fits the setting perfectly. When you manage to clear a room without wasting half your ammo, it’s weirdly rewarding.\n\nProgression is steady and surprisingly addictive. Finding better gear, levelling up, tweaking your build—it all adds to that “one more run” loop. And seeing other players out in the world gives the game a sense of community, like everyone’s just trying to survive the same miserable apocalypse together.\n\nSure, it’s rough around the edges. Some animations are stiff, and there are moments where the game feels a bit unforgiving. But honestly, that roughness almost adds to the charm. It feels like a proper survival experience rather than a polished theme park ride.\n\nIf you like your zombie games tense, atmospheric, and a bit scrappy, Dead Frontier 2 is absolutely worth your time.\n\nMy First Glance Rating: 8.4 / 10\n\nGritty, moody, and far more absorbing than you’d expect at first glance",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like the atmosphere of Silent Hill mixed with Resident Evil (the first games) and looot of looting then this game is for you! Everything you loot can be sold at the trader. Unlike other games, the trader is an actual auction house where players decide the prices! \nBeware the game will not hold hands from the first level, so is better to play with a friend and ask around other players!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a very cool and awesome game i love it alot sometimes when stalker comes i get a lil jumpscare but ive seen monsters that i didnt think i would see wich made the game alot more awesome iam very appriciated",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game! lots of fun in co-op, and i really enjoyed the dark graphics, without being too overdone",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i invite my noob friend in this game bcs he love zombie games like RE, World war z. or king like zombie survival game. then i recommend this game base as him love.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "a good mindless zombie game. can get hard very quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really did not know about this game and I am happy to find it. It is such a cool game and it is free. It is for real a sweet deal. It is a game you can play during your weekends and chill around. I first played it for 4.5 hours and it felt like I just played it for 30 minutes. Time be wilding. XD!\n\nI downloaded this game a long time ago, and just ignored it because I judged the book by it's cover, and I am insanely glad I tried it today. So much fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game just waiting for my armor and gear!! maybe your own outpost",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's acceptable, but it definitely falls short compared to Dead Frontier 1 with its top-down style. I expect that Dead Frontier 3 will be an improvement if it's developed. I only recommend playing as a time waster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dead Frontier 2 — динамичный шутер в стиле зомби с открытым миром. Игра предлагает яркие графические эффекты, разнообразные миссии и возможность играть в команде. Сюжет заставляет бороться с апокалипсисом, а механика стрельбы и выживания напоминает Left 4 Dead, но с элементами RPG. Однако, сложность баланса и частые технические сбои могут оттолкнуть новичков. Для любителей жанра — достойный выбор, но требует терпения к оптимизации.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to relax after work, would be nice to see some graphic upgrade, but overall game is great!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "stuck to this ever since it was a browser game. To watched it grow into this really amazed me. i enjoy it solo cuz it terrifies me in a way i like and doesnt  steer me away like most zombie games do",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic premise and enjoyable. needs a lot of work but there's literally nothing like it so I hope it continues to thrive and grow <3 still playable as is",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"MMO Resident Evil\" from what I see in the gameplay itself and very slow from the start. Looting is the game's main objective, you go out there with your starting character with an IKEA wood plank and start smashing zombies in every house you go into until you find ammo/weapons/clothing etc. It's a good game to play alone or with few friends perhaps and you get exhausted if play it straight for 5 hours so, I recommend breaks from time to time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ok, let's review this game first. \n\nIn short, this game is a free shooter looter MMORPG with strong early resident evil vibes (Racoon city) and a touch of silent hill atmosphere sometimes specially outdoors. The combat also reminds me of State of Decay 1 big time but way less focus on survival elements here and more on the shooting and the looting. Its like Resident Evil, State of Decay and Diablo had a 3rd person shooter love child.\n\nThe game does indeed get repetitive with the grind but I think the dev did a great job with the atmosphere here and instances do look varied depending on the building/establishment so houses will have a different look from restaurants and so on. The game's lore is mostly known through lore notes and tape records you loot as you do missions and grind. It adds to the immersion and atmosphere big time. There are no cinematics so far, its all live and on the go which fits the fastpaced gameplay of looter games but also without compromising the atmosphere.\n\nIt does have some jank and instance corridors can branch way too much for my liking that the grind can feel rather repetitive and it is also way too overly dark outdoors for my liking specifically at night and it could still use some more QoL here and there\nBUT it does have its own charm and I can see lots of passion put into this project. I heard the game is made by a solo dev and I still see the dev updates this game and continues working on it even after 7 years and I've got to say I always respect devs who respect their project.\nNote that this also a game that doesn't hold your hand. Its very old school in that sense.\n\nThe community has been so chill so far and they remind me of good old internet days and you can't imagine howmuch I appreciate that personally but then the dev went a step ahead and also implemented a singleplayer mode. \nWorth noting that the community on the game's official discord has been extra helpful as well and they've been welcoming and nice.\n\nThis game is even more fun with friends, too and guess what? It also has a coop mode where you can host a room (with password if you like) to play alone with friends so the game has an MMO mode, a coop hosted game mode and a singleplayer mode and your progress is saved across all of them.\n\nAfaik, the game is also not high on requirements and can work on potato PCs well. There are lots of graphical options and resolution options.\n\nFor those curious, here's a little history of my personal experience with this game, I think the first time I played the prequel to this game (Dead Frontier 1) was like on 2012 or so. I really liked the concept of a free to play zombie shooter MMO at the time which was not a very common thing and is still not that common to date either. However, back then, I couldn't get into the game because, I was still a kid and I didn't know how resource management (specially when it comes to Ammo) works in survival games so I left it for a long time since then. \n\nFast forward several years later, I saw Dead Frontier 2 on steam and it caught my interest then I realized its the sequel to the older game Dead Frontier 1 but 3rd person instead of isomteric this time. I wanted to try it out but at the time, I had a potato PC and was scared if it might not run smooth then skipping a few years later and on around 2023, I had a better PC by then so I gave it a try and I've been playing it fairly casually since then. No regrets, one of the best free MMOs out there, IMO.\n\nThank you for this gem, keep up the good work. Its a breath of fresh air to see passionate projects in this age regardless of the jank.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is amazing fun to play trade system is good and all player based lots of challenges and diffrent things to do. and most of all its not a pay to win game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "сетевая игра зашел ненадолго с другом ,даже есть система данжей и боссов, сырая но вайбик имеется",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game but you need to change something is shooting don't need to click right click on the mouse",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the game as so much potencial yet the devs are so slow for everything.  theres so many ideas and sugestions never implemented.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "welcome to the looter game , where looting is the joy and sadness of this game. if u like to loot and hoarding, then u will definately like this game, the game community is great, they often give their loot to help new player or power carry u in mmo mode. \n\nTHIS IS LOOTER GLORY HOLE",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game does have some WONKYness to it like graphics other aspects, but overall its a playable game.\nPros:\nMMO feel, kill zombies with friends, create specalized builds for example I made a shotgun using character, Raids at endgame, Loot and shoot turn brain off gameplay, Unique bosses there is a zombie that goes invisible for instance, you can boost leveling pretty fast took me a week to get max level 60 and there are 15 prestige levels beyond that at 10m exp each. Each house in the open world plays like a dungeon has a key room and a boss room in every one. Loot is insanely RNG, each piece of gear rolls affixes which determines if it is good or not sort of diablo or Path of exile like. Shotgun feels super satisfying to play.\n\nCons:\nGame is free so what is the catch? Credits can be bought to sell to other players to avoid the grind for money in game. Gold membership, Event items that are BIS and you gotta wait until they come back around to aquire them. Remotely good items are millions of cash in game. Market searching for gear is a pain because you can only search 3 affixes making it hard to find exactly the items you are looking for. One of the endgame raids is a SPIDER boss so if you are arachnaphobic maybe give it a pass, but they are endgame. Daily reset system, I don't really like because if I wana grind something out I wana do it all day. First few hours will feel like crap, but the game does eventually open up when you realise what build you want to make. Respecing costs credits so if you mess up your points it will cost 100 credits ~1.3mil cash in game, you are allotted one FREE respec allowing you to fix or change to a different build. Endgame bosses are bullet sponge especially if your build isn't geared out. Loot can be insanely RNG. Little to no gear crafting exception for upgrades which improves the lvl and depending on rarity tier upgrading that to the next rarity aswell.\n\n\nIn short do I reccomend the game, only because it has a pricetag of free and the paid features don't really ruin the personal experience much. \n\nThings I would change to the game add loot dropping from normal overworld zombies, Checkpoint system for when you do die at a raid or in a house you can med back up and go straight back in currently walk of shame back if you die and it can be a rather long walk, more outpost locations 3 isn't enough, update UI to display quests you tracked or are on track to complete, allow partying up in the MMO mode, make armor and health pool more meaningful me at max level and spec into armor and life still gets two shot by most endgame mobs, more loot chances as it stands you only get 3 or 4 loot spots in a house it would be better to make loot possible behind all doors instead of the expected boss and key rooms what if you are struggling and just need to find something without doing the boss. Also add bosses spawning in the outpost defenses, MMO mode needs some world bosses that can give unique to that boss loot. Unique items seem too rare I had 200% unique item find and found no uniques for a week of grinding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is actually a good game, wishing for more updates soon!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played this game ( Dead Frontier 2 ) more than 1000+ hours. So if you want to play this game then my advice is definitely try it, but in early game ( 0 to 50 level ) you might face some problems like -\r\n\r\n1) Running out cash.\r\n2) Running out medicines and ammo.\r\nAnd so on .....\r\n\r\nBut you will get helped by many players in MMO mode. \r\n\r\nIF you will play with your friends then this game much more enjoyable.\r\n\r\nYou will get helped and advised in Discord server.\r\n\r\nMain thing is this game is FREE. 😇\r\n\r\nIf you love digging, this game is for you.\r\n\r\n( forgive me for grammar or spelling mistakes )",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't love this game and i don't quite hate this game but you can only say Yes or No so its a Meh. The Game is extremely repetitive and despite all the quests being written differently there all the same fetch, Find, or kill and return to the safe building. + The game well not being pay to win dose have aspects of it if you know you know. only reason i have this set to a Positive review is because its free to play and you don't have to spend money if you don't want to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun gameplay and an excellent, helpful community. The atmosphere is dark, gritty, and incredibly well crafted—it really captures that survival horror tension. The perk system is unique for an MMO, offering a surprising amount of build diversity and freedom.\n\nI’d love to see PvP evolve into a Zombies vs. Humans mode, where players could take on mutated roles—there’s a lot of potential there for deeper immersion and strategy.\n\nCurrently running a Tank Chainsaw build, and it’s holding up nicely in PvE. Overall, a great experience that balances intensity, community, and creativity in a way few MMOs manage.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a pretty decent zombie game. Lots of grinding and items to find. It's a bit of a learning curve to start with. Don't be afraid to experiment on your first character to figure out what you like before you heavily invest into a certain build. The more characters you have, the better. You'll need all the inventory slots you can get to store random items.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i get that its meant to be well, scary. but the sounds of the slugs make me want to puke my fucking intestines out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i keep getting disconnected every 5min whenever i open loot or try to consume something",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked the quantity of hotels, not too many, not too few",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun and a really good game in my opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so far its really fun, its like if 7 days made an rpg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I need friends to play, one of my boys dipped to play fortnut",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game! Very fun to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love to play this games to killed people and make them bloods",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it is fun and udickding",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great coop experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, it's just that good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pretty hard and scary",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like zombie games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "dula na mo kay para naa koy ka party",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "бесплатная игрушка",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FUN WITH FRIEND",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fye",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Grind",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ass",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game might feel like it starts off kind of slow. Many of the weapons you have access to in the early game have low rates of fire. But at the same time, it's not too hard to deal with early-level zombies using these slightly underwhelming guns. So like I said, the start can feel a little slow...\n\nHOWEVER, it can offer a surprising amount of fun if you spend some time with it, get to understand it, grind for gear and levels, and start venturing into the higher-level areas.\n\nI often play it for a week or two and then take a break and rotate back to it again.\n\nYou can easily host a server with or without a password and have random people or your friends join.\n\nFor a free co-op zombie shooter with some vibes inspired by older zombie-type games, it really is pretty decent.\n\nOne of the crazy things is that the developer is, as far as I know, just one guy who has been actively working on the DF games since... well, probably before 2008 (DF1 open beta started sometime in 2008).\n\nUPDATE: I've had a chance to really experience some of the updates I've missed during one of my longer breaks from the game. They have added many QoL updates which makes the game even more fun. Navigating the in-game menus like inventory, storage, and marketplace, and even checking your food/drink/health/armor levels used to be somewhat tedious, but not enough to keep me away from the game. But now the interface has been modernized and optimized, and it looks and feels excellent.",
      "voted_up": true,
      "votes_helpful": 7
    }
  ],
  "negative": [
    {
      "review": "Game is a pay 2 win scheme. The creator does not like any sort of negative view and will BAN you if you talk down on the game. Full of Chinese hackers and whales.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "[h1]A 5/10 game, with 0/10 developers/moderators[/h1]\nThe developers are the problem, not the game. This games development seems to have been slowly moving at a snails pace over years now since its launch, with some major updates that have for sure brought it forward. But unfortunately it seems the devs don't know what they are doing anymore. The most recent update is an event to incentivise PvP, when the vast majority of players have little to no interest, as is the case for me, with the PvP. \n\nNo one wants to play with the certain people from certain parts of the worlds who unethically partake in PvP events, killing on sight, and just typical high-level stomping of lower level players. Its some form of tyranny they've learnt to cope with in their own personal lives. And its just not for the rest of us.\n\nSo when the devs realise, lets get back to PvE, and lets stop trying to think tank every new update as a business idea, instead of going back to the love of making this the game it was meant to be. PvE, co-op focus, mmo. And we can start getting some QoL fixes and features that will actually make people want to come and play with their friends and not worry about dumb grinds and rubbish ideas in the game that actually make you stop and go \"seriously why is this game like this?\", the faster it can grow again.\n\n[h2] But it gets better![/h2]\nThis is hilarious! I saw someone else say that the devs don't like it when people say things they disagree with, but this is a whole new level. Check this out.\n\n[quote=Steam Support]\nYou have been banned from Dead Frontier 2 Community Hub\nYou have been banned from Dead Frontier 2 Community Hub by a forum moderator for your post in \"UPDATE: THE PURGE\":\nWaiting to see more QoL Co-op and PvE content for this game to actually play with friends.\nSee waste of time development on PvP.\nNice to see it still have its time wasted,\nDo the people who originally visioned this games PvE, not get to speak in that studio anymore or whats going on?\nDUMP THE PVP.\n\nBan Reason:\nTrolling, 7 years old lvl 6 account.\n\nWhile this ban is active, you will not be able to post or comment in the Dead Frontier 2 Community Hub or upload new content to this community hub.\n\nIf you believe this ban was issued by mistake, please contact Steam Support.\n\nThis is a permanent ban.\n[/quote]\n\nIncredible honestly. A developer (Now identified as APwn) has looked up my steam account, because they were so infuriated with my comment on their \"Steam discussions\" talking against their PvP. Did my post go against Guidelines? No? Did I start a fight with someone? No? Did I have a DISCUSSION on the DISCUSSION BOARD? Yep. \nThey permanently banned me from the discussions, furthermore, they deleted my account and banned me from the servers based on this one interaction, I haven't in fact played in 7 years, and this is the first thing I have written on their discussions since then as I was looking to return and saw they are still making rubbish PvP updates for their hacker player base :')\n\nI rest my case.....\n\n[h3]Response to Developer response[/h3]\n[quote=APwn]\nPosted: 18 Nov @ 6:52pm\nYou don't even play the game and are spamming our forums with abuse over a completely optional update that you've never even bothered to try out for yourself. So yes, you have quite rightly been banned.\n\nIf you don't like PvP, you don't have to take part. It's an optional event for people who like PvP. It in no way affects the game for people who just want to PvE.\n[/quote]\n\nI do play? And I posted one post on the 18/11/2025 for the first time as I have shown in this review, and now you claim I was \"spamming your forums\", which upset you, and you decided to permanently ban me from the Steam discussion forever? Omg grow up hahaha. I don't care that you are having a cry about it, but you don't have to start lying to try and help yourself feel better. Just admit you are terrible people and move on now. You cant even admit you are wrong here, you are arguing with your player base, this is hilarous, so pathetic. You have earnt this 0/10 rating and negative review.\n\n[quote=APwn]\nPosted: 21 Nov @ 11:53pm\nDeveloper response:\nAPwn  [developer] Posted: 21 Nov @ 11:53pm\nI have removed your Steam forum ban. Your game account still exists and was never banned in the first place.\n[/quote]\n\nUnless it was a coincidence, that I could not access the game online servers other than the singleplayer option during that entire period. But I will take your word for it, I will try see if I can access them soon. I appreciate you reversing the community ban decision, as I assure you, if I have not proven it already with my public stance. I am opinionated, but not malicious.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I do not think anyone can prepare you for the developer who is known as \"APwn\" currently in this game. \n\nI would try to talk to the community, or a developer about it, but after one innocent post on the Steam discussion board, it is now a permanent ban as others who have spoken about the developer's recent behaviour have experienced.\n\n\"Hey new player starting today. I also am displeased to see this. Hope its not a habit in future? So I wont just get attacked in the open????\nAlso why is the developers responding so rudely to people in reviews :( That wasnt a good start to me finding this game.\n\nBan Reason:\nTrolling, ban evasion. Alt.\"\n\nAfter having to google what an Alt is, I can tell everyone I am not a clone or a duplicate of anything. I guess it is true what everyone else is saying, I feel very sorry for the developer, at first I thought it was sad seeing someone just being angry, and upset at the community for not liking their game, or what they are doing with it.\n\nNow its clear its just mental illness, and thats not funny at all.\n\nHope you can get some help APwn, you deserve it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I'd rather spend 3 hours with Big Dick Randy than play this and search for literally NOTHING ever again. Nothing but a searching simulator where you occasionally kill. I ended up finding the car part after 3 hours and then my game crashed :wilted_flower:. Not even sure there is an objective",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "woh, terrible graphics, everything has a grey fog distraction, doors have to load a black screen to get you in, like a game from 20 or so years ago...., terrible battling, nonsensical npc's that are lifeless and stand and do nothing, no voiceovers, its a terrible game. hope you rot in hell developers. the dev's ignore player criticism and focus only on what they offer, pathetic worthless souls.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is super weird, yeah you grind kill bosses and grind, then what? building exploration gets boring, some of the puzzles are absolutely garbage and boring and misleading, you think you need to use your brain but you just need to be stupid to solve them.\nMonsters are meh, the UI is completely garbage especially in inventory and weapon stats etc, its just bunch of text and you have to compare line by line, not to mention there game just feels unfinished. The quest tracking system is garbage too, and quests feel pointless for the rewards as well.\nMoney is super easy to come by just farm bullets and sell on the market then buy gear.\n-> You dont even need ammo because you can simply just get unlimited ammo super easy as well",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is garbage and is pay to win because even if you are a mere 2 levels below an area, you are screwed automatically and are basically banned from that area unless you want to die instantly to a giant enemy thats a red/black widow spider, not a ZOMBIE. Dont PLAY unless you want to waste money on a monthly subscription just to not be annoyed to death at how tedious the experience is.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "graphics are bad. its not what it is in the trailer. there's nothing to do in it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bring back the top-down perspective or atleast make it optional, this game is annoyingly boring with the 3d pov it feels like every other horror game with guns, ever. it really dulls the fun in my opinion and makes the movement even more janky and sluggish than before. overall after you clear the first 2-3 buildings the game becomes a boring grind for resources exp and loot that doesnt feel remotely fun with the repetitive playback loop and basic zombies apart from bosses which take you an hour to find in each building if youre clearing them normally, i dont know what they did but it just feels so less engaging than it did years ago on flash, bleh 6/10 would not play again theres no nostalgia here to enjoy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played dead frontier way back in the day and a year ago I found they made this, and was pretty excited. The game was definitely fun to play, however once you get to a certain level gear progression just stops being affordable/possible. The devs have given out OP event gear in the past but now seem hesitant to do so now, so if you’re a new player you either have to wait years to hopefully get your own *or* try and buy some of the few that remain tradable from the past. But in reality what most end up doing is spending real money gambling on “unique chests”. It’s technically possible to do the endgame content with the “affordable” gear on the market but it’s not enjoyable, especially when all the veteran player walk around with their “mutant killer 9000” and “Speedy McSpeed sandle” which they just got given for basically free. I mean come on is it so hard to actually add lootable uniques that are good? Most of the loots in this game are scrap, you basically don’t actually get useful gear from playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sorry but... Big no for this game.\n\nIt's cool, but I didn't feel like, immersed on the game. I have runned through bugs, and the combat functionality needs a rework.\n\nI'm not saying that rudely, but I expected more in this game, to be honest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Według mnie gra jest ambitnym projektem lecz zabrakło odrobiny dopracowania no czyli dojście do jednego punktu zajmuje prawie 10minut (pierwsza misja 800m chodzenia) oraz zombie są wręcz nie śmiertelne",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's pretty basic, and it shows it's age.\r\nThe gameplay loop is okay, worth the novelty for an hour or so. If anything, than for the atmosphere. \r\nThe prices for the cosmetics are SO not worth what they're asking for it.\r\nWhile they have been adding in a lot of new content, none of it is particularly good. It took 7 years for them to add it a story to it.\r\nNow they make PVP mandatory, and it's just a really shite experience. \r\nIt's free, but honestly a waste of 55 hours. And I genuinely tried to give it an honest shake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like being born in the most remote part of Africa being tormented by the local predators and after scavenging for one hour you find a canister with half a liter of gas and with no clue on what kind of use it may have you drink it get so high you forget where you are born and launch CS2 and open a stattrak minimal wear hideout.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not quite finished\nnot quite started either\nclunky, poorly optimized, confusing, and only enjoyable for a few minutes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "From when I played it, it was alright. But like many others said it really is pay-to-win, I remember getting a big boost from paying up a while ago. It's fun for like the first 2 hours, then it starts to get repetitive, which is typically how an MMO goes sometimes but this one... really feels repetitive. \r\n\r\nTl;dr good time killer, but not really worth grinding. DF1 better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "got the game cause evry budy sed it was rilly fun but it was trash cant understand eney thing in the game\r\ntakes forever to akshily play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "NIE POLECAM, ZOMBIE ZADAJA PIERDOLONE CALE HP A MY MUSIMY DAC 5 HEADOW, KOLEGA ZWALIL SE KONIA PO PRZEGRANEJ NIE POLECAM",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games an absolute ripoff. I wouldn't buy anything or give this developer a single penny. Just like the the first Deadfrontier this game runs a shady scheme where cosmetics that are purchased with real money can't be view before buying, amounting to countless garbage purchases. - Secondly the game offers no customer support or any real way to contact the dev for help with any account issues. Just steer clear of this garbage and let it go under.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Limited and very random loot, I kill an insanely hard boss and it drops trinkets... randomly opening a garbage can gives you a better loot. Why would I bother with the hard rooms then???",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is not fun for f2p players.. try running into a couple of players.. yeah you die instantly... The game does not focus on welcoming new players... And ofc late players are becoming p2w.. so ye.. enjoy the big nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you didn't play the first and this is your first time playing a DF game, it might be okay.\n\nThe long story short is that it's not very engaging with you, it's extremely boring and mindnumbing, and I wouldn't personally recommend it over the first one.\n\nJust play the original, you'll love it more. (unless you hate a topview game)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much bug and no support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad optimization and crashes often",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst game in the world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring trash",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "So sh*ty game /:",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this shit is ass, thanks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DEAD GAME",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sex",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is a pay 2 win scheme. The creator does not like any sort of negative view and will BAN you if you talk down on the game. Full of Chinese hackers and whales.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "[h1]A 5/10 game, with 0/10 developers/moderators[/h1]\nThe developers are the problem, not the game. This games development seems to have been slowly moving at a snails pace over years now since its launch, with some major updates that have for sure brought it forward. But unfortunately it seems the devs don't know what they are doing anymore. The most recent update is an event to incentivise PvP, when the vast majority of players have little to no interest, as is the case for me, with the PvP. \n\nNo one wants to play with the certain people from certain parts of the worlds who unethically partake in PvP events, killing on sight, and just typical high-level stomping of lower level players. Its some form of tyranny they've learnt to cope with in their own personal lives. And its just not for the rest of us.\n\nSo when the devs realise, lets get back to PvE, and lets stop trying to think tank every new update as a business idea, instead of going back to the love of making this the game it was meant to be. PvE, co-op focus, mmo. And we can start getting some QoL fixes and features that will actually make people want to come and play with their friends and not worry about dumb grinds and rubbish ideas in the game that actually make you stop and go \"seriously why is this game like this?\", the faster it can grow again.\n\n[h2] But it gets better![/h2]\nThis is hilarious! I saw someone else say that the devs don't like it when people say things they disagree with, but this is a whole new level. Check this out.\n\n[quote=Steam Support]\nYou have been banned from Dead Frontier 2 Community Hub\nYou have been banned from Dead Frontier 2 Community Hub by a forum moderator for your post in \"UPDATE: THE PURGE\":\nWaiting to see more QoL Co-op and PvE content for this game to actually play with friends.\nSee waste of time development on PvP.\nNice to see it still have its time wasted,\nDo the people who originally visioned this games PvE, not get to speak in that studio anymore or whats going on?\nDUMP THE PVP.\n\nBan Reason:\nTrolling, 7 years old lvl 6 account.\n\nWhile this ban is active, you will not be able to post or comment in the Dead Frontier 2 Community Hub or upload new content to this community hub.\n\nIf you believe this ban was issued by mistake, please contact Steam Support.\n\nThis is a permanent ban.\n[/quote]\n\nIncredible honestly. A developer (Now identified as APwn) has looked up my steam account, because they were so infuriated with my comment on their \"Steam discussions\" talking against their PvP. Did my post go against Guidelines? No? Did I start a fight with someone? No? Did I have a DISCUSSION on the DISCUSSION BOARD? Yep. \nThey permanently banned me from the discussions, furthermore, they deleted my account and banned me from the servers based on this one interaction, I haven't in fact played in 7 years, and this is the first thing I have written on their discussions since then as I was looking to return and saw they are still making rubbish PvP updates for their hacker player base :')\n\nI rest my case.....\n\n[h3]Response to Developer response[/h3]\n[quote=APwn]\nPosted: 18 Nov @ 6:52pm\nYou don't even play the game and are spamming our forums with abuse over a completely optional update that you've never even bothered to try out for yourself. So yes, you have quite rightly been banned.\n\nIf you don't like PvP, you don't have to take part. It's an optional event for people who like PvP. It in no way affects the game for people who just want to PvE.\n[/quote]\n\nI do play? And I posted one post on the 18/11/2025 for the first time as I have shown in this review, and now you claim I was \"spamming your forums\", which upset you, and you decided to permanently ban me from the Steam discussion forever? Omg grow up hahaha. I don't care that you are having a cry about it, but you don't have to start lying to try and help yourself feel better. Just admit you are terrible people and move on now. You cant even admit you are wrong here, you are arguing with your player base, this is hilarous, so pathetic. You have earnt this 0/10 rating and negative review.\n\n[quote=APwn]\nPosted: 21 Nov @ 11:53pm\nDeveloper response:\nAPwn  [developer] Posted: 21 Nov @ 11:53pm\nI have removed your Steam forum ban. Your game account still exists and was never banned in the first place.\n[/quote]\n\nUnless it was a coincidence, that I could not access the game online servers other than the singleplayer option during that entire period. But I will take your word for it, I will try see if I can access them soon. I appreciate you reversing the community ban decision, as I assure you, if I have not proven it already with my public stance. I am opinionated, but not malicious.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I do not think anyone can prepare you for the developer who is known as \"APwn\" currently in this game. \n\nI would try to talk to the community, or a developer about it, but after one innocent post on the Steam discussion board, it is now a permanent ban as others who have spoken about the developer's recent behaviour have experienced.\n\n\"Hey new player starting today. I also am displeased to see this. Hope its not a habit in future? So I wont just get attacked in the open????\nAlso why is the developers responding so rudely to people in reviews :( That wasnt a good start to me finding this game.\n\nBan Reason:\nTrolling, ban evasion. Alt.\"\n\nAfter having to google what an Alt is, I can tell everyone I am not a clone or a duplicate of anything. I guess it is true what everyone else is saying, I feel very sorry for the developer, at first I thought it was sad seeing someone just being angry, and upset at the community for not liking their game, or what they are doing with it.\n\nNow its clear its just mental illness, and thats not funny at all.\n\nHope you can get some help APwn, you deserve it.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "the bad part is the end game it is just to much of a grind to make enough money at the end. i'm sorry but a player ran market is cool idea on paper but not in this game i will not grind for 2 weeks doing money runs for 1 piece of equipment that slightly boosts my stats. to sum up this game once u have seen it u have seen it all. AKA it gets very boring fast.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "the game itself isn't bad. Respawn rate for zombies to come into a small room with BIG Bosses or Special zombies for story quest is way too much especially with limlited ammo even at lvl 25 with full inventory. easily can get cornered and die fast. Dodging doesnt help either when cornered in such small space with so much going in with 5 feet of space. very time consuming and WAY TOO MANY ROOMS. one floor can have 10 room and one of those doors is another hallway with 10 rooms and then you go into one room just to find out that room has 4 more doors? rooms to go through. Imagine having special zobies and bosses in every other room. not enough resources for all that..6/10 game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 921 hours in game, I can definitely not recommend this game unless you are someone who loves to grind non stop for the same junk over and over and over.... Get stuck behind a constant pay wall for the ability to store your loot for later intentions.... The melee builds in this game are so pointless that they are simply a waste of time due to ... hitting a zombie will make it fall forward to you meaning that the ones that are on fire, have flies around them or have tendrils hit you near enough every time because the animation to hit takes too long that even using the swing around doesn't get you away from them, While hitting zombies from behind makes them stumble BACKWARDS!!! and thus causing the same as above mentioned. Oddly enough, using a melee weapon doing 25dmg with say +100% to infected will kill enemies faster than using a gun doing the same damage and if the enemy is optic, well if you have a gun body build be warned that 90% of the optic's only have a eye on their head or their back.... meaning that you can really only shoot the head, therefore negating the added damage of your body build. \r\n\r\nLoot in the END GAME buildings is NO BETTER than what you can randomly loot near enough anywhere, with the exception of building specific unique items????\r\n\r\nThis is just a very few amount of a very large number of problems in this game that overall create a game full of frustration, lag..... oh the lag.... not general game lag, but the random \"every 20-30 minutes\" where the game just decides it had enough of processing and sits for anywhere up to a minute or so just doing nothing, mid loot, mid door transition, mid travel, any time it feels like it.\r\n\r\nTried very hard to stick it out with this game \"921 hours right\" but just cant do it anymore, ha hoped some of these issues would have been addressed over the years, but alas, they have not.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unless your willing to pay real money it's very very difficult to survive! You MUST play EVERYDAY to keep up. I prefer dead frontier original that was difficult but at least you can survive without paying. Every time i have run out of ammo inside buildings only to die. My opinion skip this one and play the original unless your a player that must have better graphics then good luck with this one!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'd rather spend 3 hours with Big Dick Randy than play this and search for literally NOTHING ever again. Nothing but a searching simulator where you occasionally kill. I ended up finding the car part after 3 hours and then my game crashed :wilted_flower:. Not even sure there is an objective",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "woh, terrible graphics, everything has a grey fog distraction, doors have to load a black screen to get you in, like a game from 20 or so years ago...., terrible battling, nonsensical npc's that are lifeless and stand and do nothing, no voiceovers, its a terrible game. hope you rot in hell developers. the dev's ignore player criticism and focus only on what they offer, pathetic worthless souls.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is super weird, yeah you grind kill bosses and grind, then what? building exploration gets boring, some of the puzzles are absolutely garbage and boring and misleading, you think you need to use your brain but you just need to be stupid to solve them.\nMonsters are meh, the UI is completely garbage especially in inventory and weapon stats etc, its just bunch of text and you have to compare line by line, not to mention there game just feels unfinished. The quest tracking system is garbage too, and quests feel pointless for the rewards as well.\nMoney is super easy to come by just farm bullets and sell on the market then buy gear.\n-> You dont even need ammo because you can simply just get unlimited ammo super easy as well",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is garbage and is pay to win because even if you are a mere 2 levels below an area, you are screwed automatically and are basically banned from that area unless you want to die instantly to a giant enemy thats a red/black widow spider, not a ZOMBIE. Dont PLAY unless you want to waste money on a monthly subscription just to not be annoyed to death at how tedious the experience is.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Played even the original dead frontier as far back as 20 years ago. ive watched niel yates, or adminpwn for years from the original dead frontier rap, to the holiday events where he gave out cool shit.\r\nHes a cool guy, with a cool concept for a game with good world building. However,\r\nDead frontier 2 was a collasal mistake, and part of it isint even neil's fault.\r\n\r\nTo understand we need to flash back to the time shortly before dead frontier 2 is born, sometime in 2017.\r\nmost of the ideas for zombies, and monsters that inspire the dead frontier games come from the resident evil franchise this is well known, but of course in 2017 resident evil had its first major reboot as a franchise, shying away from the action combat zombie game it was, to focus more on the horror aspect. no longer are you chris redfield spin kicking a 25 foot tall tendril monster with 4 arms and shooting a grenade launcher at its head blowing it up, your a random normal guy named ethan armed with a pocket knife, and a small pistol cauciosly making his way through a large farm house. This massive change clearly left its mark on neil, and because of that dead frontier as a franchise suffered, because neil figured if copying resident evil worked well before, there was no reason it couldnt work again, not realizing that kind of change is very hard to pull off, which is how dead frontier goes from 3d, players backpedaling at super human speed through a parking lot firing a minigun at 3 titanic zombies armorer in bone from head to toe whilst on fire, To a random guy in a beanie using the worlds weakest 12 gauge to shoot a zombie thats slower then a 3 year old. You can see where im going with this. dead frontier, and dead frontier 2 are completly different games from the ground up, as different as mario kart is from super mario world, both mario, but utterly different. and it just doesn't work in dead frontier 2. The BIGGEST problem by far, and the choice that still haunts the game is the over the shoulder combat choice. df3d was a birds eye view top down shooter for over 10 years. which meant neil had zero experience in this form of design, and it shows, combat feels rough, made even worse by the sheer lack of threat from most zombies, which in 3d were an overwhelming force of nature, a near hive mind level threat that was ever present. in df2 they feel almost static. Another very large problem is the ui, god help the ui because its 1 of the worst ive seen in a hot minute, it need a full redesign, namely inventory and the marketplace, which if im being honest idk why neil didint copy his own work from df3d since it already worked well there. even if it didint want the cell based inventory design thats fine, keep the look, and core design.\r\n\r\nThere is a lot more that can be said about this game, such as neil already got the message from fans, that they prefer the original df3d game over df2, and that he will focus development to the og game over df2 so this things already on the backburner, or that 90% of the players no longer speak english which is a strange turn of events, there is some good that can be said about this game.\r\n\r\nFirst and foremost, that title music, god damn he did good on that a classic reimagining of the original theme, 2nd is he finnally added at least 1 monster that feels like it belongs in dead frontier, a nearly unstoppable pursuent zombie, that cannot be killed, only slowed down, hes also improved some under the hood items, here and there. still a long ways to go, likely years before shes playable, and will still never play like a dead frontier game, but it is starting to crawl out of its grave, however slowly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "graphics are bad. its not what it is in the trailer. there's nothing to do in it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bring back the top-down perspective or atleast make it optional, this game is annoyingly boring with the 3d pov it feels like every other horror game with guns, ever. it really dulls the fun in my opinion and makes the movement even more janky and sluggish than before. overall after you clear the first 2-3 buildings the game becomes a boring grind for resources exp and loot that doesnt feel remotely fun with the repetitive playback loop and basic zombies apart from bosses which take you an hour to find in each building if youre clearing them normally, i dont know what they did but it just feels so less engaging than it did years ago on flash, bleh 6/10 would not play again theres no nostalgia here to enjoy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played dead frontier way back in the day and a year ago I found they made this, and was pretty excited. The game was definitely fun to play, however once you get to a certain level gear progression just stops being affordable/possible. The devs have given out OP event gear in the past but now seem hesitant to do so now, so if you’re a new player you either have to wait years to hopefully get your own *or* try and buy some of the few that remain tradable from the past. But in reality what most end up doing is spending real money gambling on “unique chests”. It’s technically possible to do the endgame content with the “affordable” gear on the market but it’s not enjoyable, especially when all the veteran player walk around with their “mutant killer 9000” and “Speedy McSpeed sandle” which they just got given for basically free. I mean come on is it so hard to actually add lootable uniques that are good? Most of the loots in this game are scrap, you basically don’t actually get useful gear from playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sorry but... Big no for this game.\n\nIt's cool, but I didn't feel like, immersed on the game. I have runned through bugs, and the combat functionality needs a rework.\n\nI'm not saying that rudely, but I expected more in this game, to be honest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Według mnie gra jest ambitnym projektem lecz zabrakło odrobiny dopracowania no czyli dojście do jednego punktu zajmuje prawie 10minut (pierwsza misja 800m chodzenia) oraz zombie są wręcz nie śmiertelne",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very repetitive game-play. Nothing feels satisfying, and its hard to navigate inside buildings. The game feels pointless in general.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's pretty basic, and it shows it's age.\r\nThe gameplay loop is okay, worth the novelty for an hour or so. If anything, than for the atmosphere. \r\nThe prices for the cosmetics are SO not worth what they're asking for it.\r\nWhile they have been adding in a lot of new content, none of it is particularly good. It took 7 years for them to add it a story to it.\r\nNow they make PVP mandatory, and it's just a really shite experience. \r\nIt's free, but honestly a waste of 55 hours. And I genuinely tried to give it an honest shake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like being born in the most remote part of Africa being tormented by the local predators and after scavenging for one hour you find a canister with half a liter of gas and with no clue on what kind of use it may have you drink it get so high you forget where you are born and launch CS2 and open a stattrak minimal wear hideout.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a underdeveloped ass game , its sooo fucking boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A flamingo with thumbs could make a better game. Its like DayZ if Dayz was made by a toddler with brain damage and no creativity.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not quite finished\nnot quite started either\nclunky, poorly optimized, confusing, and only enjoyable for a few minutes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Download, launch it and got new account. Enter the game, look around and got kicked with error that server encountered an unexpected error. Can't enter the game anymore. You can expect negative review. Learn to make games or stop working on them. Just friendly advice from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ngl it's mid at best, good if you are slow. doesn't require thinking, just press buttons and run through infinite hallways to loot canned tuna.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sucks.. Too laggy and Very low drop rate nothing to be excited about.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "From when I played it, it was alright. But like many others said it really is pay-to-win, I remember getting a big boost from paying up a while ago. It's fun for like the first 2 hours, then it starts to get repetitive, which is typically how an MMO goes sometimes but this one... really feels repetitive. \r\n\r\nTl;dr good time killer, but not really worth grinding. DF1 better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Feels like a mobile game some say they have to spend money just to survive which made no sense I spent $0.00 dollars on this game and can say there is way better quality of F2P's out there and this one is not one the content feels like the same content every update This is what a nothing burger is!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "got the game cause evry budy sed it was rilly fun but it was trash cant understand eney thing in the game\r\ntakes forever to akshily play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "NIE POLECAM, ZOMBIE ZADAJA PIERDOLONE CALE HP A MY MUSIMY DAC 5 HEADOW, KOLEGA ZWALIL SE KONIA PO PRZEGRANEJ NIE POLECAM",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No tutorials/no guides, you can't understand what to do in this game, anyway, game feels like an early access game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games an absolute ripoff. I wouldn't buy anything or give this developer a single penny. Just like the the first Deadfrontier this game runs a shady scheme where cosmetics that are purchased with real money can't be view before buying, amounting to countless garbage purchases. - Secondly the game offers no customer support or any real way to contact the dev for help with any account issues. Just steer clear of this garbage and let it go under.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's like a bowl of dog water that bacteria began to grow in. Just get State of Decay 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "impossible leveling or looting, the zombies(non-boss) sometimes invisible or just appear in front of our character. there's also high-level boss in low level area or building, it's almost impossible to finis it up without teamate.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game still looks like it was made in 1999 by a Russian dev on an i486 computer. It looks boring as hell. I hate how you can't jump and that you can only dodge or kick once every minute. It's stupid that we have to create an external account to play instead of just using our Steam account. I couldn't get in on my old account because it would not send me a password recovery email. And when I created a new account, it never prompted me to log in on a website, which would have been ideal because then my password could have been saved on my browser in case I ever forget it. I don't know why anyone would be desperate enough to play this game. Just play No More Room in Hell. NMRIH is free, moddable, and a lot more fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty ass game, Gas way too hard to get. VERY boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is so bad, it makes you go crazy, play this game if you are mentally ill like me....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Limited and very random loot, I kill an insanely hard boss and it drops trinkets... randomly opening a garbage can gives you a better loot. Why would I bother with the hard rooms then???",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is terrible and it takes 50 shots to kill a zombie.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How did a whole studio manage to make something look great while playing worse than Roblox",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Door simulator, too much room, too much door",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is not fun for f2p players.. try running into a couple of players.. yeah you die instantly... The game does not focus on welcoming new players... And ofc late players are becoming p2w.. so ye.. enjoy the big nothing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you didn't play the first and this is your first time playing a DF game, it might be okay.\n\nThe long story short is that it's not very engaging with you, it's extremely boring and mindnumbing, and I wouldn't personally recommend it over the first one.\n\nJust play the original, you'll love it more. (unless you hate a topview game)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont like horror with jumpscare. but this one is ok since i play from DF1\n\nThe grind is abit heavy at end game toward f2p even for low spender. The price for monthly is a bit pricy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS JUST A GAME ABOUT KILLING ZOMBIE WITH 1 HITTING ANIMTIONS.THERE IS NO ONLINE PLAYER AND IT FEELS A LITTLE DEPRESSING PLAYING THIS ALONE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much bug and no support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad optimization and crashes often",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst game in the world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring trash",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "So sh*ty game /:",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this shit is ass, thanks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DEAD GAME",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Do not play this even it's free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sex",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is a pay 2 win scheme. The creator does not like any sort of negative view and will BAN you if you talk down on the game. Full of Chinese hackers and whales.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "[h1]A 5/10 game, with 0/10 developers/moderators[/h1]\nThe developers are the problem, not the game. This games development seems to have been slowly moving at a snails pace over years now since its launch, with some major updates that have for sure brought it forward. But unfortunately it seems the devs don't know what they are doing anymore. The most recent update is an event to incentivise PvP, when the vast majority of players have little to no interest, as is the case for me, with the PvP. \n\nNo one wants to play with the certain people from certain parts of the worlds who unethically partake in PvP events, killing on sight, and just typical high-level stomping of lower level players. Its some form of tyranny they've learnt to cope with in their own personal lives. And its just not for the rest of us.\n\nSo when the devs realise, lets get back to PvE, and lets stop trying to think tank every new update as a business idea, instead of going back to the love of making this the game it was meant to be. PvE, co-op focus, mmo. And we can start getting some QoL fixes and features that will actually make people want to come and play with their friends and not worry about dumb grinds and rubbish ideas in the game that actually make you stop and go \"seriously why is this game like this?\", the faster it can grow again.\n\n[h2] But it gets better![/h2]\nThis is hilarious! I saw someone else say that the devs don't like it when people say things they disagree with, but this is a whole new level. Check this out.\n\n[quote=Steam Support]\nYou have been banned from Dead Frontier 2 Community Hub\nYou have been banned from Dead Frontier 2 Community Hub by a forum moderator for your post in \"UPDATE: THE PURGE\":\nWaiting to see more QoL Co-op and PvE content for this game to actually play with friends.\nSee waste of time development on PvP.\nNice to see it still have its time wasted,\nDo the people who originally visioned this games PvE, not get to speak in that studio anymore or whats going on?\nDUMP THE PVP.\n\nBan Reason:\nTrolling, 7 years old lvl 6 account.\n\nWhile this ban is active, you will not be able to post or comment in the Dead Frontier 2 Community Hub or upload new content to this community hub.\n\nIf you believe this ban was issued by mistake, please contact Steam Support.\n\nThis is a permanent ban.\n[/quote]\n\nIncredible honestly. A developer (Now identified as APwn) has looked up my steam account, because they were so infuriated with my comment on their \"Steam discussions\" talking against their PvP. Did my post go against Guidelines? No? Did I start a fight with someone? No? Did I have a DISCUSSION on the DISCUSSION BOARD? Yep. \nThey permanently banned me from the discussions, furthermore, they deleted my account and banned me from the servers based on this one interaction, I haven't in fact played in 7 years, and this is the first thing I have written on their discussions since then as I was looking to return and saw they are still making rubbish PvP updates for their hacker player base :')\n\nI rest my case.....\n\n[h3]Response to Developer response[/h3]\n[quote=APwn]\nPosted: 18 Nov @ 6:52pm\nYou don't even play the game and are spamming our forums with abuse over a completely optional update that you've never even bothered to try out for yourself. So yes, you have quite rightly been banned.\n\nIf you don't like PvP, you don't have to take part. It's an optional event for people who like PvP. It in no way affects the game for people who just want to PvE.\n[/quote]\n\nI do play? And I posted one post on the 18/11/2025 for the first time as I have shown in this review, and now you claim I was \"spamming your forums\", which upset you, and you decided to permanently ban me from the Steam discussion forever? Omg grow up hahaha. I don't care that you are having a cry about it, but you don't have to start lying to try and help yourself feel better. Just admit you are terrible people and move on now. You cant even admit you are wrong here, you are arguing with your player base, this is hilarous, so pathetic. You have earnt this 0/10 rating and negative review.\n\n[quote=APwn]\nPosted: 21 Nov @ 11:53pm\nDeveloper response:\nAPwn  [developer] Posted: 21 Nov @ 11:53pm\nI have removed your Steam forum ban. Your game account still exists and was never banned in the first place.\n[/quote]\n\nUnless it was a coincidence, that I could not access the game online servers other than the singleplayer option during that entire period. But I will take your word for it, I will try see if I can access them soon. I appreciate you reversing the community ban decision, as I assure you, if I have not proven it already with my public stance. I am opinionated, but not malicious.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I do not think anyone can prepare you for the developer who is known as \"APwn\" currently in this game. \n\nI would try to talk to the community, or a developer about it, but after one innocent post on the Steam discussion board, it is now a permanent ban as others who have spoken about the developer's recent behaviour have experienced.\n\n\"Hey new player starting today. I also am displeased to see this. Hope its not a habit in future? So I wont just get attacked in the open????\nAlso why is the developers responding so rudely to people in reviews :( That wasnt a good start to me finding this game.\n\nBan Reason:\nTrolling, ban evasion. Alt.\"\n\nAfter having to google what an Alt is, I can tell everyone I am not a clone or a duplicate of anything. I guess it is true what everyone else is saying, I feel very sorry for the developer, at first I thought it was sad seeing someone just being angry, and upset at the community for not liking their game, or what they are doing with it.\n\nNow its clear its just mental illness, and thats not funny at all.\n\nHope you can get some help APwn, you deserve it.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "the bad part is the end game it is just to much of a grind to make enough money at the end. i'm sorry but a player ran market is cool idea on paper but not in this game i will not grind for 2 weeks doing money runs for 1 piece of equipment that slightly boosts my stats. to sum up this game once u have seen it u have seen it all. AKA it gets very boring fast.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "the game itself isn't bad. Respawn rate for zombies to come into a small room with BIG Bosses or Special zombies for story quest is way too much especially with limlited ammo even at lvl 25 with full inventory. easily can get cornered and die fast. Dodging doesnt help either when cornered in such small space with so much going in with 5 feet of space. very time consuming and WAY TOO MANY ROOMS. one floor can have 10 room and one of those doors is another hallway with 10 rooms and then you go into one room just to find out that room has 4 more doors? rooms to go through. Imagine having special zobies and bosses in every other room. not enough resources for all that..6/10 game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 921 hours in game, I can definitely not recommend this game unless you are someone who loves to grind non stop for the same junk over and over and over.... Get stuck behind a constant pay wall for the ability to store your loot for later intentions.... The melee builds in this game are so pointless that they are simply a waste of time due to ... hitting a zombie will make it fall forward to you meaning that the ones that are on fire, have flies around them or have tendrils hit you near enough every time because the animation to hit takes too long that even using the swing around doesn't get you away from them, While hitting zombies from behind makes them stumble BACKWARDS!!! and thus causing the same as above mentioned. Oddly enough, using a melee weapon doing 25dmg with say +100% to infected will kill enemies faster than using a gun doing the same damage and if the enemy is optic, well if you have a gun body build be warned that 90% of the optic's only have a eye on their head or their back.... meaning that you can really only shoot the head, therefore negating the added damage of your body build. \r\n\r\nLoot in the END GAME buildings is NO BETTER than what you can randomly loot near enough anywhere, with the exception of building specific unique items????\r\n\r\nThis is just a very few amount of a very large number of problems in this game that overall create a game full of frustration, lag..... oh the lag.... not general game lag, but the random \"every 20-30 minutes\" where the game just decides it had enough of processing and sits for anywhere up to a minute or so just doing nothing, mid loot, mid door transition, mid travel, any time it feels like it.\r\n\r\nTried very hard to stick it out with this game \"921 hours right\" but just cant do it anymore, ha hoped some of these issues would have been addressed over the years, but alas, they have not.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unless your willing to pay real money it's very very difficult to survive! You MUST play EVERYDAY to keep up. I prefer dead frontier original that was difficult but at least you can survive without paying. Every time i have run out of ammo inside buildings only to die. My opinion skip this one and play the original unless your a player that must have better graphics then good luck with this one!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'd rather spend 3 hours with Big Dick Randy than play this and search for literally NOTHING ever again. Nothing but a searching simulator where you occasionally kill. I ended up finding the car part after 3 hours and then my game crashed :wilted_flower:. Not even sure there is an objective",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "woh, terrible graphics, everything has a grey fog distraction, doors have to load a black screen to get you in, like a game from 20 or so years ago...., terrible battling, nonsensical npc's that are lifeless and stand and do nothing, no voiceovers, its a terrible game. hope you rot in hell developers. the dev's ignore player criticism and focus only on what they offer, pathetic worthless souls.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is super weird, yeah you grind kill bosses and grind, then what? building exploration gets boring, some of the puzzles are absolutely garbage and boring and misleading, you think you need to use your brain but you just need to be stupid to solve them.\nMonsters are meh, the UI is completely garbage especially in inventory and weapon stats etc, its just bunch of text and you have to compare line by line, not to mention there game just feels unfinished. The quest tracking system is garbage too, and quests feel pointless for the rewards as well.\nMoney is super easy to come by just farm bullets and sell on the market then buy gear.\n-> You dont even need ammo because you can simply just get unlimited ammo super easy as well",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is garbage and is pay to win because even if you are a mere 2 levels below an area, you are screwed automatically and are basically banned from that area unless you want to die instantly to a giant enemy thats a red/black widow spider, not a ZOMBIE. Dont PLAY unless you want to waste money on a monthly subscription just to not be annoyed to death at how tedious the experience is.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Played even the original dead frontier as far back as 20 years ago. ive watched niel yates, or adminpwn for years from the original dead frontier rap, to the holiday events where he gave out cool shit.\r\nHes a cool guy, with a cool concept for a game with good world building. However,\r\nDead frontier 2 was a collasal mistake, and part of it isint even neil's fault.\r\n\r\nTo understand we need to flash back to the time shortly before dead frontier 2 is born, sometime in 2017.\r\nmost of the ideas for zombies, and monsters that inspire the dead frontier games come from the resident evil franchise this is well known, but of course in 2017 resident evil had its first major reboot as a franchise, shying away from the action combat zombie game it was, to focus more on the horror aspect. no longer are you chris redfield spin kicking a 25 foot tall tendril monster with 4 arms and shooting a grenade launcher at its head blowing it up, your a random normal guy named ethan armed with a pocket knife, and a small pistol cauciosly making his way through a large farm house. This massive change clearly left its mark on neil, and because of that dead frontier as a franchise suffered, because neil figured if copying resident evil worked well before, there was no reason it couldnt work again, not realizing that kind of change is very hard to pull off, which is how dead frontier goes from 3d, players backpedaling at super human speed through a parking lot firing a minigun at 3 titanic zombies armorer in bone from head to toe whilst on fire, To a random guy in a beanie using the worlds weakest 12 gauge to shoot a zombie thats slower then a 3 year old. You can see where im going with this. dead frontier, and dead frontier 2 are completly different games from the ground up, as different as mario kart is from super mario world, both mario, but utterly different. and it just doesn't work in dead frontier 2. The BIGGEST problem by far, and the choice that still haunts the game is the over the shoulder combat choice. df3d was a birds eye view top down shooter for over 10 years. which meant neil had zero experience in this form of design, and it shows, combat feels rough, made even worse by the sheer lack of threat from most zombies, which in 3d were an overwhelming force of nature, a near hive mind level threat that was ever present. in df2 they feel almost static. Another very large problem is the ui, god help the ui because its 1 of the worst ive seen in a hot minute, it need a full redesign, namely inventory and the marketplace, which if im being honest idk why neil didint copy his own work from df3d since it already worked well there. even if it didint want the cell based inventory design thats fine, keep the look, and core design.\r\n\r\nThere is a lot more that can be said about this game, such as neil already got the message from fans, that they prefer the original df3d game over df2, and that he will focus development to the og game over df2 so this things already on the backburner, or that 90% of the players no longer speak english which is a strange turn of events, there is some good that can be said about this game.\r\n\r\nFirst and foremost, that title music, god damn he did good on that a classic reimagining of the original theme, 2nd is he finnally added at least 1 monster that feels like it belongs in dead frontier, a nearly unstoppable pursuent zombie, that cannot be killed, only slowed down, hes also improved some under the hood items, here and there. still a long ways to go, likely years before shes playable, and will still never play like a dead frontier game, but it is starting to crawl out of its grave, however slowly.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "graphics are bad. its not what it is in the trailer. there's nothing to do in it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bring back the top-down perspective or atleast make it optional, this game is annoyingly boring with the 3d pov it feels like every other horror game with guns, ever. it really dulls the fun in my opinion and makes the movement even more janky and sluggish than before. overall after you clear the first 2-3 buildings the game becomes a boring grind for resources exp and loot that doesnt feel remotely fun with the repetitive playback loop and basic zombies apart from bosses which take you an hour to find in each building if youre clearing them normally, i dont know what they did but it just feels so less engaging than it did years ago on flash, bleh 6/10 would not play again theres no nostalgia here to enjoy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played dead frontier way back in the day and a year ago I found they made this, and was pretty excited. The game was definitely fun to play, however once you get to a certain level gear progression just stops being affordable/possible. The devs have given out OP event gear in the past but now seem hesitant to do so now, so if you’re a new player you either have to wait years to hopefully get your own *or* try and buy some of the few that remain tradable from the past. But in reality what most end up doing is spending real money gambling on “unique chests”. It’s technically possible to do the endgame content with the “affordable” gear on the market but it’s not enjoyable, especially when all the veteran player walk around with their “mutant killer 9000” and “Speedy McSpeed sandle” which they just got given for basically free. I mean come on is it so hard to actually add lootable uniques that are good? Most of the loots in this game are scrap, you basically don’t actually get useful gear from playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sorry but... Big no for this game.\n\nIt's cool, but I didn't feel like, immersed on the game. I have runned through bugs, and the combat functionality needs a rework.\n\nI'm not saying that rudely, but I expected more in this game, to be honest.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}