{
  "positive": [
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "One of the prettiest games I’ve ever played. And a massive upgrade compared to the last game.\r\nThe only thing that wasn’t great was the story, kinda all over the place, I think Rise of the Tomb Raider did the story the best, but the exploration and tombs here easily made up for it.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "One of my all time favorite games. Great action and graphics. Good story too.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Love this game, deadly obsession difficulty has been hell but beating it was amazing, the tombs are all fun, really no issues that I can think of besides the lack of gameplay outside of New Game + after doing all the DLC tombs.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "this game is so PEAK!! it ddnt have as much combat as the others, but i loved the story and the tombs, especially the ones from the dlc. great game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Some things are better than in two previous parts, some are worse, but still awesome game. However, after all that years, there are still many bugs, random freezing, crashing, audio and subtitles are not working during a lot of cutscenes, there are workarounds to fix it, but still, very annoying",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's easily the best-looking game in the series, featuring stunning, massive environments like the deadly Peruvian jungle and the beautiful hidden city of Paititi.\r\n\r\nThe best part? It finally feels like a true Tomb Raider game. The tombs and puzzles are incredible—they're huge, challenging, and will truly make you stop and think. Exploration is rewarding, and the new stealth mechanics (like using mud for camouflage) make you feel like a true predator.\r\n\r\nThe story is amazing and delivers a dark, compelling conclusion to Lara's journey. While there isn't as much intense gun combat as the earlier games, the game leans into stealth and survival, which fits the narrative perfectly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if you like the survivor trilogy so far you will like playing this game, it has better graphics and cool everything but compared to the last 2 games it feels less like an action shooter and more of a floaty tomb raider compared to the more tactile feeling and more action packed tomb raider 2013. if you want tomb raider get shadow, if you want a shooter with lara croft get 2013.\n\nworks well on steamdeck",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Don't expect major innovations comparing to previous titles from the trilogy. You just get more of what you loved: a lot of tombs, vibrant open world, neat progression system. Very addictive! Also still looks stunning 7 years after release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It'a a decent game but after playing Rise Of The Tomb Raider I had high expectations that were't fulfilled. It felt more buggy than it's prequel which had huge improvements compared to the first title, honestly, I was expecting an even smoother gaming experience with this game but this wasn't the case. The game mechanics were decent, I really enjoyed the ceiling climbing one! The story was nice and I really enjoyed it although, in my opinion, the story of the previous two titles was way better. Regarding the graphics, they were pretty nice, not a big improvement over its prequel though. All in all, even though I was expecting something better, this was a great game and I had fun playing it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lara's final challenge. A great end to a tremendous rebrand that in my opinion really moved the series forward. Great set pieces, fun exploration and overall just great games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the only game of the trilogy that kind of feels like tomb raider. There are more tombs and crypts and are a little bigger. Otherwise the same optional tombs. Feels like Lara was copied pasted in another game. Lot of shooting and warfare. Signature weapon the bow? I don't think so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Lara is so cool, I like attacking the chickens",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played all the Tomb Raider surviver series, and this one has always been my favorite. The character presented in this game is exactly how I picture Lara Croft. And, the puzzles and scenes are quite amazing. I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TR2013 was great, Rise of Tomb Raider was more of the same with a good story, Shadow of Tomb Raider is again more of the same with a great story but also lot of new addition to the game mechanics, love it 100%!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A beautiful and atmospheric finale to the Survivor trilogy. The environments are stunning, and the challenge tombs were a highlight for me – rewarding and fun to explore. Combat feels solid, especially the stealth, though the gameplay overall stays very close to what the previous games already did well. The story goes for a darker tone with a few narrative stumbles, but it’s still engaging enough to carry the adventure. If you enjoy atmospheric exploration and puzzles, this is a great pick, just don’t expect big narrative ambitions or major gameplay innovations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game and experience just as good if not better than the last game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. This one is my favorite in the trilogy.\n\nThe main story is well written, gameplay during the main storyline is pretty much just in line with the previous 2 games but with a few extra stealth mechanics.\n\nThis one does a much better job of encouraging you to explore the world, do side quests, find and complete challenge tombs etc apart from just the main story. The first game didn't really do that at all imo, Rise of the Tomb Raider tried but the side content wasn't super appealing to me (although the main story was awesome), this one does an amazing job of making the world feel alive and inviting. I finished the main story at 71% overall completion because I kept getting drawn into side quests etc which were really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the open ended play, optional quests, puzzles. This has been a great game to learn gaming. Nice to have so many difficulty settings as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this version of Lara Croft, I really hope the new games(if they come) will use the same voice actress and model!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of the Tomb Raider is a stunning, atmospheric adventure with great exploration, smooth combat, and some of the best tombs in the series. An amazing finale to Lara’s origin story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best looking Tomb Raider by far While still giving that classic tomb raider experience. Even dives into Lara's past and why she goes looking for all these stranger artifacts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another great game in the series. Originally played on Xbox, then again on pc. The story is not as good as the previous two games, but still has the great combat and graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a great addition to the Tomb Raider franchise.  The gameplay was solid all the way through and the boss battles were appropriately scaled.  I really enjoyed the puzzles, the story, and the game dynamics.  There were many different environments with different challenges to overcome so the game never felt boring or repetitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to test your system and great story play and game play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game. Shadow of the Tomb Raider brings the story that was weaved from the first through the 2nd to an epic, world-altering, cataclysmic conclusion. As with every Ragnarok-like story comes rebirth, in experience and perspective. I am once more glad of all the history lessons it poured on my brain and injected into my mind. The game also masterfully presented myths I'd vaguely heard about in a clear manner, much to the pleasure of this ancient history and creation myth avid learner that I am. \n\nWhen I was 9 summers young, a Tomb Raider game was the first adventure video game I played. Much thanks to my uncle who had burned a copy on a CD (yeah I'm prehistoric). Now as a young adult, it continues to draw me back in as it is the only game I've played that has divined this perfect balance between its pedagogical aspect and 3D 3rd-person adventure. While I know that all good things are things that end, I selfishly (and perhaps pointlessly) hope more Lara stories will be told in years to come. If you love history, action, well-written lore, myths, puzzles, adventure, and already played the 2 prior installments, jump into it and become the Shadow of the Tomb Raider.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally finished the trilogy and I think this, again, is a good improvement on the 2nd. The game felt more like an adventure, with more tombs to discover and a bigger focus on this than the combat - which I enjoyed, the combat it self was pretty good, although I had around 6/7 different bows and used the main one for 99% of the game.. so, not sure the point of them.\n\n The story was great, the actual 'tomb raiding' was enjoyable with interesting puzzles.\n\n My only real gripes were:\n1. Sometimes the camera angle SUCKS. Have to make a jump with some wonky camera angle only to fail because I couldn't properly angle the jump, was annoying.\n2. There is a bug where if you do not have V-Sync on, some of the puzzles don't work so you cannot continue. Although, once this was sorted it wasn't a problem - just a pain figuring it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best game ever even in 2025.(actually i'd say 2025 and beyond)\n\n10/10 it's not perfect but still i'd give 10/10. Wish all those dlc tombs are in main game storyline. \n\nHuge difference in graphic settings, with everything max this game is ultra beaufitul. you'd just stare at \nyour screen in awe most of the time.\nUse to play this game with medium graphic settings back in the day( cracked/pirated version tho) and i quit after reaching Paititi because it's so boring and graphic was like an oil painting. But now with a better pc im enjoying this game like it's a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game besides the bugs that don't let you progress in certain areas. The devs knew this soon after launch but I guess they weren't bothered enough to fix the problem. Some puzzles here suck too.\n\nStory was good but the previous was better by a long shot. Still worth it if it's on sale. I personally got it for dirt cheap so I can't complain. Gameplay is solid but some neat mechanics are locked so far away in the skill tree that I wasn't bothered with grinding just to learn those.\n\n6.7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Placed this game years ago after finishing both Tomb Raider and Rise of the Tomb Raider.  Never finished this one though, and, boy, am I glad I waited to play it the definitive way!  Game is dame near perfection on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In many ways Shadow of the Tomb Raider is an improvement over Rise, but it also feels as if it took several steps backwards. Of all the times Lara has been to Peru (which is surprisingly often), this is the most we've ever got to engage with local cultures, even if the story mainly concerns a displaced Maya civilisation. On the other hand the amount of hub areas with side quests slow down the game massively for what amounts to fetch quests that feel more at home in Deus Ex than it does Tomb Raider. I also don't think the developers realised Lara interacting with active civilisations means she's just stealing artefacts from people's houses. The platforming gameplay is strict to the point of feeling buggy at times. It all works but mistime a jump even slightly and it's over for Lara, which also takes the wind out of several cinematic scenes since on a first try you'll likely be going through it over and over again attempting to get that one jump right (particularly frustrating in Deadly Obsession where you can only save between campfires, easily wasting about 20 minutes at a time). Carrying over from previous Survivor titles, there is also something so horrifying in that every archaeological site Lara visits ends up being utterly destroyed by her merely passing through.\n\nAll in all it is still a very good game, but one with a bit of an identity crisis (mainly in the gameplay department, whereas Tomb Raider 2013 felt more embarrassed about being Tomb Raider). Second best in the trilogy, below Rise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me this game is 7.5/10.\r\nGraphics is \"Excellent\" each region in the game is designed well.\r\nSystem requirement - Normal\r\nDifficulty - Easy to learn.\r\nBuy when it's on sale.\r\nI don't face any bugs in this game during my playtime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed my time with this game, BUT I think crystal dynamics and Eidos were on the verge of something really great within this reboot trilogy but they never quite grasped that potential, which is most felt in Shadow imo.\r\n\r\nThe story starts promisingly but bizarrely never explores any of the repercussions Lara might face from causing untold death and destruction so she never doesn't learn or develop in any way throughout this entire game. (This is especially odd after how much Lara is brutalised in the previous 2 games). Despite this there's quite a few fantastic moments that still come through, particularly when Lara becomes a horror game villain for a moment that was brilliant. \r\n(I honestly would've been okay if Lara became a cold blooded killer there.)\r\n\r\nThe rest of the game is I think the peak of the survivor trilogy, The Peruvian amazonia, the maya and inca architecture all of it is beautifully recreated. I love how much effort and consideration is put into portraying the unique wildlife and ancient cultures throughout the series in general and Shadow especially.\r\n\r\nI'm grateful there's been a significant reduction in combat as it's by far the most generic and boring part of these games; exploration and puzzles have taken centre stage. The optional tombs (and the DLC ones) are the best they've ever been and nearly always hold interesting architecture and landscapes, The small narratives that unfold during these really considered as well.\r\n\r\nIt's a huge shame that sqenix canned this series of tomb raider games despite it selling gangbusters. Lara you will forever be an autistic icon <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game. Aesthetically beautiful, performant, the tombs are more elaborate and challenging, and there are a number of ‘quality of life’ improvements here over the previous games (button prompts when picking up an item) that I really liked.\r\n\r\nThe story, it’s the weakest of all 3 in my opinion. There’s a real change of pace when you get to Paititi, and that drags things down a lot. The latter half of the game can be a bit of a slog.\r\n\r\nOverall though, I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of the Tomb Raider keeps the formula strong, gorgeous environments, solid gameplay, and enough extra content stuffed inside the world to make completionists suddenly rethink their life choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Tomb Raider\" holds a huge place in my childhood. \"Tomb Raider Anniversary\" was the first game I ever played on my very first PC—a gift from my dad. Later, I played \"Rise of the Tomb Raider\" on the Xbox 360 and instantly fell in love with the series. The atmosphere, characters, and story all came together to create my ultimate comfort game.\r\n\r\nI want to say the same about Shadow of the Tomb Raider, but I simply can’t. There are parts I genuinely enjoyed—like the fast-paced, chaotic prologue, and the stunning presentation of the \"Día de Muertos\" festival with its vibrant colors and incredible ambience. The world in general feels fresh, with dense jungles full of life and challenges.\r\n\r\nHowever, the puzzles are where the game lost me. They aren’t difficult to solve, but they tend to drag on and test your patience more than your logic. The storyline also feels weaker and less engaging compared to \"Rise of the Tomb Raider.\" And Lara’s character model in this entry looks unusually exhausted; something about her face just feels off.\r\n\r\nOverall, the trilogy as a whole is a solid 10 for me, and I’d love to see how Lara’s journey continues. But from what we know so far, the series is heading for yet another reboot—something I don’t think is necessary at this point. There’s no real reason to start over again. Hopefully the new direction actually happens and doesn’t end up shelved like other IPs by the \"Embracer Group.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of fun exploring tombs, crypts and more. I just wish games like this didn't have to be so dark and creepy - just not into the never-ending bodies strewn everywhere.  I also don't like the hunting of animals aspect of the game. Hope developers listen to their audience...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game for being released 8 years ago. Had fun getting all the achievements and challenge tombs were a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun mix of action and puzzles, if you jump into the game without previous knowledge of the game series then most likely you will just play through the main story without doing a lot of side quests and miss out on quite a lot of content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":ots of stuff to do, amazing graphics, imersive enviroments, especially with the open world villages and towns. Story is also good. Overall great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RPG 3RD person action game is like watching a movie. Very recommended if you want to relax and enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People criticize this game for being slow and its story being boring, but I loved this game. If you liked the last two of the trilogy, I'm sure you'll love this too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! Especially if you give yourself time to explore and solve the puzzles and get familiar with the NPC-s, the story makes a lot more sense than when you just rush through the main questline. Solid 9/10 game for me. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even by 2025 standards this game is gorgeous. The story has an excellent beginning and ending, but the middle is a bit rushed, but the game makes up for it by being ABSOLUTELY KINO at points. Lara's VA has delivered EXCELLENTLY at transmitting all the emotions that Lara goes through throughout the game and every cutscene is damn worth watching. Especially **THAT** refinery cutscene, whoever directed that I hope they got several raises, chef's kiss, absolute goosebumps. Definitely get the game if you're a fan of the series, or even if you aren't one and you're interested in playing something visually appealing that veers away from combat and focuses on narrative, exploration and riddles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feeling a mixed bag of emotions as I am writing this review but at the very least I can safely say that this game is definitely worth a shot. \r\n\r\nThe high points are really really high but the low points are equally abysmal so the overall experience is somewhat rocky (and janky).\r\n\r\nPlatforming will be one of your biggest gripes as you progress through locations, slowly morphing from being extremely fluid and sticky to simply unresponsive by the later quests and missions in the game. \r\n\r\nSome side quests drag along for an unnecessarily long amount of time (this critique is specifically for the main quests, the dlc quests are much more intriguing and well paced).\r\n\r\nYou will spend a lot less time in combat sections in comparison to the previous iterations. A lot more time will be spent exploring and also actively \"tomb raiding\", making Lara live up to the name of the title for once. \r\n\r\nPaititi (which acts as the main hub for a large segment of the game) will feel like a grinding halt in progress. Over time however it will a.) grow on you or b.) something you completely despise. There is also the lucrative option c.) which is that the game will force you to return to this segment regardless, so its best that you learn to love it with all of its flaws.\r\n\r\nStealth in combat is done incredibly well. There are multiple ways to take down enemies from the dark, hide their bodies, attack sneakily from canopies and a plethora of other fun options. There are also unique trap arrows and ammunition options to choose from. The biggest shame however is the fact that the game makes you resort to using your bow for a combat for a majority of the Paititi section, along with restricting your clothing to \"traditional\" tribal attire (which is pretty annoying).\r\n\r\nOverall, out of the three games in the survivor trilogy, this is one that I find myself returning to constantly. There has been a clear focus on explorability and environments. In my opinion, the story (so far, I'm yet to finish the final few missions) is much stronger for me in comparison to the previous titles. There might be issues with pacing and some amount of jank, but the game makes up for it with its pretty much constant action and endless amounts of in game content. If possible, I definitely recommend getting the dlc's as the tombs present within the same are absolutely excellent.\r\n\r\nTombs: 10/10\r\nStory (so far): 7/10\r\nCombat (with all weapons): 9/10\r\nCombat (just bow): 6/10\r\nWorld: 9/10\r\nTraversal (for hub areas): 4/10\r\n\r\nBut anyways, stop being indecisive already and get this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loveee this game, from the graphics to the game play its so good. It's deff one of my favorite with the levels being different difficulties it keeps it interesting especially because there's small things to find along the way, so when you get tired of the combat you can go on little treasure hunts. Highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unsure on whenever Sottr beats Rottr in terms of the story, both are high-key bangers.\n\nBut on Sottr i've encountered an issue with the game which is that the game ocassionally just breaks your entire PC, to be more specific, your whole PC just freezes alongside with the game, even my animated keyboard lighting just froze.\nThis happens occassionally in the game, its not a problem with my computer cause i played on 2 different setups and this issue persist on both which can really mess up your gameplay.\nEspecially if you are playing on Deadly Obsession (my case) resulting in me losing 20+ minute long progress multiple times like dying on that difficulity already wasn't punishing enough.\n\nNevertheless, the Sottr manages to beat its predecessor with aspects like graphics, new mechanics, less bugs (sometimes) etc...\nRecommending this to anyone who likes 50/50 open world story games.\nIf you dont count in the crashing then i really enjoyed playing this. \n\nKeep cooking devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I personally liked Rise better, this one grew on me after a few days, but it feels like a downgrade in many respects.  Still a great game, but they brought a lot of the irritating things from the first entry back (endless jump scares, and general anxiety inducing mechanics, and slightly jankier platforming than rise, and obviously rushed portions along with deliberate time sinks)  The plus sides are a beautiful game, and the exploration/lore aspects are great.  Janky platforming aside, I really like the majority of the puzzles, and the narrative is decent.  I'm in the middle with the stealth mechanics, which are definitely more punishing, but it does make sense in the context of the game.  It took me awhile to really start enjoying it, but that's probably a skill issue :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. As well as Tomb Raider and Rise of Tomb Raider. Highly recommend all three games and play them in chronological order for best experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great atmosphere, plays great. Loved the first 2 ones, this one is great too. But I play single player games primarily for story, and if I had to Google the story at the end to make most sense of it, it's not a great sign. Game is 10/10, worse pacing and most weapons being useless compared to the first 2 installments makes it a 9/10, losing me in the story drops it down to a hard 6, you can imply the whole story but it's a delicate thing and this does not do it well; all the elements are there but they don't connect well and the story which is the centerpiece here should have had more love and polish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☑ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☑ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☑ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty weak story, but new the gameplay mechanics are pretty neat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This part is exceptional filled with unforgettable moments and exciting adventures",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome!\r\n\r\nI've been a fan of Tomb Raider ever since 1998, when I bought Tomb Raider Platinum for PS1.\r\nI immedietly loved the reboot of Survivor and thoroughly enjoyed Rise, even though it had small pacing problems.\r\n\r\nNow, with Shadow I haven't been expecting anything more than Rise. Rise 2.0 That was my expectation. Boy was I wrong!\r\nThe pacing issues are gone. Every little step feels engaging. The music is superb and atmospheric. The constant surprises and little shock moments were always keeping me sharp and on my toes. It feels very intense to play this game. Especially blind, i.e. without any help from game guides.\r\n\r\nThe crafting is streamlined to a resonable level. It doesn't get in the way like in Rise. Although as a little gun nerd, I have some criticism about realism. But it doesn't get in the way.\r\nThe climbing is exhilirating and especially without the little cues it feels very important.\r\nExploration and the puzzles are magnificent. I had some real head scratchers and that is how I like it. That is litterally the core of the Tomb Raider experience.\r\nCombat is well done. Not too flashy and not too realistic. It is a good balance. And one can almost always choose to go sneaky instead of noisy. That also adds to the intensity.\r\nIt is a end of the world king of story, but that is okay. She can save the world, too.\r\n\r\nAll in all this game isn't just something for fans of the franchise, but also for players that seek a challenge and want to be entertained.\r\n\r\nHave fun everyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "考虑英语是世界上用得最广的语言，所以我发布语言是选的“英语”\n\n主观评分9.5/10分（优化问题，渲染问题扣0.5分），商业游戏评分5/10分（不及格），同一个人在不同生活工作环境，不同压力环境不同角度，会对这部作品有不同的评分，包括我。\n\n这是一部注定两极分化的作品，我建议心理年龄超过20甚至30或者40的人，有大量空闲时间的玩这部作品，这游戏不适合碎片化时间的人玩。（我没有阴阳人也没有阴阳作品，我是在描述客观事实），目前我的游戏进度是88%，你参考我游戏数还有我的游戏时间来看我这个评论。\n\n这游戏好就好在太深奥了，各方面的，差就差在太深奥了，这游戏我玩下来感觉是个博士论文，对于文化的探究、关卡/古墓做得是历代最强。但不是在2018年包括今天2025的一个好的商业游戏，作为商业游戏非常失败，商业游戏你面向的是所有18+游戏玩家。玩通玩懂你这代游戏的准入门槛是最高的，从你们成就达成的百分比还有销量就能看出来，包括我在内，很多人是需要查攻略的，战斗不难，解密还有理解文化底蕴难。商业游戏是需要赚钱的，像你们这种游戏如果一直这么做，是只会保留很少的核心用户群体，而失去广泛的大规模用户群体，更别提现在还是短视频、低用脑、碎片化时间的时代，会导致你们失去很多收入而陷入负面循环最终没人来做这么一部优良作品的后果。\n\nThe following English and Japanese translations are generated by Doubao, an AI product under ByteDance, the parent company of TikTok.\n\nConsidering that English is the most widely used language in the world, I chose \"English\" as the language for publication.\n\nSubjective score: 9.5/10 (0.5 points deducted for optimization and rendering issues); commercial game score: 5/10 (below passing grade). The same person—including myself—may assign different ratings to this work based on their varying living/working environments, stress levels, and perspectives.\nThis is destined to be a polarizing work. I recommend it to those with a psychological age of over 20, or even 30 or 40, who have ample free time; it is not suitable for players who only have fragmented time to spend on games. (I am not being sarcastic about anyone or the work itself; I am merely stating objective facts.) Currently, my game progress is 88%—please take my total number of played games and playtime into consideration when evaluating this review.\nThe game’s greatest strength is its profoundness in all aspects, yet this very profoundness is also its biggest flaw. Playing it feels like reading a doctoral dissertation: its exploration of culture and design of levels/tombs are the best in the franchise to date. However, it is not a good commercial game—not in 2018, nor in 2025 (today). As a commercial game, it is a complete failure. Commercial games are intended for all players aged 18 and above, but this installment has the highest entry barrier for players to complete and fully understand. This is evident from your low achievement completion rate and sales volume: many people, myself included, have to consult walkthroughs to get through it. The combat is not difficult, but the puzzles and the understanding of cultural connotations are.\nCommercial games need to be profitable. If your studio continues to develop games in this vein, you will only retain a small core user base while losing the broad, large-scale audience. Not to mention we are in an era of short videos, low mental engagement, and fragmented time—this will lead to a significant loss of revenue for you, trapping you in a vicious cycle that could ultimately result in no one being able to create such an excellent work again.\n\n以下の英語と日本語の翻訳は、TikTok の親会社である字節跳動（ByteDance）傘下の豆包による AI 翻訳です。\n\n英語が世界で最も広く使われている言語であることを考慮し、私は公開時の言語として「英語」を選択しました。\n\n主観評価：9.5/10 点（最適化の問題とレンダリングの問題で 0.5 点を減点）、商業ゲームとしての評価：5/10 点（合格ライン未満）。同じ人物であっても、生活や仕事の環境、ストレスの状況、評価の視点が異なれば、この作品への評点も変わる可能性があり、私自身もその一人です。\nこれは必ず二極化する評価になる作品です。私は、心理年齢が 20 歳以上、さらには 30 歳や 40 歳以上で、多くの自由な時間を持つ人にこの作品をプレイすることを推奨します。このゲームは、スキマ時間しかない人には不向きです。（私は誰も皮肉っているわけでも、この作品を批判的に言っているわけでもなく、客観的な事実を述べているだけです。）現在、私のゲーム進行度は 88% です。このレビューを参考にする際には、私がプレイしたゲームの数とプレイ時間も考慮してください。\nこのゲームの良さは、あらゆる面で極めて奥深い点にありますが、悪さもまたこの「奥深さ」にあります。プレイしている感覚はまるで博士論文を読んでいるようで、文化への探究、ステージ / 古墓のデザインはシリーズ過去最高の出来栄えです。しかし、2018 年当時はもちろん、2025 年の今日においても、これは優れた商業ゲームとは言えません。商業ゲームとしては非常に失敗しています。商業ゲームは 18 才以上のすべてのプレイヤーを対象とするものですが、本作を完全にプレイし、理解するための門戸はシリーズで最も高いです。これは、実績達成率や販売数からも明らかです。私を含め、多くの人が攻略本や攻略動画を参照する必要があります。戦闘部分は難しくないのですが、パズルや文化的な底力を理解する部分は難しいのです。\n商業ゲームは利益を上げる必要があります。もし貴社が今後もこのようなスタイルでゲームを開発し続けた場合、少数のコアユーザー層だけを維持することになり、広範な大規模なユーザー層を失うでしょう。何より現在は短編動画が主流で、低い思考負荷で、スキマ時間を活用する時代です。その結果、貴社の収入が大幅に減少し、悪循環に陥り、最終的にはこのような優れた作品を制作できる人材もいなくなってしまう可能性があります。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game looks incredible even 7 (or however many years later). I also think that the story is probably the most engaging of the three entries in this trilogy. My biggest complaint is that the climbing/parkour is by far the most inconsistent out of the three games. It has been borderline frustrating in certain situations trying to jump from one obstacle to another. The collectibles are still kind of annoying to collect, but I don't think it feels too bad to try and get to 100% which I am going to to to do. The challenge tombs are pretty fun, but going back through and replaying them in challenge mode is exhausting. I would recommend this game if you are looking for something to scratch an itch similar to that of Assassin's Creed. I have enjoyed the entire TR trilogy, and this one is the best looking with the most refined combat, but it has frustrated me more than the other two titles. Fun game doe. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 100% ing the game I got to say... it was not that bad BUT it feels like the soul of the developers has been slowly going numb. The story is ok... nothing to really brag about and some times the game play feels a little bit off putting. It is by far not a bad game but in contrast to to rise it feels like a tad if a downgrade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of the Tomb Raider is honestly the best and most refined game in the entire Tomb Raider series. The controls feel smoother than ever, the story is tighter, and the whole progression of events is more engaging and polished. Everything—from the gameplay to the pacing to the atmosphere—just feels on a higher level in this one. It’s definitely my favorite installment in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is better than all the men I've talked to in the past 3 years. Strong independent woman  against chop suey men...it's what we needed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of the Tomb Raider is the final game of the trilogy, and the whole story can be divided into different parts: formation, turning point and prime. \nSo, this part is prime (while continuing of this story should be ascension and enlightenment) of Lara Croft.\nIn this part of game, we clearly see the same pros and peculiarities with new plot twist.\n\nLara will have to confront Trinity and Dominguez to put an end to their confrontation and save the world once again.\n\nThroughout the story, the duality of feminine nature is beautifully revealed: at one extreme, a woman can be incredibly strong, while at the other, she must remain feminine, lest she disturb the fragility of her inner world. Jonah's phrase, \"Only you, what?\" makes one wonder whether fragile female shoulders are truly capable of bearing such a heavy burden. And this question sometimes becomes rhetorical, given Lara's physical fitness.\n\nJokes aside, this is the story of the strongest woman in history. Of course, Lara Croft is a fictional character, but she's not a superhero and doesn't possess superpowers.\n\nMoreover, while going through difficult moments that require incredible fortitude, we see how she is overwhelmed and not afraid to show emotions, which reminds us that before us is, after all, a girl, fragile and vulnerable.\n\nThe icing on the cake is an unlikely combination. Before us is an intelligent beauty who has not fallen victim to greed, cunning, or treachery.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are some bugs that made me wanna end it all because of how far back i would be sent back on the hardest difficulty BUT the story felt pretty good and still gave me goosebumps when i beat it. def worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I SHED TEARS\r\nfav tb storyline for me by far i was obsessed and it was so fun to explore, amazing sceneries and music to back it up, i will have to come back to this one fs...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda woke ass game but blessed be the kind souls in modding communities for obvious reasons, ehem! Mods can make wonders on this one, gotta say! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BUT they have absolutly no concept of rasonable, story or easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a long break from the TR series I finally hunkered down to play this, starting with Hard - because surfaces shouldn't be need to be painted to find your way, and you shouldn't need magical perception powers to dispatch enemies, right? The dialogue and story are so-so. The challenge (and regular) tombs are mostly excellent, and the world feels very much alive.\r\n\r\nThe campaign tries to be as \"cinematic\" as it possibly can and this is occasionally aggravating. Why is Lara crawling through piles of dead bodies with the camera at the most claustrophobic angle *again*? Why is she constantly gasping and crying out when taking innocuous actions? Why does she have to make constant annoying radio contact with her useless friend? And what the f--- is this 'creepy' music that so often masks the natural ambience of the halls of the dead? Such questions many never be answered, but at least learning bits of history through collectible artifacts is possible and very enjoyable. \r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice visual effects and graphics, wan't as much fun as the previous ones :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like it as much as the other 2 Tomb Raiders, but still a lot of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replaying in 2025 and it’s okay overall. The puzzles are sadly way too easy, the subtle wokery is annoying but tolerable. But Jonah? Absolutely unbearable. He’s a useless, feminized, spineless, do-nothing tag-along who manages to drag down every scene he’s in. Why is he even here? Starts with D ends with I.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the mix of adventure, puzzle, and action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played the trilogy, this one went from dreadful, to a horror game, to being dark.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐ One of the Best Games I’ve Ever Played! ⭐\r\n\r\nShadow of the Tomb Raider easily stands out as one of the best games I’ve played in years. The story is gripping, the visuals are stunning, and the world feels alive with so much to explore. Every location is packed with detail, and the balance between action, puzzles, and exploration is spot on.\r\n\r\nThe challenge tombs are absolutely perfect — they’re creative, rewarding, and really bring out the essence of what Tomb Raider is all about. Out of all of them, the Path of Fear is my personal favorite. It’s such a brilliant mix of atmosphere, tension, and clever design that keeps you on edge from start to finish. The eerie environment, the haunting sound design, and the feeling of being lost in Lara’s fears make it unforgettable.\r\n\r\nDon’t skip the side missions either — they’re surprisingly well written and add a lot of depth to the story and the world. Some even unlock amazing gear and new tombs, so they’re definitely worth doing.\r\n\r\nOverall, Shadow of the Tomb Raider is an incredible experience — a perfect blend of adventure, challenge, and storytelling. A must-play for anyone who loves exploration and puzzle-solving games! 🔥",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "“Same story, new jungle.”\n\nStory-wise, Shadow of the Tomb Raider was a letdown. It basically reuses Rise of the Tomb Raider’s plot — just with different faces and a new location. Avalanche in Siberia? Now it’s a plane crash in Peru. Lara loses her gear, has to rely on her bow again, and once more races Trinity to find a mystical artifact before they do. There’s even another hidden tribe that joins her for the big final battle.\n\nWe also get the same “world-changing power” plot, with Lara tempted to use it for herself — almost beat for beat what we saw before. And they kept dragging out her rewritten backstory with the most overused trope ever: dead parents. That arc could’ve wrapped up after Rise, but instead they stretched it across three games until it just felt tired.\n\nThat said, gameplay-wise it’s easily the best of the trilogy. The exploration, stealth, and tomb design are fantastic — probably the closest the reboot ever got to the classic Tomb Raider feel. I’ve always loved using bows in games, and the stealth mechanics here made that really satisfying.\n\nIf you play these games mostly for story, Shadow might disappoint you. But if you’re here for exploration, puzzles, and sneaky bow gameplay, it’s absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of Lara Croft, I must play Shadow of The Tomb Raider. Non-stop action and breath-taking visual. Game's mechanic and environment interaction is very detailed. Another success from the studio.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like an interactive cinema of a game a solid 10/10. Must play before u die.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game play and story, well worth a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very fun and the graphics are stunningg\n⠀\n⠀\nand lara👅👅👅",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most visually tunning and highly optimised game i have played so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice and underrated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3] Third time's the charm (mostly) [/h3]\r\n\r\nShadow of the Tomb Raider finally gets the trilogy formula right: fewer shootouts, more tombs, and platforming that’s actually fun. The story is basically the same  [spoiler]“Trinity, ancient warriors, end-of-the-world”[/spoiler] routine for the third time, but whatever - at least it looks great. Easily the best of the three, even if it thinks I didn’t just play this plot twice already.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very optimised, good story, overall upgrade to the other two",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bought the series good game..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10. Solid way to end the trilogy.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "kinda buggy, but very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super game macht bock!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually challenging with all the puzzles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best adventure game I ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "btw if anyone looks like lara croft my dms are still open",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WAS REALLY GOOD GAME +1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game with stunning visuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game, love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, I really like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, made my penis hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good adventure game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Story Line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yup its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Female Version of Nathan Drake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story<3",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "good tomb raider one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Within about 2 hours of actual gameplay I've already encountered two massive bugs one of which literally prevents you from continuing the game.\n\nIt started with an audio dialogue bug where the characters decided to stop speaking (which also meant subtitles no longer functioned) the fix to this was to download the German voices so that I could swap to that (which fixes the problem) and then swap back to English.\n\nThe 2nd bug breaks an entire MAIN STORY puzzle from functioning making it impossible to progress if Vsync is turned off in the settings.\n\nThe fact that such egregious bugs are still present within this game 7 years after release is an absolute embarrassment and disgrace.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It’s a rather mediocre work with a dull storyline — disasters follow Lara wherever she goes. There’s also a side quest with a serious bug: if you don’t follow the official sequence, you won’t be able to find the NPC for the final dialogue, which affects 100% completion. On the positive side, the game offers plenty of tomb exploration and decent graphics, but I’d still recommend you play Rise of the Tomb Raider or Uncharted 4 instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautiful, but mostly jump puzzles and quick time events.  The sign of weak game devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bloated with crafting and collectables, lots of pointless backtracking spoiling the urgency of the main quest. QTE hell and constant cutscenes where you don't even know if you have control of Lara or not. You're more likely to die a horrible death by falling than by getting killed by an enemy. At least there are plenty of tombs, but this is the most tedious game in this trilogy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The name shadow of the tomb raider is a good name for this game because it is a shadow compared to its predecessors. \n\nIn terms of graphics, mechanics, openw world, etc. This game feels like it would have been the first try for the devs for the mechanics of the new series, before the previous two games, but somehow this game is the last in the series. What an utter disappointment compared to the two previous games. The mechanics are sloppy, the maps are tedious, and the combat is boring or does not allow actual tactics. The \"open world\" is constricting, linear but doesn't want to be, and gives me no real reason to return other than my autistic rage. It also feels like there is barely a game here compared to the content and story of the two previous games. If you enjoyed the two previous games, just save yourself time, money and heartbreak and pretend the previous game was the last in the series. Laura would be embarrassed for you. Also, how does a game not just have a crouch button and decide for me when I am stealthy?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ 04 / 10 }---\r\nShadow of the Tomb Raider shines with beautiful hidden villages that blend into the environment so well. The visuals really are the highlight of this game. The story is simple but decent, and the characters had potential.\r\n\r\nBut the game lost me through pure frustration.\r\nA puzzle with a globe soft-locked itself: once I rotated it to the limit, it wouldn’t move back at all. I had to google the solution, plug in a controller, switch inputs, and only then it worked. Later, interaction prompts randomly disappeared. That was the moment I stopped having fun.\r\nStealth barely matters because running in with a gun is easier and more effective.\r\nParkour should feel fluid, but the game blocks off obvious ledges, leading to constant deaths from jumps that look correct but aren’t allowed. I even recorded a few of them, it really is funny and sad at the same time.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n[b]☑ Beautiful[/b]\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n[b]☑ It's just gameplay[/b]\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n[b]☑ Good[/b]\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Story }---\r\n☐ It'll replace your life\r\n☐ Lovely\r\n☐ Good\r\n[b]☑ Average[/b]\r\n☐ Some lore\r\n☐ No Story\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n[b]☑ ARK: Survival Evolved[/b]\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n[b]☑ Easy[/b]\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n[b]☑ Nothing to grind[/b]\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really rather boring. Puzzles are bland or obnoxious, story is meh.. who cares - gunplay is good, but exploration is highly repetitive and there's far too much crap to collect. It's like they looked at Assassins Creed and said MORE!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly, I found Shadow to be a step down from the rest of the trilogy. I’d say I still enjoyed it overall, but it has a lot of flaws that took away from my enjoyment. First, the good - the gameplay is the same old, with a few tweaks to stealth, and it’s still a lot of fun. Graphically, I honestly think this is one of the best-looking games I’ve ever seen, and the story is, I think, the best of the trilogy. Unfortunately, it feels like the game is sabotaging itself in a lot of ways. First, you spend much of the story in a location called the Hidden City; while this is an awesome setting in the story, it also restricts you to only using a small number of outfits and one weapon. Again, this isn’t bad in service of the story, but you spend so long here that it rapidly gets wearing. And, even after the story, the restrictions remain in place. But frankly, I wouldn’t bother with what comes after the story because there are way, way too many collectables, many of which feel phoned in. All of the notes that were previously voiced by various characters are now read by Lara, there’s a new collectible called murals… which are just notes again, and a number of the artefacts recycle models and descriptions. The DLCs are also weak - all of them are the same get problem from character, do extra linear challenge tomb, get mediocre reward. It’s a damn shame, because again, the story here is great, but the rest of the game just can’t quite carry it. If it’s on sale and you liked the previous games, go for it, but I’m sad to say that this game really disappointed me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stale gameplay and far too many collectibles combined with poor writing and uninteresting characters constitute why I can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like reading the Odyssey, but Odysseus takes a pause every time to grind loot. The narrative is too predictable and the gameplay is too repetitive, too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repetative level, less action more of jumping and hanging.. most of the time it gave feeliing of uncharted. but uncharted was more fun to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the good\n+spectacular lighting and art direction. almost photo real at times.\n+immaculate detail environments that feels lived in and awe-inspiring\n+collectathon with plenty of things to do in each open zones which all contribute to upgrades\n+everybody's hair is shampoo-ed and conditioned at all times\n+tight combat both stealth and blazing guns. once the game opens up.\n+plethora of equipment, upgrades, outfits for Lara\n\nthings that are ok\n+ok story, you have seen similar stories before. but the setting makes it interesting and keep you going.\n+forced stealth and gunplay at some sections\n\nthe bad\n-Platforming is subpar for tomb raider game, this is the main cause of hilarious deaths. Lara will miss the ledge, platforms that are so obvious to catch. \n-it is not always clear which platforms can be climbed and which hazard is lethal. you will find out by hilarious deaths\n-unnecessary and long gruesome repetitive close ups on Lara deaths. it is either annoying or straight up funny coz its inappropriate.\n-many cheap deaths that give no time to react, at this point I am already numb and become business as usual.\n-Lara's character is inconsistent. She's warm one moment and cut up baddies in brutal executions 5 mins later\n-game mechanics are overall real clunky, Lara does not always do what player intends to do\n\noverall\n+a real mixed bag and every sense of wonder and adventure promptly killed by frustration a few mins later",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some areas are way too dark, Lara just refuses to turn on her flashlight, and I can’t turn it on myself either. It’s really stupid. I’ve set the brightness to the highest level and still can’t see sh*t.\ntoo many bugs.\nThe weapon upgrade screen is kinda boring, it’s a downgrade from the last two games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lush environments. Heartfelt and masterfully crafted cutscenes. The best facial animation the industry has to offer. The best graphics I've ever seen. This game actually manages to provide a realistic explanation as to why someone would do the things Lara does with some wonderful new backstory involving a troubled home life. HOWEVER! There is not nearly enough combat AT ALL, not enough to justify all the upgrading and shit. I didn't even get my shotgun until 2/3 into the game. The machine gun was also super OP. I wanted to love it, and it does do some things very well, but when I've killed less than 50 enemies in 9 hours, yet the game has almost 30 combat-related talents to learn, something is seriously wrong here. It's so disappointing because it starts extremely strong and just wears and wears on you until you finally quit out of either frustration or boredom. I feel so fucking bad for Crystal Dynamics, being busy making Avengers while Eidos Montreal fucks their series in the ass. Is this review lopsided as fuck? Yes. But that's because this game fell off a fucking cliff. \n\n6.5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has all the *components* of the first two in the trilogy but none of the execution, pacing or  composition of them, and that's what mattered the most.\n\nThis game irritates me to play after the first two:\n\n- The studio changed to Motreal and this game was lead largely by a different team than the first game.\n- They shifted direction from action more towards puzzles and exploration with longer cutscenes.\n- There are issues with performance including low fps and hitching that are still present, despite not looking much better than ROTTR.\n- The hitching that happens when you move the camera quickly basically ruins the third-person shooter aspect of the game.\n- There are audio issues.\n- Pacing feels completely different and *wrong* compared to the first two. \n- They didn't even notice that the same two notes are played on a violin on repeat through the entire game and triggered each time you open a menu and it will do your head in after a few hours.\n- There's actually no way to avoid an irritating sound effect if you want to know where you're going. Either you open the map and get the bloody violins or you use survival instincts and are subject to the much longer, way more unnecessary and annoying noise they have inexplicably changed that the old subtler, shorter one too. \n- Stealth is broken\n- FOV too narrow & camera distance too close for enjoying on pc with no way to change it.\n- When you shoot enemies there's no blood, no bullet effect even, they barely even react. It's so amateur.\n- You have to wear a stupid costume for half of the game.\n- You'll spend 20 mins 'navigating' through a section that might as well be a corridor you walk through because you really are just following the navigation cues only to be met with yet another cutscene and then more of the same.\n\nIf you've played through the first two games like I did prior to this one, don't get excited. I'm not even able to force myself to play through this one it's like trying to eat the raw ingredients to a pizza.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's a lot I like about this. The gameplay is really fun and it's visually stunning. \r\n\r\nSo it such a shame that the game itself feel near unplayable at the times. From literally gamebreaking glitches to the fact that there seems to be more cutscenes than actual gameplay, it seems that Shadow of the Tomb Raider is practically begging you to stop playing. \r\n\r\nI remember really liking this franchise back in the day, including this one, so maybe a lot of my issues stem from the fact that this is a replay for me. But come on, it is frankly ridiculous how little actual gameplay there is in the first 5 HOURS. And you can't even really skip the cutscenes because the game uses them for loading, which it does a lot. So you're forced to watch the story and when you finally get to play the game has you slowly squezing through tight openings (I guess to once again try to hide the insane amount of loading that this seems to require). And the story is doing nothing for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hate this game. Constantly annoyed at all times while playing it. OoOOh yeah lets force slow walking for 20 minutes more while we listen to unskippable boring white-savior dialog (Lara isn't a tomb raider, you see, she's the hero who saves the natives against the evil military people). The game loop is literally 70% quick time events, 10% shooting, and 20% listening to nonsense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh my God I hate this game, I played the demo & it was pretty decent so I bought it based off what I saw in the demo, after that like 30 - 40 mins if gameplay the game nose dives into aimless ubisoft get thrown into a world for hours and hope you find something of value to make the effort feel worth it in extremely clunky, awkard, gameplay, i genuinely feel kinda lied too by how much better that first tiny part of the game was before it became ubisoft slop. Idk if it even is made by ubusoft, but my God does it feel like it & I'm not going to search it up because how sad I found it being reminding this game us still in my library.\n\nThe cinematography is genuinely incredible for the first part of this game & the cutscenes, but the gameplay driving itself off a cliff like it did just makes me sad thinking of what this game could have been.\n\n1.5/10\n\nThe score would be higher if they didn't try baiting with a demo that doesn't remotely resemble the full product, but even if I based the game off of just the game itself, not thinking of how its marketed its a 3.5/10 absolute max",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A buggy and very sub par game with glitchy graphics and questionable and unrealistic choice options. Puzzles don't work consistently.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game crashed after 11 hours of playtime (the playtime was great). Not saying it will happen to you, but steam wont help me out with it. Other than that; the time i did play was great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game the how the fuck does a franchise climbing mechanics get wrose after the first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many bugs, got locked from progression and nothing helps\r\nthis reboots have been such a dissapointment",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "voice and subtitle is not working",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woke slop. Uglified Lara to please the \"modern audience\". Franchise ruined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to enjoy this game. I absolutely loved the first two tomb raider games, but this one just did not live up to the bar they set. The story pacing seems odd as well: the game started slow but finished fast. The parkour, which is by all means a very central part of the game, is so much more sensitive than in either of the two previous games. If you're even a small amount off of where it wants you to be, too bad, you're dead! \nAll in all, this was a frustrating game to play that did not make up for that frustration with good plot or satisfying mechanics.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "did not like this tomb raider games as much as the other two, yes the game was very pretty and the tombs where fantastic but the story was rushed, once you reach the hidden city the plot becomes so bad the second half of the game was so bland",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Within about 2 hours of actual gameplay I've already encountered two massive bugs one of which literally prevents you from continuing the game.\n\nIt started with an audio dialogue bug where the characters decided to stop speaking (which also meant subtitles no longer functioned) the fix to this was to download the German voices so that I could swap to that (which fixes the problem) and then swap back to English.\n\nThe 2nd bug breaks an entire MAIN STORY puzzle from functioning making it impossible to progress if Vsync is turned off in the settings.\n\nThe fact that such egregious bugs are still present within this game 7 years after release is an absolute embarrassment and disgrace.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Sure, the game looks nice but the story is horrendous and completely loses the plot towards the end. I also dislike the same formula the other Tomb Raider games and this game uses where Lara gets and/or finds a story related artifact of importance and the enemy faction sweeps in to seize the day and Lara gets captured or left for dead. Boring and uninteresting.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game is beautiful, but mostly jump puzzles and quick time events.  The sign of weak game devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They took what was great bout other titles and threw it away. Lara went from being a strong female protagonist, and is now an emotional idiot. The gameplay is still decent, but not up to scratch with the other 2 titles.\n\nIdiotic design choices include: \n> losing all your weapons for some late game missions so you can play a bad version of hitman.\n> Interrupting cutscenes that take over control and gives you bad position and tactical choices.\n> Many NPCs/creatures that run into melee range but giving you a the worst combat skills with limited dodge/counter and kill animation during which you can still be hurt and killed.\n> Horrendous PC control mapping that cannot be changed for many normal actions.\n> Slow animations that cannot be interupted, jumping off ledges the wrong way because it was too slow to notice the multiple button presses, crawling though gaps and walking forward to continue playing - stuff that means nothing but wasting time holding down a button.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was really fun until you get to a certain tomb after how many hours with a stupid bug that stops all progression in its tracks.  The \"fix\" is apparently limiting frame rate and upping your ray tracing and graphic settings to max but the pillars will not move no matter how many settings I change.  I wish developers would stop releasing broken crap into the world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is the perfect example of how to take one of the best looking games ever made and make it as frustrating as possible to play. Every few minutes, my gameplay is interrupted by long, boring, and un-skippable cutscenes. After the cutscenes are finally finished, the game forces slow walking sections, which completely kill the pace. Jonah is the most boring and out of place character I've ever seen in a game, and he adds even more frustration every time he appears. It didn't feel like I was playing Tomb Raider, it felt like I was playing \"cutscenes and forced walking\" raider, with a story that somehow revolves around Jonah for reasons I will never understand. I had to mute my PC every time a cutscene starts because I'm absolutely fed up with hearing \"Jonah\" EVERY TWO MINUTES.\r\n\r\nWhat makes this even more disappointing is that the graphics, setting and atmosphere absolutely impressive. Wasted potential by extremely lazy design choices.\r\n\r\nWhen the game FINALLY gives me control to play, progressing requires constant guessing and blind jumping to random ledges with barely any visual guidance, making the chance of falling and instantly dying extremely high. I died well over a hundred times because of unclear design, not actual challenge. Instant-Deaths Raider? Anyways, the story is bland and unengaging. The moment you feel immersed, get ready to be interrupted by yet another cutscene/forced-walking.\r\n\r\nI will NEVER play this game ever again even if I get paid for it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played the first 2 games. 1st was an amazing experience, felt like I was literally in a interactive movie with an RPG-esque type of looting and exploring adventure. The 2nd one has better characters and story but pretty forgettable, and the adventure was not as good as the first one so it was a meh game. But this one oh boy. Instead of Lara raiding a tomb for the sense of adventure or sort of a character completion phase, Lara's objective is to take what an evil organization wants first to stop \"world domination\". And the adventure, bruh this doesnt feel like an adventure, I just had the same experience I do taking exams I never studied for and that is such a major turn off for games. I am stupid I admit but the first 2 games puzzles was such a walk-past mandatory part of the game that makes me feel smart. This one makes me scratch my head expecting me to know the actual real life lore about the aztecs for hours looking at tutorials on YouTube. Shit game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The hardest part of the game is realising there is no soul anymore, everything has an easy and a hard solution and there is no incentive for the hard solution, no extra reward, no secrets.... the level design is... sad, most of the times, with the occasional treasure placed in a hidden spot in a nice way that rewards exploration. It's really sad what is sacrificed for the sake of selling to anyone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s a rather mediocre work with a dull storyline — disasters follow Lara wherever she goes. There’s also a side quest with a serious bug: if you don’t follow the official sequence, you won’t be able to find the NPC for the final dialogue, which affects 100% completion. On the positive side, the game offers plenty of tomb exploration and decent graphics, but I’d still recommend you play Rise of the Tomb Raider or Uncharted 4 instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whatever i try to play the game the audio of the character gone",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WAAAAAYYYY to little combat/action. Too bored to finish the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Relentless amounts of 5 + minute unskippable cut-scenes, absolutely boring puzzles. 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated with crafting and collectables, lots of pointless backtracking spoiling the urgency of the main quest. QTE hell and constant cutscenes where you don't even know if you have control of Lara or not. You're more likely to die a horrible death by falling than by getting killed by an enemy. At least there are plenty of tombs, but this is the most tedious game in this trilogy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The name shadow of the tomb raider is a good name for this game because it is a shadow compared to its predecessors. \n\nIn terms of graphics, mechanics, openw world, etc. This game feels like it would have been the first try for the devs for the mechanics of the new series, before the previous two games, but somehow this game is the last in the series. What an utter disappointment compared to the two previous games. The mechanics are sloppy, the maps are tedious, and the combat is boring or does not allow actual tactics. The \"open world\" is constricting, linear but doesn't want to be, and gives me no real reason to return other than my autistic rage. It also feels like there is barely a game here compared to the content and story of the two previous games. If you enjoyed the two previous games, just save yourself time, money and heartbreak and pretend the previous game was the last in the series. Laura would be embarrassed for you. Also, how does a game not just have a crouch button and decide for me when I am stealthy?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ 04 / 10 }---\r\nShadow of the Tomb Raider shines with beautiful hidden villages that blend into the environment so well. The visuals really are the highlight of this game. The story is simple but decent, and the characters had potential.\r\n\r\nBut the game lost me through pure frustration.\r\nA puzzle with a globe soft-locked itself: once I rotated it to the limit, it wouldn’t move back at all. I had to google the solution, plug in a controller, switch inputs, and only then it worked. Later, interaction prompts randomly disappeared. That was the moment I stopped having fun.\r\nStealth barely matters because running in with a gun is easier and more effective.\r\nParkour should feel fluid, but the game blocks off obvious ledges, leading to constant deaths from jumps that look correct but aren’t allowed. I even recorded a few of them, it really is funny and sad at the same time.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n[b]☑ Beautiful[/b]\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n[b]☑ It's just gameplay[/b]\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n[b]☑ Good[/b]\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Story }---\r\n☐ It'll replace your life\r\n☐ Lovely\r\n☐ Good\r\n[b]☑ Average[/b]\r\n☐ Some lore\r\n☐ No Story\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n[b]☑ ARK: Survival Evolved[/b]\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n[b]☑ Easy[/b]\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n[b]☑ Nothing to grind[/b]\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really rather boring. Puzzles are bland or obnoxious, story is meh.. who cares - gunplay is good, but exploration is highly repetitive and there's far too much crap to collect. It's like they looked at Assassins Creed and said MORE!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly, I found Shadow to be a step down from the rest of the trilogy. I’d say I still enjoyed it overall, but it has a lot of flaws that took away from my enjoyment. First, the good - the gameplay is the same old, with a few tweaks to stealth, and it’s still a lot of fun. Graphically, I honestly think this is one of the best-looking games I’ve ever seen, and the story is, I think, the best of the trilogy. Unfortunately, it feels like the game is sabotaging itself in a lot of ways. First, you spend much of the story in a location called the Hidden City; while this is an awesome setting in the story, it also restricts you to only using a small number of outfits and one weapon. Again, this isn’t bad in service of the story, but you spend so long here that it rapidly gets wearing. And, even after the story, the restrictions remain in place. But frankly, I wouldn’t bother with what comes after the story because there are way, way too many collectables, many of which feel phoned in. All of the notes that were previously voiced by various characters are now read by Lara, there’s a new collectible called murals… which are just notes again, and a number of the artefacts recycle models and descriptions. The DLCs are also weak - all of them are the same get problem from character, do extra linear challenge tomb, get mediocre reward. It’s a damn shame, because again, the story here is great, but the rest of the game just can’t quite carry it. If it’s on sale and you liked the previous games, go for it, but I’m sad to say that this game really disappointed me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stale gameplay and far too many collectibles combined with poor writing and uninteresting characters constitute why I can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like reading the Odyssey, but Odysseus takes a pause every time to grind loot. The narrative is too predictable and the gameplay is too repetitive, too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repetative level, less action more of jumping and hanging.. most of the time it gave feeliing of uncharted. but uncharted was more fun to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some areas are way too dark, Lara just refuses to turn on her flashlight, and I can’t turn it on myself either. It’s really stupid. I’ve set the brightness to the highest level and still can’t see sh*t.\ntoo many bugs.\nThe weapon upgrade screen is kinda boring, it’s a downgrade from the last two games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has all the *components* of the first two in the trilogy but none of the execution, pacing or  composition of them, and that's what mattered the most.\n\nThis game irritates me to play after the first two:\n\n- The studio changed to Motreal and this game was lead largely by a different team than the first game.\n- They shifted direction from action more towards puzzles and exploration with longer cutscenes.\n- There are issues with performance including low fps and hitching that are still present, despite not looking much better than ROTTR.\n- The hitching that happens when you move the camera quickly basically ruins the third-person shooter aspect of the game.\n- There are audio issues.\n- Pacing feels completely different and *wrong* compared to the first two. \n- They didn't even notice that the same two notes are played on a violin on repeat through the entire game and triggered each time you open a menu and it will do your head in after a few hours.\n- There's actually no way to avoid an irritating sound effect if you want to know where you're going. Either you open the map and get the bloody violins or you use survival instincts and are subject to the much longer, way more unnecessary and annoying noise they have inexplicably changed that the old subtler, shorter one too. \n- Stealth is broken\n- FOV too narrow & camera distance too close for enjoying on pc with no way to change it.\n- When you shoot enemies there's no blood, no bullet effect even, they barely even react. It's so amateur.\n- You have to wear a stupid costume for half of the game.\n- You'll spend 20 mins 'navigating' through a section that might as well be a corridor you walk through because you really are just following the navigation cues only to be met with yet another cutscene and then more of the same.\n\nIf you've played through the first two games like I did prior to this one, don't get excited. I'm not even able to force myself to play through this one it's like trying to eat the raw ingredients to a pizza.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's a lot I like about this. The gameplay is really fun and it's visually stunning. \r\n\r\nSo it such a shame that the game itself feel near unplayable at the times. From literally gamebreaking glitches to the fact that there seems to be more cutscenes than actual gameplay, it seems that Shadow of the Tomb Raider is practically begging you to stop playing. \r\n\r\nI remember really liking this franchise back in the day, including this one, so maybe a lot of my issues stem from the fact that this is a replay for me. But come on, it is frankly ridiculous how little actual gameplay there is in the first 5 HOURS. And you can't even really skip the cutscenes because the game uses them for loading, which it does a lot. So you're forced to watch the story and when you finally get to play the game has you slowly squezing through tight openings (I guess to once again try to hide the insane amount of loading that this seems to require). And the story is doing nothing for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hate this game. Constantly annoyed at all times while playing it. OoOOh yeah lets force slow walking for 20 minutes more while we listen to unskippable boring white-savior dialog (Lara isn't a tomb raider, you see, she's the hero who saves the natives against the evil military people). The game loop is literally 70% quick time events, 10% shooting, and 20% listening to nonsense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh my God I hate this game, I played the demo & it was pretty decent so I bought it based off what I saw in the demo, after that like 30 - 40 mins if gameplay the game nose dives into aimless ubisoft get thrown into a world for hours and hope you find something of value to make the effort feel worth it in extremely clunky, awkard, gameplay, i genuinely feel kinda lied too by how much better that first tiny part of the game was before it became ubisoft slop. Idk if it even is made by ubusoft, but my God does it feel like it & I'm not going to search it up because how sad I found it being reminding this game us still in my library.\n\nThe cinematography is genuinely incredible for the first part of this game & the cutscenes, but the gameplay driving itself off a cliff like it did just makes me sad thinking of what this game could have been.\n\n1.5/10\n\nThe score would be higher if they didn't try baiting with a demo that doesn't remotely resemble the full product, but even if I based the game off of just the game itself, not thinking of how its marketed its a 3.5/10 absolute max",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crashed after 11 hours of playtime (the playtime was great). Not saying it will happen to you, but steam wont help me out with it. Other than that; the time i did play was great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game the how the fuck does a franchise climbing mechanics get wrose after the first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many bugs, got locked from progression and nothing helps\r\nthis reboots have been such a dissapointment",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very boring compared to Tomb Raider (2013) and Rise of the Tomb Raider",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "voice and subtitle is not working",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woke slop. Uglified Lara to please the \"modern audience\". Franchise ruined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to enjoy this game. I absolutely loved the first two tomb raider games, but this one just did not live up to the bar they set. The story pacing seems odd as well: the game started slow but finished fast. The parkour, which is by all means a very central part of the game, is so much more sensitive than in either of the two previous games. If you're even a small amount off of where it wants you to be, too bad, you're dead! \nAll in all, this was a frustrating game to play that did not make up for that frustration with good plot or satisfying mechanics.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "did not like this tomb raider games as much as the other two, yes the game was very pretty and the tombs where fantastic but the story was rushed, once you reach the hidden city the plot becomes so bad the second half of the game was so bland",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Within about 2 hours of actual gameplay I've already encountered two massive bugs one of which literally prevents you from continuing the game.\n\nIt started with an audio dialogue bug where the characters decided to stop speaking (which also meant subtitles no longer functioned) the fix to this was to download the German voices so that I could swap to that (which fixes the problem) and then swap back to English.\n\nThe 2nd bug breaks an entire MAIN STORY puzzle from functioning making it impossible to progress if Vsync is turned off in the settings.\n\nThe fact that such egregious bugs are still present within this game 7 years after release is an absolute embarrassment and disgrace.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Sure, the game looks nice but the story is horrendous and completely loses the plot towards the end. I also dislike the same formula the other Tomb Raider games and this game uses where Lara gets and/or finds a story related artifact of importance and the enemy faction sweeps in to seize the day and Lara gets captured or left for dead. Boring and uninteresting.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game is beautiful, but mostly jump puzzles and quick time events.  The sign of weak game devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They took what was great bout other titles and threw it away. Lara went from being a strong female protagonist, and is now an emotional idiot. The gameplay is still decent, but not up to scratch with the other 2 titles.\n\nIdiotic design choices include: \n> losing all your weapons for some late game missions so you can play a bad version of hitman.\n> Interrupting cutscenes that take over control and gives you bad position and tactical choices.\n> Many NPCs/creatures that run into melee range but giving you a the worst combat skills with limited dodge/counter and kill animation during which you can still be hurt and killed.\n> Horrendous PC control mapping that cannot be changed for many normal actions.\n> Slow animations that cannot be interupted, jumping off ledges the wrong way because it was too slow to notice the multiple button presses, crawling though gaps and walking forward to continue playing - stuff that means nothing but wasting time holding down a button.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was really fun until you get to a certain tomb after how many hours with a stupid bug that stops all progression in its tracks.  The \"fix\" is apparently limiting frame rate and upping your ray tracing and graphic settings to max but the pillars will not move no matter how many settings I change.  I wish developers would stop releasing broken crap into the world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is the perfect example of how to take one of the best looking games ever made and make it as frustrating as possible to play. Every few minutes, my gameplay is interrupted by long, boring, and un-skippable cutscenes. After the cutscenes are finally finished, the game forces slow walking sections, which completely kill the pace. Jonah is the most boring and out of place character I've ever seen in a game, and he adds even more frustration every time he appears. It didn't feel like I was playing Tomb Raider, it felt like I was playing \"cutscenes and forced walking\" raider, with a story that somehow revolves around Jonah for reasons I will never understand. I had to mute my PC every time a cutscene starts because I'm absolutely fed up with hearing \"Jonah\" EVERY TWO MINUTES.\r\n\r\nWhat makes this even more disappointing is that the graphics, setting and atmosphere absolutely impressive. Wasted potential by extremely lazy design choices.\r\n\r\nWhen the game FINALLY gives me control to play, progressing requires constant guessing and blind jumping to random ledges with barely any visual guidance, making the chance of falling and instantly dying extremely high. I died well over a hundred times because of unclear design, not actual challenge. Instant-Deaths Raider? Anyways, the story is bland and unengaging. The moment you feel immersed, get ready to be interrupted by yet another cutscene/forced-walking.\r\n\r\nI will NEVER play this game ever again even if I get paid for it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played the first 2 games. 1st was an amazing experience, felt like I was literally in a interactive movie with an RPG-esque type of looting and exploring adventure. The 2nd one has better characters and story but pretty forgettable, and the adventure was not as good as the first one so it was a meh game. But this one oh boy. Instead of Lara raiding a tomb for the sense of adventure or sort of a character completion phase, Lara's objective is to take what an evil organization wants first to stop \"world domination\". And the adventure, bruh this doesnt feel like an adventure, I just had the same experience I do taking exams I never studied for and that is such a major turn off for games. I am stupid I admit but the first 2 games puzzles was such a walk-past mandatory part of the game that makes me feel smart. This one makes me scratch my head expecting me to know the actual real life lore about the aztecs for hours looking at tutorials on YouTube. Shit game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The hardest part of the game is realising there is no soul anymore, everything has an easy and a hard solution and there is no incentive for the hard solution, no extra reward, no secrets.... the level design is... sad, most of the times, with the occasional treasure placed in a hidden spot in a nice way that rewards exploration. It's really sad what is sacrificed for the sake of selling to anyone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s a rather mediocre work with a dull storyline — disasters follow Lara wherever she goes. There’s also a side quest with a serious bug: if you don’t follow the official sequence, you won’t be able to find the NPC for the final dialogue, which affects 100% completion. On the positive side, the game offers plenty of tomb exploration and decent graphics, but I’d still recommend you play Rise of the Tomb Raider or Uncharted 4 instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whatever i try to play the game the audio of the character gone",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WAAAAAYYYY to little combat/action. Too bored to finish the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Relentless amounts of 5 + minute unskippable cut-scenes, absolutely boring puzzles. 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated with crafting and collectables, lots of pointless backtracking spoiling the urgency of the main quest. QTE hell and constant cutscenes where you don't even know if you have control of Lara or not. You're more likely to die a horrible death by falling than by getting killed by an enemy. At least there are plenty of tombs, but this is the most tedious game in this trilogy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The name shadow of the tomb raider is a good name for this game because it is a shadow compared to its predecessors. \n\nIn terms of graphics, mechanics, openw world, etc. This game feels like it would have been the first try for the devs for the mechanics of the new series, before the previous two games, but somehow this game is the last in the series. What an utter disappointment compared to the two previous games. The mechanics are sloppy, the maps are tedious, and the combat is boring or does not allow actual tactics. The \"open world\" is constricting, linear but doesn't want to be, and gives me no real reason to return other than my autistic rage. It also feels like there is barely a game here compared to the content and story of the two previous games. If you enjoyed the two previous games, just save yourself time, money and heartbreak and pretend the previous game was the last in the series. Laura would be embarrassed for you. Also, how does a game not just have a crouch button and decide for me when I am stealthy?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ 04 / 10 }---\r\nShadow of the Tomb Raider shines with beautiful hidden villages that blend into the environment so well. The visuals really are the highlight of this game. The story is simple but decent, and the characters had potential.\r\n\r\nBut the game lost me through pure frustration.\r\nA puzzle with a globe soft-locked itself: once I rotated it to the limit, it wouldn’t move back at all. I had to google the solution, plug in a controller, switch inputs, and only then it worked. Later, interaction prompts randomly disappeared. That was the moment I stopped having fun.\r\nStealth barely matters because running in with a gun is easier and more effective.\r\nParkour should feel fluid, but the game blocks off obvious ledges, leading to constant deaths from jumps that look correct but aren’t allowed. I even recorded a few of them, it really is funny and sad at the same time.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n[b]☑ Beautiful[/b]\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n[b]☑ It's just gameplay[/b]\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n[b]☑ Good[/b]\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Story }---\r\n☐ It'll replace your life\r\n☐ Lovely\r\n☐ Good\r\n[b]☑ Average[/b]\r\n☐ Some lore\r\n☐ No Story\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n[b]☑ ARK: Survival Evolved[/b]\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n[b]☑ Easy[/b]\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n[b]☑ Nothing to grind[/b]\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really rather boring. Puzzles are bland or obnoxious, story is meh.. who cares - gunplay is good, but exploration is highly repetitive and there's far too much crap to collect. It's like they looked at Assassins Creed and said MORE!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly, I found Shadow to be a step down from the rest of the trilogy. I’d say I still enjoyed it overall, but it has a lot of flaws that took away from my enjoyment. First, the good - the gameplay is the same old, with a few tweaks to stealth, and it’s still a lot of fun. Graphically, I honestly think this is one of the best-looking games I’ve ever seen, and the story is, I think, the best of the trilogy. Unfortunately, it feels like the game is sabotaging itself in a lot of ways. First, you spend much of the story in a location called the Hidden City; while this is an awesome setting in the story, it also restricts you to only using a small number of outfits and one weapon. Again, this isn’t bad in service of the story, but you spend so long here that it rapidly gets wearing. And, even after the story, the restrictions remain in place. But frankly, I wouldn’t bother with what comes after the story because there are way, way too many collectables, many of which feel phoned in. All of the notes that were previously voiced by various characters are now read by Lara, there’s a new collectible called murals… which are just notes again, and a number of the artefacts recycle models and descriptions. The DLCs are also weak - all of them are the same get problem from character, do extra linear challenge tomb, get mediocre reward. It’s a damn shame, because again, the story here is great, but the rest of the game just can’t quite carry it. If it’s on sale and you liked the previous games, go for it, but I’m sad to say that this game really disappointed me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stale gameplay and far too many collectibles combined with poor writing and uninteresting characters constitute why I can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like reading the Odyssey, but Odysseus takes a pause every time to grind loot. The narrative is too predictable and the gameplay is too repetitive, too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repetative level, less action more of jumping and hanging.. most of the time it gave feeliing of uncharted. but uncharted was more fun to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some areas are way too dark, Lara just refuses to turn on her flashlight, and I can’t turn it on myself either. It’s really stupid. I’ve set the brightness to the highest level and still can’t see sh*t.\ntoo many bugs.\nThe weapon upgrade screen is kinda boring, it’s a downgrade from the last two games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has all the *components* of the first two in the trilogy but none of the execution, pacing or  composition of them, and that's what mattered the most.\n\nThis game irritates me to play after the first two:\n\n- The studio changed to Motreal and this game was lead largely by a different team than the first game.\n- They shifted direction from action more towards puzzles and exploration with longer cutscenes.\n- There are issues with performance including low fps and hitching that are still present, despite not looking much better than ROTTR.\n- The hitching that happens when you move the camera quickly basically ruins the third-person shooter aspect of the game.\n- There are audio issues.\n- Pacing feels completely different and *wrong* compared to the first two. \n- They didn't even notice that the same two notes are played on a violin on repeat through the entire game and triggered each time you open a menu and it will do your head in after a few hours.\n- There's actually no way to avoid an irritating sound effect if you want to know where you're going. Either you open the map and get the bloody violins or you use survival instincts and are subject to the much longer, way more unnecessary and annoying noise they have inexplicably changed that the old subtler, shorter one too. \n- Stealth is broken\n- FOV too narrow & camera distance too close for enjoying on pc with no way to change it.\n- When you shoot enemies there's no blood, no bullet effect even, they barely even react. It's so amateur.\n- You have to wear a stupid costume for half of the game.\n- You'll spend 20 mins 'navigating' through a section that might as well be a corridor you walk through because you really are just following the navigation cues only to be met with yet another cutscene and then more of the same.\n\nIf you've played through the first two games like I did prior to this one, don't get excited. I'm not even able to force myself to play through this one it's like trying to eat the raw ingredients to a pizza.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's a lot I like about this. The gameplay is really fun and it's visually stunning. \r\n\r\nSo it such a shame that the game itself feel near unplayable at the times. From literally gamebreaking glitches to the fact that there seems to be more cutscenes than actual gameplay, it seems that Shadow of the Tomb Raider is practically begging you to stop playing. \r\n\r\nI remember really liking this franchise back in the day, including this one, so maybe a lot of my issues stem from the fact that this is a replay for me. But come on, it is frankly ridiculous how little actual gameplay there is in the first 5 HOURS. And you can't even really skip the cutscenes because the game uses them for loading, which it does a lot. So you're forced to watch the story and when you finally get to play the game has you slowly squezing through tight openings (I guess to once again try to hide the insane amount of loading that this seems to require). And the story is doing nothing for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hate this game. Constantly annoyed at all times while playing it. OoOOh yeah lets force slow walking for 20 minutes more while we listen to unskippable boring white-savior dialog (Lara isn't a tomb raider, you see, she's the hero who saves the natives against the evil military people). The game loop is literally 70% quick time events, 10% shooting, and 20% listening to nonsense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh my God I hate this game, I played the demo & it was pretty decent so I bought it based off what I saw in the demo, after that like 30 - 40 mins if gameplay the game nose dives into aimless ubisoft get thrown into a world for hours and hope you find something of value to make the effort feel worth it in extremely clunky, awkard, gameplay, i genuinely feel kinda lied too by how much better that first tiny part of the game was before it became ubisoft slop. Idk if it even is made by ubusoft, but my God does it feel like it & I'm not going to search it up because how sad I found it being reminding this game us still in my library.\n\nThe cinematography is genuinely incredible for the first part of this game & the cutscenes, but the gameplay driving itself off a cliff like it did just makes me sad thinking of what this game could have been.\n\n1.5/10\n\nThe score would be higher if they didn't try baiting with a demo that doesn't remotely resemble the full product, but even if I based the game off of just the game itself, not thinking of how its marketed its a 3.5/10 absolute max",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crashed after 11 hours of playtime (the playtime was great). Not saying it will happen to you, but steam wont help me out with it. Other than that; the time i did play was great.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game the how the fuck does a franchise climbing mechanics get wrose after the first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many bugs, got locked from progression and nothing helps\r\nthis reboots have been such a dissapointment",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very boring compared to Tomb Raider (2013) and Rise of the Tomb Raider",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "voice and subtitle is not working",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woke slop. Uglified Lara to please the \"modern audience\". Franchise ruined.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to enjoy this game. I absolutely loved the first two tomb raider games, but this one just did not live up to the bar they set. The story pacing seems odd as well: the game started slow but finished fast. The parkour, which is by all means a very central part of the game, is so much more sensitive than in either of the two previous games. If you're even a small amount off of where it wants you to be, too bad, you're dead! \nAll in all, this was a frustrating game to play that did not make up for that frustration with good plot or satisfying mechanics.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "did not like this tomb raider games as much as the other two, yes the game was very pretty and the tombs where fantastic but the story was rushed, once you reach the hidden city the plot becomes so bad the second half of the game was so bland",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Within about 2 hours of actual gameplay I've already encountered two massive bugs one of which literally prevents you from continuing the game.\n\nIt started with an audio dialogue bug where the characters decided to stop speaking (which also meant subtitles no longer functioned) the fix to this was to download the German voices so that I could swap to that (which fixes the problem) and then swap back to English.\n\nThe 2nd bug breaks an entire MAIN STORY puzzle from functioning making it impossible to progress if Vsync is turned off in the settings.\n\nThe fact that such egregious bugs are still present within this game 7 years after release is an absolute embarrassment and disgrace.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Sure, the game looks nice but the story is horrendous and completely loses the plot towards the end. I also dislike the same formula the other Tomb Raider games and this game uses where Lara gets and/or finds a story related artifact of importance and the enemy faction sweeps in to seize the day and Lara gets captured or left for dead. Boring and uninteresting.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game is beautiful, but mostly jump puzzles and quick time events.  The sign of weak game devs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They took what was great bout other titles and threw it away. Lara went from being a strong female protagonist, and is now an emotional idiot. The gameplay is still decent, but not up to scratch with the other 2 titles.\n\nIdiotic design choices include: \n> losing all your weapons for some late game missions so you can play a bad version of hitman.\n> Interrupting cutscenes that take over control and gives you bad position and tactical choices.\n> Many NPCs/creatures that run into melee range but giving you a the worst combat skills with limited dodge/counter and kill animation during which you can still be hurt and killed.\n> Horrendous PC control mapping that cannot be changed for many normal actions.\n> Slow animations that cannot be interupted, jumping off ledges the wrong way because it was too slow to notice the multiple button presses, crawling though gaps and walking forward to continue playing - stuff that means nothing but wasting time holding down a button.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was really fun until you get to a certain tomb after how many hours with a stupid bug that stops all progression in its tracks.  The \"fix\" is apparently limiting frame rate and upping your ray tracing and graphic settings to max but the pillars will not move no matter how many settings I change.  I wish developers would stop releasing broken crap into the world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is the perfect example of how to take one of the best looking games ever made and make it as frustrating as possible to play. Every few minutes, my gameplay is interrupted by long, boring, and un-skippable cutscenes. After the cutscenes are finally finished, the game forces slow walking sections, which completely kill the pace. Jonah is the most boring and out of place character I've ever seen in a game, and he adds even more frustration every time he appears. It didn't feel like I was playing Tomb Raider, it felt like I was playing \"cutscenes and forced walking\" raider, with a story that somehow revolves around Jonah for reasons I will never understand. I had to mute my PC every time a cutscene starts because I'm absolutely fed up with hearing \"Jonah\" EVERY TWO MINUTES.\r\n\r\nWhat makes this even more disappointing is that the graphics, setting and atmosphere absolutely impressive. Wasted potential by extremely lazy design choices.\r\n\r\nWhen the game FINALLY gives me control to play, progressing requires constant guessing and blind jumping to random ledges with barely any visual guidance, making the chance of falling and instantly dying extremely high. I died well over a hundred times because of unclear design, not actual challenge. Instant-Deaths Raider? Anyways, the story is bland and unengaging. The moment you feel immersed, get ready to be interrupted by yet another cutscene/forced-walking.\r\n\r\nI will NEVER play this game ever again even if I get paid for it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played the first 2 games. 1st was an amazing experience, felt like I was literally in a interactive movie with an RPG-esque type of looting and exploring adventure. The 2nd one has better characters and story but pretty forgettable, and the adventure was not as good as the first one so it was a meh game. But this one oh boy. Instead of Lara raiding a tomb for the sense of adventure or sort of a character completion phase, Lara's objective is to take what an evil organization wants first to stop \"world domination\". And the adventure, bruh this doesnt feel like an adventure, I just had the same experience I do taking exams I never studied for and that is such a major turn off for games. I am stupid I admit but the first 2 games puzzles was such a walk-past mandatory part of the game that makes me feel smart. This one makes me scratch my head expecting me to know the actual real life lore about the aztecs for hours looking at tutorials on YouTube. Shit game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The hardest part of the game is realising there is no soul anymore, everything has an easy and a hard solution and there is no incentive for the hard solution, no extra reward, no secrets.... the level design is... sad, most of the times, with the occasional treasure placed in a hidden spot in a nice way that rewards exploration. It's really sad what is sacrificed for the sake of selling to anyone",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}