{
  "positive": [
    {
      "review": "One of the most immersive and creative games I've played in a while. \n\nYou begin to explore because it's fun. \nYou keep exploring because you need to understand. \nAnd when you finally do, you'll wish you could forget it all to experience it again.",
      "voted_up": true,
      "votes_helpful": 176
    },
    {
      "review": "If I had the possibility I would recommend this experience even harder than Steam will let me. just buy it, it and play it completely blind. Trust.",
      "voted_up": true,
      "votes_helpful": 56
    },
    {
      "review": "[h2] in short: if you still harbour a sense of pure curiosity about anything at all, i highly recommend you play Outer Wilds. [/h2]\n\nconsider, for a moment, the wave function. you may not be familiar with the specifics, but you encounter it every day. it was proven by Fourier, what was Fourier after? he just thought this was kind of cool, it was like this is interesting. he was not at all thinking about practical applications. a world of electric communications which uses this routinely in order to. look at your Phone, how does this thing know to convert weird stuff, which is in the air? into sounds. answer: wave function. but Fourier wasn't thinking of those, and the application came later, almost every field of mass.\n\nto Fourier, it was simply.....cool. he was guided by a sense of aesthetics; he found it interesting. the application came later.\n\nin fact, many times in history someone's gone off into the mathematical wilderness. motivated purely by curiosity and kind of guided by a sense of aesthetics. and then they have created a whole bunch of new mathematics which has nice and interesting but doesn't really do anything useful. but then, say a hundred years later, someone will be working on some problem at the cutting. edge of physics or computer science and they will discover that this old theory in pure maths is exactly what they need to solve their real world problems.....which is awesome\n\nthere is a profound distinction here: [b] when you find solutions for math it is called \"pure math\" when math finds solutions for you it is called \"applied math\" and this transition from the \"useless\" beauty of discovery to the vital necessity of understanding, is the very soul of Outer Wilds. [/b]\n\nin this game, there are no experience points, no weapon upgrades, and no arbitrary skill trees. there is only knowledge.\n\nwhen you find yourself in a situation where that theoretical knowledge becomes your only lifeline. you realise that the obscure rule you learned ten hours ago just because it was \"cool\" is actually the key to solving a grand mystery. you transition into applied math. you use the rules you discovered to save yourself, to traverse the impossible, and to witness the truth of the cosmos.\n\nit even touches upon the profound strangeness of Gödel's incompleteness theorems, the idea that mathematics is a system made up by humans, yet it somehow explains the physical universe so perfectly. Outer Wilds presents a universe that feels hand-crafted and \"made up,\" yet it operates on such a consistent, rigorous internal logic that unraveling it feels like a spiritual experience.\n\nagain, if you still harbour a sense of pure curiosity about anything at all, i highly recommend you play Outer Wilds!!\n\n::) ·:)",
      "voted_up": true,
      "votes_helpful": 68
    },
    {
      "review": "This game can become your whole universe!\nI tried to find the right words to capture it, but language fails, just as it failed with anybody who tried to explain it without breaking its fragile mystery.\n\nit is really a hard game to sell, how you can tell someone in this chaos of content to just get on outer wilds and trust the journey and all?(as someone said: \"Best game that you can't talk about\")\nbut it is true tho! if you already seen something or know the answer you miss the experience!\nIT'S ONE TIME ONLY.(Arguable)\n\nThe best I can describe or put my feeling into word is, this game feels like an entire solar system (duh) into art, a place where horror, beauty and absurdity orbit each other in perfect harmony!\n\nyou dreamed of being a astronaut? explore the mysteries behind the stars? this is your place!\n\nouter wilds isn't just a game, it's a magnum opus of wonder.\n(Remember, not a singular translator in universe could help you to understand and experience what's really there)",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Outer Wilds is honestly one of the best gaming experiences I’ve ever had. At its core, it’s basically a physics‑based puzzle/mystery game, but the way it’s designed makes it feel completely unique. Every planet, every mechanic and every discovery is crafted with such care that exploring feels fun, interesting and often profound.\n\nWhat really sets it apart is how the mystery unfolds. You’re not just solving puzzles, you’re piecing together a story about the universe itself, and by the end, it feels like you’ve gone on a journey that’s bigger than just a game. It’s rare to finish a game and genuinely feel like you experienced something special, but Outer Wilds delivers exactly that.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "A masterpiece that you can only really experience once so try to avoid any spoilers!\n\nWord of warning, this is definitely a game that you should only really play when you don't have any big deadlines or other activities you want to do, so that you can just take it slow and enjoy it at your own pace. If you're banging your head in an area and then get that feeling that you're starting to try rush through, you will probably get frustrated and hate the game so best to take a break - most annoying is when it turns out you actually had the right idea... but it happens!\n\nI want to say more but it's probably already a spoiler so I'll just say enjoy flying through space, keeping an eye on rumours, and just visiting whatever you feel like visiting - you only live once right? \n\n10/10",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I think about this game almost daily since I've finished it. \nThe sense of yearning wonder it was able to gave me is something I'll be searching for a long time.\n\nIt started scratching that itch for exploration and turned into one of the most emotional experiences I've had in my life. The way storytelling, music, and mechanics blend together is perfect, the atmosphere incredible.\nThe themes and the way they're delivered left me breathless.\n\nThe pain I feel knowing I won't ever play this for the first time again.\nSuch a gem.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The fear of not existing drives us, but for the Nomai, the fear of not understanding was greater than the fear of ceasing to exist.\n10/10",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Incredible game. It's all about discovery and the thrills that come with it. It's the gold standard example of quality over quantity when it comes to any game centred on space exploration and mystery solving. No resource gathering tedium, no in-game currency headaches, no gear-grinding. No cutscenes. It's all about taking your time to seek, find, learn and revel in every tiny step towards your goals. On top of this, there's authentic challenge to be found in platforming, navigation and logical problem solving. Do yourself a favour and dive in without knowing what awaits, avoid game guides as much as 'human'-ly possible and let the game breathe. You'll be met with that rare sense of reward that few games in the AAA-era of content gluttony try to fool you into feeling. 10/10 classic for all ages.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best physics-based puzzle games out there. Truly a masterpiece.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Wow!!! Ez a játék hihetetlen. Év játéka is volt, és eddig nagyon király. Szép grafika, és van mit felfedezni. Már több bolygón is jártam, de úgy látom ebben a játékban még nagyon sok van. Bár a felfedezés kissé nehézkes, de tetszik, hogy tét nélkül járhatjuk be a naprendszerünket. Fontosak a beszélgetések, így szinte kötelező magyar fordításban játszani. A hangulat fantasztikus, érdekes, izgalmas, és nem kevésszer ijesztő is. Nem is spoilereznék a sztoriról, de annyit elárulok, hogy meg fogunk lepődni sokszor. Egyelőre én magam sem tudom, hogy mit is csináljak, mert minden bolygót be kéne járni és mindent meg kéne nézni. A koncepció vicces és érdekes, bár még nem tudom mi fog belőle kisülni. Elmenteni nem lehet a játékot csak a halálunkkal, mert egy időhurokban vagyunk. Persze ezt teljesen én magam sem értem. A sztorit te magad írod és a végleges cél igzából kissé homályos. \r\n\r\n\r\nEbben a játékban kizárólag magunkra vagyunk utalva!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Je ne pensais pas qu’un jeu pouvait me faire ressentir ça.\n\nOuter Wilds n’est pas juste un jeu d’exploration spatiale —\nc’est une expérience sur la curiosité, le temps et notre place dans l’univers.\nChaque planète est un mystère vivant, chaque découverte une petite claque,\net chaque boucle te rapproche d’une vérité aussi simple que vertigineuse.\n\nC’est un jeu qui ne te prend jamais par la main,\nmais qui te récompense à chaque fois que tu réfléchis, observes et oses t’émerveiller.\nSa musique, son ambiance et son écriture t’accompagnent jusqu’à une fin…\nque tu n’oublieras probablement jamais.\n\nSi tu aimes les jeux qui te font réfléchir, explorer, comprendre, ressentir,\nalors Outer Wilds est une expérience à vivre au moins une fois dans ta vie.\nTu ne regarderas plus jamais les étoiles de la même façon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best experiences i had in gaming 10/10\n\ni would recommend to go in blind without any prior knowledge about this game \n\nAll the clues are so meticulously crafted and so satisfying to find , even trying and failing is so fun , It will require a fair bit of thinking, it will sometimes test your speed, reflexes and precision but the payoff is very  satisfing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I died hundreds of times, was confused for hours and hated about 40% of the experience. However, there aren't many games that make me feel what this ending does, a soft warm feeling in my chest with a lot of goosebumps that I haven't felt in years, a mix of melancholy, happiness, and nostalgia. \r\n\r\nAll that effort and frustration is well worth it. 11/10. Masterpiece, you may feel it's overrated at first, but keep pushing, it's well worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most amazing game I have ever played. You can only experience it once. Every bit is absolute cinema. \n\nChanged my perspective on life and made me feel so much in so little time. I will never emotionally recover from this experience, and Im okay with that.\n\nTrust me bro, play Outer Wilds.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "genuinely changed my life and my outlook on the world. go play this blind. that's all you need to know. 25 dollars for an unforgettable lifechanging game is well worth it. please please please play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful. A fantastic narrative gameplay experience. \n\nThis will be the first game I've completed in some time, maybe ever, where there was no combat, empire building or some form of antagonist that one must struggle valiantly against. As you can imagine then, I was at first hesitant to play. You're telling me that this game has a mystery? Immersive and challenging space flight? A supernova and quantum physics? I'm not so sure if thats for a medieval peasant like me....\n\nWell I was wrong. The Outer Wilds is worth every hour of the 27 that I put in. It sparked in me that drive, that constant thinking of \"Man, I cant wait to get back on to play more and do X or to try out Y.\" I even found myself pondering its story over diner with my wife, exictedly updating her whenever I had a break through or finally understood a (admittedly not that hard) puzzle. The sense of discovery this game provides is unparalleled. \n\nAll that to say that this game is a masterwork and I highly recommend it to anyone. \n\n[b]PS. I also highly recommend that as much as possible you avoid looking things up. I am normally one to look up quests so that I don't miss out on any story but in this game in particular I believe you should try as hard as you can to go without. I promise this will make those discovery moments all the more enjoyable .[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow! Just wow!\r\n\r\nIncredible game. Very unassuming at first, but oh boy does it open up!\r\n\r\nOne of the best adventure games ever.\r\n\r\nIf you get stuck, look at the map at the ship. It will tell you where you still need to go. It helped me a lot when I was unsure where to explore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is as good as everyone says it is. The mechanics, story, sound, and art are superb. The puzzles/challenges can be hard, but solving them is mega rewarding. All of the tools at your character's disposal are unique, useful, and fun to use. The scenery is all beautiful and the music is god tier! If you're an emotional person be prepared to feel all of those too. There are moments where you'll just want to stop whatever puzzle you're attempting, to watch and listen to whats going on. There will also be moments where you're MLG 360 no scope sweating trying to get something done. Both are equally valid things to do in.\n\nThis game's community has my respect too. They encourage others to play the game with no spoilers, think through the challenges, and be creative. They will also just hand out the guide without judgment too. Its a breath a fresh freaking air that there is a community behind this game that isn't brainrotted and about to implode on itself...  I will add that the few times I did use the internet for how to do a puzzle, I instantly connected dots from things I learned in-game and regretted looking it up... Your success in this game depends on you being curious and creative.\n\nI picked up Outer Wilds becuase I needed a break from the shooty-mcshooty magic spells attack blow you up kill you respawn fast etc. games. After just 23 hours of play time I can say this is now one of my favorite games. Its deserves the glaze it gets and I think if you happen to read all of this from some random goober on the internet, then you should buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can be a difficult game at first. What do I mean by difficult? Well, it doesn't hold your hand past the tutorial. It gives you one 'rumor' to chase down which can lead to a linear progression. But there's no map markers save for \"This is the planet\" and this is a landmass on the planet. It also is a lot of reading and little to no voice acting contributing to my own personal difficulty of being patient enough to read and fully comprehend and appreciate it.\n\nThe beauty of the game is discovering things on your own. There is a mystery afoot that I want to unravel on my own time, but it's been a delight and terror as I encounter space phenomena that is both awe-inspiring and fatal. I would've loved voice acting for the NPC's, written logs, and such. But it is not necessary to enjoy the wonders of the galaxy. If you have the heart of an explorer, this game is for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Outer Wilds is literally the best game I've ever played, the ending is probably the best part but if you want to experience this properly, do NOT and I mean by ANY means do NOT google anything or watch anything about this game before you have completed it.\n\nthis is best experienced going in completely blind and discovering it for yourself as its the type of game that doesn't need gear or levels to progress, you need knowledge. and you cannot go back after completing it, because if you already know how to get to the ending you could complete the game in about 15-20 minutes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Outer Wilds is the best single-player game I've ever played.  It's worth your time and twenty five dollars.   Top-tier sci-fi, hands down.\n\nI could explain why, but that would spoil too much.  \n\nIt has one flaw, which is that the game takes a few hours to 'click' for most people, including myself.  But once that happens, you'll be completely invested.  \n\nAfter you finish it you'll want to talk about it with everybody.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished the game...and wow...I am at a loss for words and there is no doubt that this is one of the best games I have ever played.\r\nIf you are reading this and are considering playing it, the only thing I can say is the less you know going into it, the better.\r\n10/10 an emotional, curiosity piquing masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I rarely leave reviews, but this game was so impressive...\nI liked the atmosphere, exploration, music, lore, quests.\nSome were quite hard! Took me a while to crack them, but I only had to continue exploration, because all the answers are in the game and in the lore writings.\nIf you like exploration and a really good story - go on, this is a game for you, no more words, I don't wanna spoil the story :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Words cannot describe this game. I have sat down, and played it all in 2 days. If you decide to pick it up, will experience one of, if not the best games of all time. Just do not look up anything. Take your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]I have 400 hours in this no repeatability value game \n\n[b]I might be autistic but that theory is still a work in progres\n\n\n\n\nand yes the rumors are true the game is spoiler sensitive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is for someone who wants to explore and wants to learn truth (history)\nThis game might look slow and boring but when u know what to do its mostly exciting",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Just play the game, please. Almost every details you would learn about it outside the game itself, would be a massive spoiler. As the one who played the game, I completely join others who says this is the game you can experience once.\r\n\r\nThis is the game which made me smile and cry at the same time in the end... Such a beautiful storytelling... Just play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not done with the game but this might dethrone Bloodborne as my favorite game of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's really rare to find a game that you can not only, only play once, but also be completely fine with that fact at the end.\nThe ending will most definitely hit some harder then others, but it's still absolutely worth experiencing if you have little to no prior knowledge about this game.\nIn this game, knowledge is key, and if you already have that knowledge, then there's no point in playing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Outer Wilds is beautiful in so many ways but also very difficult to complete without getting a few hints from the internet. The concept of the storyline, the physics, the music and all the tiny details the devs included in this game made it very memorable.  I had a lot of fun and frustration playing it. Overall, definitely recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 — The first game I’d replay if I ever got amnesia.\nThe first time I played, I honestly didn’t catch the hook everyone was talking about. But after some time, I decided to give it another shot and that turned out to be one of the best experiences in my life. Like many other reviews say, go in completely blind. I believe you will not regret it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "absolute awesome story and music. always worthy a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Finally got to finish it after parcouring around spoilers for years. \n\nJust finished the game and I am lost for words. A once in a lifetime experience. The kind that makes you sad because you will never get to experience it again for the first time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, I had problems with headaches to play this game.\n\nEven so, I was consumed by curiosity of this game mistery. I completed the game and, it was beautiful.\n\nThe soundtrack hits different after finishing the game, and I really loved this experiencie.\n\nThanks",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A beautiful and terrifying exploration/puzzle game with a bittersweet ending. Truly one of those \"hidden gem indy games\".\n\nYou have to figure out why what is happening to you, is happening to you. You get endless tries but every try takes 20 minutes. A unique take backed by fantastic music and visuals. \n\nI especially love the twin planets; what an original idea!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I plan to not interact with anything from this game for 5 years, get the dlc and start a fresh save. I can't wait to rediscover everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's basically Myst in space, set to Groundhog Day style exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game provides an excellent experience of discovery problem solving and puzzles. It is a serine and beautifully well realized gameworld loaded with interesting things to explore and threads to pull. I enjoyed a fantastic 15 hrs with this game. there were certainly a few sections that required some waiting around or an obtuse solution, but also left bread crumbs to how to find the solution in the game world. Do yourself a favor if you play this game stay off the internet go in with a fresh perspective and enjoy the way the game communicates with you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally the best game I've ever played/will play. I am going to buy for a friend because everyone should experience it atleast once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have yet to play this game, play this game. Even reading this review is spoiling too much. \r\n\r\nAnd if you have beat the game, you already understand that there is nothing I can say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just finished my first playthrough of Outer Wilds earlier today, and I've got to say, that was an incredible experience! The music and atmosphere in this game are just amazing. Sure some parts were frustrating, or some I got stuck on, but what games don't have a few sections like that?\n\nOverall, I would highly recommend playing this if you haven't already. I would recommend going into this blind for the best experience, and try not to look anything up unless you get really stuck. The best advice I can give is just to keep exploring and translate every piece of text you find; that's the best way to progress. Most importantly, make sure to have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A favorite. Went in totally blind and enjoyed the exploration and the unfolding mystery. Controlling myself through space and learning to release my attachment to up/down/left/right was a fun challenge. There were some very frustrating moments trying to thread the needle or bashing my head incorrectly against some obstacle, but well worth it overall. The end hit me in the feels and had me in tears.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely stunning game that can only truly be experienced in a single unspoilered playthrough. You can only experience this once, don't ruin it for yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stop researching. It's best to go in blind, but it is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played. If you stick with it and get invested in the story, it will provide you with one of the most fulfilling and unique experiences available in gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game.The story and music are beautiful and the gameplay is outstanding. The puzzles are well tought out, as well as the games gimick. 10/10 wish I could experince it all again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SCARYYY but I love so much fun. Big exploration/puzzle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much I feel like it changed my life. It is my favorite game ever in all of my life. 10/10 game just please don't spoil yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outer Wilds is the \"trust me bro\" game.\n\nI can't say much about this experience without giving it away. I will say, it has provided an interesting and worthwhile experience. \n\nTrust me bro.\n\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a magical experience. A compelling story, a lovingly crafted universe, an immersive soundtrack. There are just so many aspects of this game to love. Easily the best game I have ever experienced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. The puzzles are amazing. The lore is touching and makes you think. I wish more games were like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Tons of fun. No guides for maximum enjoyment. Just explore and you will find your way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is game brings back that feeling of wonder and curiosity many used to have in childhood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cannot stress enough that this is *the* most important game ever.\nif there is any game you play with the rest of your life, let it be this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Difficult to get a grasp of what you're supposed to do at the beginning, but man does it lead to a really satisfying ending. And the journey along the way is what truly counts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I went into it unbelievably hyped and not really digging it, but genuinely give it a good shot. It's beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I picked up this game, I didn't set my expectations too high. I'd heard it was good, but the no-spoilers mindset that is an ABSOLUTE NESSECTIY for this games' intended experience made it hard to know what to expect. Having completed the main game, I will say now that this may be one of, if not the, best games ever made. The experience of playing this drums up more emotion and sheer wonder than any game I've played since... 2015 Minecraft? It gave me a more profound experience than, I really believe, any other piece of media I have ever consumed. I was bawling my eyes out at a couple points. This game has touched me in a way few others ever have and I physically cannot recommend it higher. For the love of god, BUY THIS GAME! \n\n(Haven't started the DLC yet, but I'm very excited.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i cried and peed my pants a little bit, this is the only game I consistently recommend to absolutely everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great story telling and an overall amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outer Wilds is not my favourite game.\r\n\r\nHowever, I do genuinely believe it is the best game ever made and a truly breathtaking experience if you have the presence of mind for it. I have bought it multiple times just to share the joy of exploration with friends, each one joining the waitlist to watch the next person in line play.\r\n\r\nAlso the first game to ever compel me to 100% it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was one of the best games I've ever played. It starts a bit like a rocket launch, a little slow at first, but catches speed quite quickly. The thrills of exploration were worth the price of admission, the ending was just phenomenal. I cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool space game\n\ntotally wont give u a reason to go to therapy because of an existential crisis\nwould recommend 10/10!!\n\nlove roasting some marshmallows :p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard to put into words, difficult to describe at the risk of trespassing into what the player HAS to experience for themselves. \r\n\r\nA slow, rocky, confusing start. That's the only thing holding this game back, and it's a tragedy that it snags so many who play the game for the first time. But the more you look at any reviews, you'll notice that they all seem to be broken up into two groups: \"Couldn't get myself to keep playing until I reached the end game because xyz\" and \"I beat the game, this is the best thing to ever grace mortal hands\". But that's about all the criticisms I have for the game. Now that that's out of the way..\r\n\r\nThis game should have revolutionized storytelling as we know it. It's an experience that will NEVER leave you, and it can change your entire perception of video games as an art form by the end. The sheer meaning and purpose you feel putting things into place near the end of the game is indescribable, and the gameplay complements it all with how deliciously small you feel in the face of it all. The number one most important element in a game like this (in most games, I feel) is immersion, and so few games execute it so well that there's a moment where I'm left me frozen in awe, much less SEVERAL moments. No other media has managed to express the sheer significance of a big moment as much as this one.\r\n\r\nUnironically life-changing, and well deserving of the cult of weirdos like myself talking about this game like it's the single most significant creation the human race has ever developed. It'll get you high on wonder, and leave you desperate to feel it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Incredible achievement in Science Fiction... Once it clicks for you [/h1] \r\n\r\nOuter Worlds is one of the greatest works of Science Fiction ever made, in that it integrates the scientific method into its narrative and gameplay. You essentially have to approach it like a scientist, slowly piecing together what is going on and what you have to do through a process of experimentation, theorizing and testing. Unfortunately, this means that the early hours of the game will involve an awful lot of directionless bumbling, unexplained deaths, weird occurrences and disconnected lore snippets that mean nothing to you yet. This part of the game can easily filter you (it almost filtered me), but once you push past that wall, the game is an astonishing, terrifying and at times quite moving series of fascinating discoveries. What initially comes across as a nifty, but slightly pointless simulated Le Petit Prince style mini-solar system (the cosmic equivalent of your undiagnosed uncle's meticulous model trainset), reveals itself to be an intricately-designed puzzle box meditation on the nature of curiosity, discovery and the scientific method.\r\n\r\nOuter Wilds is essentially a Metroidvania, in which knowledge replaces powerups. This is why everyone keeps so obnoxiously shtum about the game, not because the game is so transcendentally incredible (although it can be), but because knowledge is your main reward and your main measure of progress. With the right knowledge, you can beat the game in about 10 minutes. Looking up solutions would be like activating NoClip and zooming to the credits in an action game, it defeats the purpose of the game.\r\n\r\nBear with the game, trust in its quality and vision and MAKE SURE TO TAKE THE LORE ENTRIES SERIOUSLY (there is no pointless flavour text here. The notes you find DO matter). Once the pieces start to connect you will be hooked. Just be ready to put up with some truly terrifying stuff at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This took a while to get the hang of and wrap my head around, and ultimately was one of the best games I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Remember those who came before and carry their curiosity with you on your journey.[/i]\n-\nA genre-defining, generational masterpiece that changed me fundamentally as a person and as a consumer of video games as both a medium of entertainment and art.\nYour own knowledge is your only progression. Once you know, you know.\nIf you're reading this review you've already seen too much and I implore you to stop what you're doing and purchase the game. No, begging you. Please. Stop what you're doing and play Outer Wilds.\n\nEnter blind and you will experience a game unlike any other I have played.\nA true, once-in-a-lifetime, experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be perfectly honest, if you'd have told me two and half years ago that this game would lead to me and the love of my life getting together, I would've laughed in your face. If you'd have told it would ease my existential anxiety like nothing else, I'd have laughed harder. \r\nThat said, my partner and I played this game together again for our 2nd anniversary and here I am, sat with him again, sobbing and gushing about how this is the best game I've ever played. We laughed at my clumsy control of the physics; giggled at the funny and heartwarming interactions with npc's so friendly that they felt alive; and cried and cried and cried as we figured out what we found. \r\nWhoever you are, whatever games you've played before, I absolutely promise you this game is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The ultimate philosophical experience.\n\nOuter Wilds will most likely change the way you think. I have never played a game that stuck with me for so long. It's one of those games you finish and then wish you could forget it all. Mark my words - in a hundred years, when people start appreciating video games for what they are, a solid piece of media that can tell a story better than movies or books, this game will be taught in philosophy classes. That's what it is - a philosophical work of art.\n\nThe DLC only expands on this. It is its own story, but not really. It explains a great deal, but it also has its own charm.\n\nI can't recommend it enough. Please buy it. At first, you might feel lost, but it's worth every penny. The understanding comes with repetition and time. Once you understand the game, you will then consider it a masterpiece.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the kind of game that makes you glad you stopped and smelled the pine trees along the way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe that I didn't write a review yet. \nThis is by far my most favourite game, along with Darkwood and Pathologic. \n\nI will not write anything about the game, as there is nothing to say. \n\nThe biggest flaw of the game is that I will never be able to play it again for the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few games I will ever leave a review for. Anything you've heard about this game from your friends is probably true. Finishing this game is hands down one of the best experiences I've ever had in my life. Pick it up, play it, and stay curious on your journey!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is not a game, it is an experience. Emotional, powerful experience about curiosity, connection, discovery. It makes you feel, care, discover. You truly feel yourself as an explorer. Absolutely unforgettable and unique",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please play this game without spoiling yourself!\r\nif you are stuck, come back later. \r\nif its the last thing you see and can think of, look it up, but please do as much as you can blind. \r\nthis is the best game i have EVER played.\r\nthank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me cry, an achievement that no movie, series or game could do to me. i am no longer afraid to die. play this game and come out as a different person.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i ever played\r\n i loved the scary side in it it can get your hands shaking I totally recommend it.\r\nif i can refund it i wouldn't because it deserve every single dollar. \r\n\r\nit's just (ABSOLUTE CINEMA)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A life-changing experience that I would literally recommend to anyone. This is a beautiful work of art that deserves your time and money and the only thing stopping me from going into specifics about why I love this game so much is that it would spoil you from finding out yourself. Every time the soundtrack for this game sneaks it's way into my youtube autoplay, I think of everything I experienced while playing and cry.\nFor your own sake, buy and play this game, regardless of whether it is on sale or not. If you can't right now, pirate it and then buy it once you can afford to. That is genuinely just how good this game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not sure what else I can say that hasn't been said, but I've been playing videos games for over 25 years and I've never had an experience quite like this. As someone who has somewhat lost their passion for modern games and hasn't found a new \"favorite\" game for over a decade, this truly may be my favorite video game I've ever played.\n\nJump in blind, don't look up anything. Just get in there and have at it. You won't regret it. And when it's all said and done, you'll wish you could wipe your memory and do it all over again. An absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played, I'm a huge fan of puzzle games and figuring things out in games and this is a prime example of how to make a game that teaches you how to play by guiding you and letting you figure things out, without forcing you or holding your hand too much after the game really gets going, you learn through the entire experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a compelling mystery game with great Orbital physics model providing both technical and mental challenges,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good puzzle with a lot of discovery. I like how game mechanics are set by the plot itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first really open world game i love it but u need to read and voice actors would be more immersive but still 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "During my junior year of university, i remember getting very confused when the professor starts talking about the definition of \"sublime\", and to be quite frankly, i still don't think i can capture into words what that state, or feeling, or the whole idea means.\r\nNot that i need to though, because i now perfectly understand the sublime -- the experience Outer Wilds gave me.\r\n\r\nBeginning to end, ever since I first press the button to wake up and see Giant's Deep with its curious blue sparks, the first lift off, the first ruins i visit, and the first strand in a web of mystery i uncover, i can always feel that there's something bigger than all of this, hidden behind a curtain in a color i couldn't quite tell, and that i couldn't quite reach.\r\n\r\nBut it's not the first kiss shared that made one realize the person in front of them is the one, nor is the moment of revelation when all the mysteries are solved, and the curtain has been pulled away is not the moment when i know this game is special -- it's the time when i, right after my first launch, stood on the historic site of the first Hearthians' landing on Atterlock, watching the sunrise, with a blue streak of a comet rushing pass it. That's when it clicked in, that this is the game i will forever cherish. \r\n\r\nNo game has ever brought me such joy, and such sorrow that it overwhelms my every senses. Making me feel like a bumbling idiot, before it gently, with a smile, nudge me to the final piece of the clue i needed to solve it on my own and make me feel like a genius to show me something so truly heartbreaking all over again.\r\n\r\nEver since i started playing video games as a child, I have experience several games crowned the \"best game of all time,\" some of those by my own judgement, but if asked, i struggle to come up with a stable answer, and hesitate to give a single, straight answer.\r\n\r\nI now no longer hesitate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You like puzzles?\nYou like exploration?\nYou like time loops?\nWell, I've got a game for you...\nSeriously tho, this might be one of the best games I've ever played, Yes, it has no replay value, yes, there is no coop, and no, none of it matters.\nThis game is a masterpiece, through and through, Gameplay,story,music,level design, everything, and I mean EVERYTHING is GREAT at worst\nThat being said, this game isn't for everyone, there is no progression, no items to unlock, you only progress by learning and understanding the world around you, so if you like being guided, maybe this isn't the right pick...\nHowever, everyone, and I mean everyone, should give it a shot.\nThis is a love letter to videogames, for all to be enjoyed, go for it :)\n(and for the love of god don't spoil anything to anyone)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Said hi to Riebeck. Fell into a black hole. Ate some marshmallows. Flew into the sun and died. \n        - IGN 10/10 best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The reason why people say \"Go in blind\" is because the developers took the idea of show don't tell to heart, similar on how hl2 shows but doesn't tell much.\nAlmost everything you can see in the game tells a story, there is some dialog (about 2 hours of it) but that is only a fraction of the time it will take to complete the game.\nOne of the main reason people love this game is because it NEVER holds your hand, there is no tutorial. Once you figure out how to solve a puzzle you realize how blind you were on how to look for the clues that tell you how to solve the puzzle.\n Not looking up tutorials is vital because once you figure it out it pays off, because the game doesn't directly tell you how to solve the puzzle, only hints from the entire world, and it really feels like YOU solved it.\nAs someone who did look up one or two, I deeply regret it, because the game is a one time experience and everything you need to finish the game and story is there.\n\nDon't really know what else to say other than best experience i ever had in a game, HIGHLY recommend if you like puzzle/story games that don't hold your hand or lock you in a cutscene.\n\nIf you are prone to motion sickness, this is not the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the most immersive gaming experience I've experienced, wish I could start over!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "singlehandedly one of the most immersive, inspiring and truly enjoyable gaming experiences ive ever had. there is no feeling like playing this game for the first time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just go with it. It's an amazing exploration and discovery game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like being a xenoarcheologist explorer, unraveling the mysteries of the ancient Nomai culture across the solar system. Like Indiana Jones, except you die a million times.\r\nI will admit that my first play-through I got pretty anxious near the end at a certain part and had to take a break to remind myself it was a video game and it would be okay if i failed. and then I failed. and it was, in fact, ok.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very immersive and atmospheric. Outstanding game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The less you know the better. infinity/10 \nSuch a unique and good non linear story line, great for taking in the sheer beauty and exploration of the game at your own pace. \nI wish i could play it for the first time again, I would erase my memory for this peak fiction\nThank you my friend of recommending peak to me with NO spoilers xd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An exploration game with a huge mystery done right. One of the games that coined the term Metroidbrainia. The more you understand about the game, the further you can explore.\n\nI wish I could forget the game from my memory just so I can play it again, because it was so impactfull that I don't think I will forget with time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has to be the best game i've ever played. The worst part about this game is that you can only play it once - things may start off confusing and be a little tricky to navigate, but in the end, you'll understand. 20/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best puzzle games of all time. Try and solve things without any guides, but totally understandable if you can't figure it out after trying a bunch of things. Sometimes just come back to a puzzle after trying something else. Oh also a wonderful story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A once in a lifetime experience. Beautiful, littered with smart development decisions and a beautiufil plot. Do yourself a favor and just play it without looking into it any further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outer Wilds is a cosmic archaeology mystery where every discovery feels earned. You decipher the traces of ancient civilizations, piece together their hopes and failures, and slowly realize how they shaped the universe you’re trapped in. There’s no combat, no upgrades, no checklist pushing you forward, only curiosity, observation, and the quiet pull of understanding. It won’t be for everyone, but for those it reaches, it becomes something singular. It’s one of the greatest gaming experiences ever made, and it will stay with me for the rest of my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although my game time on this title is not very long I would like to preface this by saying that I played my ass off to try and figure out what was going on. This game isn't just a game. It's art. From the very beginning it luls you into a state of peace and calm. There is no grand goal when it all begins. You are not the chosen one. You don't carry a magical weapon to slay the BBEG. You're just a regular guy going on a regular journey.\n\nOnly by playing the game do you learn what is needed. About the Nomai. About your people. Also, about yourself. This game isn't about saving the galaxy. It's about letting it go.\n\n11/10 would erase my memories about this game so I could enjoy it over and over again until our own sun goes supernova.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me develop an irrational hatred for deep-sea wildlife and a wish to forget about its solar system so I can fall in love with it all over again.\nAs many others said, avoid guides as much as possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games I've ever played, its a bit slow to start but once it clicks you're in for the most unique experience gaming can offer.\n\nyou truly do have to go in blind with this game. the progression keys are purely knowledge based. its not about the incredible story, its that the spoilers will completely shatter the beautiful sense of progression the game builds.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I know I'm in the minority here but this is a great game that I straight up cannot bring myself to finish. I want to like this game, but the things that annoy me just keep stacking up to the point where I can't enjoy it anymore even though the day I got it I played for 8 hours straight in pure awe of how amazing it was.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I honestly don't want to give this game a thumbs down, I liked it, but I also don't understand that \"we don't talk about Outer Wilds\" part. I think we absolutely need to talk about it so future players know what to expect and don't feel like there is something wrong with them if the game \"didn't click\" or was simply good but not life-changing as majority of the fan-base seems to say. \n\nFirst of all the rating bias. It's overwhelmingly positive but I believe part of the reason for that is that the game itself is really niche, plus players who didn't like it either couldn't be bothered to write a review or didn't want to leave a negative review because this game is so hard to hate as it's beautifully crafted, has great soundtrack, engaging story, not coming from greedy AAA clowns but an indie dev etc. Because it's a niche game even a slightest criticism is often met with hostility, people will tell you to get back to tiktok/fortnite, that you have ADHD and so on. \n\nThe game itself is mostly fun, but can also be quite tedious at times, some questlines seem a bit shallow, pretentious or simply boring (I personally didn't enjoy the Quantum Moon and the Ash Twin project). There is a lot of back and forth, the time loop concept may feel annoying at times - I personally dislike deadlines when I am exploring something cool.\n\nOverall, try this game but don't think there is something wrong with you if you find it to be just \"alright\". Don't believe the hype.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The controls ruined it for me almost instantly. Not looking forward wonking about with them on a time limit no less.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game requires A LOT of patience. Patience I ran out of, while exploring some of the planets, since no one told me beforehand how difficult, or rather, how inaccessible it was going to be. \nIf you are slow or clunky or have any accessibility issues regarding time or/and input, don't buy.\nFlight controls, both in ship and on foot, at first seem easy and straight forward, but are problematic due to how irresponsive they are. Don't ask me how many times I fell into the [spoiler]Brittle Hollow's black hole[/spoiler] because I miscalculated a jump or made bad inputs.\nThe time loop only gives you 22 minutes before it resets everything and sends you back to camp. Many times it's not enough to see everything in a single location, especially if you need more time to think and sometimes you have to wait for a time sensitive event. Every time the loop happens, it feels like lost progress. The only accessibility options in-game regarding time are pausing it whenever you have to read something; there's no option to extend time between loops for those who might need it (luckily there's a mod available for that).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Massively overhyped. I do not understand why people love this game so much. I wanted to like it too. The game could have sold me on it's method of clue distribution if it could just have spent some time connecting me to the universe in a way that made me care about what was going on. As it stands the game is unbearable to me. I tried so hard to connect with it. Reading all the ancient text is boring. The living NPCs somehow are just as much of static unchanging exposition dispensers as the ancient texts are. The puzzle of the universe was put together in a very interesting way and the spectacle of it all is impressive, but with it being strung together with hours of restarts and reading ancient instant messenger texts I just don't understand how so many people resonated so strongly with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I think the game would've worked just fine as a regular adventure with save points and a time limit to complete the whole thing. The death loop just made it longer than it needed to be. Rather than get invested in the story, I was invested in seeing what kind of gimmick each planet had to offer... The atmosphere is really nice but the mechanisms are not. You spend a lot of time going back to the exact same place you were before because you ran out of time or got killed. A checkpoint to start in orbit of the planet would've at least been something. Rushed it to the end after getting fed up. I don't know how I can recommend the game. I would've liked it better as a regular adventure.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've played this for an hour and was barely able to find the launch tower, then immediately crashed, jumped out, and died. Everything is so confusing and hard to control",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think I've ever felt my time was utterly wasted as much as when playing this game. To begin with, cutting all of the BS out, I want to note that anything that involves a \"time loop\" of any sort is using it to pad length. Yes, it adds a layer of urgency to the game (a la Majora's Mask)... but not like it needs it much anyway considering many planets are actively collapsing as you try to traverse them, making everything time limited.. If this was a stock standard exploration game, it probably would be nowhere near as time consuming.\n\nThat definitely succeeds. I stopped playing Blue Prince because of the RNG being decidedly annoying, and it consuming too much of my time in a similar manner (this was well into the \"postgame puzzles, after finding the room). In this, I have now had many runs where I simply died or ran out of time and absolutely nothing to accomplished. I don't have the time for this shit. It's not my thing. I'm beginning to think that there's some Stockholm Syndrome cult that just has to convince everyone that this is somehow the best game ever. \n\nI don't know how long this takes to \"take off\", but I haven't encountered it yet. All of the information I've found has been incredibly mundane and I just found myself impatiently going, \"Okay, and?\" I just don't give a shit. \n[spoiler]So they tried to blow up the Sun, okay cool idgaf. Feldspar is stuck in the bramble where my scout landed. Cool, again doesn't really solve anything. Now I'm sitting here waiting in an alien ship in a gravity cannon, waiting for the moon to come by. I don't know if the poem on the trees meant something for the way I have to look at it, but I'm bored to tears trying to get it in front of me (while browsing my phone frankly). Maybe there's some other info mission, but I don't feel like finding it[/spoiler]. Maybe I could continue if I looked up some \"hint guide\" or something, but I think my current playtime is the only hint I need that this just is not for me. I might come back to it on and off when I feel like I hate my existence enough to continue pissing myself off with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "There is little structure for progression and the time-gate component of the game will punish you for too much exploration and discovery. In the mid-game you will repeatedly grind content looking for context clues about anything you can do next. Cool idea but mediocre execution.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I do not understand the hype at all. I was SO bored I got burnt out on gaming for the day. I could not find a single reason to care about anybody or anything in the game. I had zero direction, zero mystery, not a single hook or desire whatsoever. Paired with meaningless, trite, and droll repetitive dialogue you would expect from a children's edutainment offering and movement and controls that are clunky, sluggish, and insufferable made my brief time with this game a bewildering shock of detestable apathy. I think I hate this game... I bought this a while back and I finally got around to playing it. I wish I had played it right away. So I could have asked for a refund.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to enjoy this game, but every time I was starting to have fun and get excited the arbitrary time loop mechanics would say \"NO\" and reset my fun and excitement back to zero. I'm sure the time loop is important to the story, but it's an awful game play mechanic. It's basically like dying, but it happens regularly even if you're playing perfectly. This quickly eroded my desire to continue despite my strong interest in the actual good parts of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Another purchase based of people recommendations. It's a nice game with good story but the movement and spacecraft steering is horrible. And having a time reset in the middle of progress seemed fine but with the steering and flight in the game it's just bad. Forcing you to do the steering all over again to get back there just to pick up one more thing..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dime-store existentialism which seeks to soothe the player, rather than reflect reality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got Outer Wilds under the impression it was a puzzle game like Myst or Quern. If it is, it's shit.\nIt's actually an exploration game, and it's still shit. This game entirely on your curiosity to move it forward, but 99% of the time your curiosity will not be rewarded. Its signaling and sense of progression is complete ass. And the first 10 minutes of every loop will be wasted traveling instead of problem solving. I've never seen an exploration game go so far out of its way to discourage its players from exploring it.\nI wasn't enjoying the game, so I did what any rational person would do - ask for help. That turned out to be a big fucking mistake.\n\nThe Outer Wilds Steam community is the perfect example of how a shit fandom can ruin what could have been a great experience. For a moment I thought they were different, but they're a bunch of toxic elitist gatekeepers like every other gaming community out there. These people are too emotionally fragile to handle even the smallest criticism for their game. They're even worse about advice than the Dark Souls community who just say \"skill issue bro\" to everything you say. Literally, this one guy deleted his \"advice\" and accused me of being impatient, ungrateful, and having \"behavior problems\" because I didn't immediately reply to their comment.\n\nImagine being such a bunch of self-entitled and bigoted jackasses you drive people away from the game you like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really don't understand the hype on this one. Super boring.\nEvery comment section of game recommendation videos is just full of people dick riding this game and I have no idea why.\nIt's worse than watching paint dry, it's like watching paint in the fuckin tin.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, I finally tried Outer Wilds. Honestly, it really didn't work for me. Literally all my friends loved it, and one said it's their favorite game ever, but yeah, it just didn't click.\n\n- The visuals felt super cheap, everything looked like it came from an asset store. Also, I'm personally really not a fan of the \"camping in space\" aesthetic (timberpunk, lumberpunk) in general. I also really don't like the \"tiny planet\" style. It was a turnoff for me when playing Mario Galaxy and reading The Little Prince. Outer Wilds was no different. \n\n- I found the writing to be terrible. I could barely discern any personality between the characters, it assumed I already knew things about the story while I didn't, none of the dialogue options felt relatable, and there weren't even character sounds. I don't mind the lack of voice acting, but they could have added at least something like Undertale where each character has its own sound. I understand the idea was to make dialogue confusing at the beginning and to get me to slowly understand it more and more as I progressed through the game, but this only works if I am intrigued enough to want to understand what the characters were saying. I don't think any of them were saying anything interesting or hook-y, so it just felt bad. Also, the game was a serious offender of the \"As You Know, Bob\" trope where characters explain things to each other they should already know. This is most striking in the first dialogue with the alien at the campire. He goes like \"you just graduated and yet you're already going on your first solo space mission!\" This is the kind of writing that screams \"the devs don't know how to write, dialogue is worthless in this game, the devs don't care.\"\n\n- The dialogues were badly placed. The game gave me no reason to speak to the aliens of the camp, and it was a very high concentration of disjointed conversation in a small area. It felt daunting and uninteresting.\n\n- It's a small thing, but the smoke trail on the moon's campfire didn't follow the laws of gravity like how the balls taught me. Since the game's main mechanic is observing these kinds of details, it felt like a massive oversight. Compounded with the fact that this oversight was in the first 5 minutes of gameplay, this felt very amateurish, incompetent, and lazy. It's like if Doom's guns didn't work in the first room because of a bug. It'd be fine since they'd work in all other rooms and there's no enemy in the first room, but God, that's such a blatant and embarassing blemish.\n\n- The characters were ugly aliens, which was a total turn-off for me. I prefer games with no/barely visible characters like Subnautica, or games with actually attractive characters (especially furries :3).\n\n- The spaceship controls felt like garbage. I understand it's something I had to learn, but it was such a big ask right at the beginning of the game before I had even been sold on it. Technical reflex-based inputs are not the kind of challenge I find appealing, at least not right away.\n\n- I wasn't into the whole meta thing about remembering previous playthroughs, or the game remembering my current playthrough. I get what the devs were trying to do, kind of like a pure knowledge-based roguelike. Normally, I adore knowledge-based games, but I wasn't a big fan of the meta-framing and how short the playthroughs were, it pulled me out of the immersion.\n\n- I felt the game had no hook, nothing from the hub or the spaceship made me want to stay in the game. That's such a basic task, even Daggerfall from 1996 just dropped the player in a massive randomly generated world with barely any guidance while still having a hook with the quests from Septim in the FMV.\n\n- I hated how the game basically showed me all the mechanics upfront in the hub instead of letting me discover them naturally as I explore. This felt like a gallery or a tech demo instead of a game, which is not what I wanted.\n\n- None of the mechanics showed in the museum/gallery made me want to play with them. I don't know if it's because of how they were presented or because they're just not interesting to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a thumbs down for me.\r\n\r\nI think my expectations may have been set too high based on the \"hype\" from other people that claim this to be \"an unforgettable experience\", but honestly the game is mediocre at best.\r\n\r\nPoor graphics, clunky controls, and very little satisfaction along the way. \r\n\r\nSome might say, \"but you only played 105 minutes, so you didn't give it a chance\" but the reality is that I suffered through 105 minutes giving the game a chance to pull me into what was supposedly and EPIC story, and it fell flat. Actually, it was worse than flat. It was a crater IMO.  \r\n\r\nThis title is in the bottom 10% of games I've ever played. I realize there are others who love the game, and I say more power to them, but for me it didn't deliver a story, or experience. \r\n\r\nOuter Wilds was simply a slow moving and frustrating exercise in trying to make myself love a low end game, and 2 hours in realizing that this game doesn't live up to the hype.\r\n\r\nCiao!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS NOT FOR PEOPLE LIKE ME. HOW WANT SAVING OPTION. I SPEND 2HR. THEN I DIED AND WHAT I FOUND THERE IS NO SAVING.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "says it requires an controller. \nim on pc. i use kbm.\ndevelopers should apply job at mcdonalds to flip burgers if they can't make working kbm controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand the hype about this game. It's complete nonsense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know people love this game and have very strong feelings about it.  I just did not vibe with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i really really really hate controller only games\nat least the put the warning the start menu",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was impossible to learn how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I didn't like this game at all. Sorry Outer Wilds fans :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the few games I wish I could return but can't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its to good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lowkey buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game unfortunately made me SO motion sick within 10 minutes! I'm posting this because I read so many reviews and no one mentioned this, but if you are prone to motion sickness definitely something to consider (it's the space travel/gravity changes that make the camera work nauseating to me). I'm sad because it seems like such a cool game!",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I’d been sitting on this game for a long time, but finally decided to give it a try during the sale. I went in completely blind, as recommended.\n\nUnfortunately, the “genius/emotional masterpiece” that so many people rave about didn’t land for me. It’s certainly a unique experience with some strong qualities, but after the first couple of hours, it just fell flat.\n\nThe Good:\n\n- I love that there are no waypoints, quest markers, or hand-holding objectives. You’re simply given a ship and told to explore in whatever order you want.\n\n- The game pushes you to seek out the story on your own. Aside from the occasional nudge from NPC explorers, it’s up to you to find connections between ruins, scrolls, planets, and crash sites. This sense of discovery and piecing together scattered fragments into something meaningful was the highlight of the game for me.\n\n- The ship’s computer acts as a kind of evidence board for logging discoveries and how they might connect, but ultimately, the interpretation up to you. Every time I pieced things together and proved my hunch right, it was deeply satisfying.\n\n- The music is excellent. I wish there was more.\n\nThe Bad:\n\n- The universe isn’t all that big. While the handful of planets are cleverly layered, revisiting the same ones over and over in hopes of finding something I missed quickly became tedious.\n\n- My biggest issue: the time loop. Learning that I only had 22 minutes per “life” before the universe reset completely killed the experience for me. Finally discovered a hidden entrance or new scrolls? Too bad, time’s up, back to the start. Found the way into an underground city? Oops, didn’t get there fast enough, it’s filled with sand now. Better luck next loop. There’s a wealth of interesting lore here, but no time to absorb it. The constant ticking clock turns what could’ve been a thoughtful, patient exploration game into a speedrunning experience.\n\n- Yes, shortcuts and back entrances make re-exploration faster, but that doesn’t solve the core problem: the loop undermines the game’s best strengths: critical thinking, problem solving, and slow burn discovery.\n\n\nIf this game didn’t have a time limit, it would be an easy thumbs up from me. As it stands, the pressure of the loop ruined my enjoyment, and I just couldn’t settle into the thoughtful, exploratory pace the game seemed to promise. I'll probably still play it here and there, but every time I boot it up, I feel less interested.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Not my cup of tea. I don't tend to enjoy these kinds of games to begin with, so I had my doubts before I even bought it. But, a few reviews saying \"even if it's not your genre of choice, just try it anyways\" managed to convince me after all the glowing reviews I've seen. To those people, or anyone giving that advice for that matter, you are giving terrible advice.\nTo anyone that doesn't tend to enjoy these types of games, this one is not somehow magically different. While the story may be wonderful, that's irrelevant when I derive no joy from the actual gameplay itself.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I know I'm in the minority here but this is a great game that I straight up cannot bring myself to finish. I want to like this game, but the things that annoy me just keep stacking up to the point where I can't enjoy it anymore even though the day I got it I played for 8 hours straight in pure awe of how amazing it was.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I honestly don't want to give this game a thumbs down, I liked it, but I also don't understand that \"we don't talk about Outer Wilds\" part. I think we absolutely need to talk about it so future players know what to expect and don't feel like there is something wrong with them if the game \"didn't click\" or was simply good but not life-changing as majority of the fan-base seems to say. \n\nFirst of all the rating bias. It's overwhelmingly positive but I believe part of the reason for that is that the game itself is really niche, plus players who didn't like it either couldn't be bothered to write a review or didn't want to leave a negative review because this game is so hard to hate as it's beautifully crafted, has great soundtrack, engaging story, not coming from greedy AAA clowns but an indie dev etc. Because it's a niche game even a slightest criticism is often met with hostility, people will tell you to get back to tiktok/fortnite, that you have ADHD and so on. \n\nThe game itself is mostly fun, but can also be quite tedious at times, some questlines seem a bit shallow, pretentious or simply boring (I personally didn't enjoy the Quantum Moon and the Ash Twin project). There is a lot of back and forth, the time loop concept may feel annoying at times - I personally dislike deadlines when I am exploring something cool.\n\nOverall, try this game but don't think there is something wrong with you if you find it to be just \"alright\". Don't believe the hype.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "TLDR: The game is good, but it's not for everyone!\r\n\r\nFirst of all the game is very well made. It's interesting, it keeps you going like a good book finding tid-bits of info along the way that end up making it both addicting and frustrating. Here's the reason why I don't recommend it, because honestly I feel that a \"recommend\" tag wouldn't let people know, like myself, what they're really getting into. The game is already overly popular and hopefully this could reach those that I'm targeting. Let me just say that if you are dealing with mental health and/or depression this game might trigger those feelings. I'm halfway into the \"story\" and I can already see a mile away what is there to come and honestly I'm in no way, shape, or form to be dealing with that. When I was younger, yeah I could with sad stories but now that I deal w/ depression and have had lost loved family members it hits different. I play video games 1, because I enjoy the hobby and 2. for escapism. I saw all the reviews on this game and most if not all were very cautious about revealing spoilers which lead me to believe this was a nice little game with a chill story. Don't get me wrong, it is. I've heard it's bittersweet, but like I said, I'm in no position to put myself into a bittersweet position out of my own volition and specially in a video game. I've played games like this before and they were okay, like SOMA, but back then my mind could handle the psychological trauma. Not anymore!! Haha. Anyway, I know this review will most likely get lost in the void of Steam much like the void of space, but if it at least helps that one person know truly about this game or help them in their research of what this game is like then I'll be happy. I know for sure I should have made more of an effort to know about the game instead of letting the hype get the better of me. Other than that the game is neat, but you really have to have a lot of patience. I mean A LOT. To be honest I'd rather just read a book instead of dealing with scavenging for small texts that reveal the story and dealing with physics and timed events. Again, it's not for everyone.\r\n\r\nMy rating...\r\n\r\nBurt Marshmallow / 10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, I knew going into this game that I was going to have a rough time of it. I vehemently dislike time limits in games (especially strict ones), and I'm not really a fan of roguelike/lites. Imagine my surprise when it was neither of these factors that killed my enjoyment of the game (although they didn't help), but the absolutely miserable movement. If you've ever played Lunar Lander, that's basically the entire game: fiddly momentum based mechanics with gravity involved. \n\nIt took me very little time to realize that I had no desire to deal with the movement for however many hours this game was going to take, as it was going to be a constant anchor weighing down any enjoyment I might get from the good parts of the game. Add to that the 20 minute time limit and constant resets, I decided I'd rather not waste my time further. I'm just going to watch a let's play and have a much better time that way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I finally finished Outer Wilds after giving up on it twice. The journey delivered some of the most memorable moments I have experienced in a game, but also some of the most frustrating ones, to the point that I stopped playing on two separate attempts. Be warned that this is an exceptionally difficult game to get into.\n\nThere is a lot to appreciate. The entire solar system runs like a precise clock and makes the world feel alive. Gravity can feel unpredictable at first, but once it makes sense, movement becomes genuinely fun. The environmental storytelling is outstanding, and [spoiler] the gradual reveal of what happened to the Nomai and why you are trapped in the time loop [/spoiler] is handled with great care. Solving some of the game’s puzzle pieces feels incredible, especially when everything finally connects in your mind. Moments like [spoiler] the journey toward the Quantum Moon [/spoiler], [spoiler] the revelations inside the Ash Twin Project [/spoiler], and [spoiler] the discoveries on the Interloper [/spoiler] easily rank among the most memorable in gaming. It is very clear why the game has earned such a passionate following.\n\nThe first major issue is the transition from the early game to the mid game. Many players, including myself, follow the ship log as a guide for progression. After finishing the Attlerock, the log naturally pushes you toward Brittle Hollow and its observatory near the south pole. On paper this seems straightforward, but in practice it demands a good understanding of how the planet behaves. By this point the time loop starts to feel like genuine pressure, and the collapsing terrain of Brittle Hollow adds another layer of stress. You feel compelled to rush, even though the game never explicitly requires it.\n\nFinally reaching the south pole left me exhausted, and the story still felt like a confusing collection of fragments. The narrative is delivered entirely through scattered environmental clues, and every player uncovers them in a different order. Early on you simply do not have enough context to connect anything, so the logs feel disconnected and incomplete rather than intriguing. The mystery never comes together, and instead grows into a pile of half understood ideas. That combination of confusion and the effort required just to make basic progress is what caused me to stop playing during my first attempt.\n\nIf you manage to push past this phase, the mid game is wonderful. Here you will encounter some of the best designed puzzles in the entire experience. The game presents its rules clearly and lets you assemble the bigger picture through true discovery. Unfortunately, not every puzzle is this well crafted. The worst example by far is [spoiler] Dark Bramble [/spoiler]. The only real advice the game gives is to stay silent around [spoiler] anglerfish [/spoiler]. Everything else is left entirely for you to deduce. The internal logic of this world is extremely unclear, and progress often requires repetitive trial and error. I only learned that the [spoiler] node structure was fixed across iterations [/spoiler] after giving up and searching online for help. Even with that knowledge, exploring [spoiler] Dark Bramble [/spoiler] remained tedious, confusing, and unrewarding.\n\nI also have mixed feelings about the ending. [spoiler] It does not provide clear answers and instead presents even more questions [/spoiler]. It left me both disappointed and strangely inspired, a combination that is hard to describe.\n\nOuter Wilds is a rare kind of game. It is ambitious, imaginative, and capable of delivering extraordinary moments that stay with you. It is also demanding and often unforgiving, especially during its early hours and in a few late game locations. If you have the patience to endure its most frustrating moments, the rewards are remarkable. If not, you may find yourself giving up more than once, just as I did.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely tried very hard to like this game. It’s praised and adored by many, with some even calling it life-altering. And honestly, I think it’s wonderful that so many people found something special in it — even though I have no idea why.\n\nTo be fair, the music and sound design are fantastic. No complaints there. The overall setting is intriguing at first, thoughtfully crafted, and full of charm.\nBut everything else — at least for me — felt completely off.\n\nThe game plays like a clumsy running simulator with imprecise controls. The story and characters felt lifeless or distant, and the time-loop structure created a lot of unnecessary repetition that quickly became frustrating. Instead of settling into a cozy, chill adventure, I ended up feeling stressed, annoyed, and constantly on edge. For me personally, this ranks among the top 10 worst gaming experiences I’ve ever had.\n\nSo consider this a small warning: even though the game has an Overwhelmingly Positive rating, it might absolutely not be for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The controls ruined it for me almost instantly. Not looking forward wonking about with them on a time limit no less.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game requires A LOT of patience. Patience I ran out of, while exploring some of the planets, since no one told me beforehand how difficult, or rather, how inaccessible it was going to be. \nIf you are slow or clunky or have any accessibility issues regarding time or/and input, don't buy.\nFlight controls, both in ship and on foot, at first seem easy and straight forward, but are problematic due to how irresponsive they are. Don't ask me how many times I fell into the [spoiler]Brittle Hollow's black hole[/spoiler] because I miscalculated a jump or made bad inputs.\nThe time loop only gives you 22 minutes before it resets everything and sends you back to camp. Many times it's not enough to see everything in a single location, especially if you need more time to think and sometimes you have to wait for a time sensitive event. Every time the loop happens, it feels like lost progress. The only accessibility options in-game regarding time are pausing it whenever you have to read something; there's no option to extend time between loops for those who might need it (luckily there's a mod available for that).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Massively overhyped. I do not understand why people love this game so much. I wanted to like it too. The game could have sold me on it's method of clue distribution if it could just have spent some time connecting me to the universe in a way that made me care about what was going on. As it stands the game is unbearable to me. I tried so hard to connect with it. Reading all the ancient text is boring. The living NPCs somehow are just as much of static unchanging exposition dispensers as the ancient texts are. The puzzle of the universe was put together in a very interesting way and the spectacle of it all is impressive, but with it being strung together with hours of restarts and reading ancient instant messenger texts I just don't understand how so many people resonated so strongly with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I think the game would've worked just fine as a regular adventure with save points and a time limit to complete the whole thing. The death loop just made it longer than it needed to be. Rather than get invested in the story, I was invested in seeing what kind of gimmick each planet had to offer... The atmosphere is really nice but the mechanisms are not. You spend a lot of time going back to the exact same place you were before because you ran out of time or got killed. A checkpoint to start in orbit of the planet would've at least been something. Rushed it to the end after getting fed up. I don't know how I can recommend the game. I would've liked it better as a regular adventure.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've played this for an hour and was barely able to find the launch tower, then immediately crashed, jumped out, and died. Everything is so confusing and hard to control",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think I've ever felt my time was utterly wasted as much as when playing this game. To begin with, cutting all of the BS out, I want to note that anything that involves a \"time loop\" of any sort is using it to pad length. Yes, it adds a layer of urgency to the game (a la Majora's Mask)... but not like it needs it much anyway considering many planets are actively collapsing as you try to traverse them, making everything time limited.. If this was a stock standard exploration game, it probably would be nowhere near as time consuming.\n\nThat definitely succeeds. I stopped playing Blue Prince because of the RNG being decidedly annoying, and it consuming too much of my time in a similar manner (this was well into the \"postgame puzzles, after finding the room). In this, I have now had many runs where I simply died or ran out of time and absolutely nothing to accomplished. I don't have the time for this shit. It's not my thing. I'm beginning to think that there's some Stockholm Syndrome cult that just has to convince everyone that this is somehow the best game ever. \n\nI don't know how long this takes to \"take off\", but I haven't encountered it yet. All of the information I've found has been incredibly mundane and I just found myself impatiently going, \"Okay, and?\" I just don't give a shit. \n[spoiler]So they tried to blow up the Sun, okay cool idgaf. Feldspar is stuck in the bramble where my scout landed. Cool, again doesn't really solve anything. Now I'm sitting here waiting in an alien ship in a gravity cannon, waiting for the moon to come by. I don't know if the poem on the trees meant something for the way I have to look at it, but I'm bored to tears trying to get it in front of me (while browsing my phone frankly). Maybe there's some other info mission, but I don't feel like finding it[/spoiler]. Maybe I could continue if I looked up some \"hint guide\" or something, but I think my current playtime is the only hint I need that this just is not for me. I might come back to it on and off when I feel like I hate my existence enough to continue pissing myself off with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "There is little structure for progression and the time-gate component of the game will punish you for too much exploration and discovery. In the mid-game you will repeatedly grind content looking for context clues about anything you can do next. Cool idea but mediocre execution.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I do not understand the hype at all. I was SO bored I got burnt out on gaming for the day. I could not find a single reason to care about anybody or anything in the game. I had zero direction, zero mystery, not a single hook or desire whatsoever. Paired with meaningless, trite, and droll repetitive dialogue you would expect from a children's edutainment offering and movement and controls that are clunky, sluggish, and insufferable made my brief time with this game a bewildering shock of detestable apathy. I think I hate this game... I bought this a while back and I finally got around to playing it. I wish I had played it right away. So I could have asked for a refund.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to enjoy this game, but every time I was starting to have fun and get excited the arbitrary time loop mechanics would say \"NO\" and reset my fun and excitement back to zero. I'm sure the time loop is important to the story, but it's an awful game play mechanic. It's basically like dying, but it happens regularly even if you're playing perfectly. This quickly eroded my desire to continue despite my strong interest in the actual good parts of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Another purchase based of people recommendations. It's a nice game with good story but the movement and spacecraft steering is horrible. And having a time reset in the middle of progress seemed fine but with the steering and flight in the game it's just bad. Forcing you to do the steering all over again to get back there just to pick up one more thing..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dime-store existentialism which seeks to soothe the player, rather than reflect reality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got Outer Wilds under the impression it was a puzzle game like Myst or Quern. If it is, it's shit.\nIt's actually an exploration game, and it's still shit. This game entirely on your curiosity to move it forward, but 99% of the time your curiosity will not be rewarded. Its signaling and sense of progression is complete ass. And the first 10 minutes of every loop will be wasted traveling instead of problem solving. I've never seen an exploration game go so far out of its way to discourage its players from exploring it.\nI wasn't enjoying the game, so I did what any rational person would do - ask for help. That turned out to be a big fucking mistake.\n\nThe Outer Wilds Steam community is the perfect example of how a shit fandom can ruin what could have been a great experience. For a moment I thought they were different, but they're a bunch of toxic elitist gatekeepers like every other gaming community out there. These people are too emotionally fragile to handle even the smallest criticism for their game. They're even worse about advice than the Dark Souls community who just say \"skill issue bro\" to everything you say. Literally, this one guy deleted his \"advice\" and accused me of being impatient, ungrateful, and having \"behavior problems\" because I didn't immediately reply to their comment.\n\nImagine being such a bunch of self-entitled and bigoted jackasses you drive people away from the game you like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really don't understand the hype on this one. Super boring.\nEvery comment section of game recommendation videos is just full of people dick riding this game and I have no idea why.\nIt's worse than watching paint dry, it's like watching paint in the fuckin tin.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, I finally tried Outer Wilds. Honestly, it really didn't work for me. Literally all my friends loved it, and one said it's their favorite game ever, but yeah, it just didn't click.\n\n- The visuals felt super cheap, everything looked like it came from an asset store. Also, I'm personally really not a fan of the \"camping in space\" aesthetic (timberpunk, lumberpunk) in general. I also really don't like the \"tiny planet\" style. It was a turnoff for me when playing Mario Galaxy and reading The Little Prince. Outer Wilds was no different. \n\n- I found the writing to be terrible. I could barely discern any personality between the characters, it assumed I already knew things about the story while I didn't, none of the dialogue options felt relatable, and there weren't even character sounds. I don't mind the lack of voice acting, but they could have added at least something like Undertale where each character has its own sound. I understand the idea was to make dialogue confusing at the beginning and to get me to slowly understand it more and more as I progressed through the game, but this only works if I am intrigued enough to want to understand what the characters were saying. I don't think any of them were saying anything interesting or hook-y, so it just felt bad. Also, the game was a serious offender of the \"As You Know, Bob\" trope where characters explain things to each other they should already know. This is most striking in the first dialogue with the alien at the campire. He goes like \"you just graduated and yet you're already going on your first solo space mission!\" This is the kind of writing that screams \"the devs don't know how to write, dialogue is worthless in this game, the devs don't care.\"\n\n- The dialogues were badly placed. The game gave me no reason to speak to the aliens of the camp, and it was a very high concentration of disjointed conversation in a small area. It felt daunting and uninteresting.\n\n- It's a small thing, but the smoke trail on the moon's campfire didn't follow the laws of gravity like how the balls taught me. Since the game's main mechanic is observing these kinds of details, it felt like a massive oversight. Compounded with the fact that this oversight was in the first 5 minutes of gameplay, this felt very amateurish, incompetent, and lazy. It's like if Doom's guns didn't work in the first room because of a bug. It'd be fine since they'd work in all other rooms and there's no enemy in the first room, but God, that's such a blatant and embarassing blemish.\n\n- The characters were ugly aliens, which was a total turn-off for me. I prefer games with no/barely visible characters like Subnautica, or games with actually attractive characters (especially furries :3).\n\n- The spaceship controls felt like garbage. I understand it's something I had to learn, but it was such a big ask right at the beginning of the game before I had even been sold on it. Technical reflex-based inputs are not the kind of challenge I find appealing, at least not right away.\n\n- I wasn't into the whole meta thing about remembering previous playthroughs, or the game remembering my current playthrough. I get what the devs were trying to do, kind of like a pure knowledge-based roguelike. Normally, I adore knowledge-based games, but I wasn't a big fan of the meta-framing and how short the playthroughs were, it pulled me out of the immersion.\n\n- I felt the game had no hook, nothing from the hub or the spaceship made me want to stay in the game. That's such a basic task, even Daggerfall from 1996 just dropped the player in a massive randomly generated world with barely any guidance while still having a hook with the quests from Septim in the FMV.\n\n- I hated how the game basically showed me all the mechanics upfront in the hub instead of letting me discover them naturally as I explore. This felt like a gallery or a tech demo instead of a game, which is not what I wanted.\n\n- None of the mechanics showed in the museum/gallery made me want to play with them. I don't know if it's because of how they were presented or because they're just not interesting to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a thumbs down for me.\r\n\r\nI think my expectations may have been set too high based on the \"hype\" from other people that claim this to be \"an unforgettable experience\", but honestly the game is mediocre at best.\r\n\r\nPoor graphics, clunky controls, and very little satisfaction along the way. \r\n\r\nSome might say, \"but you only played 105 minutes, so you didn't give it a chance\" but the reality is that I suffered through 105 minutes giving the game a chance to pull me into what was supposedly and EPIC story, and it fell flat. Actually, it was worse than flat. It was a crater IMO.  \r\n\r\nThis title is in the bottom 10% of games I've ever played. I realize there are others who love the game, and I say more power to them, but for me it didn't deliver a story, or experience. \r\n\r\nOuter Wilds was simply a slow moving and frustrating exercise in trying to make myself love a low end game, and 2 hours in realizing that this game doesn't live up to the hype.\r\n\r\nCiao!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS NOT FOR PEOPLE LIKE ME. HOW WANT SAVING OPTION. I SPEND 2HR. THEN I DIED AND WHAT I FOUND THERE IS NO SAVING.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "says it requires an controller. \nim on pc. i use kbm.\ndevelopers should apply job at mcdonalds to flip burgers if they can't make working kbm controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand the hype about this game. It's complete nonsense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know people love this game and have very strong feelings about it.  I just did not vibe with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i really really really hate controller only games\nat least the put the warning the start menu",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was impossible to learn how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I didn't like this game at all. Sorry Outer Wilds fans :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the few games I wish I could return but can't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its to good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lowkey buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game unfortunately made me SO motion sick within 10 minutes! I'm posting this because I read so many reviews and no one mentioned this, but if you are prone to motion sickness definitely something to consider (it's the space travel/gravity changes that make the camera work nauseating to me). I'm sad because it seems like such a cool game!",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I’d been sitting on this game for a long time, but finally decided to give it a try during the sale. I went in completely blind, as recommended.\n\nUnfortunately, the “genius/emotional masterpiece” that so many people rave about didn’t land for me. It’s certainly a unique experience with some strong qualities, but after the first couple of hours, it just fell flat.\n\nThe Good:\n\n- I love that there are no waypoints, quest markers, or hand-holding objectives. You’re simply given a ship and told to explore in whatever order you want.\n\n- The game pushes you to seek out the story on your own. Aside from the occasional nudge from NPC explorers, it’s up to you to find connections between ruins, scrolls, planets, and crash sites. This sense of discovery and piecing together scattered fragments into something meaningful was the highlight of the game for me.\n\n- The ship’s computer acts as a kind of evidence board for logging discoveries and how they might connect, but ultimately, the interpretation up to you. Every time I pieced things together and proved my hunch right, it was deeply satisfying.\n\n- The music is excellent. I wish there was more.\n\nThe Bad:\n\n- The universe isn’t all that big. While the handful of planets are cleverly layered, revisiting the same ones over and over in hopes of finding something I missed quickly became tedious.\n\n- My biggest issue: the time loop. Learning that I only had 22 minutes per “life” before the universe reset completely killed the experience for me. Finally discovered a hidden entrance or new scrolls? Too bad, time’s up, back to the start. Found the way into an underground city? Oops, didn’t get there fast enough, it’s filled with sand now. Better luck next loop. There’s a wealth of interesting lore here, but no time to absorb it. The constant ticking clock turns what could’ve been a thoughtful, patient exploration game into a speedrunning experience.\n\n- Yes, shortcuts and back entrances make re-exploration faster, but that doesn’t solve the core problem: the loop undermines the game’s best strengths: critical thinking, problem solving, and slow burn discovery.\n\n\nIf this game didn’t have a time limit, it would be an easy thumbs up from me. As it stands, the pressure of the loop ruined my enjoyment, and I just couldn’t settle into the thoughtful, exploratory pace the game seemed to promise. I'll probably still play it here and there, but every time I boot it up, I feel less interested.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Not my cup of tea. I don't tend to enjoy these kinds of games to begin with, so I had my doubts before I even bought it. But, a few reviews saying \"even if it's not your genre of choice, just try it anyways\" managed to convince me after all the glowing reviews I've seen. To those people, or anyone giving that advice for that matter, you are giving terrible advice.\nTo anyone that doesn't tend to enjoy these types of games, this one is not somehow magically different. While the story may be wonderful, that's irrelevant when I derive no joy from the actual gameplay itself.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I know I'm in the minority here but this is a great game that I straight up cannot bring myself to finish. I want to like this game, but the things that annoy me just keep stacking up to the point where I can't enjoy it anymore even though the day I got it I played for 8 hours straight in pure awe of how amazing it was.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I honestly don't want to give this game a thumbs down, I liked it, but I also don't understand that \"we don't talk about Outer Wilds\" part. I think we absolutely need to talk about it so future players know what to expect and don't feel like there is something wrong with them if the game \"didn't click\" or was simply good but not life-changing as majority of the fan-base seems to say. \n\nFirst of all the rating bias. It's overwhelmingly positive but I believe part of the reason for that is that the game itself is really niche, plus players who didn't like it either couldn't be bothered to write a review or didn't want to leave a negative review because this game is so hard to hate as it's beautifully crafted, has great soundtrack, engaging story, not coming from greedy AAA clowns but an indie dev etc. Because it's a niche game even a slightest criticism is often met with hostility, people will tell you to get back to tiktok/fortnite, that you have ADHD and so on. \n\nThe game itself is mostly fun, but can also be quite tedious at times, some questlines seem a bit shallow, pretentious or simply boring (I personally didn't enjoy the Quantum Moon and the Ash Twin project). There is a lot of back and forth, the time loop concept may feel annoying at times - I personally dislike deadlines when I am exploring something cool.\n\nOverall, try this game but don't think there is something wrong with you if you find it to be just \"alright\". Don't believe the hype.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "TLDR: The game is good, but it's not for everyone!\r\n\r\nFirst of all the game is very well made. It's interesting, it keeps you going like a good book finding tid-bits of info along the way that end up making it both addicting and frustrating. Here's the reason why I don't recommend it, because honestly I feel that a \"recommend\" tag wouldn't let people know, like myself, what they're really getting into. The game is already overly popular and hopefully this could reach those that I'm targeting. Let me just say that if you are dealing with mental health and/or depression this game might trigger those feelings. I'm halfway into the \"story\" and I can already see a mile away what is there to come and honestly I'm in no way, shape, or form to be dealing with that. When I was younger, yeah I could with sad stories but now that I deal w/ depression and have had lost loved family members it hits different. I play video games 1, because I enjoy the hobby and 2. for escapism. I saw all the reviews on this game and most if not all were very cautious about revealing spoilers which lead me to believe this was a nice little game with a chill story. Don't get me wrong, it is. I've heard it's bittersweet, but like I said, I'm in no position to put myself into a bittersweet position out of my own volition and specially in a video game. I've played games like this before and they were okay, like SOMA, but back then my mind could handle the psychological trauma. Not anymore!! Haha. Anyway, I know this review will most likely get lost in the void of Steam much like the void of space, but if it at least helps that one person know truly about this game or help them in their research of what this game is like then I'll be happy. I know for sure I should have made more of an effort to know about the game instead of letting the hype get the better of me. Other than that the game is neat, but you really have to have a lot of patience. I mean A LOT. To be honest I'd rather just read a book instead of dealing with scavenging for small texts that reveal the story and dealing with physics and timed events. Again, it's not for everyone.\r\n\r\nMy rating...\r\n\r\nBurt Marshmallow / 10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, I knew going into this game that I was going to have a rough time of it. I vehemently dislike time limits in games (especially strict ones), and I'm not really a fan of roguelike/lites. Imagine my surprise when it was neither of these factors that killed my enjoyment of the game (although they didn't help), but the absolutely miserable movement. If you've ever played Lunar Lander, that's basically the entire game: fiddly momentum based mechanics with gravity involved. \n\nIt took me very little time to realize that I had no desire to deal with the movement for however many hours this game was going to take, as it was going to be a constant anchor weighing down any enjoyment I might get from the good parts of the game. Add to that the 20 minute time limit and constant resets, I decided I'd rather not waste my time further. I'm just going to watch a let's play and have a much better time that way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I finally finished Outer Wilds after giving up on it twice. The journey delivered some of the most memorable moments I have experienced in a game, but also some of the most frustrating ones, to the point that I stopped playing on two separate attempts. Be warned that this is an exceptionally difficult game to get into.\n\nThere is a lot to appreciate. The entire solar system runs like a precise clock and makes the world feel alive. Gravity can feel unpredictable at first, but once it makes sense, movement becomes genuinely fun. The environmental storytelling is outstanding, and [spoiler] the gradual reveal of what happened to the Nomai and why you are trapped in the time loop [/spoiler] is handled with great care. Solving some of the game’s puzzle pieces feels incredible, especially when everything finally connects in your mind. Moments like [spoiler] the journey toward the Quantum Moon [/spoiler], [spoiler] the revelations inside the Ash Twin Project [/spoiler], and [spoiler] the discoveries on the Interloper [/spoiler] easily rank among the most memorable in gaming. It is very clear why the game has earned such a passionate following.\n\nThe first major issue is the transition from the early game to the mid game. Many players, including myself, follow the ship log as a guide for progression. After finishing the Attlerock, the log naturally pushes you toward Brittle Hollow and its observatory near the south pole. On paper this seems straightforward, but in practice it demands a good understanding of how the planet behaves. By this point the time loop starts to feel like genuine pressure, and the collapsing terrain of Brittle Hollow adds another layer of stress. You feel compelled to rush, even though the game never explicitly requires it.\n\nFinally reaching the south pole left me exhausted, and the story still felt like a confusing collection of fragments. The narrative is delivered entirely through scattered environmental clues, and every player uncovers them in a different order. Early on you simply do not have enough context to connect anything, so the logs feel disconnected and incomplete rather than intriguing. The mystery never comes together, and instead grows into a pile of half understood ideas. That combination of confusion and the effort required just to make basic progress is what caused me to stop playing during my first attempt.\n\nIf you manage to push past this phase, the mid game is wonderful. Here you will encounter some of the best designed puzzles in the entire experience. The game presents its rules clearly and lets you assemble the bigger picture through true discovery. Unfortunately, not every puzzle is this well crafted. The worst example by far is [spoiler] Dark Bramble [/spoiler]. The only real advice the game gives is to stay silent around [spoiler] anglerfish [/spoiler]. Everything else is left entirely for you to deduce. The internal logic of this world is extremely unclear, and progress often requires repetitive trial and error. I only learned that the [spoiler] node structure was fixed across iterations [/spoiler] after giving up and searching online for help. Even with that knowledge, exploring [spoiler] Dark Bramble [/spoiler] remained tedious, confusing, and unrewarding.\n\nI also have mixed feelings about the ending. [spoiler] It does not provide clear answers and instead presents even more questions [/spoiler]. It left me both disappointed and strangely inspired, a combination that is hard to describe.\n\nOuter Wilds is a rare kind of game. It is ambitious, imaginative, and capable of delivering extraordinary moments that stay with you. It is also demanding and often unforgiving, especially during its early hours and in a few late game locations. If you have the patience to endure its most frustrating moments, the rewards are remarkable. If not, you may find yourself giving up more than once, just as I did.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely tried very hard to like this game. It’s praised and adored by many, with some even calling it life-altering. And honestly, I think it’s wonderful that so many people found something special in it — even though I have no idea why.\n\nTo be fair, the music and sound design are fantastic. No complaints there. The overall setting is intriguing at first, thoughtfully crafted, and full of charm.\nBut everything else — at least for me — felt completely off.\n\nThe game plays like a clumsy running simulator with imprecise controls. The story and characters felt lifeless or distant, and the time-loop structure created a lot of unnecessary repetition that quickly became frustrating. Instead of settling into a cozy, chill adventure, I ended up feeling stressed, annoyed, and constantly on edge. For me personally, this ranks among the top 10 worst gaming experiences I’ve ever had.\n\nSo consider this a small warning: even though the game has an Overwhelmingly Positive rating, it might absolutely not be for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The controls ruined it for me almost instantly. Not looking forward wonking about with them on a time limit no less.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game requires A LOT of patience. Patience I ran out of, while exploring some of the planets, since no one told me beforehand how difficult, or rather, how inaccessible it was going to be. \nIf you are slow or clunky or have any accessibility issues regarding time or/and input, don't buy.\nFlight controls, both in ship and on foot, at first seem easy and straight forward, but are problematic due to how irresponsive they are. Don't ask me how many times I fell into the [spoiler]Brittle Hollow's black hole[/spoiler] because I miscalculated a jump or made bad inputs.\nThe time loop only gives you 22 minutes before it resets everything and sends you back to camp. Many times it's not enough to see everything in a single location, especially if you need more time to think and sometimes you have to wait for a time sensitive event. Every time the loop happens, it feels like lost progress. The only accessibility options in-game regarding time are pausing it whenever you have to read something; there's no option to extend time between loops for those who might need it (luckily there's a mod available for that).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Massively overhyped. I do not understand why people love this game so much. I wanted to like it too. The game could have sold me on it's method of clue distribution if it could just have spent some time connecting me to the universe in a way that made me care about what was going on. As it stands the game is unbearable to me. I tried so hard to connect with it. Reading all the ancient text is boring. The living NPCs somehow are just as much of static unchanging exposition dispensers as the ancient texts are. The puzzle of the universe was put together in a very interesting way and the spectacle of it all is impressive, but with it being strung together with hours of restarts and reading ancient instant messenger texts I just don't understand how so many people resonated so strongly with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I think the game would've worked just fine as a regular adventure with save points and a time limit to complete the whole thing. The death loop just made it longer than it needed to be. Rather than get invested in the story, I was invested in seeing what kind of gimmick each planet had to offer... The atmosphere is really nice but the mechanisms are not. You spend a lot of time going back to the exact same place you were before because you ran out of time or got killed. A checkpoint to start in orbit of the planet would've at least been something. Rushed it to the end after getting fed up. I don't know how I can recommend the game. I would've liked it better as a regular adventure.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've played this for an hour and was barely able to find the launch tower, then immediately crashed, jumped out, and died. Everything is so confusing and hard to control",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think I've ever felt my time was utterly wasted as much as when playing this game. To begin with, cutting all of the BS out, I want to note that anything that involves a \"time loop\" of any sort is using it to pad length. Yes, it adds a layer of urgency to the game (a la Majora's Mask)... but not like it needs it much anyway considering many planets are actively collapsing as you try to traverse them, making everything time limited.. If this was a stock standard exploration game, it probably would be nowhere near as time consuming.\n\nThat definitely succeeds. I stopped playing Blue Prince because of the RNG being decidedly annoying, and it consuming too much of my time in a similar manner (this was well into the \"postgame puzzles, after finding the room). In this, I have now had many runs where I simply died or ran out of time and absolutely nothing to accomplished. I don't have the time for this shit. It's not my thing. I'm beginning to think that there's some Stockholm Syndrome cult that just has to convince everyone that this is somehow the best game ever. \n\nI don't know how long this takes to \"take off\", but I haven't encountered it yet. All of the information I've found has been incredibly mundane and I just found myself impatiently going, \"Okay, and?\" I just don't give a shit. \n[spoiler]So they tried to blow up the Sun, okay cool idgaf. Feldspar is stuck in the bramble where my scout landed. Cool, again doesn't really solve anything. Now I'm sitting here waiting in an alien ship in a gravity cannon, waiting for the moon to come by. I don't know if the poem on the trees meant something for the way I have to look at it, but I'm bored to tears trying to get it in front of me (while browsing my phone frankly). Maybe there's some other info mission, but I don't feel like finding it[/spoiler]. Maybe I could continue if I looked up some \"hint guide\" or something, but I think my current playtime is the only hint I need that this just is not for me. I might come back to it on and off when I feel like I hate my existence enough to continue pissing myself off with it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "There is little structure for progression and the time-gate component of the game will punish you for too much exploration and discovery. In the mid-game you will repeatedly grind content looking for context clues about anything you can do next. Cool idea but mediocre execution.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I do not understand the hype at all. I was SO bored I got burnt out on gaming for the day. I could not find a single reason to care about anybody or anything in the game. I had zero direction, zero mystery, not a single hook or desire whatsoever. Paired with meaningless, trite, and droll repetitive dialogue you would expect from a children's edutainment offering and movement and controls that are clunky, sluggish, and insufferable made my brief time with this game a bewildering shock of detestable apathy. I think I hate this game... I bought this a while back and I finally got around to playing it. I wish I had played it right away. So I could have asked for a refund.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to enjoy this game, but every time I was starting to have fun and get excited the arbitrary time loop mechanics would say \"NO\" and reset my fun and excitement back to zero. I'm sure the time loop is important to the story, but it's an awful game play mechanic. It's basically like dying, but it happens regularly even if you're playing perfectly. This quickly eroded my desire to continue despite my strong interest in the actual good parts of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Another purchase based of people recommendations. It's a nice game with good story but the movement and spacecraft steering is horrible. And having a time reset in the middle of progress seemed fine but with the steering and flight in the game it's just bad. Forcing you to do the steering all over again to get back there just to pick up one more thing..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dime-store existentialism which seeks to soothe the player, rather than reflect reality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got Outer Wilds under the impression it was a puzzle game like Myst or Quern. If it is, it's shit.\nIt's actually an exploration game, and it's still shit. This game entirely on your curiosity to move it forward, but 99% of the time your curiosity will not be rewarded. Its signaling and sense of progression is complete ass. And the first 10 minutes of every loop will be wasted traveling instead of problem solving. I've never seen an exploration game go so far out of its way to discourage its players from exploring it.\nI wasn't enjoying the game, so I did what any rational person would do - ask for help. That turned out to be a big fucking mistake.\n\nThe Outer Wilds Steam community is the perfect example of how a shit fandom can ruin what could have been a great experience. For a moment I thought they were different, but they're a bunch of toxic elitist gatekeepers like every other gaming community out there. These people are too emotionally fragile to handle even the smallest criticism for their game. They're even worse about advice than the Dark Souls community who just say \"skill issue bro\" to everything you say. Literally, this one guy deleted his \"advice\" and accused me of being impatient, ungrateful, and having \"behavior problems\" because I didn't immediately reply to their comment.\n\nImagine being such a bunch of self-entitled and bigoted jackasses you drive people away from the game you like.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really don't understand the hype on this one. Super boring.\nEvery comment section of game recommendation videos is just full of people dick riding this game and I have no idea why.\nIt's worse than watching paint dry, it's like watching paint in the fuckin tin.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, I finally tried Outer Wilds. Honestly, it really didn't work for me. Literally all my friends loved it, and one said it's their favorite game ever, but yeah, it just didn't click.\n\n- The visuals felt super cheap, everything looked like it came from an asset store. Also, I'm personally really not a fan of the \"camping in space\" aesthetic (timberpunk, lumberpunk) in general. I also really don't like the \"tiny planet\" style. It was a turnoff for me when playing Mario Galaxy and reading The Little Prince. Outer Wilds was no different. \n\n- I found the writing to be terrible. I could barely discern any personality between the characters, it assumed I already knew things about the story while I didn't, none of the dialogue options felt relatable, and there weren't even character sounds. I don't mind the lack of voice acting, but they could have added at least something like Undertale where each character has its own sound. I understand the idea was to make dialogue confusing at the beginning and to get me to slowly understand it more and more as I progressed through the game, but this only works if I am intrigued enough to want to understand what the characters were saying. I don't think any of them were saying anything interesting or hook-y, so it just felt bad. Also, the game was a serious offender of the \"As You Know, Bob\" trope where characters explain things to each other they should already know. This is most striking in the first dialogue with the alien at the campire. He goes like \"you just graduated and yet you're already going on your first solo space mission!\" This is the kind of writing that screams \"the devs don't know how to write, dialogue is worthless in this game, the devs don't care.\"\n\n- The dialogues were badly placed. The game gave me no reason to speak to the aliens of the camp, and it was a very high concentration of disjointed conversation in a small area. It felt daunting and uninteresting.\n\n- It's a small thing, but the smoke trail on the moon's campfire didn't follow the laws of gravity like how the balls taught me. Since the game's main mechanic is observing these kinds of details, it felt like a massive oversight. Compounded with the fact that this oversight was in the first 5 minutes of gameplay, this felt very amateurish, incompetent, and lazy. It's like if Doom's guns didn't work in the first room because of a bug. It'd be fine since they'd work in all other rooms and there's no enemy in the first room, but God, that's such a blatant and embarassing blemish.\n\n- The characters were ugly aliens, which was a total turn-off for me. I prefer games with no/barely visible characters like Subnautica, or games with actually attractive characters (especially furries :3).\n\n- The spaceship controls felt like garbage. I understand it's something I had to learn, but it was such a big ask right at the beginning of the game before I had even been sold on it. Technical reflex-based inputs are not the kind of challenge I find appealing, at least not right away.\n\n- I wasn't into the whole meta thing about remembering previous playthroughs, or the game remembering my current playthrough. I get what the devs were trying to do, kind of like a pure knowledge-based roguelike. Normally, I adore knowledge-based games, but I wasn't a big fan of the meta-framing and how short the playthroughs were, it pulled me out of the immersion.\n\n- I felt the game had no hook, nothing from the hub or the spaceship made me want to stay in the game. That's such a basic task, even Daggerfall from 1996 just dropped the player in a massive randomly generated world with barely any guidance while still having a hook with the quests from Septim in the FMV.\n\n- I hated how the game basically showed me all the mechanics upfront in the hub instead of letting me discover them naturally as I explore. This felt like a gallery or a tech demo instead of a game, which is not what I wanted.\n\n- None of the mechanics showed in the museum/gallery made me want to play with them. I don't know if it's because of how they were presented or because they're just not interesting to me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a thumbs down for me.\r\n\r\nI think my expectations may have been set too high based on the \"hype\" from other people that claim this to be \"an unforgettable experience\", but honestly the game is mediocre at best.\r\n\r\nPoor graphics, clunky controls, and very little satisfaction along the way. \r\n\r\nSome might say, \"but you only played 105 minutes, so you didn't give it a chance\" but the reality is that I suffered through 105 minutes giving the game a chance to pull me into what was supposedly and EPIC story, and it fell flat. Actually, it was worse than flat. It was a crater IMO.  \r\n\r\nThis title is in the bottom 10% of games I've ever played. I realize there are others who love the game, and I say more power to them, but for me it didn't deliver a story, or experience. \r\n\r\nOuter Wilds was simply a slow moving and frustrating exercise in trying to make myself love a low end game, and 2 hours in realizing that this game doesn't live up to the hype.\r\n\r\nCiao!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS NOT FOR PEOPLE LIKE ME. HOW WANT SAVING OPTION. I SPEND 2HR. THEN I DIED AND WHAT I FOUND THERE IS NO SAVING.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "says it requires an controller. \nim on pc. i use kbm.\ndevelopers should apply job at mcdonalds to flip burgers if they can't make working kbm controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand the hype about this game. It's complete nonsense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know people love this game and have very strong feelings about it.  I just did not vibe with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i really really really hate controller only games\nat least the put the warning the start menu",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was impossible to learn how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I didn't like this game at all. Sorry Outer Wilds fans :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the few games I wish I could return but can't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its to good",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}