{
  "positive": [
    {
      "review": "Amazing online game, would i recommend YES but only if you like games like runescape, pretty fun but kinda grindy.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "albion online's system with builds is the best compared to all other mmorpg's. your ability to build as anything you want and mix and match whatever you want and not be locked into a specific class is spectacular. it's the main system that shines in this game.\nhowever the pay to win aspect and the full loot pvp holds the game back. i would 1000% prefer if it was just a buy to play game where everyone played on equal footing, and if they ever make a sequel that's how i prefer for the game to be.\nbut for a free to play game, with what you get you can still play and have fun, and that's the most you can hope for for a free to play game and it provides.\ni also wished the games pvp arena had shorter queue times. it can take upwards of 10 minutes to get into a match, (which was my preferred way to play the game to get to experience pvp without suffering the full loot drawback), and i wish queue times were shorter. \nthose are my only gripes about the game. \nso overall my opinion on the game is it is good for a free to play game, there are some things that could change that would make it be better, but for a free to play game it's fun which is all you can ask for, so you might as well try it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i will be honest and fast.\nalbion online is that game that you will need to grind ALOT. when i say alot IS ALOT\nif you have no life,no job and responsabilitys. play this thing it will consume your time",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has EVERYTHING for just about every gamer: crafting, mining, pvp, pve, farming crops, huge open world map, dungeon diving, looting etc. Simple to learn, the loading screen between map sections usually takes less than 5 seconds plus you can play on pc and mobile with your same character and play with others between the two.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "El mejor mmorpg que existe, horas de entretenimiento solo o con amigos, bastante recomendable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of fun and is limitless in things to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like how the game has so many directions, unlike other games that are set in one way. From a chaotic and heart-pumping black zone gathering to a laid-back island farming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is super fun with friends, its a bit grindy at times but fishing with friends is some of the most fun ive had while gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albion Online is a unique sandbox MMORPG with a fully player-driven economy and a flexible “you are what you wear” class system. You can switch roles anytime and explore a huge world filled with PvE and intense full-loot PvP. Guilds, territory battles, and constant events keep the game active and exciting. It’s not pay-to-win skill and teamwork matter most. A great game for players who enjoy freedom, risk, and rewarding progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You play for +500hrs\nyou grind to get literally best items in the game\nyou die by 20GAY people \nYOU START OVER\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You see an IP bully and you die, you see 5 gankers and you die, you play solo on corrupted and you die, you try mists and gather then you die, you try faction on Red Zone one and get massacred by bombers you just die, you try joining a big guild it gets safer then you join them on CTA and you die to a bigger guild. That's Albion, you die. But in the end, you get to enjoy the progression of getting stronger and better from each death. Some death's are just unavoidable but you go back to portal and play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's alright with a group to play with.\nAlone, not so much.\nEco giants would enjoy a solo play though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steam shows only a fraction of the play time I have into this game since I switched to the official launcher with my current account sitting at almost 1500 hours on my main account, its my first MMORPG but its been one of the funnest games to play for me in the past several years, the art style is awesome and the game play if you are running on PC is fantastic, I almost exclusively go for PVP and the full loot style in blackzones gives you a strange 'loot high' like no other game I've ever played, it's addictive! the game is free and only a few gigs so I recommend giving it a try at the very least and make it to at least T4 equipment before making a judgment call.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fest popiči hra, mam 12 rokov a hram ju už 8 rokov, moja najoblubenejsia, ked si maminka vypije obcas bije tatinka ale inak fest dobra hra",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels good when i have friend in discord to talk to, but if i was alone its kinda weird like alone but not alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very relaxing mmorpg and good for casuals looking for an easy mmorpg to get in to\nnot a problem playing solo but you are locked to a certain number of activities that would require a party or clan/guild\n\noverall experience has been nice so get some friends or join an existing guild to have some fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for farm with friends and experience diferents gameplays. We can play as mage, warrior, mage warrior and so on. Good mechanics and visual, with a lot of active players daily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it takes time to understand whats up with everything but when you catch up , it gets fun \r\na really good f2p mmo , try it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for me, steam version has so much issues like suttering, delay.... but native client do it much better.Only for that but i still recommend for those who playing on steam if you want to get achivements and if you want a better performance but no achivements you should try native client version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is simple yet difficult as f*ck. If you can play knowing the gear your have is just borrowed, it'll help with your mental wellness during your time on this game. Overall, worth the experience. Premium is not necessary but makes it easier/faster to level up your stats in the different pieces of armor and weapons. To get the most out of AO, expect to be social and interact with the guild you end up joining (and liking). Solo play is possible but you won't touch much of the \"end game\" content that way. The community is a mix of toxic as hell and friendly and supportive. My go-to content creator is swolebenji - dude has experience and brings a unique perspective to the game albeit sometimes a bit overdramatic - with the intent of steering new players away from the \"meta\" and backs his findings up with research/numbers so to why his suggestions are superior to other content creators.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Advice for this game: You will need to spend a lot of time grinding before walking into a PVP map and losing everything you've ground for before you even start learning the game's systems. And yes, the 'Welcome to Albion' achievement you receive the first time you get killed by another Player...NICE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mostly play direct on Albion client but feel a review needs to be made, \n\n100% recommend, you can do what you want in the game, if you want to be a gatherer you can.. crafter knock yourself out,\n\nSome of the higher fame players are crofters only, plus you don't have to do PvP to get good stuff (Although the full loot PvP zones will get you better stuff faster) but you can just stay in the safe zones (Blue and Yellow zones) and still make good money and craft\n\nBut yeah overall worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no toxicity the worst is just a slow connection from time to time but the game itself is immense with a multitude of options for living and playing weather your about starting a settlement and or town or adventuring killing everything in the path of you and even learning skills that i find very fascinating from the moment the game starts you are drawn to feel like you are the story and nothing else matters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very grindy, but I enjoy that. You can pay to get a leg up or just stay in other zones and work for your levels a bit longer. I do like that if I buy 7 days premium I get to keep the island after that. The game wants you to buy for sure but you do not have to. Honestly it’s fun if you let it be and play your way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played after a month still same fun to explore and grind in it must play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's really addictive and the gameplay is superb",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun with friends in the begging but it gets \nBoring in some point, takes a lot of time, i will say its recommended in the start after that its not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, but I got banned for using an Auto Clicker and the Devs are NOT Forgiving",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bro I play tHis game 3 years ago only 2 hours and I think it was trash game but now when I dont know what to play I give a chance TO  albion and its work its very chill fun and Interesting game to play btw I play solo but its still fire if I find friends who gonna play with me this game will be 10x better\r\n\r\nALBION ONLINE THE BEST GAME I PLAY SO FAR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albion is honestly one of the best MMORPG games ive ever played, it has alot of things to offer, you can play on a bunch of different electronics, such as pc, mobile, console. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game made for theory crafters, and Pvp player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if youre looking for a truely ftp mmo this ones it. the entire game is playable without premium its just a grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and love everything you can do in the game for all mmo styles of gameplay. Wanna be that guy that farm mats all day and night you can do that. Want to pvp and gank people as they come around you can do that. Want to do big 100v100 guild wars you can do that. As a mostly solo player of Fort Sterling i have always been able to run around do everything myself and not rely on anyone and games been amazing to play over the years. We can also point out that the games free to play and you can buy premmy with ingame money also. Gold price do go up and down like the market so you can invest your silver and make money that way if you really wanted to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albion Online is one of the best games ever made, and if you aren't aware - it's actually a clone of Eve Online in terms of the pvp systems, the player driven economy, the sandbox style gameplay, etc. \n\nOf course, the moment-to-moment gameplay of Eve and Albion seem vastly different on the surface, but if you've played both games then you know how similar they truly are. They're really the only two games of this kind on the market. I mean, yeah there are *some* other games like this, but let's be real - most of them are absolute dogshit and will never compare to either Eve or Albion. These two games are the perfect example of a \"hardcore full loot pvp mmo\" being done correctly, almost perfectly even.\n\nYou basically take Eve Online, and turn it into an isometric fantasy game. You strip it down to its most basic fundamentals, and make it digestible for the normies who don't \"get\" Eve.\n\nYou add in a little bit of League, a little bit of Dota, a little bit of Diablo and Runescape. But always with the soul of Eve flowing through its veins. \n\nWhat you get is Albion Online - one of the greatest games ever made. \n\nSure, it will never be as deep as a game like Eve or even Ultima online. And I suppose that will always be one of the games weaknesses. But having said that, I'd rather have a functioning game that actually works, and makes sense and is fairly balanced like Albion is - than have a broken mess of a game that tries to do too many things at once, but ends up failing at everything overall. \n\nAlbion is an example of a game that had a tight, realistic vision for what it wanted to be and honed in on that vision without being distracted by anything else. It is what it is, I'm proud to say I bought a founder's pack way before the game even came out. I never thought it would grow to be this big, but here we are. Excellent game, and well worth the grind if you like this type of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun but complicated, I like complicated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun game if you like grinding levels and items it is a bit slow but worth the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world, thats cool. RPG, thats cool. cool game in general but you need premium for some things but overall not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albion online is my personal little break from all the high paced action type games that I normally spend my time on. I really enjoy just mindlessly chopping wood for 10 hours straight while watching youtube, and chatting with people in the game. You really get to choose what you wanna do in this game and thats by far my favorite part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, awesome and big community, no classes just you and big ass world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great balance between simplicity and fun factor. Love it!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Loving this game! Chill with abit of danger and ALOT of content to explore and try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally enjoy it but i can see how it might not be everyone's cup of tea. sbi might need to slow down with the monetization tho, or find some non game beneficial way to do so",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fishing game.\r\nDon't let people lie to you.\r\nThere is NOTHING, but fish...\r\n-IPickedMercy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy going outside to touch some grass, don't play this game.\nSuper fun gameplay loops, but the time commitment to level everything is not fit for the average gamer.\n\nGathering is chill and addictive. The build variety means you always have something new to try. The player driven economy is incredibly unique and probably the coolest part about the game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I'm back to the game after 3 years. I started with a new character and so did my wife. I still like the game very much. (disclosure, I'm buying premium). The game allows for a satisfying progression. I'm finding new ways to make money and I travelled for the first time to Caerleon to sell to the blackmarket. I'm finding new ways to play and things to do. Playing with my wife also creates new opportunities and companionship on the long trips. I lost some decent gear recently in a red zone but it was my fault as I stopped in the place there were already corpses. Stupid me! Other than that the royal continent is pretty safe and with the right Guild the ventures further north are very rewarding and exciting. I'd recommend new players to stick to the royal city of their choosing for the first month or so, but if you want any tips or have any question either check the forums or DM me. I'm happy to help newcomers. See you there! ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive game loop. Premium not required and its affordable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Addictive, no boring unnecessary long dialogue, runescape-esque. Overall 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albion Online is a sandbox MMORPG with a player-driven economy and open-world PvP. Gathering, crafting, and trading are deep and rewarding, giving a real sense of progression. Guild battles and territory control make the game exciting and strategic. A must-play for anyone who enjoys open-world adventures and cooperative gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone enjoyed this when we played. A bit dated by now, but still fun if you get a chance to try it out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game and nice to play with friends, sadly filled with a lot of bots. Pvp is kinda dying as the developers are focused more on PVE content and making PvP areas safer for people that PVE which in my opinion ruins the pvp aspect of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For anyone with dc issues especially poland T-mobile internet provider (lately also optic-fibre ) had constant problems with connection to EU server, use VPN - even free one - helped for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really time consuming but great when with friends or good guild",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever created u will get thousands of bitches playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get f♡♡♡♡d by a red zoner is better than get f♡♡♡♡d by yellow g♡♡ner, donkey is the best mount. the game economy is great, get addicted by getting more rich just for get k♡♡♡♡d by hardcore pvp player.\r\n\r\n10/10 beginner friendly ♡♡",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game recomended  for people trying to chill and hag out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friends forced me to play this game, and it’s actually kinda cool. But sorry, I’ve ended up as the “spare part” they bring in when someone’s missing. T-T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS PERFECT, OH I M SO ADDICTED AND IVE NEVER PLAYED AN MMO IN MY LIFE EXCEPT FOR THIS ONE, PLEASE GET IT IF U WANNA HAVE A GOOD TIME, ALONE OR WITH FRIENDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wont play it because I used to play it with a good friend ive lost but it was fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Liked everything other than what the game asks or wants you to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun for casual players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game requires you to invest a lot of time into your character. A true MMORPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i don't have that many hours on the game but i recommend it cuz of the easy gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quick and simple if you actually follow instructions........ i didnt..... till now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been enjoying it so far. Though F2P player is not that sustainable and needs hard grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute cartoon-style graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "odd but fun mmorpg you will get locked in so you will lose time playing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's a really good game if you prefer full loot pvp games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Faction Warfare update is pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very fun and chill game heavily recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of filthy gatherers. Black zone = bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good for a free game. There's alot of grinding involved, I mean ALOT, and there are many bots. Wherever you go you can see at least one bot monopolizing resources. Fortunately, there are many friendly players and guilds to help with your progress. I don't know why devs didn't take any action against bots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not much to say, the games fun, addictive and has content for everyone. If you enjoy creative build expression, large/small scale pvp games and intense rewarding and risky experiences, give it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for a F2P mmo but would not be worth if it wasn't free. couldn't play it for too long since it kinda got stale after a while but great look for free to play MMOS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Es bueno hasta que se convierte en un trabajo xd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Off-Brand WOW, but better to play, not so hard mechanics, kinda good quality, and well thats all.\nEvery MMORPG is about grind so GRIND!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best MMO in-game economics i've ever seen. \r\nHaven't played Eve though:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Adventure-themed game with fun quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is grindy but in a good way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RuneScape vibes, pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall is good but the signal is bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you need to grind a lot in this game but its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking peak playing with others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "group content is more than solo content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is what Runescape 3 wish it was",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A+ MMO with cross platform device, SOLID :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good hard to learn but put time in and you will be invested",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really fun and good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its A Pretty Fun Game Just a Minor Paywall But 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good until you get lost in dark zones",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad\nedit: worse!! love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bro pls buff fort sterling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good and funny game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very good game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game very addicting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its free, so no complaints",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game so much and i will earn money from it ill promise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game, Gets you Addicted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still learning the game lmao.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just grind if you dont have a life and to pk go get urself a rope and hang urself",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "is good man frost goes woosh kachow freeze blizzard snow chill",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "This game is a complete garbage, Its pay-to-win. Also their support is terrible, I submitted few support requests, and they didnt wont to help me, where they where able to. Funnily enough it was always their \"senior\" support technician named Rio. Don't play  this garbage, Dont  give them any of your name.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "You cannot play this game alone. As the game progress, it really punished you if going to red or black zone. As someone who play casually without friends in this game, going to tier 6 is really hard. You gonna get gank everytime you step in the zone. Furthermore, it is really a pay to win game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't even bother installing this crap, it's just a massive pay-to-win cash grab, no major updates ever since, just releasing a bunch of ugly skin bundles, haven't resolved the premium increases and other problems in-game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Refuses basic customer service like unlinking from your steam account or changing old and unused email addresses.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool game with a really in depth economy. Rewards dedicated players and balances it with a mechanic with rogue-like inventory loss on death. The new player experience is tedious and pvp is limited since you have nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are looking for botted economy, unbalanced game, community managed by few AI obsessed moderators, a game right for you, especially if you look for a progression without any actual goal besides the changing number next to your gear.\n\nAlbion, a game where even watering your plants is put behind a paywall.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Albion Online 2025. This game is a dumpster fire. There is no self reward in this game cause its literally ran by BOTS that keep the market flooded. Learning points are a scam to speed level up your tools for gathering then you find out wtf did i do that i can craft now but your no way gonna compete and make money on the BOT FUELED MARKET. The premium has skyrocketed from 4 usd to 16 usd in such a short period of time why you ask cause the game is going downhill with the new dev team. So to make money they hiked the premium price play the game for free min if you wanna swipe sure do that premium but not needed. If you wanna make silver in this game and not waste your time do FISHING youtube bercelin city rep farm that to get to BERCELIN. Then with your t3 pole hop in a safe t5 mist and fish your brains out. Once you stockpile bring to the buthcer CHOPPED FISH stacks 999 sell like hotcakes for 245k or more on market and fill only t6 fishing journals and sell those. You dont need to swipe for learning points wtf speed up your tools thinking your gonna make money but you cant compete on the market. If you do islands only do farm plots and stock pile carrots and sell those on the market dont bother with the other stuff its a waste. So if this is your type of game crafting is ass backwards you ex for a t5 weapons need that t5 wood but to craft that t5 wood you need t2 3 4 to craft that t5 so get ready for a grind. If you wanna craft just do skinning and fiber make BAGS go as high as t5 its all you need make gathering tools dont pipe dream for that t8 cash flow not gonna happen.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool game, well designed, and fun to play...  at first...  Then you realize that going solo to do anything outside of green and yellow zones is essentially a death sentence.  If you have a group of friends to play with though, you'll probably love the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very difficult to play solo without getting jumped by a massive group. Plus they keep nerfing things that solo players can do to make money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Once you get hang of the game you will be eventually banned for RMT with no proofs provided . SO IF YOU ARE PLAYING THIS GAME DO NOT EVER TRADE WITH ANYONE USE ONLY MARKET.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a fun game that has a lot to do, like being randomly killed by another, much more powerful, player while trying to hunt. Your equipment takes a 5% drop in durability, drop some silver, wait a minute or two to revive, repeat. \r\n\r\nI really enjoyed and looked forward to logging in everyday but I'm not going to play anymore due to the non-consensual PVP that we can't opt out of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't want a life, go ahead and play this game, very hardcore and grindy, but can be fun at times if you manage to find a good community to play with",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was banned for 200 years simply because I received 40 million silver from a friend. I contacted support, but they didn’t care at all. They insisted it was an “in real life trade,” even though I have never purchased silver or engaged in any kind of real-money transaction.\nThe support team didn’t listen, didn’t investigate properly, and provided no real explanation. It’s extremely disappointing to be punished so harshly for something I didn’t do, and it shows how little the developers value their players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Download the game when its released play for 400 hours\nstop play then the EU server is released come back when your friends play there\nthey give you silver to get prem u play for a couple of months \nopen one time to give your friend access to your farm and get insta banned for third party trading \nopening tickets is useless, appealing is also useless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its litearly just a grind simulator: chop trees, get better axe, chop harder trees. I can see how some pepole could enjoy this game, but \"some pepole\" are not me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "would not recommend this game due to giving my data to make account to play this i then found that my info was in a data breach and found on the dark web on Mar 10, 2022",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a sandbox.\nNot an MMORPG in the traditional sense.\nMaybe the least thought out/most inflationary and definitely the messiest tiered-item economy I have seen.\n\nA niche social environment for certain people. If you are looking for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not work in the steam client very well and I assume it is micro transaction hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For some reason you're unable to log into an existing account through steam and you'll need to create a new one in order to be able to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent 6 hours, went through some dungeons, everything was fine until some diddy killed me in pvp zone(there was no notification that it was a pvp zone, so I didn't even know it was a pvp zone). After that I was left without mount and gear. went through some more dungeons until my gear broke and I had no silver to repair. Waste of 6 hours",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "do not leave your game runing i just lost 20 hours of my life becuse i was afk and the my acc got dealted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly seems decent, just seems dated. Can def tell it’s like a mobile game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was my first mmorpg. It was good, although after a day of work i go to my bedroom load up the game and then as i get ready to play, my account is missing! I tried to retrieve it to no avail. Will not return due to lack of security and account safety reassurance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They keep claiming their servers have a large player base. Go explore the riverbanks and forests; they have many officially approved fishing and gathering bots. Apparently, if over 60% of the players are bots, you can still claim your game has a large player base. lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was fun until they removed or cut down on solo content and smaller group content.\nEverything is to focused on big factions that just push out any newcomers.\nWas great while it latest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy a lot of aspects of this game allowing creative freedom with builds and play styles. HOWEVER, in my very specific case I went to somewhere i had never been before in the mists called Brecillan, and without realizing it, it pretty much traps you there and either forced you to pay a crap load of money depending on the gear you hold (700k in my case) I could simply not afford that and had to try the other route. The Unstable road portal took me to a black zone where I was almost instantly attacked my literally 16 people and killed, losing all my stuff in mere seconds that I had spent over 250 hours to get. The Brecillan city part of this game was designed by someone clearly missing vital parts of their frontal lobe and I honestly cannot recommend this game to anyone else unless badly want to waste their time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is fine, but the overall community itself is horrible. My first time playing the game and everyone was already arguing, being sexist, racist, homophobic, and just horrible people as a whole. I do not recommend the game due to that alone. Being part of a game with that horrible of people playing it is not something anyone should be stuck with. I cant even turn off the chat, so its not like I could just ignore it like I would normally.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is littered with Bots RMT and hackers. Play at your own risk.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The strangest thing happened... I played the game, reached a distant area, developed my character, and was enjoying myself... and suddenly the servers stopped yesterday and my character was deleted... so of course I will delete the game and will not download it again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The moderation is trash got muted really long time just cause using other language no warning for second mute 5 hours of mute is desperation the mods also quite singy they didnt help me at all in ticket support and most of them are toxic also they dont give a F about people tlaking about sexualized words or any toxic F or S word which is quite unfair cause how long i got muted not because im toxic but cause i used 2 words from different language",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every solo pve activity is gutted to the floor. You cant even make your investment back. For example you do 15 min dungeon. and final boss drop 8.000 silver. Only way to make decent income as a solo casual player is farming gatering which is imo in game slavery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "An MMO that lacks the chill RPG grind. The PVE content is as barebones as possible, a heavy focus on PVP & running with groups to obtain progress in any reasonable way just kinda sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started playing one week ago or so. It's your typical addictive grind. I enjoyed the game, but the general chat is filled with the kind of garbage that makes you lose all hope in humanity. One new player recalled that back in the day MMO players used to be friendly. Calling it a toxic community would be a kindness, as there is no community. Switching to a different tab helps, but creates a feeling of loneliness. I don't want to waste my time in such an environment. According to \"the community\", uninstalling the game is the end-game for a solo PVE player. I think I'll take their advice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a great game that does not respect your time because it takes forever to do anything lots of grind involved not the game for you if you have a life and want to also have time to play more than 1 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actual hot garbage. I had played this before for probably the same amount of time elsewhere and decided to give it another try. Had to reset my password, which requires the name of a character on the account to do? Anyway, I get my 3-letter character name hint and eventually work out the name and get my password reset, only for them to just be like \"Well, you've used this account outside of Steam, so therefore we can't link it to Steam.\" Wow, that's about some of the dumbest shit I've ever read in my life. So, against every part of me screaming to just give it up, I make a new account and finally get in game. What an absolutely mediocre game this is. It's like they couldn't decide whether they wanted a full MMO or to just make it mobile garbage, which just kinda made it even bigger garbage. Now I went to uninstall, only to realize that achievements just straight up didn't trigger. I never got the achievement for fixing the ship in the prologue and the achievement for getting 1000 fame from killing mobs literally says \"1000/1000\" but I somehow don't have it? This game is an absolute waste of time. I wish I could get a refund of the time I spent giving it a second chance that it never should have gotten.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "imagine having 15 people on a single 4.4 node at 2am eastern. Game is going to die off the 3 guilds that rule the entire map.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got a 6 hour chat mute for saying, and I quote: \"Aint that fraud\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Constant disconnects, no LatAm server, bad power progression, T4 seems like T1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i can safely say that this game sucks ahh\r\nyou'll have to trust me cause i have 2765 hours on this trash currently",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just purely fucking bad no other ways of saying it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shitty pvp too much grind and pay to win game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No transfer?! WTF dumb devs. It's not like I wanted to play in U.S to begin with. Thats the only server you had, why cant I move my char??? Delete",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I haven 't been hooked since the very beginning of the game .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stop spamming the steam home page with ai slop thanmks <3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ALBION ONLINE IS AN ONLINE MMORPG WHERE THE PLAYERS EFFECT THEIR SURROUNDINGS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate click to move what is this fucking 1992? Lame design decision.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just an ass ugly looking game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cool game but a pay to win one .. :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got banned for no reason",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just play osrs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SO MANY SCAM PLAYERS .... ONE WAY OR ANOTHER ... SCAMMER ALERT!!!!!!!!!  .. THEY FRIENDLY FIRST .. THEN THEY SCAM .. INDIAN / INDONESIA PLAYERS THE MOST .. DARK COLOR .. DARK MINDSET ..",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Barton wruc prosze",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my account randomly got deleted out of nowhere",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Reconnecting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A dozen better MMOs out there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fucking trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "na maikati tupata igra",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash-Slop-Game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No Cinema",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "khoshome naymad\r\nkon paregi ziyad dare",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Net",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]SHOULD YOU START PLAYING ALBION ONLINE IN 2025?[/h1]\n\n[i]I downloaded the game on Steam just so I could leave this review (I've been playing on the native client since closed beta 2016)[/i]\n\n[h2]First, I want to address a few of the things this game did well:[/h2]\n\n1. The pvp is exceptional, metas change frequently, but nothing game-breaking. There's solo, group, zvz, faction warfare, and countless other options for both lethal (full loot) and non-lethal (not full loot) pvp. The game feels great, and it's highly rewarding and exhilarating to pvp, losing everything upon death. It's not for everybody, but it's a core aspect of this game.\n\n2. The game runs very well considering there's only one server for entire continents. I play on the NA server, and it's based in Washington, D.C. - I get decent ping. \n\n3. The player-driven economy is a unique and well-planned feature that separates this game from most other MMORPG's. The fact that you can be a trader who buys items in one city and travels to another city to sell at a profit is interesting and adds to the \"you can be whoever you want to be\" vibe this game goes for. \n\nThere are other great aspects of the game, unique systems and positive experiences I could list that span my ~6 years of playing, but I'm going to cut right to the chase.\n\nIf you are a casual MMORPG enjoyer who wants a fun game they can sink a few hundred hours into, maybe get some buddies to hop on with you and do some group dungeons, gank in the red zones (full-loot pvp which required you to flag as hostile; allowing others to attack you as well), or gather resources and have a chill farming simulator experience - this game is for you.\n\n[h1]**HOWEVER**[/h1]\n\nIf you are a semi-hardcore/hardcore MMORPG gamer who wants to maximize your profits + do endgame activities, DO NOT EVEN BOTHER. What I've witnessed over the past 6 years has been one of the most abhorrent examples of ultra-capitalist monopolization of power and resources I've ever experienced. \n\n[h1]Let's get into the biggest issues plaguing Albion Online:[/h1]\n\n[b]1. The cartel:[/b] Yes, you read that right - this game has a cartel. A group of the most powerful guilds who are all in communication with each other via Discord servers and group chats, who horde rare mobs (such as the old one's mammoth worth hundreds of millions of silver potentially), entire zones of resources (Tier 7-8 zones are completely wiped of the rare resources because they're controlled by the huge guilds), not to mention the entire in-game economy. Yes, they manipulate the market so much so that these cartels actually make real-world money by selling players things like silver, information obtained through cheating and API manipulation, and artificially inflating the prices of key resources, gear, and items, so much that the average player will never experience all the game has to offer. \n\nIt's comparable to a corrupt government corporatocracy that bails out the elite <1% and hoards the resources for themselves. They abuse the market by utilizing information obtained through 3rd party API's that SBI (Sandbox Interactive - the developers) know about but don't do anything to stop, such as the Albion Online Data Project. This is data uploaded daily, which contains the entire active marketplace, which an AI analyzes that tells \"the elite\" which resources, items, and equipment they can craft, flip, buy, or sell at the highest profit. This means that certain items will completely disappear from the shop in certain cities, only to be dumped at another city, netting these cartels HUNDREDS OF MILLIONS of silver PER HOUR. \n\nAND THEY DO THIS ALL DAY.\n\n[i]It's cheating, plain and simple. [/i]\n\n[b]2. Botting:[/b] This is an issue in almost every MMORPG, but in Albion, SBI makes no effort to actually stop this from happening. If you're an AO player, you already know about the fishing bots. Bots that sit in zones and fish 24/7 netting millions of silver in profit, players run these bots through a program called \"Geforce now\" by opening multiple instances (not allowed under normal circumstances), and the worst part - they'll have these bots sitting on a separate instance, sometimes as many as 5-10 bots sitting in entrances to zones waiting for transportation players (players who are carrying a large amount of resources, items, or equipment that are on their way to trade them for a profit in another city) and will have a bot scan their account, and ping their entire guild that a \"juicy target\" is in XYZ zone and that they can gank them. They do this daily. If you've ever played and seen a naked sitting on a transport ox by the exit, standing still, that's a bot doing this, looking for their next target. \n\n[b]3. Hackers:[/b] I'd say that at least 25% of veteran AO players use hacks of some kind. Take that figure with a grain of salt, of course - but if someone is a veteran player, they've either cheated or know someone who has. There are ESPs that people abuse to be able to see farther than they should, speed hacks, movement, range, boundary crossing (invisible wall no-clips), scripting, and, worst of all, dungeon scanning.\n\nDungeon scanning is when a high-level cartel member will buy an 8.3/8.4 group dungeon map (basically a map worth millions that they can consume that shows them the location of a tier 8.3 (highest tier - 8, and lvl 3 enchantment aka 8.3) group dungeon, to which they will use a hack to tell them the rarity of the chest. They spend all day looking for a legendary chest (anything but legendary isn't worth it) and once they find it, they clear the dungeon in mere minutes, and net anywhere from 150-250 MILLION silver in profit, usually split among only ~5 people. This is why you can never find these maps for sale on the marketplace: the cartel buys them up and abuses them, trashing the ones they don't use - artificially inflating the price and gutting the entire supply.\n\n[b]4. Bad Support:[/b] SBI is aware of all these issues, and not only do they do nothing to combat them, but they deny these issues exist, and silence those who speak out. There's also unjust/toxic favoritism from SBI towards certain creators and players.\n\n[h1]IN CONCLUSION[/h1]\n\nIf you wish to play this game at a high level, your only option is selling your soul to a guild that requires you to grind for 6+ hours/day, who will not only openly use cheats, bots, hacks, API manipulations, and dirty tactics, but they will deny the mere existence of these issues/exploits, and will continue to profit billions of silver a day by stomping on those too ignorant to be aware of their control. It's such a large disparity between the ultra-wealthy and the average player that these cartels have inflated the price of silver. (Silver is the native currency of the game, and gold is their version of v-bucks, which can be exchanged for silver in what's basically the stock market) There are issues here too - these cartels use spreadsheets, AI, API's, programs, bots, hacks, and even inside sources to SBI themselves to profit, keep you weak and penniless, while staying completely under the radar of the average player. \n\nTo call them the \"illuminati\" would be fitting - that's the level the corruption and abuse go to. \n\n[h2]BUT,[/h2]\n\nIf you wish to play casually for a few hundred hours, chill with some friends, gather + craft purely for fun in safe zones, you'll absolutely have a fun time, as long as you're content with [i]never ever, ever,[/i] experiencing the high-level content the game has to offer.\n\nMaybe if you spend 100 hours of just grinding efficiently, selling your resources, and flipping high-quality gear, you can make a few hundred million silver. Maybe. You can spend it on a single high-quality gear set, only to lose it in full-loot pvp by the cheating scumbags that have ruined a game I once loved. \n\n[i]If you're playing casually, give it a shot - it's fun with friends.[/i]\n\n[i]If you're playing for a hardcore experience - good luck.[/i]",
      "voted_up": false,
      "votes_helpful": 405
    },
    {
      "review": "You will spend a lot of time grinding peacefully to get that premium. You will level up your gathering skills and hone your instinct to dodge gankers that lurks in the red zones. But at the end of the day, some player will use 2 account, 1 to scout at the entrance of the map (not hostile) and the main account will gank you using the gained information. Inventory lost. Time wasted. Wish I could turn back time and never played this game.",
      "voted_up": false,
      "votes_helpful": 112
    },
    {
      "review": "If you think to start playing Albion 2025 -- just don't. Seriously, find something better or go touch the grass. The game is not bad, really. But it's getting worse and worse as you progress. I'm too lazy to explain it all, just go watch SwoleBenji @ YT if you like. Video named \"Albion Online Is In a Bad Place Right Now...\". He overdramatize sometimes but the general take is fair.\nIf you're playing it for a few years already like me -- my condolences. Today I've deleted this piece of software and my char and I'm happy. Wish y all the same. Gl hf!",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Couple days into it and already leaving.  Dungeons are not worth it,  EXP, loot is just TRASH!  Next anywhere good loot is, your forced to pvp.  The PVP is 4 on 1, no way to win.  The game is hidden behind a pay wall.  To even progress decently you have to buy their pass.  Yes other games have a pass, BUT if you do NOT have it on this game your going to feel the pain with exp and your board.  A normal games Pass just gives you loot, and some mats.  Now, being that this game is older.  Good luck trying to find groups for content, party finder always says 0 for groups.  Save your time and energy, buy a regular MMO that is not MICRO transaction.  Good luck and enjoy this cluster of a game.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "As a new player, the worst outcome when running black zones, is getting jumped by gankers, 10 ppl ass teams, or literally maxed out players with maxed gear. Now just imagine buying loot of average of like 120k, and running some mist TIer 5 zones, and getting jumped in less then 30 secconds by a quarterstaff tier 8.4, with and full leather maxed armour :((",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "albion online... was a good game...\n\nUntill...\n\naccused of third party trading and banned untill the year 2225.\n\nmultiple attempts to prove my innocents have been ignored. \n\nonly ever suppoted albion only ever purchasing threw there in game store.\n\n-100/100\n\ngreat game\nHORRIBLE SUPPORT TEAM.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "if you are a solo player this game is not for you..for the best loot you will have to go to the black zone pvp where a group from the same guild will always be waiting for you, kill you and take the loot..the game is fun if you have friends but if you are solo you have absolutely no chance..don't waste your time...",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "This Game is utter Sh*t i started out playing you get no progression early game without Paying for the premium pass okay ill do it once i get a little bit more progressed try more advanced but still \"easy\" stuff i get into the blackzone buy my first set get spawn trapped as soon as i use a \"S.A.F.E\" portal by 3 guys with sets worth 5m+ okay whatever second try i see a guy wearing a cheap set he attacks me and i commit thinking ill do something and get some loot for once gets jumped by a maxed setup or some stuff idk okay whatever try and go in the mists i try to do a camp see a enemy instantly runs he and his duo follows me to the death and i loose all my stuff again can they make it any harder for new players in this game? i mean i am literally uninstalling bc of these unfair game mechanics bc there is no area in the game that is worth doing for solos without being camped or absolutely sh*it -1/100 do not recommend if you like these kinds of game go play something different must f*cked game i have ever played",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "This game is a complete garbage, Its pay-to-win. Also their support is terrible, I submitted few support requests, and they didnt wont to help me, where they where able to. Funnily enough it was always their \"senior\" support technician named Rio. Don't play  this garbage, Dont  give them any of your name.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You cannot play this game alone. As the game progress, it really punished you if going to red or black zone. As someone who play casually without friends in this game, going to tier 6 is really hard. You gonna get gank everytime you step in the zone. Furthermore, it is really a pay to win game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Albion Online não é um jogo, é um pesadelo virtual. Ele transforma cada segundo de tentativa de diversão em frustração pura, com grind interminável, mortes cruéis e PvP que parece projetado só pra te humilhar.\n\nPor que é horrível:\n\t•\tMorreu? Perdeu tudo, incluindo seu orgulho.\n\t•\tJogar solo é suicídio; sem clã ativo você não existe.\n\t•\tPvP é sadismo puro, onde veteranos te esmagam antes de você reagir.\n\t•\tEconomia manipulada, cheia de monopólios e preços absurdos.\n\t•\tGrind infinito para fabricar itens que você provavelmente vai perder na primeira batalha.\n\t•\tCurva de aprendizado impossível, menus confusos e tutoriais quase inexistentes.\n\t•\tRecompensas pequenas e facilmente destruídas por erros.\n\nResumo final:\nAlbion Online odeia você. Não é divertido, não é justo e não vale seu tempo. Se você gosta de sofrimento virtual, então… talvez você encontre um lar aqui.\n\nNota: -10/10",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't even bother installing this crap, it's just a massive pay-to-win cash grab, no major updates ever since, just releasing a bunch of ugly skin bundles, haven't resolved the premium increases and other problems in-game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refuses basic customer service like unlinking from your steam account or changing old and unused email addresses.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a PvP-centric game, and there are no PvE servers.\nEven though there some PvE zones, that's not good enough for me. \nThe best materials are in the PvP zones, and you'll get instantly killed if you step foot there.\nThe community rejects even the notion of PvE servers, because if that happens, only the griefers will be left to j*rk themselves in those PvP servers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Cool game with a really in depth economy. Rewards dedicated players and balances it with a mechanic with rogue-like inventory loss on death. The new player experience is tedious and pvp is limited since you have nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are looking for botted economy, unbalanced game, community managed by few AI obsessed moderators, a game right for you, especially if you look for a progression without any actual goal besides the changing number next to your gear.\n\nAlbion, a game where even watering your plants is put behind a paywall.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is generally nice, however it DOES get boring and more boring as you play, things are expensive and other stuff. I recommend playing with an experienced friend if you have one.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game had so much potential before all the cheats/bots took over now it's just a matter of who has the better cheats and scripts. Would never recommend anyone play this game ever again. Don't care if the devs finally decide to fix things either it has been more than a year of this mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "GRIND. So much potential and promise, but I lost interest quickly once I realized that there are no groups queuing for low level group dungeons. Everybody else is already high level and the game naturally pushes you toward PvP as you approach end-game (I'm not a PvP fan).\r\n\r\nGRIND. Game is manageable as a solo player, but the rate of \"doing everything yourself\" (gathering resources, refining them, crafting them, using them in combat) is intentionally very, VERY slow. This MMO really MUST be played with friends.\r\n\r\nGRIND. If you don't pay for premium, everything is effectively 33% slower. Manageable, but the game still feels like a slog. I want to get into the game and the lore and explore the world but... it really just kind of feels like an idle game with extra steps.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not support games that you can lose all your gear to folks when you die in pvp zones. Its why I didn't play runescape. Its why I will not be playing this any more. gg I do not know how this game is still as popular as it is with this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Open game, get money, get killed, lose all money, Repeat.. that's the gameplay if anyone is wondering",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I dont recommend playing this game as of 2025.\nIt is heavily grindy and shop prices are ridiculous.\nIt was a good game before it was sold to a stillfront group.\nNow it is a shitty game developed for monetization purposes, existing solely to fulfill lucrative bonus to CEOS.\nNo, dont play it. Waste of your precious time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Albion Online 2025. This game is a dumpster fire. There is no self reward in this game cause its literally ran by BOTS that keep the market flooded. Learning points are a scam to speed level up your tools for gathering then you find out wtf did i do that i can craft now but your no way gonna compete and make money on the BOT FUELED MARKET. The premium has skyrocketed from 4 usd to 16 usd in such a short period of time why you ask cause the game is going downhill with the new dev team. So to make money they hiked the premium price play the game for free min if you wanna swipe sure do that premium but not needed. If you wanna make silver in this game and not waste your time do FISHING youtube bercelin city rep farm that to get to BERCELIN. Then with your t3 pole hop in a safe t5 mist and fish your brains out. Once you stockpile bring to the buthcer CHOPPED FISH stacks 999 sell like hotcakes for 245k or more on market and fill only t6 fishing journals and sell those. You dont need to swipe for learning points wtf speed up your tools thinking your gonna make money but you cant compete on the market. If you do islands only do farm plots and stock pile carrots and sell those on the market dont bother with the other stuff its a waste. So if this is your type of game crafting is ass backwards you ex for a t5 weapons need that t5 wood but to craft that t5 wood you need t2 3 4 to craft that t5 so get ready for a grind. If you wanna craft just do skinning and fiber make BAGS go as high as t5 its all you need make gathering tools dont pipe dream for that t8 cash flow not gonna happen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the worst MMO I've played to be honest, I tried to get into this with friends on 3 different occasions, didn't stick any of them, it's just really boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool game, well designed, and fun to play...  at first...  Then you realize that going solo to do anything outside of green and yellow zones is essentially a death sentence.  If you have a group of friends to play with though, you'll probably love the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very difficult to play solo without getting jumped by a massive group. Plus they keep nerfing things that solo players can do to make money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs are brain dead actually.... I pressed esc when game was laggy on main menu... It deleted my character. So stupid. Not playing this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Once you get hang of the game you will be eventually banned for RMT with no proofs provided . SO IF YOU ARE PLAYING THIS GAME DO NOT EVER TRADE WITH ANYONE USE ONLY MARKET.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've genuinely really loved this game and a lot it has to offer from a MMO side, actually it has insane potential.\n\nHousing is cool, farming is a bit tedious and can be improved, I think there's potential to add a lot more mini-games, graphics are very pretty and combat PVE is very fun and engaging and builds are also okay-ish for its own game. However, sadly, I find myself realizing the emphasis on PVP content just ruins this game for me and my friends, evidently, this game really just is League Of Legends with extra steps and grind before you actually fight someone either to lose all progress, restart and repeat. It gets tiring because I think this game has INSANE potential to be one of the best MMOs out there but this hyper focus on PVP, not implementing good PVE focused content like raids, build variety, focus on different class systems (Tank, DPS, Support for PVE), loots to build your gear around, etc, is what truly holds this game back.\n\nIf you are a fan of the game's soft sandbox experience and PVP focus gameplay, more power to you but I just wish this game wasn't League of Legends in a dungeon/open world simulator, crazy potential but lost in appealing to \"whales\" and sweats. Oh well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't play your game because I got a new laptop and I don't know the email that I had to use in order to create an account even though it is linked to my steam account.   You also leave no possible way to fix this.  Well done on taking actions to eliminate your player base through your brilliant UI design.\n\nUninstalled and deleted from existence.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "one of the most boring games i have ever played i don't like the premise i get that it's all about farming and getting better gear but that gameplay loop is too boring for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just realized this game has kernel level anti-cheat. I can't trust anyone who doesn't tell me exactly what access they are using and what they are collecting on my computer at any moment with kernel level access, no matter how much I enjoy the game. It's also not safe, I don't trust that an exploit won't be found because of this anti-cheat. Going to miss it!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a fun game that has a lot to do, like being randomly killed by another, much more powerful, player while trying to hunt. Your equipment takes a 5% drop in durability, drop some silver, wait a minute or two to revive, repeat. \r\n\r\nI really enjoyed and looked forward to logging in everyday but I'm not going to play anymore due to the non-consensual PVP that we can't opt out of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I honestly found the experience disappointing. While the sandbox MMO concept seemed promising, I quickly grew tired of the repetitive grind and shallow gameplay. Playing solo felt especially unrewarding, most of the content pushes you towards joining big guilds or alliances, which made me feel sidelined and left out, something other MMOs don't seem to do.\r\n\r\nThe combat system was another letdown. It felt basic and didn't offer much strategy or variety. Crafting and progressing started to feel monotonous, as there’s little that makes your character or gear feel unique. On top of that, the game's economy seems plagued by bots and silver inflation, and there’s a strong pay-to-win vibe as premium features keep growing.\r\n\r\nDespite early excitement, Albion Online ended up burning me out. The developers don't seem to address balance issues or player feedback very much, and overall I just stopped feeling motivated to log in. It’s not an experience I’d recommend to anyone looking for a satisfying MMO adventure.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried it. Not a fan of the elementary combat system, the design of the game, the clicking to move or the babying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is ass and should NOT be allow to exist.\n\nThis game is PvPvE Server ONLY with zero PvE Servers and you run the risk of losing EVERYTHIGN that you worked so hard to create and build, which adds more to the bullshit of this rage quitting game.\n\nYou should avoid this game like the plague if you do not wanna have to go out and buy a new keyboard.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}