{
  "positive": [
    {
      "review": "After spending almost 500 hours playing this game, some impressions have been collected. The game is good, not the best, but it's good. The flaws of this game were most noticeable to me at some lower levels, because let's say if we decide to fish only on the bottom, when I get to the old burg I can only fish for bream and tons of bream, as I progress further in leveling, maps are opened to me that are exclusively tied to cheating and float, only in amber I can fish for carp, but I don't have the equipment. So I go back to bream and just bream, it's frustrating. Why isn't there a certain type of fish on every map that is active and that we can earn money on, without having to fish with a float or lure. Another thing, when I open copper lake, I collect equipment. I still don't know what to do. There are no other maps where I could fish for carp, and the intensity of fishing is the same or at least similar to that on copper. As a carp fisherman, I am not interested in the sea. Amber is a dead map, akhtuba is here and there, but it has to wait for a very long time. At this moment, copper is the only map that at 29+ level brings some concrete profit. Why don't you add some new maps so we can rotate and fish nicely, or simply activate amber and add at least one more map. That experience would be great. Another thing, we would like to be able to see at least our friends while fishing on that map,means that we have visual contact with them, to see how they fish.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "its very good and very good nice too play because it feels like youre fishing in real life",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "very high quality game peak life experience i dont have friend anymore i just fish all day",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best fishing game in my honest opinion. Takes alot of time to grind but as soon as you get the gear required for carp and catfish the game becomes fun,",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if you like Grindy realism games then this is for you, lots of different species of fish with many different type of ways to catch them, ranging from a couple grams to over 3000 kg shark, There's no gate-keeping for information, great helpful community, the most generous I've seen on any game that I've played, all u need to do is ask for help and you will gain a lot more than what u asked for, great experience for a fishing sim",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the most immersive and rewarding fishing sims I’ve ever played. The attention to detail—weather, tackle setups, rod action, fish behavior—makes every catch feel earned. The progression system is slow but incredibly satisfying, and the variety of locations keeps things fresh.\n\nWhat really stands out is the depth. Every lure, hook, line, and knot actually matters. Experimenting with rigs is half the fun, and landing a trophy fish after tweaking your setup feels amazing.\n\nThe community is friendly, the dev team is active, and the game keeps getting updates. If you enjoy realistic fishing and don’t mind a slower-paced, thoughtful experience, this game is absolutely worth sinking hours into.\n\nRating: 9/10 – Highly recommended for fans of realistic fishing sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game and realistic but sometimes you are stuck and dont know where to go to catch fish with no directions or a clue but overall good game.maybe some hints would be good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just play this game while watching netflix or HBO max and you can sink a lot of time into it. I have a steam account dedicated to this game with 1100 hours on it, and for all of it, except maybe like 100 hours, I was chilling with a tv series or podcast on in the background. \r\n\r\nThere is a particular depth about this game that will have you addicted once you start to figure it out. \r\n\r\nAlso, don't by stupid useless stuff at the beginning and ask oldheads in the discord for advice on purchases, along with mech weight once you get better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best fishing sim mmo rpg, very grindy game but very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game to relax  great grapthics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game but f the penalty pond i got it rn and i cant get it off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty good, can be grindy at times but best fishing game out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent hours playing this, got mad when I was in the boat and went to go complain. When I couldn't complain I went and drank vodka under the stars while the gizzard shad in my keep net watched in horror. 250/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great, chill, relaxing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "delivers a calming yet engaging fishing experience with realistic mechanics, beautiful environments, and the kind of slow-burn satisfaction that keeps you hooked for hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so relaxing and amazing. I thnik everyone should try this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game i can't go lure fishing in real life but this game makes me fell like i am lure fishing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very beautiful game. It's very similar to reality!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On the surface this is a cozy, relaxed fishing game where you can just sit back and catch fish. But after playing for just long enough to be introduced to the massive community this game has, you learn just how intricate and detailed everything is within the world of Russian Fishing 4. Line diameters matter, lure colors matter, water temperatures matter, weather matters, everything that can change about your equipment or environment can affect your fishing. If you are someone who loves to stress the details, and experiment with different strategies than what others take as the \"standard\", then this is a game you will love. The game balances progression and location together, keeping water bodies that would have fish too strong for your level locked away until you're ready. The micro transactions are not pushed heavily, and where they are pushed, they provide a significant boost without feeling cheaty or undervalued, if you have a steady income and are willing to spend money on pixels, you will not find much issue with these. The last part I would like to add is the trophy fish, the way this game rewards you finding the \"correct\" rig/lure/bait is fantastic, horns and bells and a big golden tag, along with unique models for the trophy sized fish is perfect!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good chill game, Nice players. Little to much of grind)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love that you can just relax and chill, wait for a bite, or if you dont have anything to do just go fishing actively, its not a fast progress game which i like, if you want to catch nice fish you have to play alot tho, still love the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best fishing game, realistic and very fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak fishing, grinding may take a bit, but theres not really much to do. you slow down extremely in level 22 ish, and progress became something about just finding spots and hooking in trophies. silver is secondary at this point, because you now unlock taran fishing spot that can bring you 500 silver an hour",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ama dobra igra ,samo da ju odrzaju takvu koliko toliko i bit ce sve 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The RPG aspect to the game is nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great time to spent whit friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beatiful Game, Most realise fishing game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very relaxing game with a lot of fun !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Barely any of the fish actually speak Russian",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best fishing game i've EVER played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best fishing game u can ever find",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill, but pay to play to progress",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY ADDICTING ME FISH ME HAPPY YES HAPPY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic and enternaning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "soda pc and this game is 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good but i have much of a tiktok brain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Detailed game, pretty decent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best fishing game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and relaxing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best fishing game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "мой батя играл раньше",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best good games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best fishing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W fishing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game  <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best fishing\r\ngame ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very high quality game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my new favorite game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get fish\nbig fish\nfish jumps out of the water\nleader broke \nfu*K",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Moerse grind die kak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good one :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "veri gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best fishing game. very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST FISHING SIMULATOR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chilling n \"relaxing\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAMES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just like fishing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u like fishing this game is for u",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FANTASTIC GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Рыбалка чоткая просто",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best fishing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GOOD GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get fish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fiash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gring sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fishscale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "crap la 7 kile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "хорошо",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yum",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kai kimb zjbs",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Has energy & hunger system in a casual game which doesn't tell you what food gives, it tells you to go to their website to learn more & the tutorial shows you 2 fishing methods but not that there is an energy & hunger system, not even how to recover them at all\n\nI almost was enjoying the game, then I saw the skills, was able to upgrade to dig up worms, because that sounded cool, so I got all 3 upgrades for that, okay I needed a shovel, went to the hardware store & wasted $38 on a shovel, okay lets get some worms, after digging I got a worm, but you know what, it drains all my energy to extremely low to almost deplete\n\nI drank some lemonade & ate some bread, I have no idea how to increase my energy at all & the game never told me how\n\nThey have tooltips on the items in the store for each food & drink, but nothing states if it restores energy or hunger & not by any amounts either\n\nSo in all that, I don't like this game, it's not casual & it's a stressful game to deal with when it doesn't give you everything to know how the game works, it didn't even tell me it was going to drain all my energy using a shovel, what's the point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was great for the first couple days, now nothing bites and you cant progress at any decent rate. Same baits at the same spots and it gets slower and slower.  All these games have the same problem endless grinding with no hope of doing anything interesting.\r\n\r\nDon't waste your time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not recommended - the loading times can be long after the tutorial level and most of the time nothing happens and even when it does it is just a fish model.\n\nThe loading times get shorter when you replay the same levels, though the problem of little payoff for your time remains. The game seems to slowly reload the graphics if you change the graphics setting, so be prepared to wait.\n\nIt is a much better idea to watch someone else's gameplay videos of this game. That way you can skip the loading times and the long periods of time of nothing happening. Apparently the fish becomes rarer to come by later in the game.\n\nIt has the same problem as most other realistic job simulators - if you are going to put effort into playing it, you are just doing a job without being paid for it like a complete fool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games really buggy and also not helpful with the settings if you are on pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for almost 400 hours, yet not a single russian has been caught. This is false advertising and my lawyer will take action.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The early stages are rough. This game is super boring. I'd rather just go fishing irl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Крайне странная игра с точки зрения симулятора рыбалки\r\n\r\nНемного о багах, которые я заметил за время игры:\r\n- Леска путается в ногах\r\n- При подборе удочки с открытой катушкой, она сперва закрывается, а потом открывается\r\n- В рандомный момент полностью пропадает клёв, проблем с интернетом нет\r\n\r\n\r\nИногда админы просто перезагружают сервера без уведомлений\r\n\r\nА в целом надо просто поиграть и там уже решить, настолько игра нормасная. Но в ней много гринда, а если гринд не хотите, то платите за премы/предметы\r\n\r\nАдмины иногда творят самосуд, был отправлен на штрафной пруд раз 20 уже, 1 раз за мат, 19 за стимдек (но пришлось писать им на мыло, что они не правы)\r\n\r\nЕсли сидите с стимдека, то вырубайте все оптимизаторы, вырубайте dxvk-async ОБЯЗАТЕЛЬНО, gamescope, админам пофиг, что вы на линуксе, для них эта штука = читы, а за читы на прудик",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I came back to give this game a serious try and invested 2 weeks and about 100 dollars buying gear and premium in their shop. But fak no! Game deleted now. \n\nThis game has the most toxic forum with devs that only pander to the fanbois. I had an issue a few days back with the game suddenly giving me \"server error\" and \"contact support if this continues\", and then crashing of the game while I was reeling in a big fish that I had spent about an hour in real life on! Having to fight a fish for an hour in this game is very very exhausting!! So I tried to do what the game recomended and posted on the forum asking what had just happened and why the game crash. And then instead of being adressed by a dev or moderator, I was attacked by a couple of brainless fanbois who started plastering me with insults. That it was my own fault for creating server issues and crashing the game. That I was smashing buttons and that tthe game crashing is in reality a feature and other such nonsense.  The arguments between us got a bit heated, someone obviously complained and a dev came and told us to be quiet, deleted some of my comments and locked down the thread without answering my question to why the game had crashed. No mention of lost game time or compensation or any of that. Just a blank ignore.\n\nAnd then I read about other gamers who the longer they play the more they regret hundreds or thousands of hours invested into a company that banns players left and right, nerfs the fishing over and over pushing people to spend money on gear out of sheer frustration. This is not gaming for me. Not gonna support such a company. Seems very unprofessional. I will take my money to other games.\n\nDon't even care to go into all the pro's and con's of the gamplay. I'm just done with this one. I wish all the free games would just dissapear. They often have such trash communities that are poorly moderated, like this one talks of a profanity filer in the chat. but allows for the most sexually vulgar gamer names, which the devs don't even care about. Lol... They have a trash pay-to-not-win monetary system, cause there is nothing here to win, but pay-to-get-a-head-of-the-mindless-grind-scheme. \n\nI'd much rather just pay full price for a game or a monthy fee than this scam of a game where everything is designed to drain your time and money.\n\nSad really but there it is.\n\nGood on you devs! ;) I hope you game tanks before reaching full release. This still feels like a Beta to me.\n\n\n\nSo, an hour after writing the above I got into an argument with the dev that had locked my first thread down without ever answering me. He answerd on my second thread giving me a final warning telling me that I had already received answeres, (from those two fanbois who accused me of me probably smashing the keys on my keyboard and thus stressing the server to the point of it resulting in an internal server eror and a game crash with loss of game content.) But I didnt know those two bozo's were representing the dev team. I thought they were just two fools ganging up on me...Lol. I asked why he never gave those two that were mocking me and speaking condescending about things that were not true a warning. But he never answered to that. Instead I received a permanent ban! Lol. \nBut the answer he game me now about package issues on my end, never the game servers end, regardless that I have no connectivity issues in other games, I said nobody had told me about before he now said it. So how could he say that other people had already given me the answers to my gamecrash, that I just didn't want to accept?? Just a bald faced lie and attempt at manipulating me into a corner. So I told him what to do with his warning and the result came promptly::))\n\n\"You have been permanently banned from the Russian Fishing 4 Hub.\nYou were banned by a Russian Fishing 4 developer.\nReason: \"Insults and false information's \"\"\n\nFALSE information!?! Hahahaha... I was giving who false information about what?? Sure I insulted the dumb dev. And I know he got the message. But me giving false information? I was the one asking about the gamecrash and what it meant. How I could have done things diferently. I never had any business to give out information. The fanbois were feeding me informations about stuff they knew nothing about. The only ones who were dealing in information was the dumb dev and his fanbois.\n\nOh well... who cares now.\n\nSo this is the company you are dealing with here. Better tread lightly if you plan on playing this game. You are now all officially warned! ;)\n\nCheers all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is no way to play with your friends. you can chat with them but not fish next to each other.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got blocked for no reason after not playing 2 weeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no playing with friends so you can see each other",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hope yall die. Fishing Planet better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "where are thr russians",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 4,000+ hours (this is my alt), I can say RF4 has the most absurd monetization I’ve ever seen. End-game gear runs $500+ for a single reel; mid-tier is $300—and you need three reels and three rods. Your choices: drop thousands of dollars, grind thousands of hours, or both.\n\nThe community is more toxic than that of Rust and the moderation? They don’t care. You can be banned for basic criticism, and appeals go nowhere. Security on the standalone (non-Steam) client is a joke, don’t even get me started.\n\nThe only reason this game has the player base it does is because it has zero real competitors. If another fishing sim shows up with mechanics even close to RF4, this game’s population will evaporate. People think EA or 2K are bad? FishSoft makes them look charitable. Even Star Citizen doesn’t touch these gear prices.\n\nVerdict: Incredible fishing mechanics held hostage by a predatory pricing model, heavy-handed moderation, and a toxic community. If you value your time or your wallet, stay away.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "the game is bad, very bad...\nyou need second life to grind.\n\nif you unemployee, this game is for you",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game demands Escape from Tarkov-level time investment and grinding before you can truly “have fun” and catch whatever fish you want.\n\nThe developers are lazy, arrogant, and show little care for Steam players. Don’t expect to transfer your Steam account progress to their standalone client for “extra benefits,” either. They’ll simply forget you ever asked—my friend tried and was left hanging, eventually giving up on the transfer ticket.\n\nRussian and Chinese players are clearly favored. Their servers dominate global records, with rare trophies caught almost exclusively there. Seeing a world record from any other server is extremely rare.\n\nOptimization is another weak point. For the visuals you get, performance is underwhelming. The graphics were designed with 4K resolution in mind, which causes shadows and especially fishing lines to look terrible on lower resolutions. There’s FXAA anti-aliasing support, but it barely makes a difference and often reduces perceived detail on fishing lines at lower resolutions.\n\nTL;DR: The devs are lazy, the grind is brutal, and optimization is poor—but just like Tarkov, there’s no other fishing game quite like this. If you can overlook these issues and are willing to sink 1,500–2,000 hours into it, you will eventually enjoy it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has energy & hunger system in a casual game which doesn't tell you what food gives, it tells you to go to their website to learn more & the tutorial shows you 2 fishing methods but not that there is an energy & hunger system, not even how to recover them at all\n\nI almost was enjoying the game, then I saw the skills, was able to upgrade to dig up worms, because that sounded cool, so I got all 3 upgrades for that, okay I needed a shovel, went to the hardware store & wasted $38 on a shovel, okay lets get some worms, after digging I got a worm, but you know what, it drains all my energy to extremely low to almost deplete\n\nI drank some lemonade & ate some bread, I have no idea how to increase my energy at all & the game never told me how\n\nThey have tooltips on the items in the store for each food & drink, but nothing states if it restores energy or hunger & not by any amounts either\n\nSo in all that, I don't like this game, it's not casual & it's a stressful game to deal with when it doesn't give you everything to know how the game works, it didn't even tell me it was going to drain all my energy using a shovel, what's the point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was great for the first couple days, now nothing bites and you cant progress at any decent rate. Same baits at the same spots and it gets slower and slower.  All these games have the same problem endless grinding with no hope of doing anything interesting.\r\n\r\nDon't waste your time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not recommended - the loading times can be long after the tutorial level and most of the time nothing happens and even when it does it is just a fish model.\n\nThe loading times get shorter when you replay the same levels, though the problem of little payoff for your time remains. The game seems to slowly reload the graphics if you change the graphics setting, so be prepared to wait.\n\nIt is a much better idea to watch someone else's gameplay videos of this game. That way you can skip the loading times and the long periods of time of nothing happening. Apparently the fish becomes rarer to come by later in the game.\n\nIt has the same problem as most other realistic job simulators - if you are going to put effort into playing it, you are just doing a job without being paid for it like a complete fool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games really buggy and also not helpful with the settings if you are on pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for almost 400 hours, yet not a single russian has been caught. This is false advertising and my lawyer will take action.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The early stages are rough. This game is super boring. I'd rather just go fishing irl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First, fix the chatroom control so that it allows banning unfriendly players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the closest thing to actual fishing that I've played. I find myself unconsciously doing things I do fishing IRL and they're effective. The rigs you'd use to target species IRL work for those species in the game. I don't think it's an exaggeration to say that you could teach someone to fish for real by playing this game.\n\nIt's a shame, because all of the positives are buried by the heavy handed push for microtransactions. I'd happily buy an offline version of this game for ~$25 and ~$5 for DLC packs for new locations without the artificial grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "igra HUETA polnyaya долбоебы делали игру папкиным хуем и измазали всё сметанорй и ссаньем суки я ДАЖЕ зарегистрироваться не могу пожалустйа поффискте я хочу игшратьПОЖКЕЛАУСТЬСЯ ЛДЖЬфыв",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The end game is absolute trash. 2 lifetimes are not enough to complete 1/4 of the game. The blue bonuses to the gear do nothing and every purple/pink tag trophy takes a miracle to catch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has this one annoying bug that causes your fish inventory(the keepnet) to just open while your fishing.  ive looked in all the settings and not a one of them explains whats going on.  the game would be fun otherwise, but i hate being interrupted all the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "игра ГОВНО. ЗВУКА НЕТУ ВЕЗДЕ, КАМПЬЮТЕР ЗВУК ЕСТЬ ИГРА НЕТУ, ДРУГ НЕ ЗАХОДИТ, COOPERATE ГЕЙМ НЕТ. СУК. русская рулетка ой рыбалка говно я не советую. скачал игра горила говорила ой не то маудоналс. игра дерьмо, скачал игра и на кровати появилось 3 мужчины, я конечно не знаю кто они но на них не было белья. ГОВНО ПИЗДЕЦ БОЛЬШОЙ МИНУС ФУУУУ💩💩💩💩💩💩💩💩💩🤬🤬🤬🤬🤬🤬",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Крайне странная игра с точки зрения симулятора рыбалки\r\n\r\nНемного о багах, которые я заметил за время игры:\r\n- Леска путается в ногах\r\n- При подборе удочки с открытой катушкой, она сперва закрывается, а потом открывается\r\n- В рандомный момент полностью пропадает клёв, проблем с интернетом нет\r\n\r\n\r\nИногда админы просто перезагружают сервера без уведомлений\r\n\r\nА в целом надо просто поиграть и там уже решить, настолько игра нормасная. Но в ней много гринда, а если гринд не хотите, то платите за премы/предметы\r\n\r\nАдмины иногда творят самосуд, был отправлен на штрафной пруд раз 20 уже, 1 раз за мат, 19 за стимдек (но пришлось писать им на мыло, что они не правы)\r\n\r\nЕсли сидите с стимдека, то вырубайте все оптимизаторы, вырубайте dxvk-async ОБЯЗАТЕЛЬНО, gamescope, админам пофиг, что вы на линуксе, для них эта штука = читы, а за читы на прудик",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]If you just like chill fishing games with good graphics, then you'll probably like this, but if you're looking for a game to play with friends, this isn't it.[/h1]\n\nI do not recommend playing this, unless you just really like fishing by yourself. Even thought it's advertised with the MMO tag, the only multiplayer part is that you can see other people's catches in your region and there's a leaderboard as well. However, you can not go Russian fishing with your friends like one would think, which ultimately is why I wouldn't recommend this to most people.\n\n[u][b]If being able to actually fish with my mates gets added in, I'll change my review and redownload.[/b][/u]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was looking for a free game and this popped up. I do like the game's concept but when your in it. Like at the cafe you have to buy premium to view things but if you willing to spend some money for fishing enthusiest go ahead but if your just strolling for game dont choos this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I came back to give this game a serious try and invested 2 weeks and about 100 dollars buying gear and premium in their shop. But fak no! Game deleted now. \n\nThis game has the most toxic forum with devs that only pander to the fanbois. I had an issue a few days back with the game suddenly giving me \"server error\" and \"contact support if this continues\", and then crashing of the game while I was reeling in a big fish that I had spent about an hour in real life on! Having to fight a fish for an hour in this game is very very exhausting!! So I tried to do what the game recomended and posted on the forum asking what had just happened and why the game crash. And then instead of being adressed by a dev or moderator, I was attacked by a couple of brainless fanbois who started plastering me with insults. That it was my own fault for creating server issues and crashing the game. That I was smashing buttons and that tthe game crashing is in reality a feature and other such nonsense.  The arguments between us got a bit heated, someone obviously complained and a dev came and told us to be quiet, deleted some of my comments and locked down the thread without answering my question to why the game had crashed. No mention of lost game time or compensation or any of that. Just a blank ignore.\n\nAnd then I read about other gamers who the longer they play the more they regret hundreds or thousands of hours invested into a company that banns players left and right, nerfs the fishing over and over pushing people to spend money on gear out of sheer frustration. This is not gaming for me. Not gonna support such a company. Seems very unprofessional. I will take my money to other games.\n\nDon't even care to go into all the pro's and con's of the gamplay. I'm just done with this one. I wish all the free games would just dissapear. They often have such trash communities that are poorly moderated, like this one talks of a profanity filer in the chat. but allows for the most sexually vulgar gamer names, which the devs don't even care about. Lol... They have a trash pay-to-not-win monetary system, cause there is nothing here to win, but pay-to-get-a-head-of-the-mindless-grind-scheme. \n\nI'd much rather just pay full price for a game or a monthy fee than this scam of a game where everything is designed to drain your time and money.\n\nSad really but there it is.\n\nGood on you devs! ;) I hope you game tanks before reaching full release. This still feels like a Beta to me.\n\n\n\nSo, an hour after writing the above I got into an argument with the dev that had locked my first thread down without ever answering me. He answerd on my second thread giving me a final warning telling me that I had already received answeres, (from those two fanbois who accused me of me probably smashing the keys on my keyboard and thus stressing the server to the point of it resulting in an internal server eror and a game crash with loss of game content.) But I didnt know those two bozo's were representing the dev team. I thought they were just two fools ganging up on me...Lol. I asked why he never gave those two that were mocking me and speaking condescending about things that were not true a warning. But he never answered to that. Instead I received a permanent ban! Lol. \nBut the answer he game me now about package issues on my end, never the game servers end, regardless that I have no connectivity issues in other games, I said nobody had told me about before he now said it. So how could he say that other people had already given me the answers to my gamecrash, that I just didn't want to accept?? Just a bald faced lie and attempt at manipulating me into a corner. So I told him what to do with his warning and the result came promptly::))\n\n\"You have been permanently banned from the Russian Fishing 4 Hub.\nYou were banned by a Russian Fishing 4 developer.\nReason: \"Insults and false information's \"\"\n\nFALSE information!?! Hahahaha... I was giving who false information about what?? Sure I insulted the dumb dev. And I know he got the message. But me giving false information? I was the one asking about the gamecrash and what it meant. How I could have done things diferently. I never had any business to give out information. The fanbois were feeding me informations about stuff they knew nothing about. The only ones who were dealing in information was the dumb dev and his fanbois.\n\nOh well... who cares now.\n\nSo this is the company you are dealing with here. Better tread lightly if you plan on playing this game. You are now all officially warned! ;)\n\nCheers all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one word toooooo grindy \r\nIts a pretty nice game but if you need to play 100 hours + to even can go carp fishing if you can buy the overexpensive stuff you need in shop then you should go play it.\r\nMy advice install fisher online its way better then this unfair game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Das spiel ist so schlecht ich kann mich nicht einmal über Steam einloggen, es steht einfach internal error.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is no way to play with your friends. you can chat with them but not fish next to each other.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS ASS YOU HAVE TO PLAY FOR 2 MONTHS NON STOP AND SPEND 200 USD TO GET GOOD STUFF AND CATCH GOOD FISH",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pls let ppl send silver things under 5k silver and over 5k silver cost gold this is way too hard to progress now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "for me the game just auto runs backwards and i cant do anityhing about it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DOWNLOADED IT TO TRY AND I COULDNT GET THE CODE TO WORK TO EVEN PLAY THE STUPID GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make a way for players  to Set language in first screen.  Was all in a foreign language and not able to play due to this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got blocked for no reason after not playing 2 weeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no playing with friends so you can see each other",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hope yall die. Fishing Planet better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "where are thr russians",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 4,000+ hours (this is my alt), I can say RF4 has the most absurd monetization I’ve ever seen. End-game gear runs $500+ for a single reel; mid-tier is $300—and you need three reels and three rods. Your choices: drop thousands of dollars, grind thousands of hours, or both.\n\nThe community is more toxic than that of Rust and the moderation? They don’t care. You can be banned for basic criticism, and appeals go nowhere. Security on the standalone (non-Steam) client is a joke, don’t even get me started.\n\nThe only reason this game has the player base it does is because it has zero real competitors. If another fishing sim shows up with mechanics even close to RF4, this game’s population will evaporate. People think EA or 2K are bad? FishSoft makes them look charitable. Even Star Citizen doesn’t touch these gear prices.\n\nVerdict: Incredible fishing mechanics held hostage by a predatory pricing model, heavy-handed moderation, and a toxic community. If you value your time or your wallet, stay away.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "the game is bad, very bad...\nyou need second life to grind.\n\nif you unemployee, this game is for you",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game demands Escape from Tarkov-level time investment and grinding before you can truly “have fun” and catch whatever fish you want.\n\nThe developers are lazy, arrogant, and show little care for Steam players. Don’t expect to transfer your Steam account progress to their standalone client for “extra benefits,” either. They’ll simply forget you ever asked—my friend tried and was left hanging, eventually giving up on the transfer ticket.\n\nRussian and Chinese players are clearly favored. Their servers dominate global records, with rare trophies caught almost exclusively there. Seeing a world record from any other server is extremely rare.\n\nOptimization is another weak point. For the visuals you get, performance is underwhelming. The graphics were designed with 4K resolution in mind, which causes shadows and especially fishing lines to look terrible on lower resolutions. There’s FXAA anti-aliasing support, but it barely makes a difference and often reduces perceived detail on fishing lines at lower resolutions.\n\nTL;DR: The devs are lazy, the grind is brutal, and optimization is poor—but just like Tarkov, there’s no other fishing game quite like this. If you can overlook these issues and are willing to sink 1,500–2,000 hours into it, you will eventually enjoy it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has energy & hunger system in a casual game which doesn't tell you what food gives, it tells you to go to their website to learn more & the tutorial shows you 2 fishing methods but not that there is an energy & hunger system, not even how to recover them at all\n\nI almost was enjoying the game, then I saw the skills, was able to upgrade to dig up worms, because that sounded cool, so I got all 3 upgrades for that, okay I needed a shovel, went to the hardware store & wasted $38 on a shovel, okay lets get some worms, after digging I got a worm, but you know what, it drains all my energy to extremely low to almost deplete\n\nI drank some lemonade & ate some bread, I have no idea how to increase my energy at all & the game never told me how\n\nThey have tooltips on the items in the store for each food & drink, but nothing states if it restores energy or hunger & not by any amounts either\n\nSo in all that, I don't like this game, it's not casual & it's a stressful game to deal with when it doesn't give you everything to know how the game works, it didn't even tell me it was going to drain all my energy using a shovel, what's the point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was great for the first couple days, now nothing bites and you cant progress at any decent rate. Same baits at the same spots and it gets slower and slower.  All these games have the same problem endless grinding with no hope of doing anything interesting.\r\n\r\nDon't waste your time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not recommended - the loading times can be long after the tutorial level and most of the time nothing happens and even when it does it is just a fish model.\n\nThe loading times get shorter when you replay the same levels, though the problem of little payoff for your time remains. The game seems to slowly reload the graphics if you change the graphics setting, so be prepared to wait.\n\nIt is a much better idea to watch someone else's gameplay videos of this game. That way you can skip the loading times and the long periods of time of nothing happening. Apparently the fish becomes rarer to come by later in the game.\n\nIt has the same problem as most other realistic job simulators - if you are going to put effort into playing it, you are just doing a job without being paid for it like a complete fool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games really buggy and also not helpful with the settings if you are on pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for almost 400 hours, yet not a single russian has been caught. This is false advertising and my lawyer will take action.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The early stages are rough. This game is super boring. I'd rather just go fishing irl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First, fix the chatroom control so that it allows banning unfriendly players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the closest thing to actual fishing that I've played. I find myself unconsciously doing things I do fishing IRL and they're effective. The rigs you'd use to target species IRL work for those species in the game. I don't think it's an exaggeration to say that you could teach someone to fish for real by playing this game.\n\nIt's a shame, because all of the positives are buried by the heavy handed push for microtransactions. I'd happily buy an offline version of this game for ~$25 and ~$5 for DLC packs for new locations without the artificial grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "igra HUETA polnyaya долбоебы делали игру папкиным хуем и измазали всё сметанорй и ссаньем суки я ДАЖЕ зарегистрироваться не могу пожалустйа поффискте я хочу игшратьПОЖКЕЛАУСТЬСЯ ЛДЖЬфыв",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The end game is absolute trash. 2 lifetimes are not enough to complete 1/4 of the game. The blue bonuses to the gear do nothing and every purple/pink tag trophy takes a miracle to catch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has this one annoying bug that causes your fish inventory(the keepnet) to just open while your fishing.  ive looked in all the settings and not a one of them explains whats going on.  the game would be fun otherwise, but i hate being interrupted all the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "игра ГОВНО. ЗВУКА НЕТУ ВЕЗДЕ, КАМПЬЮТЕР ЗВУК ЕСТЬ ИГРА НЕТУ, ДРУГ НЕ ЗАХОДИТ, COOPERATE ГЕЙМ НЕТ. СУК. русская рулетка ой рыбалка говно я не советую. скачал игра горила говорила ой не то маудоналс. игра дерьмо, скачал игра и на кровати появилось 3 мужчины, я конечно не знаю кто они но на них не было белья. ГОВНО ПИЗДЕЦ БОЛЬШОЙ МИНУС ФУУУУ💩💩💩💩💩💩💩💩💩🤬🤬🤬🤬🤬🤬",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Крайне странная игра с точки зрения симулятора рыбалки\r\n\r\nНемного о багах, которые я заметил за время игры:\r\n- Леска путается в ногах\r\n- При подборе удочки с открытой катушкой, она сперва закрывается, а потом открывается\r\n- В рандомный момент полностью пропадает клёв, проблем с интернетом нет\r\n\r\n\r\nИногда админы просто перезагружают сервера без уведомлений\r\n\r\nА в целом надо просто поиграть и там уже решить, настолько игра нормасная. Но в ней много гринда, а если гринд не хотите, то платите за премы/предметы\r\n\r\nАдмины иногда творят самосуд, был отправлен на штрафной пруд раз 20 уже, 1 раз за мат, 19 за стимдек (но пришлось писать им на мыло, что они не правы)\r\n\r\nЕсли сидите с стимдека, то вырубайте все оптимизаторы, вырубайте dxvk-async ОБЯЗАТЕЛЬНО, gamescope, админам пофиг, что вы на линуксе, для них эта штука = читы, а за читы на прудик",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]If you just like chill fishing games with good graphics, then you'll probably like this, but if you're looking for a game to play with friends, this isn't it.[/h1]\n\nI do not recommend playing this, unless you just really like fishing by yourself. Even thought it's advertised with the MMO tag, the only multiplayer part is that you can see other people's catches in your region and there's a leaderboard as well. However, you can not go Russian fishing with your friends like one would think, which ultimately is why I wouldn't recommend this to most people.\n\n[u][b]If being able to actually fish with my mates gets added in, I'll change my review and redownload.[/b][/u]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was looking for a free game and this popped up. I do like the game's concept but when your in it. Like at the cafe you have to buy premium to view things but if you willing to spend some money for fishing enthusiest go ahead but if your just strolling for game dont choos this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I came back to give this game a serious try and invested 2 weeks and about 100 dollars buying gear and premium in their shop. But fak no! Game deleted now. \n\nThis game has the most toxic forum with devs that only pander to the fanbois. I had an issue a few days back with the game suddenly giving me \"server error\" and \"contact support if this continues\", and then crashing of the game while I was reeling in a big fish that I had spent about an hour in real life on! Having to fight a fish for an hour in this game is very very exhausting!! So I tried to do what the game recomended and posted on the forum asking what had just happened and why the game crash. And then instead of being adressed by a dev or moderator, I was attacked by a couple of brainless fanbois who started plastering me with insults. That it was my own fault for creating server issues and crashing the game. That I was smashing buttons and that tthe game crashing is in reality a feature and other such nonsense.  The arguments between us got a bit heated, someone obviously complained and a dev came and told us to be quiet, deleted some of my comments and locked down the thread without answering my question to why the game had crashed. No mention of lost game time or compensation or any of that. Just a blank ignore.\n\nAnd then I read about other gamers who the longer they play the more they regret hundreds or thousands of hours invested into a company that banns players left and right, nerfs the fishing over and over pushing people to spend money on gear out of sheer frustration. This is not gaming for me. Not gonna support such a company. Seems very unprofessional. I will take my money to other games.\n\nDon't even care to go into all the pro's and con's of the gamplay. I'm just done with this one. I wish all the free games would just dissapear. They often have such trash communities that are poorly moderated, like this one talks of a profanity filer in the chat. but allows for the most sexually vulgar gamer names, which the devs don't even care about. Lol... They have a trash pay-to-not-win monetary system, cause there is nothing here to win, but pay-to-get-a-head-of-the-mindless-grind-scheme. \n\nI'd much rather just pay full price for a game or a monthy fee than this scam of a game where everything is designed to drain your time and money.\n\nSad really but there it is.\n\nGood on you devs! ;) I hope you game tanks before reaching full release. This still feels like a Beta to me.\n\n\n\nSo, an hour after writing the above I got into an argument with the dev that had locked my first thread down without ever answering me. He answerd on my second thread giving me a final warning telling me that I had already received answeres, (from those two fanbois who accused me of me probably smashing the keys on my keyboard and thus stressing the server to the point of it resulting in an internal server eror and a game crash with loss of game content.) But I didnt know those two bozo's were representing the dev team. I thought they were just two fools ganging up on me...Lol. I asked why he never gave those two that were mocking me and speaking condescending about things that were not true a warning. But he never answered to that. Instead I received a permanent ban! Lol. \nBut the answer he game me now about package issues on my end, never the game servers end, regardless that I have no connectivity issues in other games, I said nobody had told me about before he now said it. So how could he say that other people had already given me the answers to my gamecrash, that I just didn't want to accept?? Just a bald faced lie and attempt at manipulating me into a corner. So I told him what to do with his warning and the result came promptly::))\n\n\"You have been permanently banned from the Russian Fishing 4 Hub.\nYou were banned by a Russian Fishing 4 developer.\nReason: \"Insults and false information's \"\"\n\nFALSE information!?! Hahahaha... I was giving who false information about what?? Sure I insulted the dumb dev. And I know he got the message. But me giving false information? I was the one asking about the gamecrash and what it meant. How I could have done things diferently. I never had any business to give out information. The fanbois were feeding me informations about stuff they knew nothing about. The only ones who were dealing in information was the dumb dev and his fanbois.\n\nOh well... who cares now.\n\nSo this is the company you are dealing with here. Better tread lightly if you plan on playing this game. You are now all officially warned! ;)\n\nCheers all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one word toooooo grindy \r\nIts a pretty nice game but if you need to play 100 hours + to even can go carp fishing if you can buy the overexpensive stuff you need in shop then you should go play it.\r\nMy advice install fisher online its way better then this unfair game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Das spiel ist so schlecht ich kann mich nicht einmal über Steam einloggen, es steht einfach internal error.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is no way to play with your friends. you can chat with them but not fish next to each other.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS ASS YOU HAVE TO PLAY FOR 2 MONTHS NON STOP AND SPEND 200 USD TO GET GOOD STUFF AND CATCH GOOD FISH",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pls let ppl send silver things under 5k silver and over 5k silver cost gold this is way too hard to progress now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "for me the game just auto runs backwards and i cant do anityhing about it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DOWNLOADED IT TO TRY AND I COULDNT GET THE CODE TO WORK TO EVEN PLAY THE STUPID GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make a way for players  to Set language in first screen.  Was all in a foreign language and not able to play due to this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i got blocked for no reason after not playing 2 weeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no playing with friends so you can see each other",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hope yall die. Fishing Planet better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "where are thr russians",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 4,000+ hours (this is my alt), I can say RF4 has the most absurd monetization I’ve ever seen. End-game gear runs $500+ for a single reel; mid-tier is $300—and you need three reels and three rods. Your choices: drop thousands of dollars, grind thousands of hours, or both.\n\nThe community is more toxic than that of Rust and the moderation? They don’t care. You can be banned for basic criticism, and appeals go nowhere. Security on the standalone (non-Steam) client is a joke, don’t even get me started.\n\nThe only reason this game has the player base it does is because it has zero real competitors. If another fishing sim shows up with mechanics even close to RF4, this game’s population will evaporate. People think EA or 2K are bad? FishSoft makes them look charitable. Even Star Citizen doesn’t touch these gear prices.\n\nVerdict: Incredible fishing mechanics held hostage by a predatory pricing model, heavy-handed moderation, and a toxic community. If you value your time or your wallet, stay away.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "the game is bad, very bad...\nyou need second life to grind.\n\nif you unemployee, this game is for you",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game demands Escape from Tarkov-level time investment and grinding before you can truly “have fun” and catch whatever fish you want.\n\nThe developers are lazy, arrogant, and show little care for Steam players. Don’t expect to transfer your Steam account progress to their standalone client for “extra benefits,” either. They’ll simply forget you ever asked—my friend tried and was left hanging, eventually giving up on the transfer ticket.\n\nRussian and Chinese players are clearly favored. Their servers dominate global records, with rare trophies caught almost exclusively there. Seeing a world record from any other server is extremely rare.\n\nOptimization is another weak point. For the visuals you get, performance is underwhelming. The graphics were designed with 4K resolution in mind, which causes shadows and especially fishing lines to look terrible on lower resolutions. There’s FXAA anti-aliasing support, but it barely makes a difference and often reduces perceived detail on fishing lines at lower resolutions.\n\nTL;DR: The devs are lazy, the grind is brutal, and optimization is poor—but just like Tarkov, there’s no other fishing game quite like this. If you can overlook these issues and are willing to sink 1,500–2,000 hours into it, you will eventually enjoy it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has energy & hunger system in a casual game which doesn't tell you what food gives, it tells you to go to their website to learn more & the tutorial shows you 2 fishing methods but not that there is an energy & hunger system, not even how to recover them at all\n\nI almost was enjoying the game, then I saw the skills, was able to upgrade to dig up worms, because that sounded cool, so I got all 3 upgrades for that, okay I needed a shovel, went to the hardware store & wasted $38 on a shovel, okay lets get some worms, after digging I got a worm, but you know what, it drains all my energy to extremely low to almost deplete\n\nI drank some lemonade & ate some bread, I have no idea how to increase my energy at all & the game never told me how\n\nThey have tooltips on the items in the store for each food & drink, but nothing states if it restores energy or hunger & not by any amounts either\n\nSo in all that, I don't like this game, it's not casual & it's a stressful game to deal with when it doesn't give you everything to know how the game works, it didn't even tell me it was going to drain all my energy using a shovel, what's the point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was great for the first couple days, now nothing bites and you cant progress at any decent rate. Same baits at the same spots and it gets slower and slower.  All these games have the same problem endless grinding with no hope of doing anything interesting.\r\n\r\nDon't waste your time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not recommended - the loading times can be long after the tutorial level and most of the time nothing happens and even when it does it is just a fish model.\n\nThe loading times get shorter when you replay the same levels, though the problem of little payoff for your time remains. The game seems to slowly reload the graphics if you change the graphics setting, so be prepared to wait.\n\nIt is a much better idea to watch someone else's gameplay videos of this game. That way you can skip the loading times and the long periods of time of nothing happening. Apparently the fish becomes rarer to come by later in the game.\n\nIt has the same problem as most other realistic job simulators - if you are going to put effort into playing it, you are just doing a job without being paid for it like a complete fool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games really buggy and also not helpful with the settings if you are on pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for almost 400 hours, yet not a single russian has been caught. This is false advertising and my lawyer will take action.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The early stages are rough. This game is super boring. I'd rather just go fishing irl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First, fix the chatroom control so that it allows banning unfriendly players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the closest thing to actual fishing that I've played. I find myself unconsciously doing things I do fishing IRL and they're effective. The rigs you'd use to target species IRL work for those species in the game. I don't think it's an exaggeration to say that you could teach someone to fish for real by playing this game.\n\nIt's a shame, because all of the positives are buried by the heavy handed push for microtransactions. I'd happily buy an offline version of this game for ~$25 and ~$5 for DLC packs for new locations without the artificial grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "igra HUETA polnyaya долбоебы делали игру папкиным хуем и измазали всё сметанорй и ссаньем суки я ДАЖЕ зарегистрироваться не могу пожалустйа поффискте я хочу игшратьПОЖКЕЛАУСТЬСЯ ЛДЖЬфыв",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The end game is absolute trash. 2 lifetimes are not enough to complete 1/4 of the game. The blue bonuses to the gear do nothing and every purple/pink tag trophy takes a miracle to catch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has this one annoying bug that causes your fish inventory(the keepnet) to just open while your fishing.  ive looked in all the settings and not a one of them explains whats going on.  the game would be fun otherwise, but i hate being interrupted all the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "игра ГОВНО. ЗВУКА НЕТУ ВЕЗДЕ, КАМПЬЮТЕР ЗВУК ЕСТЬ ИГРА НЕТУ, ДРУГ НЕ ЗАХОДИТ, COOPERATE ГЕЙМ НЕТ. СУК. русская рулетка ой рыбалка говно я не советую. скачал игра горила говорила ой не то маудоналс. игра дерьмо, скачал игра и на кровати появилось 3 мужчины, я конечно не знаю кто они но на них не было белья. ГОВНО ПИЗДЕЦ БОЛЬШОЙ МИНУС ФУУУУ💩💩💩💩💩💩💩💩💩🤬🤬🤬🤬🤬🤬",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Крайне странная игра с точки зрения симулятора рыбалки\r\n\r\nНемного о багах, которые я заметил за время игры:\r\n- Леска путается в ногах\r\n- При подборе удочки с открытой катушкой, она сперва закрывается, а потом открывается\r\n- В рандомный момент полностью пропадает клёв, проблем с интернетом нет\r\n\r\n\r\nИногда админы просто перезагружают сервера без уведомлений\r\n\r\nА в целом надо просто поиграть и там уже решить, настолько игра нормасная. Но в ней много гринда, а если гринд не хотите, то платите за премы/предметы\r\n\r\nАдмины иногда творят самосуд, был отправлен на штрафной пруд раз 20 уже, 1 раз за мат, 19 за стимдек (но пришлось писать им на мыло, что они не правы)\r\n\r\nЕсли сидите с стимдека, то вырубайте все оптимизаторы, вырубайте dxvk-async ОБЯЗАТЕЛЬНО, gamescope, админам пофиг, что вы на линуксе, для них эта штука = читы, а за читы на прудик",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]If you just like chill fishing games with good graphics, then you'll probably like this, but if you're looking for a game to play with friends, this isn't it.[/h1]\n\nI do not recommend playing this, unless you just really like fishing by yourself. Even thought it's advertised with the MMO tag, the only multiplayer part is that you can see other people's catches in your region and there's a leaderboard as well. However, you can not go Russian fishing with your friends like one would think, which ultimately is why I wouldn't recommend this to most people.\n\n[u][b]If being able to actually fish with my mates gets added in, I'll change my review and redownload.[/b][/u]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was looking for a free game and this popped up. I do like the game's concept but when your in it. Like at the cafe you have to buy premium to view things but if you willing to spend some money for fishing enthusiest go ahead but if your just strolling for game dont choos this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I came back to give this game a serious try and invested 2 weeks and about 100 dollars buying gear and premium in their shop. But fak no! Game deleted now. \n\nThis game has the most toxic forum with devs that only pander to the fanbois. I had an issue a few days back with the game suddenly giving me \"server error\" and \"contact support if this continues\", and then crashing of the game while I was reeling in a big fish that I had spent about an hour in real life on! Having to fight a fish for an hour in this game is very very exhausting!! So I tried to do what the game recomended and posted on the forum asking what had just happened and why the game crash. And then instead of being adressed by a dev or moderator, I was attacked by a couple of brainless fanbois who started plastering me with insults. That it was my own fault for creating server issues and crashing the game. That I was smashing buttons and that tthe game crashing is in reality a feature and other such nonsense.  The arguments between us got a bit heated, someone obviously complained and a dev came and told us to be quiet, deleted some of my comments and locked down the thread without answering my question to why the game had crashed. No mention of lost game time or compensation or any of that. Just a blank ignore.\n\nAnd then I read about other gamers who the longer they play the more they regret hundreds or thousands of hours invested into a company that banns players left and right, nerfs the fishing over and over pushing people to spend money on gear out of sheer frustration. This is not gaming for me. Not gonna support such a company. Seems very unprofessional. I will take my money to other games.\n\nDon't even care to go into all the pro's and con's of the gamplay. I'm just done with this one. I wish all the free games would just dissapear. They often have such trash communities that are poorly moderated, like this one talks of a profanity filer in the chat. but allows for the most sexually vulgar gamer names, which the devs don't even care about. Lol... They have a trash pay-to-not-win monetary system, cause there is nothing here to win, but pay-to-get-a-head-of-the-mindless-grind-scheme. \n\nI'd much rather just pay full price for a game or a monthy fee than this scam of a game where everything is designed to drain your time and money.\n\nSad really but there it is.\n\nGood on you devs! ;) I hope you game tanks before reaching full release. This still feels like a Beta to me.\n\n\n\nSo, an hour after writing the above I got into an argument with the dev that had locked my first thread down without ever answering me. He answerd on my second thread giving me a final warning telling me that I had already received answeres, (from those two fanbois who accused me of me probably smashing the keys on my keyboard and thus stressing the server to the point of it resulting in an internal server eror and a game crash with loss of game content.) But I didnt know those two bozo's were representing the dev team. I thought they were just two fools ganging up on me...Lol. I asked why he never gave those two that were mocking me and speaking condescending about things that were not true a warning. But he never answered to that. Instead I received a permanent ban! Lol. \nBut the answer he game me now about package issues on my end, never the game servers end, regardless that I have no connectivity issues in other games, I said nobody had told me about before he now said it. So how could he say that other people had already given me the answers to my gamecrash, that I just didn't want to accept?? Just a bald faced lie and attempt at manipulating me into a corner. So I told him what to do with his warning and the result came promptly::))\n\n\"You have been permanently banned from the Russian Fishing 4 Hub.\nYou were banned by a Russian Fishing 4 developer.\nReason: \"Insults and false information's \"\"\n\nFALSE information!?! Hahahaha... I was giving who false information about what?? Sure I insulted the dumb dev. And I know he got the message. But me giving false information? I was the one asking about the gamecrash and what it meant. How I could have done things diferently. I never had any business to give out information. The fanbois were feeding me informations about stuff they knew nothing about. The only ones who were dealing in information was the dumb dev and his fanbois.\n\nOh well... who cares now.\n\nSo this is the company you are dealing with here. Better tread lightly if you plan on playing this game. You are now all officially warned! ;)\n\nCheers all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one word toooooo grindy \r\nIts a pretty nice game but if you need to play 100 hours + to even can go carp fishing if you can buy the overexpensive stuff you need in shop then you should go play it.\r\nMy advice install fisher online its way better then this unfair game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Das spiel ist so schlecht ich kann mich nicht einmal über Steam einloggen, es steht einfach internal error.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is no way to play with your friends. you can chat with them but not fish next to each other.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}