{
  "positive": [
    {
      "review": "It's my very first Total War game and I'm very glad I started out with this one as my entry into the series. If you're new to Total War games, there's definitely a lot of information to absorb when you first start playing. If you're into three kingdoms, you'll love the three kingdoms part of this. Game on default is on romance mode so you can have Guan Yu just rush in there and decimate armies, though a non-romance mode is also available. The campaign is really long though for experienced players, I'd say it can take one to two days to finish. There are plenty of factions with unique mechanics and starting areas to choose from so the game also has a plenty of replayability. I found the game to be rather challenging, even on normal, but there is hard, very hard, and legendary difficulties above that. Something else I heard that makes this Total War stand out among the others is that there's a decent diplomacy system which is definitely something you want to interact with to make the most out of the game. It is not a game that requires you to constantly command battles though you can if you want to. Performance wise, it's gone decent, though I do get crashes on a regular basis so remember to save games.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game! One of Total War's best. More arcadey at times but very immersive and appealingly complex in a positive way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is hard to understand but I love it. It takes a long time to learn this playstyle on TW game, but it can be worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best TW series out there. Only downside is 1. CA dropped it 2. not enough unit diversity. 3. not enough faction diversity. MODs are the best thing there is for this game if you want to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one word Amazing, well crafted better then RTW2\r\nAnd I've only scratched the surface of this game. been playing total war games since a teen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a song lyrics by JJ Lin that I can parody for this review... \"If you're not a true gamer, you won't play Three Kingdoms Total War...\" \nFricken 10/10 game after the addition of their alt modes (aside from campaign and multiplayer, there's also a survival hero mode that caught my fancy.) \nLive your musou (impervious) dreams in TWROTK. OMG this game's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "好花时间啊。像当初完文明系列一样。岁数大了，坐不住了。still a very decent game when on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good strategy game, i hope the developers can keep update this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First Total War game. Absolute nerd for the era of history and while I have no idea what I'm doing, I am having a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's basically Dynasty Warriors Total War. I say that as a compliment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shogun 2 had hustle, but this game has some straight up scams, including many the AI will try to run on you. And the best feeling in the world is when an attacking army splits in two as your sleeper agent defects with their whole retinue. Love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Total War yet. \r\nGood combat and fun units.\r\namazing politics for a TW game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great strategy game With great character development and storytelling, but the game could have been better and more DLC and a different timeline could have been added to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Internal affairs and interpersonal relationships are too simplistic. Anyone can be recruited with just a little money. This is not in line with reality.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the argument on the yellow river, 500 0000 people dead, three species of trees extinct, yellow river runs dry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gameplay nice graphics nice narative its recomend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worth playing if u want good turn base game and depth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please add wepon slection in custome battle for the general",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the smartest campaign map/diplomacy AI in total war",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great strategy game for Chinese history enthusiast!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good really fun game!\r\n\r\ni like it a ton!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game\r\nhope they finish the 2nd part near future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took me 2 weeks to complete a campaign, satisfying game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never got boring, had to always be on it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the top 3 best Total war games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last good total war game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love these games~ three kingdoms is so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish we could get a follow up or dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still playing after 6 years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Kingdom if it was a video game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Total War game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best total war in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated, love Sun Ce",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Localization has finally improved",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest Campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best TW game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Liked it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LU BU WILL CONQUER ALL",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WOW AMAZING !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alright i guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worth to spend the hours....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thank you SEGA.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELL YEA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cao Cao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "china",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hayday",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sex",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "`",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "50 series gpus have had a soft incompatibility with this game for months. The UI will flicker and disappear during battles making it impossible to see where your troops are going.  You have to work around this by enabling smooth motion or limiting your framerate by 40-50 fps. Game is good otherwise, but wow this should've been fixed already.",
      "voted_up": true,
      "votes_helpful": 60
    },
    {
      "review": "600+ Hours in this game (and many more in other TW titles) and never played legendary before. Wanted to try my first legendary campaign ever last night. Played Liu Bei from the 183 start and had my army wiped out and LOST the campagin in 7 turns and less than 60 minutes.... Fastest campaign ever finished in any total war games LOL\n\n10/10 will try setting another personal record of fastest defeat again",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "Should you play this game ? Is this the best total war to choose ? The answer is yes.\nI’ve been asking myself the same question 2 months ago, as I wanted to play a new total war (last one was probably Attila and Warhammer 2).\nAnd thanks god I made this choice.\nThis the most refined total war game out there and clearly hundred time better than Warhammer III that is receiving plenty of DLCs. I love fantasy, and I also tried WHIII, but this game is overrated, and I was deeply disappointed. Any player that ever touched Three Kingdoms can tell: this is pure diamond.\n\nYou may hesitate since it’s ancient China and you may not be familiar with this era. I was totally ignorant about this period, and I was so into the game that I started to be interested to the lore (it’s so cool).\n\nGOOD POINTS\n\nFirst, this game is beautiful, in many ways:\n-\tInterface is great\n-\tConstruction buildings look cool when you click a commandery \n-\tCharacter artworks are very nice \n-\tMap looks awesome, there are a lot of visual and sound details when you zoom in\n-\tBattles look so great, nice screenshots to take \n\nSecond point, there are plenty of interesting mechanics:\n-\tMany faction leaders have special buildings, capacities, attributes and units that can be very cool, unique, and enjoyable, making every game different in its own way\n-\tDespite some weird and rare cases, diplomacy is overall very nice, lot of possibilities, and AI is doing fine \n-\tCharacters have a LOT of distinct attributes that affect their administrative, battle and campaign skills, so there are plenty of possibilities (Stats, capacity tree, items, traits, roles)\n-\tTo complete the previous point, you can even give special titles to your characters, which is very cool and boost them as well (example: General who gives tranquillity to the north, orator, etc). \n-\tCourt, relationships and administration is interesting, and scales as you rank up. At some point, you can regularly choose special events/boost for your faction.\n-\tThere is a spy system that is cool and give plenty of possibilities (such as your spy becoming the faction leader of the faction he was sent in)\n-\tResearch tree is fine and allow a lot of different possible choices that are decent\n-\tYour goal is to be emperor. If the original emperor is still governing, an additional imperial system exists and affect slightly your faction (ex: you can be marked as imperial enemy by the emperor)\n-\t Food and money are balanced and never seemed frustrating\n-\tThere are actually a ton of little mechanics that are cool, but I won’t detail it here (resources, assignments, seasons, faction leader tendencies in diplomacy, satisfaction, xp and weapon, rank scaling possibilities, unique features, etc)\n\nThere are a lot of things to consider, and even with +300h I’m pretty sure I’m missing some stuff to optimize everything. It can be overwhelming at start but keep it up and you will have a blast.\n\n About battles: \n-\tBest battles in the entire franchise in term of gameplay\n-\tUnits are reactive, the interface is easy to understand and managing unit is pleasant\n-\tUnits are not randomly stopping to do what you asked them (it happens for me in WHIII and ruin the game really)\n-\tYou can burn stuff like forest, and can be game breaker\n-\tGenerals are cool as they have special abilities, and if you don’t like this kind of gameplay, you can just change the game mode, so your general is just a unit as in total war Attila (and other historical title I believe) \n-\tI said it already, but it’s so good looking\n\nAbout units:\n-\tThere are some very cool units, with some elite units that are unlocked by research (every branch has its specialized unit), or by being emperor for example\n\n\n\nCRITICS\n\nVisually:\n-\tIf you get interested in this era, you will notice that non-principal characters lack a bit of diversity, which can be disappointing \n\nMechanics:\n-\tAs always for many games, mechanics could be improved, more complex, more in depth (research tree, spy, court, events etc)\n-\tBoth campaign and battle difficulty are not really how smart an AI is, but rather how cheated he is, which is sad. Instead of fighting a smarter enemy, you fight a dude with boosted statistics (battle) or biased against you for some mysterious reasons (diplomacy). Also, AI are kind of ignoring diplomatic maluses, and can be best friend easily with other factions compared to you (at least in higher difficulties)\n-\tSpy system could be improved to be more complete on some little points\n-\tA lot of things are not really explained and you kind of discover them at some point randomly (can be a good point in a way)\n\nAbout units:\n-\tEven if there are cool units, there are not that much different units compared to what could be done, and that can make different campaigns feel repetitive on this point\n\n\nGOOD NEWS\n\nAll these critics ? Can be fixed.\nIndeed, I highly recommend using a modpack called TROM+TUP (there are also other mudpack that are great for this).\nThis mod will introduce new art for secondary characters, add some other characters, increases mechanics in the game (skill tree, attributes, etc), allow a better control on the game, and most important, it adds many units that are VERY COOL and different, with a unique recruitment system. Playing base game and playing with this mod are both cool, but clearly this modpack increases significantly the play time, making you re-discover the game. Strongly recommend trying it out after some vanilla campaigns.\n\nAnyway, this is the coolest total war in the last years, it feels still pretty recent even if he was released 6 years ago. And I think it is way more fun and pleasant to play compared to Warhammer III. As long as a new historical big title is not out, this game is clearly the best you can play",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "If you're a fan of the Total war games, then Total War: 3 Kingdoms will not disappoint. I remember initially people being skeptical about the game and many people saying that it is a very average entry into the series, but the truth of the matter is at the time of me writing this it may come to a shock to whoever reads this that 3 Kingdoms has higher peak playercount than every other game besides Rome II and Warhammer 3. This game also has the highest all time playercount at one time for a total war game (yes not even Warhammer 3 passed it). The truth is the game is fun and has a lot of replayability so you'll certainly get your moneys worth, and there are mods that exist that allow you to play as the 'minor' factions if you so please. Base game is still extremely fun and some mods can make the gameplay even better. Overall this game hasn't gotten the love it deserves for a Total War game but puts up top 3 numbers in the franchise. Lowkey a sleeper.\n\nPros:\n-Lots of replayability\n-Some of if not the best Diplomacy and Spying in any Total War game\n-Characters fit practically any playstyle you wish to play.\n-Map of China is accurate and regions in China are unique and fun.\n-Battles on 'Romance' feel great and rewarding\n-Solid Graphics\n-Heroes in battle are fun to mess with \n-Cavalry actually do something\n-'A World Betrayed' and 'Yellow Turban Rebellion' are the best DLC's for this game hands down.\n-The game can be complex but the learning curve to the game isn't insane\n-Room for modding, and some mods make the game even better\n-Micromanaging a campaign is better than the Warhammer games imo\n-Character relations are pretty cool\n-Oversimplified was literally sponsored for this game, absolute GOAT.\n\n\nCons:\n-Other DLC's are either sub par or outright suck 'Fates Divided' is average, 'Furious Wilds' doesn't feel like it even belongs in the game and is also average, 'Eight Princes' sucks. \n-Most bugs have been fixed, but I still encounter some from time to time. Even some DLC still have bugs.\n-Quick battles, Dynasty, and Record gamemodes are meh.\n-AI enemies have had improvements but could still be better imo.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "It's truly a shame this iteration of Total War's historical series got dropped and abandoned. It's set in a great era of Chinese history with good a diplomacy system, dope soundtrack and awesome visuals. Mods are the main reason i still play it. Shoutout to all the modders! I truly appreciate you guys! I recommend getting this and all its dlc on sale if you love war games, whether its because it's based in the Three Kingdoms period of Chinese history, are looking for a good historical total war entry or are just getting into the monopolized corner of CA's war game genre",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "It is by far thew most fun combination of historical + fantasy (if you play romance) total war out there.\r\nSure, there are some drawbacks & the DLCs aren't really worth it, and also the game ended support/development way too quickly, but it is still good fun.\r\n\r\nOut of the recent Total wars (not counting warhammer) it is definitely the best, but still leaves room to be desired, hopefully a similar setting gets revisited in the future",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Hands down the best Total War game since Shogun 2 and the replay value is extremely high. You'll appreciate the game much more if you read The Romance of the Three Kingdoms, but it's still great even without knowing all the historical aspects of the Three Kingdoms era",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "It's my very first Total War game and I'm very glad I started out with this one as my entry into the series. If you're new to Total War games, there's definitely a lot of information to absorb when you first start playing. If you're into three kingdoms, you'll love the three kingdoms part of this. Game on default is on romance mode so you can have Guan Yu just rush in there and decimate armies, though a non-romance mode is also available. The campaign is really long though for experienced players, I'd say it can take one to two days to finish. There are plenty of factions with unique mechanics and starting areas to choose from so the game also has a plenty of replayability. I found the game to be rather challenging, even on normal, but there is hard, very hard, and legendary difficulties above that. Something else I heard that makes this Total War stand out among the others is that there's a decent diplomacy system which is definitely something you want to interact with to make the most out of the game. It is not a game that requires you to constantly command battles though you can if you want to. Performance wise, it's gone decent, though I do get crashes on a regular basis so remember to save games.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "My first total war game, and I've had an absolute blast with it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Very good visuals and campaign, a little bit repetitive in the campaign because after tons of battles its just the same over and over again but the unit design and graphics makes it enjoyable, love it almost as much as shogun 2.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game! One of Total War's best. More arcadey at times but very immersive and appealingly complex in a positive way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Back to 2019 I started knowing and playing the Total War franchies and waiting for this game, but I didn't have a good device then. I had been playing the pirated versions of various Total War, including this one, all the way until now with the lowest graphic settings. Such a great thing after all the years I never stopped enjoying this one and the others of Total War up to now when I have just been able to afford both the game and a better device",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Positives:\n+ Great design of the maps\n+ Interesting economy system compared to other Total War games\n+ Great music and artwork to create an atmosphere to spend hours in\n\nNegatives:\n- Units are imbalanced\n- Characters are not historically accurate",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "feels just like the romance of three kingdoms by Koei.\r\n\r\nIt would be nice if it had word battle as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is hard to understand but I love it. It takes a long time to learn this playstyle on TW game, but it can be worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best TW series out there. Only downside is 1. CA dropped it 2. not enough unit diversity. 3. not enough faction diversity. MODs are the best thing there is for this game if you want to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hello, I have a game in which I see videos that have 120 soldiers, but when I open the game and play, it has 80 soldiers at most. I need to change the player level in the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ahhh What can I say about TWTK aka Total War Three Kingdoms other than hot dam it's amazing... For a 7 out of 10 game here's why.\n\nTotal War Three Kingdoms is based on one of the most romanticized points of history in the world, China's Three Kingdoms era starting from the Yellow Turbans all the way all the way to the Jin dynasty princes. It is loaded with tons of characters that if you love the novel, historical records, or the hit franchise dynasty warriors you'll notice tons of names and faces. Mechanics out the whazoo, it's truly astonishing that the devs created so many characters and factions, leaders don't play the same having different agendas, personalities, starting positions, and more. Cao Cao doesn't play like Liu Bei, and Liu Bei is dramatically different from Sun Ce, Yuan Shu, Yuan Shao, Kong Rong, and many others you can pick to play as. In TWTK you are given so many choices it might seem overwhelming at first, to who you pick, how you play, and what game type you'd like to play on being Romance or Records, Romance follows the novels where generals were literally superhuman heroes on the battlefield who can take out a quarter of armies by themselves, while records follows a more realistic style where one man cannot kill 1000 by himself it takes on a more tactical approach to the gameplay instead. There's so much more that if I tried listing all of the good things about the game this review would be way to long, instead i'll go over the DLC, why it isn't perfect, and what makes it near perfect but why that dampens it's score for me.\n\nThe DLCs are pretty good they add a lot more to the game and a few spins on the gameplay loop if you play as one of the DLC factions being the Yellow Turbans from Mandate of Heaven 182 AD Furious Wilds being the awesome Nanman of the south a bunch of tribal people riding elephants and tigers, Fate Divided and World Betrayed are good ones as well adding a few good characters to the roster, plus the free leaders. The game has no lack for content my score says around 40 or 50 but I play it offline and have around 400 hours into the game. Which is why I can say it isn't perfect a few characters are missing from the vanilla rosters ones you'd think would have been amongst the first to be developed like Lu Meng wasn't in vanilla, neither was Lianshi, Zuo Ci, the Jin Kingdom besides Sima Yi is absent in vanilla. The team never got around to making unique art and characters for all of the characters in game. How is this fixed you ask? Mods.\n\nThe Modding scene has the be one of the greatest ones I've ever seen filling in the gaps the developers couldn't do before no longer supporting the game. Adding characters, overhauls to gameplay, new graphics, scripts, even adding areas to the map to add Korea, yeah it gets that wild. However, because of this I give the game a 7 out of 10 although I love it like a 10 out of 10 but, those mods were only made because the vanilla lacked in some places. Be that as it is I still recommend people buy this game and try it as it is worth the time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I absolutely loved this game. Earlier I used to play it on PC where it worked perfectly. Now, I play it on MacOS where it crashes a few times. That issue aside, I recommend this game to everyone who is interested in playing an intense strategy game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one word Amazing, well crafted better then RTW2\r\nAnd I've only scratched the surface of this game. been playing total war games since a teen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a song lyrics by JJ Lin that I can parody for this review... \"If you're not a true gamer, you won't play Three Kingdoms Total War...\" \nFricken 10/10 game after the addition of their alt modes (aside from campaign and multiplayer, there's also a survival hero mode that caught my fancy.) \nLive your musou (impervious) dreams in TWROTK. OMG this game's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "好花时间啊。像当初完文明系列一样。岁数大了，坐不住了。still a very decent game when on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good strategy game, i hope the developers can keep update this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First Total War game. Absolute nerd for the era of history and while I have no idea what I'm doing, I am having a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's basically Dynasty Warriors Total War. I say that as a compliment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shogun 2 had hustle, but this game has some straight up scams, including many the AI will try to run on you. And the best feeling in the world is when an attacking army splits in two as your sleeper agent defects with their whole retinue. Love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Total War yet. \r\nGood combat and fun units.\r\namazing politics for a TW game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great strategy game With great character development and storytelling, but the game could have been better and more DLC and a different timeline could have been added to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Grand Campaign is a strategic masterpiece. It uses historical figures like powerful playing pieces, making them useful or dangerous. It’s the very best part of Total War's gameplay outside of battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My original negative review :\nToo complex for me regarding how to play it, User interface is so terrible that it doesn't seem inviting to new players. Loading time for campaign is too long. This game should have a small tutorial campaign instead of making us read everything in one go in information overlay feature. Don't buy it unless you are already familiar about what you are going into, I got it for free from intel so I didn't lose any money.\n\nPositive review once I have learned game from Serious Trivia on YouTube :\nGame mechanics and graphics don't let this game stale. You will have to learn about a lot of game mechanics through videos, I don't think you can enjoy this game by usual trial and error approch. But this Serious Trivia guy is very informative, you will enjoy the ride for sure.\n\nThere are mods out there to make certain characters look unique and patch fix mods that keeps the game functional. You will need SSD to fix the loading time unfortunately. My game always open in small window after launching, I have to change resolution to full screen every time.\n\nDespite many shortcomings, I still think this game deserve my recommendation because I don't think I can put 100+ hours in game I don't enjoy, You will appreciate it's mechanics & sandbox nature after initial steep learning curve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "can we have all characters convert to all woman please is there any of that out there\r\ni want to see dong zhuo mommy\r\nthis is my first total war game i see greatest here but slop at endgame auto resolve after and after.\r\ni'm bit tired playing after 100+ turn thought, my first try is as bandit faction zhang yan because i always like to play as outlaw character in any game that allow it, and it's confusing especially loot mechanic i got attrition on my own territory .\r\neventually i gave up that campaign after 30 turns , then i go start yellow turban as gong du ,on normal difficulty later on increased to hard on turn 40+ it was something really enjoyable, but i got no ally it's makes me primary target of war of any faction ,only one time i truly declared offensive war to one of the nanman warchief and after that all china declare on me only liu bei doesn't,infact he became my ally later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of the total war series, and grew up playing 3 kingdoms, this is a ton of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say this is my second favourite game after Shogun 2. Immersive worldbuilding with great diplomacy. I would consider this game to have the best \"overworld\" out of the Total war games I've played, and has answers to prevent long and grindy endgames.\n\nHero generals allow for a fresh take on battles, and game can be played just as well without them, however I have found the game to be a bit slower than other titles this way. The worst part of this game has to be the battles on vanilla. Coming from Shogun 2, battles in Three kingdoms felt like a slog where most infantry units hit eachother with foam weapons waiting for a general or cavalry to charge them down. This get a bit better mid to late game, but battle never scratch the same itch as other total war titles have on vanilla. Would recommend using mods like TROM, as it makes combat much better and makes some changes to the overworld as well. Also have some complaints about there being no ACTUAL start time with all 3 kingdoms established, but there is enough reviews already that talk about it.\nFor dlcs, everything but blood and 8 princes dlc. Everything about 8 princes dlc is true, do not get it.\n\nTLDR; Highly recommend for overworld and diplomacy, battles might need mods, STAY AWAY FROM 8 PRINCES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "undderrated i believe. dont get blood pack tho, dont support it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly good game, I love it.\nCA's policy is the problem here.\nOne just notices how the game isn't in the finished state it is supposed to be in. Steppe tribes don't exist, Namban mechanics are unbalanced und the south east feels completly empty and useless. \nStill this game has a degree of polish for a historical TW, which I last experienced in Shogun 2. So it's still massive fun.\nProblem is that CA dropped it, even though it has so much potential...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Turn on records mode, instantly the most in-depth and (in my opinion) best Historical Total War, damn shame it was mismanaged.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool, very character structured which is cool. Very nice change of pace from more realistic games like Shogun 2. Kind of like subway surfers in this regard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. This game has so much potential, if only CA took more care into it. Personally I must ran this game with mods, to solve and improve what CA didn’t fixed. Crashes are recurring issues and TW launcher are pretty bad. But tw3k is really enjoyable once I get through all the hard stuff(sht like the vassal that you just created from granting independence to one of your administrator broke off and declare war on you just because it likes all your neighbors that your are expanding into, tf bro). Over all a 8/10. 9/10 if modded. Btw there’s not a 3 kingdoms starting in this game. :(",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The gameplay itself is wonderful. What ultimately did it in was the decision to cease implementation of DLC before the game got to the Three Kingdoms proper.\n\nThe game begins with the events that paved the way for the end of the Han Empire. However, instead of getting to the time where the Three Kingdoms: Cao Wei, Shu Han, and Dong Wu were established they release DLC that skips almost 100 years into the future which the Jin Empire is established; this dynasty was established after the Three Kingdoms ceased.\n\nCreative Assembly (or just Assembly at this point) made the decision to make a second Three Kingdoms game at some time in the future, which makes little sense. A good manner to think about this, is if you played Rome Total War but Rome was never truly playable in the game; only the events and civilizations that existed right up until the Roman Republic was established.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Can't get cursors to show up on Linux via Steam Play. Not really CA's problem but I wouldn't suggest this for Linux users with NVIDIA cards. If it gets fixed or I find a workaround I'll update this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Started my first campaign, got to around turn 90\nThe game consistently crashes during an AI player turn; nothing I do seems to change that, so my campaign is now locked.\nMultiple players seem to have reported this, but there is no official solution.\n\nEDIT:\nI managed to finish a campaign, but the game still crashed quite frequently.\nOverall, I found it less enjoyable than other TW installments;\nThe reforms (3Kingdoms research tree) feel quite slow, and because they are locked to a 5 turn cooldown, with no way to reduce that interval, makes it impossible to go through the whole lot of them in a normal game.\nThe combat is ok, but most units in the game are militias, with only mid-to-late upgrades improving this. This means morale is a major issue. Also, most garrisons are garbage, 3 heroes could single-handedly beat any default garrison in the game.\nDiplomacy feels overly complicated; there are lots of options that are never available (?) and many options that are never agreed on by the AI.\nBuildings again feel more complicated than usual; there are 3 buildings in every of the five categories available to major cities, but many do not really feel useful. I ended up building about the same 5 things in all my cities. Also the main building going from lvl 1 to lvl 10 feels exaggerated; not to mention the food cost for such a city is insane; that means that having more than a couple of those is simply not feasible(also pointless, since the benefits are not really worth it).\nThe character skill tree is very ambiguous, and since it is designed like a grid, it is very hard to specialize people on combat or economy; most often I found myself picking traits I had no need of because nothing else was available that interested me.\nThere is also a spy system? while I understand the idea, it felt clunky, and more trouble than it was worth. Rarely did I get something useful out of it, and by the end I abandoned it completely.\nThe graphics look nice, but my god combat in forests is horrendous, They are so well done you can't actually see a thing in them. Good luck trying to see that flanking cavalry. Oh, also, if you use fire ammo, you will set the forest around you on fire, which will kill your units.\n\nBetter buy a TW game that actually lets you play the campaign and have fun while doing it.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I love / hate total war games. They are a niche game for a niche player but undoubtedly they always fuck up every game they play with some stupid ass mechanic. And this games stupid ass mechanic has ruined so many campaigns just because Generals who historically like each other suddenly hate each other. But that wont effect gameplay would it ? Oh yeah when they start trying to kill each other and knock each other out usually at the worst possible fucking time. But this game isnt just one stupid ass mechanic its multiple stupid ass mechanics piled on top of each other but what makes it so frustrating is one mechanic literally turns other mechanics into effing nightmares. The trait system is unfixable, modders have tried none of them work. If you play anygame long enough the odds are that each of your generals will hate every other general givin enough time. And there is no rhyme or reason to it. So the stupid ass mechanic of how you earn traits, on top of the stupid ass mechanic of likes and dislike being based off these traits and throw the early game loyalty issues which can ruin a campaign in literally 4 turns which is also effected heavily by these traits and these traits will also invariably make the majority of your generals not get along with literally anyone. In fact if this game were even remotely accurate all of china hates all of china given enough time, what a stupid ass mechanic by a company that loves stupid ass mechanics. THE GOD DAMN INSTANT you can disable the trait system for this game it would become playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as a fan of historical content that total war has always been faithful to, i found it annoying having special generals  the game play wasnt as good as its predecessors, after 14 hours of play i deleted the game, other total war titles i played for hundreds of hours, i reinstalled older total wars in preference to playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Offers something different (ish). Not my thing I prefer the older titles gameplay and generally dislike the step towards fantasy for the historical titles that we see here. Just because they assume that total war fantasy games did well doesn't mean that anything else should now be deemed boring. Historical titles will be boring for as long as CA keep dumbing down the gameplay and pumping out the same game repackaged every year. There is plenty spectacle in fun immersive battles with twists, turns, and rewarding smart plays, don't need a solo hero fighting 100 men by himself, using magic kungfoo abilities, its just becomes too arcadey. Overall though don't hate it just cant recomend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not know what is wrong with this game but it shows 15 FPS (i9, 4090) in battles/global map which make it really hard to play. I tried every suggestion to fix it I found in the internet with no luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cash grab title. Game is super unstable and crashes repeatedly. I don't think I was able to finish one game without it crashing. Basically have to keep trying until it no longer crashes. Eventually lost faith and stopped playing. Comes back years later and game crashes immediately after starting.\n\nIt saddens me that there's this modern trend of these companies spending all these years building up their reputation and then just throwing it all away for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Always had a problem with crashes which is why I stopped playing, picked it up again today and crashes on starting a new campaign now. Just unbelievable on a rig as powerful as mine. There is no excuse at this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got it for $10. I think thats a good price for it. \n\nTheres some cool mechanics and layers with the economy in this game that haven't been in previous iterations. But I have some issues with the UI. It seems to be less intuitive and navigable than previous games. \nI also don't love how CA locks a ton of content behind additional paywalls, to have blood and gore in the game requires a paid DLC. Some of the voice acting in this game is also very cheesey. And they have your generals insult the enemy generals during the game with very cringey lines that take me out of the experience.\n\nDiplomacy in this game is very cool to be fair though. It has some interesting dynamics and mechanics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 crashes during the end stages of difficult battles is not fun. :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played several hours, the game crashes during sieges if one of my generals wins a duel. Do not buy. CA has the ability to put out good games that are not buggy. I don't know what happened here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another Total war Game where your enemies can travel impossible distances. I know as I tested it and played as them with full travel perks enabled and still couldn't come close to the distances they travel when im fighting them.\r\n\r\nwhere you can be close enough to another army you can exchange units but cannot reinforce each other when attacked. \r\n\r\nBut the worst of all, again, fucking again, just like thrones of Britannia! Your enemies can be bankrupt with no food, no allies and somehow command and supply multiple massive armies.\r\n\r\nThis is the last Total War game I will purchase. They refuse to listen to fans feedback on these glaring problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm really unsure of this game. It's SO different, excessively different, almost an entirely different game to other total war games released after this one. \n\nThe font size is too small, there's no slider to increase it. The only font size mod increases the size so much that some of it overlaps others.\n\nThe interface is completely different, and cluttered. I don't need to see the records button on the main bar, thanks. The game didn't tell me that the Reforms button means this game's version of research. \n\nAll the character names look the same. In the Characters window, it shows *every single person in the entire game* I don't need to see that either.\n\nMost of the mod descriptions are in Chinese, and I imagine that even if I do run them through google translate, what ever the mod adds will be in Chinese as well. They're also outdated because the game got cancelled by CA.\n\nI'm just not a fan. Do yourself a favor, play warhammer 3 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keep crashing in the sima last era when i try to add stats onto my general. will change this review to a good review once that is fixed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games boring, bad ai, ai is too stupid for the diplomacy in game, bad ui...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It occasionally turns off automatically.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not really for me I guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crASH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have over 2000 hours in Shogun 2 and Warhammer 1 & 2 - not a single crash, across multiple different PCs, even with mods.\r\n\r\nHere (whether without any or just the bugfix mod) it's constant to the point of absolutely removing any joy from the experience.\r\nWhether I am starting a new campaign, ending a turn or simply opening my tech tree is like playing a crash roulette. Disabling that one mod, changing the resolution, doing many other tweaks suggested on forums did not help at all - their frequency and randomness remain the same.\r\n\r\nIt seems like a fun game otherwise, so if like me you are a fan of the series and setting, try it on sale - just be ready to refund at the first sight of technical issues.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "The gameplay itself is wonderful. What ultimately did it in was the decision to cease implementation of DLC before the game got to the Three Kingdoms proper.\n\nThe game begins with the events that paved the way for the end of the Han Empire. However, instead of getting to the time where the Three Kingdoms: Cao Wei, Shu Han, and Dong Wu were established they release DLC that skips almost 100 years into the future which the Jin Empire is established; this dynasty was established after the Three Kingdoms ceased.\n\nCreative Assembly (or just Assembly at this point) made the decision to make a second Three Kingdoms game at some time in the future, which makes little sense. A good manner to think about this, is if you played Rome Total War but Rome was never truly playable in the game; only the events and civilizations that existed right up until the Roman Republic was established.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Got a refund.\n\nGame was crashing repeatedly in the first 10 turns or at battle start or finish.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Game takes over 5 minutes to start up now. It took seconds few months ago. Nothing changed on my end. Tried every single troubleshooting idea. It wouldn't even start at first when i reinstalled it, instead I had to run in directly from the local folder. Game is abandoned and broken.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Can't get cursors to show up on Linux via Steam Play. Not really CA's problem but I wouldn't suggest this for Linux users with NVIDIA cards. If it gets fixed or I find a workaround I'll update this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Does not work on Linux with NVIDIA RTX 3070ti.\n\nError when launching with Native version.\nFreeze at the start of new campaign with Proton.\n\nI even try to change distribution and nvidia drivers (open and close ones).\n\nRefund asked.\n\nTried Total War Warhammer 3 and  got exact same bugs...\n\nEDIT: \nReplace NVIDIA graphic card by an AMD RX 9070 xt.\nBought Total War Warhammer 3 again to test and now the game work flawlessly.\n\nTo conclude with a famous sentence:\n\"NVIDIA, Fuck you!\" - Linus Torvald (2012)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The best total war game in my opinion that was abandoned with promises of a new game that never happened",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "There was a lot of potential in this game, you can see it sometimes, deeper economy, more research, interactions, factions feeling different from each other, generals having relationships and progression, easily the most complex and well thought out game of the series. It would be worth playing if it worked, but it does not, it is in such a bad state that it is basically a scam to sell it, a faulty product even by todays low standards. The game, as it is now, and as it will be in future, because CA abandoned it when buggy, low effort dlc underperformed because historical players, unlike Warhammer nerds, do not buy every slop and ask for seconds, can best be summarized with three words. \n\nBROKEN. It has countless bugs that affect even the most core features of the game, performance issues, desync in MP, absurd amounts of crashes. To this day I have not finished a singleplayer campaign, and not for a lack of trying either, the game just breaks the campaign before it gets that far. The AI is also laughably broken, frequently having complete breakdowns on the map, and on the field, diplomacy is often a joke, and the AI outright refuses to use certain features, while hilariously misusing others.\n\nINCONSISTENT. The numbers often seem made up, events appear arbitrary when repeating turns more often after reloads due to crashing, unit performances on the battlefield are so vastly different each time that it is hard to predict anything.\n\nOBFUSCATING. The game explains plenty of things badly, barely, or does not explain them at all, and sometimes it gives directly contradicting information that really makes you feel like the game is telling you to just guess and roll with whatever is happening.\n\nThese are just the biggest issues, plenty of other problems with this game that can and will show up even when the game does not crash, act up, or makes you guess. I could unironically write 3000 words about all the issues with balancing, badly thought out features, things that are broken in various ways, there would be no end to it, even community mods are not enough to turn it into a playable game. \nI tried so hard to make this work and to enjoy the game, but the Game is an abandoned mess, and with CA having recently even pissed off the spineless Warhammer fans I can only hope that the company goes under and sells the license, they are irredeemable at this point.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Started my first campaign, got to around turn 90\nThe game consistently crashes during an AI player turn; nothing I do seems to change that, so my campaign is now locked.\nMultiple players seem to have reported this, but there is no official solution.\n\nEDIT:\nI managed to finish a campaign, but the game still crashed quite frequently.\nOverall, I found it less enjoyable than other TW installments;\nThe reforms (3Kingdoms research tree) feel quite slow, and because they are locked to a 5 turn cooldown, with no way to reduce that interval, makes it impossible to go through the whole lot of them in a normal game.\nThe combat is ok, but most units in the game are militias, with only mid-to-late upgrades improving this. This means morale is a major issue. Also, most garrisons are garbage, 3 heroes could single-handedly beat any default garrison in the game.\nDiplomacy feels overly complicated; there are lots of options that are never available (?) and many options that are never agreed on by the AI.\nBuildings again feel more complicated than usual; there are 3 buildings in every of the five categories available to major cities, but many do not really feel useful. I ended up building about the same 5 things in all my cities. Also the main building going from lvl 1 to lvl 10 feels exaggerated; not to mention the food cost for such a city is insane; that means that having more than a couple of those is simply not feasible(also pointless, since the benefits are not really worth it).\nThe character skill tree is very ambiguous, and since it is designed like a grid, it is very hard to specialize people on combat or economy; most often I found myself picking traits I had no need of because nothing else was available that interested me.\nThere is also a spy system? while I understand the idea, it felt clunky, and more trouble than it was worth. Rarely did I get something useful out of it, and by the end I abandoned it completely.\nThe graphics look nice, but my god combat in forests is horrendous, They are so well done you can't actually see a thing in them. Good luck trying to see that flanking cavalry. Oh, also, if you use fire ammo, you will set the forest around you on fire, which will kill your units.\n\nBetter buy a TW game that actually lets you play the campaign and have fun while doing it.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i would avoid buying this! i bought as it was on sale but it wont even launch. ive tried everything and nothing works just stays on launch screen",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game itself is quite good, the battles are great. But the technical issues killed this game for me.\r\n\r\nRegular crashes when trying to load the save (more often than not). Frame rate drops no matter the graphic settings I choose (and despite graphic card and processor usage not being high). Tried both on Windows and on Linux. On Linux there're no crashes but it's like 15-20 fps less and even worse stutters than on Windows. On Windows it was actually playable once I got it to run but then it stopped working again.\r\nSo anyway, putting technical issues aside, the game is good (really the only aspect I didn't like was that every other guy is named some variant of Liu, Zhang or Geng, but I can't blame the game for that, probably would've helped if I was Chinese). Aside from that, I'd have recommended the game and was wishlisting other TW titles after getting hooked. But not anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h3]Garbage Alert[/h3]\nI have never seen a Total War game this poorly optimized before. I spent most of my playtime trying to fix the interface scaling because my cursor and the actual on-screen selections did not line up at all. Performance wise, it is decent, but come on, charging players to move back and forth through time? I could understand that kind of mechanic in a game like Crusader Kings, but in a Total War title, that is disappointing and feels unreasonably greedy.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Stuck at the very 1st splash screen, tried everything online and it seems like there are no fix to it still. just know you can be one of the lucky ones if you get this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "another game from Total War franchise with no clear instructions as to rules of the game or how to play. I used to enjoy playing T W games but now they are overcomplicated and tedious. Life is too short.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game fulfills a strong niche as an interesting take on the Three Kingdoms era, a historical chinese approach from a major western developer. It has a Total War gameplay that has an unique approach compared with other Total War - choosing to focus on flashy duels, a harder approach to alliances & theming unit and items which are somewhat fun but pretty flawed as they often limit your playstyle in unnatural ways. If you are like me. you'd have much more fun collecting people/ rare items, thanks to more RPG vibe this game has.\n\nIt shares several similarities with the recent Total War titles such as Troy and Total War Warhammer series by focusing on legendary lords with very unique faction effects akin to a Civilization game. So if you enjoyed those, you might enjoy this one as well.\n\nI would like to point out a difference to Romance from the Three Kingdoms from KOEI, a very different kind of game in the same theme and shares the 'narrative focus' that this title does. For the most part, this game tries to give you narrative branches but due to unpredictable AI and RNG and lack of flags to put you back on track - you have lesser control over it if your purpose is try to follow the narrative. So don't be surprised if Lu Bu simply just dies by accident. This game allows you to form relationships (similar to ROTK13 with expansion) but it does put a cap. So you can't befriend as many people as you'd like - the weakest relationship simply disappear as if they never existed.\n\nAnd yet, the main criticism of this game is that its development was cut short and there's still more technical issues with this game that you would have to be wary of - and use community fixes to have a more playable experience.\n\nEg. If you are a Singleplayer player, the game is mostly playable. But some factions still have issues with their faction mechanics/UI. For cooperative players, the engine bugs can crash the game for various reasons, such as having too many units. I was just fielding a full stack to fight two stacks - woe on me.\n\nOn the side note, AI in the same province as you can detect your presence quite reliably - so it complicates your ability to form ambushes and catch them unguarded if you don't plan around that. This game has quite a few oddities like this, so be careful.\n\nYou'd probably be fine if you are just Liu Bei-ing or Cao Cao-ing in Singleplayer.\n\nIn respect to the developer's developmental ethos since dropping this game, I would still have to give this a cautious negative review. Play at your own risk, but do enjoy the game as-is.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love / hate total war games. They are a niche game for a niche player but undoubtedly they always fuck up every game they play with some stupid ass mechanic. And this games stupid ass mechanic has ruined so many campaigns just because Generals who historically like each other suddenly hate each other. But that wont effect gameplay would it ? Oh yeah when they start trying to kill each other and knock each other out usually at the worst possible fucking time. But this game isnt just one stupid ass mechanic its multiple stupid ass mechanics piled on top of each other but what makes it so frustrating is one mechanic literally turns other mechanics into effing nightmares. The trait system is unfixable, modders have tried none of them work. If you play anygame long enough the odds are that each of your generals will hate every other general givin enough time. And there is no rhyme or reason to it. So the stupid ass mechanic of how you earn traits, on top of the stupid ass mechanic of likes and dislike being based off these traits and throw the early game loyalty issues which can ruin a campaign in literally 4 turns which is also effected heavily by these traits and these traits will also invariably make the majority of your generals not get along with literally anyone. In fact if this game were even remotely accurate all of china hates all of china given enough time, what a stupid ass mechanic by a company that loves stupid ass mechanics. THE GOD DAMN INSTANT you can disable the trait system for this game it would become playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sorry but honestly I don't know how this game can be called total war. It feels more like a 4X simulator, having to manage characters and their relationships. Battles are basic at best, replenishment is atrocious, heroes obliterate everything and AI cheats are through the roof even on normal.\nThe imperial authority mechanic actually prevents you from waging wars, even punishing you for when you want to counterattack factions that declared war on you.. what??\nI was honestly very excited to grab this after everything I had heard but in reality I was left with a very bitter and frustrating taste in my mouth, this game is a 4/10 at best",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crash in loading screen and not getting refund back ....pc specs better then game req...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Started good, then it just kept crashing when i loaded the game. I cant play anymore...wtf am i doing with this game i bought then ??? are you going to fix this Total War or  what ?? I guess its charity. But the game was really cool for like 20 hours...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as a fan of historical content that total war has always been faithful to, i found it annoying having special generals  the game play wasnt as good as its predecessors, after 14 hours of play i deleted the game, other total war titles i played for hundreds of hours, i reinstalled older total wars in preference to playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Offers something different (ish). Not my thing I prefer the older titles gameplay and generally dislike the step towards fantasy for the historical titles that we see here. Just because they assume that total war fantasy games did well doesn't mean that anything else should now be deemed boring. Historical titles will be boring for as long as CA keep dumbing down the gameplay and pumping out the same game repackaged every year. There is plenty spectacle in fun immersive battles with twists, turns, and rewarding smart plays, don't need a solo hero fighting 100 men by himself, using magic kungfoo abilities, its just becomes too arcadey. Overall though don't hate it just cant recomend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "actually impossible even on easy, idk what balancing this game has but even on its suggested characters and the easiest difficulty you have to minmax everything to have a chance. its such a shame cause artistically the game is great, its just miserable to play, every fight is a valiant defeat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even buying this game on sale wasn't enough to make me keep it. Im sure everyone has become aware of the total war issues, however, my problems with this game. \r\n-mods are only what make it playable.\r\n-every character/faction looks the same, like have some pride in your work and make them at least differentiated. \r\n-Have an option to convert the mandarin characters to english or make the flags unique. like 10 factions have green banners, are they my allies or enemies... no clue cause i cant read the characters. \r\n-maybe total war peaked with rome total war and im just begging for them to make a similar game. \r\nI could upgrade all my buildings for maximum out put and train troops, i didnt have to decide between food or having troops. Troops for factions were mostly unique. just a better era for total war.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately no, I didn’t like it. After 400 hours in Shogun 2, this feels like a toy compared to it. Units don’t feel unique or exciting, and the research tree is just dull.\nDiplomacy looks more advanced but it’s not fun for someone like me. I prefer simple choices like trade or war, not endless back and forth deals.\n\nBattles were disappointing. In Shogun 2 you can actually see the soldiers fight, block, and react, but here they just blob together. The tracer arrows look awful too.\n\nThe only part I really enjoyed were the Generals. Seeing them duel and crush units was amazing, but that alone can’t save the game for me.\n\nAnother big issue is the lack of good mods. In Shogun 2 I could completely change the game with mods, but here there’s not much beyond some cool General skins.\n\nI get why some players might like its unique style, but for me it just doesn’t have the same depth that Shogun 2 had.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not know what is wrong with this game but it shows 15 FPS (i9, 4090) in battles/global map which make it really hard to play. I tried every suggestion to fix it I found in the internet with no luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cash grab title. Game is super unstable and crashes repeatedly. I don't think I was able to finish one game without it crashing. Basically have to keep trying until it no longer crashes. Eventually lost faith and stopped playing. Comes back years later and game crashes immediately after starting.\n\nIt saddens me that there's this modern trend of these companies spending all these years building up their reputation and then just throwing it all away for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Always had a problem with crashes which is why I stopped playing, picked it up again today and crashes on starting a new campaign now. Just unbelievable on a rig as powerful as mine. There is no excuse at this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got it for $10. I think thats a good price for it. \n\nTheres some cool mechanics and layers with the economy in this game that haven't been in previous iterations. But I have some issues with the UI. It seems to be less intuitive and navigable than previous games. \nI also don't love how CA locks a ton of content behind additional paywalls, to have blood and gore in the game requires a paid DLC. Some of the voice acting in this game is also very cheesey. And they have your generals insult the enemy generals during the game with very cringey lines that take me out of the experience.\n\nDiplomacy in this game is very cool to be fair though. It has some interesting dynamics and mechanics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 crashes during the end stages of difficult battles is not fun. :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played several hours, the game crashes during sieges if one of my generals wins a duel. Do not buy. CA has the ability to put out good games that are not buggy. I don't know what happened here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good \"Total Button: Press End turn\" game.\nTo make your experience flawless, it's important to use shortcuts: Ctrl+S/L aka \"Why does the UI hide the result of this deterministic action? I can't figure it out if I don't try it.\". And the most important one: Alt+Tab to go try to find an explanation on how this mechanic works, because you know, it's all fun and joy to spend hours figuring how to play a game.\n\nThe diplomacy management is a mess. You get notifications and dilemmas about... about... sometimes I don't even know if it's a faction, a character or a place. Maybe I should learn Chinese and read the Records of the Three Kingdoms first?\n\nThe UI is the worst of all the TW games I've played. You really have to click all over the screen to find the information you require to make informed decisions. \n\nAnd \"no\": learning the game rules is not interesting. It should be either very brief or integrated to the game play. (Imagine learning chess and having to read pages and pages during days in order to know how to move the pieces). At some point, if I keep playing, I will probably know these rules and will be able to \"master the game\" and have fun but that won't change the awful experience I've had so far. Thus, I don't recommend it.\n\nOne annoying bug: scrolling right and down by moving the mouse cursor to the end of the screen doesn't always work (yes, there are workarounds, I know).\n\nThe game looks really pretty.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of fun in the beginning but the mid to endgame is sooo boring. Commanding 100 stacks is no fun but a chore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a difficult and confusing game to learn.  I've spent 7 hours with it so far and have only a tentative grasp a few parts of it.  Unexpected things happen, like for instance my army just refuses to move and I don't know why.  Or I want to fight a war with my allies and have no idea how to get them to fight together.  The devs try to help by giving hints here and there concerning what to do, but never tell you how to do it.  A lot of my time is also spent trying (usually fruitlessly) to get the information I need to make informed decisions.  As, for instance I would like to know something about a city before I attack it, but cannot get any information, even with spies.  I think that a lot of confusion ensues as well from the Chinese manner of thought, presentation and speaking with which I have no previous experience.  \r\nTry this game only if you are so ready for a new experience that you don't mind a lot of frustration along the way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "外交按鍵輸入數字會卡頓，啟動也很慢，網上所有能找的辦法全部不行，我這4090還玩不動這遊戲，服了",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My fav modern total war game, becomes very good with mods. \n\nI love total war that's why I left a negative review, let the developers fix the AI",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Considering how long Total war franchise has been operating, I will say I expect a lot more out of the negotiations between factions. Empire total war has a better system of \"negotiating\" then what they have implemented in Three Kingdoms. I would love to know the moron that thought up the negotiating between factions, - IE - extremely poor with giving the COM all the power all the time takes a lot of the enjoyment out of the game considering the key role it plays in the game. \n\nGameplay is on point. A lot of small things that definitely bring the game down few tiers for me. For instance, the lack of movement length is brutal, that combined with the random plagues, bandits, etc make me want to put my fist through the screen when your army gets decimated completely out of your control considering 3 times on 3 different campaigns, I got hit by bandits right after a \"sickness\" ravaged my army or when you have multiple armies protecting your borders and 2 full yellow turban armies appear in the middle of your territory and decimate everything in 2 turns. Another is keeping 2 armies side by side, as 'reinforcements' and yet, the COM can select one target to hit individually and takes out each army individually yet, they were unable to defend themselves together??? \n\nThe realistic factor with relationships is nice cause it does bring some realism to strategy based games like this. Then the negotiations just ruin that aspect as like I stated before, COM has all the power and thats that. \n\nThere was definitely a moron on the development team that loves to watch the world burn with the unrealistic characteristics that can literally ruin your campaigns in just a few turns. \n\nUnfortunately, the cons outweight the pros and I regret purchasing the game. Back to Empire total war.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The AI in the game is just too piss poor. It is not able to compete with humans so in order to compensate for this the AI uses *Buffs* to randomly generate a ton of enemy troops. it will also alter actions of factions on the map in order to simply hinder what your doing - to no tactical advantage to themselves... this destroyed any potential real strategic challenge. the only challenge is the ability to out manoeuvre the constant 'dig' the game give you.... graphics are what you'd expect same with the missions and stories...all in all 1/10 and that being extremely generous for the quite frankly, Lazy, AI.... it gets boring real fast!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game crashes like none other. Virtually unplayable. No mods, fresh new download, low settings (hoping it would help), still crashes. It does not matter what I am doing. It crashes whenever I attempt anything. I barely get 10 to 15 mins before it crashes. Thought this game would be flushed out by now....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked it a lot. 50 hours in.\n\nUntil 3 of their leaders killed my entire army. Legit THREE of their leaders killed my entire army.\n\nI've logged thousands in Rome Total War, and love all the total wars. This one was going to be one of my favorites. But as I sat there and watched three of their leaders harass and kill my entire trained army, it was so frustrating that I legit quit the game and unistalled.\n\nI'll never play this game again. \n\nHopefully they combine some of the mechanics, like how important the characters are in the game, spy games etc, but just to a Rome game. But wow, I've never been so frustrated and disappointed from a game so quickly.\n\nI'm back.\nI just can't get this game a good review.\nI want to like it so much but it just misses. There is a huge balancing issue with the Kingdom of Wei and other factions. I've played three campaigns now.\nTwice the Kingdom of Wei gets so powerful that they get to invade everyone on the map with 10-15 full armies, with their troops maxed out. I can't compete.\nMa Teng campaign got bugged and there is a cycle of the turbans revolting every turn. This happened to me, therefore I had to quit that campaign.\n\nThis game had its moment but the more you get into it the more you realize its broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If the game was did become a abandonware it could have been great. But it became the flagship of all CA lies.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another Total war Game where your enemies can travel impossible distances. I know as I tested it and played as them with full travel perks enabled and still couldn't come close to the distances they travel when im fighting them.\r\n\r\nwhere you can be close enough to another army you can exchange units but cannot reinforce each other when attacked. \r\n\r\nBut the worst of all, again, fucking again, just like thrones of Britannia! Your enemies can be bankrupt with no food, no allies and somehow command and supply multiple massive armies.\r\n\r\nThis is the last Total War game I will purchase. They refuse to listen to fans feedback on these glaring problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm really unsure of this game. It's SO different, excessively different, almost an entirely different game to other total war games released after this one. \n\nThe font size is too small, there's no slider to increase it. The only font size mod increases the size so much that some of it overlaps others.\n\nThe interface is completely different, and cluttered. I don't need to see the records button on the main bar, thanks. The game didn't tell me that the Reforms button means this game's version of research. \n\nAll the character names look the same. In the Characters window, it shows *every single person in the entire game* I don't need to see that either.\n\nMost of the mod descriptions are in Chinese, and I imagine that even if I do run them through google translate, what ever the mod adds will be in Chinese as well. They're also outdated because the game got cancelled by CA.\n\nI'm just not a fan. Do yourself a favor, play warhammer 3 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keep crashing in the sima last era when i try to add stats onto my general. will change this review to a good review once that is fixed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games boring, bad ai, ai is too stupid for the diplomacy in game, bad ui...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It occasionally turns off automatically.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not really for me I guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crASH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have over 2000 hours in Shogun 2 and Warhammer 1 & 2 - not a single crash, across multiple different PCs, even with mods.\r\n\r\nHere (whether without any or just the bugfix mod) it's constant to the point of absolutely removing any joy from the experience.\r\nWhether I am starting a new campaign, ending a turn or simply opening my tech tree is like playing a crash roulette. Disabling that one mod, changing the resolution, doing many other tweaks suggested on forums did not help at all - their frequency and randomness remain the same.\r\n\r\nIt seems like a fun game otherwise, so if like me you are a fan of the series and setting, try it on sale - just be ready to refund at the first sight of technical issues.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "The gameplay itself is wonderful. What ultimately did it in was the decision to cease implementation of DLC before the game got to the Three Kingdoms proper.\n\nThe game begins with the events that paved the way for the end of the Han Empire. However, instead of getting to the time where the Three Kingdoms: Cao Wei, Shu Han, and Dong Wu were established they release DLC that skips almost 100 years into the future which the Jin Empire is established; this dynasty was established after the Three Kingdoms ceased.\n\nCreative Assembly (or just Assembly at this point) made the decision to make a second Three Kingdoms game at some time in the future, which makes little sense. A good manner to think about this, is if you played Rome Total War but Rome was never truly playable in the game; only the events and civilizations that existed right up until the Roman Republic was established.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Got a refund.\n\nGame was crashing repeatedly in the first 10 turns or at battle start or finish.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Game takes over 5 minutes to start up now. It took seconds few months ago. Nothing changed on my end. Tried every single troubleshooting idea. It wouldn't even start at first when i reinstalled it, instead I had to run in directly from the local folder. Game is abandoned and broken.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Can't get cursors to show up on Linux via Steam Play. Not really CA's problem but I wouldn't suggest this for Linux users with NVIDIA cards. If it gets fixed or I find a workaround I'll update this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Does not work on Linux with NVIDIA RTX 3070ti.\n\nError when launching with Native version.\nFreeze at the start of new campaign with Proton.\n\nI even try to change distribution and nvidia drivers (open and close ones).\n\nRefund asked.\n\nTried Total War Warhammer 3 and  got exact same bugs...\n\nEDIT: \nReplace NVIDIA graphic card by an AMD RX 9070 xt.\nBought Total War Warhammer 3 again to test and now the game work flawlessly.\n\nTo conclude with a famous sentence:\n\"NVIDIA, Fuck you!\" - Linus Torvald (2012)",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The best total war game in my opinion that was abandoned with promises of a new game that never happened",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "There was a lot of potential in this game, you can see it sometimes, deeper economy, more research, interactions, factions feeling different from each other, generals having relationships and progression, easily the most complex and well thought out game of the series. It would be worth playing if it worked, but it does not, it is in such a bad state that it is basically a scam to sell it, a faulty product even by todays low standards. The game, as it is now, and as it will be in future, because CA abandoned it when buggy, low effort dlc underperformed because historical players, unlike Warhammer nerds, do not buy every slop and ask for seconds, can best be summarized with three words. \n\nBROKEN. It has countless bugs that affect even the most core features of the game, performance issues, desync in MP, absurd amounts of crashes. To this day I have not finished a singleplayer campaign, and not for a lack of trying either, the game just breaks the campaign before it gets that far. The AI is also laughably broken, frequently having complete breakdowns on the map, and on the field, diplomacy is often a joke, and the AI outright refuses to use certain features, while hilariously misusing others.\n\nINCONSISTENT. The numbers often seem made up, events appear arbitrary when repeating turns more often after reloads due to crashing, unit performances on the battlefield are so vastly different each time that it is hard to predict anything.\n\nOBFUSCATING. The game explains plenty of things badly, barely, or does not explain them at all, and sometimes it gives directly contradicting information that really makes you feel like the game is telling you to just guess and roll with whatever is happening.\n\nThese are just the biggest issues, plenty of other problems with this game that can and will show up even when the game does not crash, act up, or makes you guess. I could unironically write 3000 words about all the issues with balancing, badly thought out features, things that are broken in various ways, there would be no end to it, even community mods are not enough to turn it into a playable game. \nI tried so hard to make this work and to enjoy the game, but the Game is an abandoned mess, and with CA having recently even pissed off the spineless Warhammer fans I can only hope that the company goes under and sells the license, they are irredeemable at this point.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Started my first campaign, got to around turn 90\nThe game consistently crashes during an AI player turn; nothing I do seems to change that, so my campaign is now locked.\nMultiple players seem to have reported this, but there is no official solution.\n\nEDIT:\nI managed to finish a campaign, but the game still crashed quite frequently.\nOverall, I found it less enjoyable than other TW installments;\nThe reforms (3Kingdoms research tree) feel quite slow, and because they are locked to a 5 turn cooldown, with no way to reduce that interval, makes it impossible to go through the whole lot of them in a normal game.\nThe combat is ok, but most units in the game are militias, with only mid-to-late upgrades improving this. This means morale is a major issue. Also, most garrisons are garbage, 3 heroes could single-handedly beat any default garrison in the game.\nDiplomacy feels overly complicated; there are lots of options that are never available (?) and many options that are never agreed on by the AI.\nBuildings again feel more complicated than usual; there are 3 buildings in every of the five categories available to major cities, but many do not really feel useful. I ended up building about the same 5 things in all my cities. Also the main building going from lvl 1 to lvl 10 feels exaggerated; not to mention the food cost for such a city is insane; that means that having more than a couple of those is simply not feasible(also pointless, since the benefits are not really worth it).\nThe character skill tree is very ambiguous, and since it is designed like a grid, it is very hard to specialize people on combat or economy; most often I found myself picking traits I had no need of because nothing else was available that interested me.\nThere is also a spy system? while I understand the idea, it felt clunky, and more trouble than it was worth. Rarely did I get something useful out of it, and by the end I abandoned it completely.\nThe graphics look nice, but my god combat in forests is horrendous, They are so well done you can't actually see a thing in them. Good luck trying to see that flanking cavalry. Oh, also, if you use fire ammo, you will set the forest around you on fire, which will kill your units.\n\nBetter buy a TW game that actually lets you play the campaign and have fun while doing it.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i would avoid buying this! i bought as it was on sale but it wont even launch. ive tried everything and nothing works just stays on launch screen",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game itself is quite good, the battles are great. But the technical issues killed this game for me.\r\n\r\nRegular crashes when trying to load the save (more often than not). Frame rate drops no matter the graphic settings I choose (and despite graphic card and processor usage not being high). Tried both on Windows and on Linux. On Linux there're no crashes but it's like 15-20 fps less and even worse stutters than on Windows. On Windows it was actually playable once I got it to run but then it stopped working again.\r\nSo anyway, putting technical issues aside, the game is good (really the only aspect I didn't like was that every other guy is named some variant of Liu, Zhang or Geng, but I can't blame the game for that, probably would've helped if I was Chinese). Aside from that, I'd have recommended the game and was wishlisting other TW titles after getting hooked. But not anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h3]Garbage Alert[/h3]\nI have never seen a Total War game this poorly optimized before. I spent most of my playtime trying to fix the interface scaling because my cursor and the actual on-screen selections did not line up at all. Performance wise, it is decent, but come on, charging players to move back and forth through time? I could understand that kind of mechanic in a game like Crusader Kings, but in a Total War title, that is disappointing and feels unreasonably greedy.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Stuck at the very 1st splash screen, tried everything online and it seems like there are no fix to it still. just know you can be one of the lucky ones if you get this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "another game from Total War franchise with no clear instructions as to rules of the game or how to play. I used to enjoy playing T W games but now they are overcomplicated and tedious. Life is too short.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game fulfills a strong niche as an interesting take on the Three Kingdoms era, a historical chinese approach from a major western developer. It has a Total War gameplay that has an unique approach compared with other Total War - choosing to focus on flashy duels, a harder approach to alliances & theming unit and items which are somewhat fun but pretty flawed as they often limit your playstyle in unnatural ways. If you are like me. you'd have much more fun collecting people/ rare items, thanks to more RPG vibe this game has.\n\nIt shares several similarities with the recent Total War titles such as Troy and Total War Warhammer series by focusing on legendary lords with very unique faction effects akin to a Civilization game. So if you enjoyed those, you might enjoy this one as well.\n\nI would like to point out a difference to Romance from the Three Kingdoms from KOEI, a very different kind of game in the same theme and shares the 'narrative focus' that this title does. For the most part, this game tries to give you narrative branches but due to unpredictable AI and RNG and lack of flags to put you back on track - you have lesser control over it if your purpose is try to follow the narrative. So don't be surprised if Lu Bu simply just dies by accident. This game allows you to form relationships (similar to ROTK13 with expansion) but it does put a cap. So you can't befriend as many people as you'd like - the weakest relationship simply disappear as if they never existed.\n\nAnd yet, the main criticism of this game is that its development was cut short and there's still more technical issues with this game that you would have to be wary of - and use community fixes to have a more playable experience.\n\nEg. If you are a Singleplayer player, the game is mostly playable. But some factions still have issues with their faction mechanics/UI. For cooperative players, the engine bugs can crash the game for various reasons, such as having too many units. I was just fielding a full stack to fight two stacks - woe on me.\n\nOn the side note, AI in the same province as you can detect your presence quite reliably - so it complicates your ability to form ambushes and catch them unguarded if you don't plan around that. This game has quite a few oddities like this, so be careful.\n\nYou'd probably be fine if you are just Liu Bei-ing or Cao Cao-ing in Singleplayer.\n\nIn respect to the developer's developmental ethos since dropping this game, I would still have to give this a cautious negative review. Play at your own risk, but do enjoy the game as-is.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love / hate total war games. They are a niche game for a niche player but undoubtedly they always fuck up every game they play with some stupid ass mechanic. And this games stupid ass mechanic has ruined so many campaigns just because Generals who historically like each other suddenly hate each other. But that wont effect gameplay would it ? Oh yeah when they start trying to kill each other and knock each other out usually at the worst possible fucking time. But this game isnt just one stupid ass mechanic its multiple stupid ass mechanics piled on top of each other but what makes it so frustrating is one mechanic literally turns other mechanics into effing nightmares. The trait system is unfixable, modders have tried none of them work. If you play anygame long enough the odds are that each of your generals will hate every other general givin enough time. And there is no rhyme or reason to it. So the stupid ass mechanic of how you earn traits, on top of the stupid ass mechanic of likes and dislike being based off these traits and throw the early game loyalty issues which can ruin a campaign in literally 4 turns which is also effected heavily by these traits and these traits will also invariably make the majority of your generals not get along with literally anyone. In fact if this game were even remotely accurate all of china hates all of china given enough time, what a stupid ass mechanic by a company that loves stupid ass mechanics. THE GOD DAMN INSTANT you can disable the trait system for this game it would become playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sorry but honestly I don't know how this game can be called total war. It feels more like a 4X simulator, having to manage characters and their relationships. Battles are basic at best, replenishment is atrocious, heroes obliterate everything and AI cheats are through the roof even on normal.\nThe imperial authority mechanic actually prevents you from waging wars, even punishing you for when you want to counterattack factions that declared war on you.. what??\nI was honestly very excited to grab this after everything I had heard but in reality I was left with a very bitter and frustrating taste in my mouth, this game is a 4/10 at best",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a good game, fun and lots of action in battles, some of the campaign mechanics are just silly for some factions. Though the game has a major problem with 5 series graphic cards. you would think it run amazing alas no.. you have to turn off a lot of settings just to get the green artifacts to go away in open field battle mode. The game looks like ++++ now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crash in loading screen and not getting refund back ....pc specs better then game req...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Started good, then it just kept crashing when i loaded the game. I cant play anymore...wtf am i doing with this game i bought then ??? are you going to fix this Total War or  what ?? I guess its charity. But the game was really cool for like 20 hours...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as a fan of historical content that total war has always been faithful to, i found it annoying having special generals  the game play wasnt as good as its predecessors, after 14 hours of play i deleted the game, other total war titles i played for hundreds of hours, i reinstalled older total wars in preference to playing this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Offers something different (ish). Not my thing I prefer the older titles gameplay and generally dislike the step towards fantasy for the historical titles that we see here. Just because they assume that total war fantasy games did well doesn't mean that anything else should now be deemed boring. Historical titles will be boring for as long as CA keep dumbing down the gameplay and pumping out the same game repackaged every year. There is plenty spectacle in fun immersive battles with twists, turns, and rewarding smart plays, don't need a solo hero fighting 100 men by himself, using magic kungfoo abilities, its just becomes too arcadey. Overall though don't hate it just cant recomend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "actually impossible even on easy, idk what balancing this game has but even on its suggested characters and the easiest difficulty you have to minmax everything to have a chance. its such a shame cause artistically the game is great, its just miserable to play, every fight is a valiant defeat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even buying this game on sale wasn't enough to make me keep it. Im sure everyone has become aware of the total war issues, however, my problems with this game. \r\n-mods are only what make it playable.\r\n-every character/faction looks the same, like have some pride in your work and make them at least differentiated. \r\n-Have an option to convert the mandarin characters to english or make the flags unique. like 10 factions have green banners, are they my allies or enemies... no clue cause i cant read the characters. \r\n-maybe total war peaked with rome total war and im just begging for them to make a similar game. \r\nI could upgrade all my buildings for maximum out put and train troops, i didnt have to decide between food or having troops. Troops for factions were mostly unique. just a better era for total war.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately no, I didn’t like it. After 400 hours in Shogun 2, this feels like a toy compared to it. Units don’t feel unique or exciting, and the research tree is just dull.\nDiplomacy looks more advanced but it’s not fun for someone like me. I prefer simple choices like trade or war, not endless back and forth deals.\n\nBattles were disappointing. In Shogun 2 you can actually see the soldiers fight, block, and react, but here they just blob together. The tracer arrows look awful too.\n\nThe only part I really enjoyed were the Generals. Seeing them duel and crush units was amazing, but that alone can’t save the game for me.\n\nAnother big issue is the lack of good mods. In Shogun 2 I could completely change the game with mods, but here there’s not much beyond some cool General skins.\n\nI get why some players might like its unique style, but for me it just doesn’t have the same depth that Shogun 2 had.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not know what is wrong with this game but it shows 15 FPS (i9, 4090) in battles/global map which make it really hard to play. I tried every suggestion to fix it I found in the internet with no luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cash grab title. Game is super unstable and crashes repeatedly. I don't think I was able to finish one game without it crashing. Basically have to keep trying until it no longer crashes. Eventually lost faith and stopped playing. Comes back years later and game crashes immediately after starting.\n\nIt saddens me that there's this modern trend of these companies spending all these years building up their reputation and then just throwing it all away for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Always had a problem with crashes which is why I stopped playing, picked it up again today and crashes on starting a new campaign now. Just unbelievable on a rig as powerful as mine. There is no excuse at this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got it for $10. I think thats a good price for it. \n\nTheres some cool mechanics and layers with the economy in this game that haven't been in previous iterations. But I have some issues with the UI. It seems to be less intuitive and navigable than previous games. \nI also don't love how CA locks a ton of content behind additional paywalls, to have blood and gore in the game requires a paid DLC. Some of the voice acting in this game is also very cheesey. And they have your generals insult the enemy generals during the game with very cringey lines that take me out of the experience.\n\nDiplomacy in this game is very cool to be fair though. It has some interesting dynamics and mechanics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 crashes during the end stages of difficult battles is not fun. :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played several hours, the game crashes during sieges if one of my generals wins a duel. Do not buy. CA has the ability to put out good games that are not buggy. I don't know what happened here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good \"Total Button: Press End turn\" game.\nTo make your experience flawless, it's important to use shortcuts: Ctrl+S/L aka \"Why does the UI hide the result of this deterministic action? I can't figure it out if I don't try it.\". And the most important one: Alt+Tab to go try to find an explanation on how this mechanic works, because you know, it's all fun and joy to spend hours figuring how to play a game.\n\nThe diplomacy management is a mess. You get notifications and dilemmas about... about... sometimes I don't even know if it's a faction, a character or a place. Maybe I should learn Chinese and read the Records of the Three Kingdoms first?\n\nThe UI is the worst of all the TW games I've played. You really have to click all over the screen to find the information you require to make informed decisions. \n\nAnd \"no\": learning the game rules is not interesting. It should be either very brief or integrated to the game play. (Imagine learning chess and having to read pages and pages during days in order to know how to move the pieces). At some point, if I keep playing, I will probably know these rules and will be able to \"master the game\" and have fun but that won't change the awful experience I've had so far. Thus, I don't recommend it.\n\nOne annoying bug: scrolling right and down by moving the mouse cursor to the end of the screen doesn't always work (yes, there are workarounds, I know).\n\nThe game looks really pretty.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of fun in the beginning but the mid to endgame is sooo boring. Commanding 100 stacks is no fun but a chore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a difficult and confusing game to learn.  I've spent 7 hours with it so far and have only a tentative grasp a few parts of it.  Unexpected things happen, like for instance my army just refuses to move and I don't know why.  Or I want to fight a war with my allies and have no idea how to get them to fight together.  The devs try to help by giving hints here and there concerning what to do, but never tell you how to do it.  A lot of my time is also spent trying (usually fruitlessly) to get the information I need to make informed decisions.  As, for instance I would like to know something about a city before I attack it, but cannot get any information, even with spies.  I think that a lot of confusion ensues as well from the Chinese manner of thought, presentation and speaking with which I have no previous experience.  \r\nTry this game only if you are so ready for a new experience that you don't mind a lot of frustration along the way.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}