{
  "positive": [
    {
      "review": "TLDR: Played the fhe full campaign with all DLC, enjoyed myself all the way through.\r\n8/10 definitly pick this up if you're into this kind of game, and be sure to get it on sale if you're slightly interested like I was.\r\n\r\nPros:\r\n- Wave based tower defense is enjoyable\r\n- Extensive Tech Tree\r\n- Nice variety of weapons\r\n- Not too complicated suply chains\r\n\r\nCons: \r\n- The only minor downside if you like resource menagement is that I couldn't find a menu or overview of total resource production.\r\n- Would have loved a blueprint like function to allow quick building of standard defensive sturctures",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Top-notch game in the genre with extreme dedication on the part of the devs to make it as great as possible. Can't go wrong here if you want to establish a massive base in a hostile environment.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've been trying to find a hybrid of real-time tower defense and resource management and voila this game comes up in my recommendation\r\n\r\nStraight bought it the first day I found it\r\n\r\nBut if Ashley can shut up the game would be better",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very addictive game, please exercise caution and make sure to free at least entire day if you still decided to try and play it. While playing, please make sure to have someone beside you to pull you out of the game at least to go to bathroom and eat.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I enjoyed Riftbreaker last year on my own just before the co-op talks started and now I get to enjoy it again with friends!\nEXOR is one of the few developers that keep hammering on their games until players are satisfied, or at least they try to and I appreciate that.\nRiftbreaker and X-Morph both have a charming cheesiness to them, with solid gameplay that has some familiar mechanics, but combined in a way to give them a unique identity.\nDefinitely worthy of the Labor of Love and I can't wait to see what the devs have to offer in the future!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very good game made only better by the Coop update.\nProps to the devs for rolling their own engine, exactly how they see fit, then also adding multiplayer.   In the age of UE4/5 game churn, it's refreshing to see.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Near the farthest reach of shining stars,\nWhere alien worlds are bound by scars,\nA game of might The Riftbreaker calls,\nHere I find, cosmic blend of endless thralls.\n\nWith mech abound I roam the land,\nBuilding, battling, making my stand,\nA symphony of resources and battle rage,\nWhere my strats and chaos fully engage.\n\nThis gameplay's vast, the worlds are wild,\nEvery choice feels harsh, yet styled.\nMy frantic dance of build and fight,\nWith rifts to close and foes to smite!\n\nThis game, a perfect blend of brain and brawn,\nWhere the constant tension’s never gone,\nNow yield, beware the swarms that come,\nThe endless monster tide, their danger hums.\n\nWith each DLC it adds a twist or turn,\nTo keep the stakes high, it makes you yearn.\nIt’s frantic, fast, and full of fun,\nRiftbreaker keeps you on the run.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hours Played: 18.7h (so far)\nVerdict: ★★★★★ / Super Addictive\n\nI’ve had so much progress and fun in just 18.7 hours, and I’m definitely going to keep playing more. The Riftbreaker is one of those games where every session feels rewarding — you always unlock something new, upgrade your mech, expand your base, or survive a crazy wave that makes you feel like a genius.\n\nWhy I’m loving it:\n\nBase-building is deep and satisfying\nCombat feels powerful and smooth\nTons of things to progress, research, and upgrade\nEvery biome looks incredible and has its own challenges\nThat “just one more mission” feeling is REAL\n\nFinal thoughts:\n\nIf you like sci-fi, automation, tower defense, or mech combat, this game mixes all of them perfectly.\nHad a great 18.7 hours — and I’m not stopping anytime soon.\n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Epic tower defence game but not a huge fan of the recent endgame changes. What a slog.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is like Factorio, but less autistic.\n\nIn all seriousness, it is a fun mix of resource gathering, base building, exploration, and tower defense. The barrier to entry is lower compared to other games of this genera, so learning the systems does not feel like a burden. Several different biome types and challenge modes add a ton of replayability. Multiplayer also adds another interesting way to experience the game. It is one of those games that is easy to pick up and hard to put down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its great. A good blend of various games. Fun, intense, addicting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I need more games like this.\r\n\r\nDo you like base building and resource harvesting in a sci fi setting? Do you like mechs?\r\nWell...this game is definitely for you. Now I already loved this game the first time I played it...but now? Now it has co op. \r\nThe co op works very well, I've had no issues with my partner at all, no crashes, nothing. You can play the full campaign together or survival.\r\nMod support through steam workshop and mod.io.\r\nFantastic gamepad support which was the most important thing for me, getting old...my hands don't have the dexterity for mouse and keyboard like they used to and playing with a gamepad lets me enjoy games without the pain and cramping. Controls with the gamepad feel perfect, definitely was not an afterthought.\r\nLots of replay value and plenty of options to tweak for your playthrough which with mod support only adds to the longevity of the game.\r\n\r\nPerformance is solid. I don't really get lag or any slowdowns, I am currently running a bit older hardware with an i7 8700k and RTX 2080 Super.\r\nMy sister and co op partner has older hardware, a i7 6800k with no real performance issues either.\r\nSo the game feels pretty well optimized.\r\n\r\nI only have one minor complaint and that would be the very few cutscenes in the game seem to by default have their audio settings all the way turned up so its a bit jarring and loud but that is so infrequent that it's only a nitpick and not really that much of a problem.\r\n\r\nI highly recommend the game. \r\nIt looks great, it plays great, gamepad support and co op. \r\n\r\nI hope for more games like this in the future or maybe a sequel or another similar game in the genre from this developer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "*** Public Service Announcement ***\r\n\r\nRight click on the game in your library.\r\nClick on Properties.\r\nClick on Betas.\r\nIn Beta Participation click Legacy.\r\n\r\nEnjoy this very nice game!\r\n\r\n(Don't use ray tracing)\r\n\r\n*** Public Service Announcement ***",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Your worst fear is not the endless swarm of locals, its the endless chatter of a immature woman and AI send to the other side of the universe.  The rest (including angry locals) is a great coop experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is an amazing game that I have had a ton of fun with. Base building and going through the campaign is great. If you love to make a base then re do it after you get more research done because now its inefficient, this is the game for you. Also I love the chainsaw. Only melee weapon I will ever use in this thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing RTS games dating back to Red Alert. That said, I've also enjoyed tower defense like defense grid. That said, its very in depth, and takes the idea of base building to the next level across multiple environments. It can be a bit CPU heavy so I would recommend a CPU from the Ryzen 5000 series or Intel 12th gen or better. Overall, a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really nice blend of different elements. Base building, strategy, tower defense, action, RPG. The voice acting and writing are well done. The campaign is long for a game that's only $30 (as of this writing), and after you finish it there are other game modes to try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine in Starcraft, you got to play as a single SCV. And as that lone SCV, you are building the entire base from the ground up and you are single-handedly fighting off countless hordes of Zerg with nothing but you and the buildings you make.\r\n\r\nIt's a base building defense game with smooth, fun gameplay, a great variety of equipment and buildings, and fantastic visuals. The devs actually seem to listen to the community and are frequently updating the game based on feedback and giving frequent communication updates. Even the DLC is solid and adds some fun new mechanics, buildings and equipment.\r\n\r\nThis game is fantastic. VERY fun. And with the multiplayer update, it's even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starcraft... but you are the SCV. And the Marine. And the Siege Tank. And it's not really Starcraft.\n\nJust play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little bit of tower defence, a little bit of base building/mining and a little bit of twin stick combat. Really hits the spot for when you want to see thousands of aliens slam into your defences while you fire nuclear missiles and acid tornadoes at them. Sounds OP? well the bosses are going to make you make you wish you had unlocked more of the absolutely massive skill tree, since they have the same abilities and more.\nThe new update really gives legs to the end game, the original ending was way too easy, esp if you had done the expansion packs. Now you are going to have a real fight on your hands. \nEspecially like the fact that they have increased the number of bases you can build and that you can go and make dedicated resource gathering hubs now.\nThere is a demo so you know what you are in for, and the engine is both pretty and runs at a fantastic pace. \nIf I could find one thing to complain about is that the inventory could be a bit more easy to spot which equipment was better without selecting the compare option, esp when looking at different classes of weapons.\nRegardless good fun, have completed several times and look forward to what the devs come up with next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of this genre, but this game has shown me how good it is. \nOverall an excellent game with a developer that continues to make it even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combination of action, tower defense, base building, and exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. I played it with a friend and we are now near the end and had a blast so far. Very enjoyable be it basebuilding or combat, especially enjoyed that basebuilding wasn't tedious but it was easy to build, repair and expand large bases.\r\n\r\nThere were some minor bugs but nothing too noticable, also I only know of those bugs since I saw them being fixed so thats great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you want to exterminate legions of weird alien monsters? If so, this is it. Not a logistics game, but a wildlife target shooting one supported with some tower defense and light base building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, originally played it in 2021 and thought DAMN THIS WOULD BE A GREAT CO-OP GAME! and now in 2025 IT IS A GREAT CO-OP GAME! the dev really worked hard the last few years to make it happen and I hope they prosper due to this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a mix of ARPG and base building games with a little bit of tower defense thrown in for good measure. With multiplayer added recently you can even enjoy these aspects with friends, adding to the challenge and hopefully creating some laughs through accidental friendly fire and such. \n\nAll in all, I have yet to be disappointed by anything they've added to the game. For the price and the amount of free content added outside of the DLC, you could do much, much worse this holiday season. Give it a try if any of this appeals to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont normally like these kinds of factory sim games, but this one is a great balance of TD and Factory building that makes even people like me enjoy it.\r\n\r\nGame good, game real good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Coop-Update did take longer than I hoped. But it was completely free and they did way more than other developer would have done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After over 100h I think I am done with this one for the time being. The game is great. Visuals are stunning, attention to detail jawdropping. Music great and memorable. Stories are nice. Ashley and Riggs duo makes the right mood. Tower defense on steroids and plus. Totally worth the money and time put into it. Great job devs. Absolute must play :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The great\nA very good game, well worth its price. Love that they keep developing the game, even after the 1.0 release, the co-op update really sold me on the game, literally, and I'm really happy I took the plunge.\nReally like the visceral combat, most of the weapons and mid- to late-game turrets have a lot of satisfying heft to them.\nAs a Factorio:SA/DSP/Satisfactory-player, I must say, I really like the simplified \"factory building\" in the game. Perhaps it might put off other more hardcore factory-affectionados, but I don't believe having more complex factory chains would work so well with the intense combat in the game, at least not without a ton more of QoL functions. But that's mostly not needed, I feel like the game has struck a pretty perfect balance.\n\nThe mid\nI like the weapon modding system alright, but it feels like it's was more or less an afterthought, especially how 'jankily' it's implemented in the menus. I feel like it could be a little more fun if you could even mod the starting rarity weapons a little. It feels a little weird that you get white rarity mods(that are pretty garbage to being with), but you can't use them in any white rarity weapons until you first blue rarity drops, and there you can only add ONE garbage quality mod to it... that does no impact at all, so why bother? I'd instead like to see 2 slots on common weapons to begin with(the mods that drop at the same time are, like mentioned, still garbage, so with 2 slots, they won't do much, but at least something), then 3, 4 and 5 slots on the following rarities. Sure, probably not gonna happen, since it will take a pretty thorough remake of the inventory GUI and some serious rebalancing of the mods and weapons themselves. For example, I'm running around with a workshop-mod that allows me to have 16 mech-modules slots(instead of the original 4 slots) in my current game, it's really fun, but utterly game-breaking, I'm basically untouchable even if most of the modules are only Purple and Blue rarity with only a few Red ones.\nEven if the factory process chains are rather simple, I still miss some quality of life stuff from the real fatory builders. I still would like to have the ability to just copy a setup I've already made and paste it down somewhere else(not blueprinting, just copy). Like farming setups, liquid processing setups or small temporary turret-setups tuned to the biomes enemies I could put down if I need to quickly expand between the waves, stuff that gets built lots and lots of times and are always the same. Or if I just want to reposition a setup, copying instead of rebuilding the whole damn setup again would help tremendously! The build menus are fine for basic stuff, but are rather limited and cumbersome to work with for larger builds, so this would would make the large strides you have to take to enter the late-game feel like less of a chore and more fun... IMHO.\n\nThe Bad\nCan't think of something REALLY bad, perhaps inventory GUI is a bit needlesly convoluted and the research trees could do with some more clarifications. Not a fan of the tech trees having unknown techs, especially in a mostly linear tech tree, especially since I've completed the game once, and especially since most of them don't specify how I acquire them. Sure, I'm guessing many of them are from the DLC's, but if I don't have the DLC and you don't specify(advertise) that they are from the DLC, then WHY have them there at all??? Just let me see all the tech and ALL requirements for unlocking them(if any(be it scanning a certain tree or buying a certain DLC)), at least after completing the campaign once. The tech trees are so huge, and there's three of them, so I find myself constantly looking for a specific tech I want and knew I had in my last run, only to never find it, having to resort to looking through wikis and reddit threads.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already played when it was released with gamepass and bought it a while ago on steam to play it again. The game was great when it was released and is now even better thanks to the constant support by the developers.\nA really nice mix of a basebuilding, tower defense and exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've really enjoyed the survival Co-op experience. There have been bugs but I still see it's being worked on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of those games I love to play when I am listening to my textbooks.  Could do with more UI scalability but I can at least get by as a low-vision gamer.  I can tune out with my mind and build while my audiobooks run to study.  This helps my ADHD brain focus on the book.  This easy to get competent but hard to master gameplay loop is perfect for gamers like me.  PS, more UI scaling please.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is mainly for the Steam Awards.\n\nThe Riftbreaker is definitely one of my favourite games. Building bases and blasting endless alien hordes doesn't ever really get old. Plus with the 2.0 update the Action-RPG aspect was vastly improved in terms of sweet, sweet loot drops.\n\nThere we go, short and sweet, just like the life of an Alien on Galatea-37, right before Mr. Rigs pays 'em a visit. Okay, well, maybe their life isn't so sweet, but it IS short.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really neat game. Base building, tower defense, exploration, production lines... It scratches a lot of itches...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed EXOR studios games for a long time, and in particular Riftbreaker. It was amazing on release, and now it's come so much further. Having a developer make a single-player game, only to listen to their fans and *make* it co-op? That is so much work, and it shows how much this studio loves both their game, and their fans. \n\nI suggest, if nothing else, give the game a chance, enjoy the beauty of it, and check out X-Morph Defence, their other big game, for a great tower defence game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Riftbreaker is one of those games that combines different concepts amazingly.  The story is there, not great, but not bad either, and keeps you going through the campaign.  I felt the limited VA was good, and enjoyed the banter between the protagonist and her AI companion of a constructor war machine.\n\nDifferent types of defenses and hundreds of variants on weaponry and loadouts means you can go an entire playthrough and never have to use the same things.\n\nThe Devs kept up great communication for the leadup towards releasing a cooperative version, which only makes the game even better.\n\nGorgeous graphics and an interesting sound track keep the game alive, especially between different biomes.\n\nI highly recommend the Riftbreaker and think it is a very solid game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and devs, I loved the X-Morph: Defense links in the dlc as that was a great game as well.\n\nThe game has base building, tower defence, resource management and logistics, technology and skill trees, staying alive type survival, exploration and story and then they added coop :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games. The devs have been developing it and surpassed anything they originally promised.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in the Factorio style genre, NOW WITH COOP\nAn awesome community and developers who care.\n\nIf you enjoy factory builders and want to play one where you can sit back and relax more than with Factorio or Satisfactory this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games out there with great  graphcis and features and coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very exciting for a longtime RTS player like me to get a new, truly fun entry to play over and over again. So far, I am loving everything about this game with zero complaints. Well Done to the developers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun tower defense.   I have been playing the campaign co-op with friends, and some survival missions with friends.  \r\n\r\nClearly I am enjoying the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game.  well balanced, lots of fun to just pick up and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good isometric base building RPG. The game design is really top notch, and the story is ok. upgrading your base and gathering resources is so satisfying. They mix in some really nice gunplay, gadgets, as well as upgrades for your mech suit. There's a lot of fine tuning for your mech and all your weapons. All able to compare to each other so you know exactly what that piece of gear will do. There are endless possibilities on how to play, several maps with their own biomes and challenges to keep the game interesting. This game is a must have for anyone that likes base building, or isometric RPGs. Endless hours could be put into this game and the price tag is the cherry on top.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loads of fun building your bases and defending them from hordes of enemies.\n\nGorgeous graphics and excellent animation and destructive environments!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't I just say I would recommend the game? Shouldn't I only have to justify why I don't recommend it?...\r\n\r\nGame good, tonnes of content to play through, late game can be challenging and enemies force you to change up your weapons often to clear through them quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Riftbreaker is one of those games that hooks you fast and keeps you coming back. I can confidently say it’s easily one of the best mixes of base-building, action combat, and survival gameplay i have played.\n\nThe game constantly pushes you to think, adapt, and expand. Building and defending your base feels incredibly satisfying, especially when you’re juggling power grids, production lines, wave defense, and exploration all at once. The combat is punchy, the tech tree is deep, and the alien planets look stunning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Superb game. It's like Factorio, but with more of a focus on combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it - a great combination of tower defence/base building and action/RPG gameplay.\n\nThe developers even went back and reworked the underlying engine just so they could add a co-op mode, which they then released for free. Mad respect for the developers for doing this! Been re-playing through the campaign in co-op mode now and it's been a blast\n\nThe DLC campaigns also add a fair bit of new content - both buildings/weapons but also new zones and story.\n\nDefinitely recommend Riftbreaker!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game I have played. It is mod friendly. They have custom difficulty settings. There is combat, base building, and resource managing. There is enough content to where it will take a day to beat the base game with the easiest difficulty settings you can make, with mods installed to make things faster. I have had no issues with crashing or lag.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually do not enjoy base building games, but this was was enjoyable for the most part to building structures for power and resource gathering. I only wish the game would give you at least a few hours of breathing room before sending weather events, attack waves, and monster events at your base every few minutes. If you are not ready, the game can be very punishing and rip through everything you built just so you have to waste more materials to rebuild everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Riftbreaker.. somehow didn't review this masterpiece yet.\nStrategy-like rpg-like factorio-like game where you have direct control over your Girl-in-the-Shell terminator-like hero and build different defensive/mining/scientific/etc infrastructure to achieve ultimate goal - prepare planet for future colonization.\nMultiple (not just several!) biomes on the planet offering completely different challenges each, hordes of aggressive fauna (and flora in latest dlc's), super-detailed life simulation - like tiny bugs swarming a fresh corpse of the attacking monster, natural creatures running in panic when you approach or light effects from nearby meteor.\nHighly recomend but beware - this game consume a lot of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun. Fun campaign, good characterization of the playable character. Good for those of us who like the idea of an RTS but who are better at the single unit management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this Game. This is why i play Games. Outside the box of traditional game play. Im not too into it yet. Maps seem small, im little picky about the placement of the veins of resources but so far im really enjoying this. And most importantly im having FUN.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very solid game for both solo and multiplayer gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game taught me that you typically don't notice when voice acting is good, but you sure know when it's bad. \n\nMinor gripe aside, the game was really fun and I thoroughly enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into tower defense and base building this game brings plenty of value.\r\nPlus since I have purchased the game they released v2.0 for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun times, haven't had any issues with the game, also workshop is awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting mix of genres and very fun in co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game. I highly recommend trying out the demo and seeing for yourself. Super fun with friends.\nI just wish the main character could stop yapping so much, for multiple character voice options in CO-OP, and for slightly better performance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So this is a solid rts\\td\\action game, a bit grindy, a bit badly balanced, repetative, but with co-op it is a good to go. BTW we had problems with co-op in demo, but in the full game - none of that happend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and fun with chanlenge and teamups of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is not your typical RTS/optimization game. The main loop involves discovering a new resource and then establishing a mining outpost for it. Best played in coop.\r\nThe larger fight scenes cause severe lag which takes a lot away from the end game fights.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was updated so that all keys and controls are now fully mappable. Thanks!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, SO much content! Would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Riftbreaker combines many of my favorite genres into one incredible experience:\n- Base building & survival – Build and defend sprawling outposts in hostile environments. Enemies swarm you\n- Tower defense – Strategically place defenses to survive massive enemy swarms.\n- Character progression – Upgrade your mech suit with new weapons and abilities.\n- Multiplayer co-op – Team up with friends to expand and defend your base together.\n- Visually stunning\n\nThe gameplay loop is addictive, the visuals are stunning, and the sense of scale when defending your base never gets old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyable little time killer, can get slightly annoying with the AI yapping and attacks, but it extends the playtime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rated EXOR's X-Morph Defense highly in the past because it did what most Tower Defense games can't. Now I'm rating Riftbreaker just as highly for base-building and action-exploration. If you wished Factorio had more combat and story progression, look no further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, worth trying out if you like fighting hordes of enemies with an expandable base system, and streamlined gameplay once you hit mid-game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a quick paced game. not crazy strategic but still very fuck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was released into early acces long ago. Now it has co-op multiplayer in I have another reason to return to it. Nice!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun pve horde shooter base builder. gives you a break from the aaa games that hound you for cash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have no faults with the gameplay.  It's very well designed, though there is some knowledge tax because the game has many avenues to play it.  Harder difficulties have you frantically going from place to place and  slapping down structures like a sloppy contractor.  The survival mode wants you to make the most out of every second.  The grid-based building and overall large amount of space they give you to do what you want has a great feel to it.  It's just a comfortable game to play when you're up for a challenge.  Very hard to find a game that can fill that niche.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great base building hack n' slash. Lots of weapon choices and each update has bought great improvements. The co-op update took a while to come out, but props to the devs not rushing out a much requested feature, instead keeping the community updated at a good pace. Only releasing the update when it was ready. \n\nLooking forward to future content and games from this team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TD+Basebuilding\n\nSort of powercreep-ish\n\nNot too bad\n\nDLCs are all separate purchase though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the only good alien, is a dead alien.\nfor reach\nfor malevalon\nfor the emperor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love everything about this, and after all these years DLC and Updates still make this game engaing in 2025 on onward",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎭 Bantering Bard’s Review of Riftbreaker\n- Gameplay – 8/10\n- Graphics – 8/10\n- Content – 8/10\n- Optimization – 6/10\n- Community/Replay Value – 8/10\n\nRiftbreaker is a solid eagle‑eye city/base builder with the added twist of controlling your character to defend and expand your resource facilities. It’s fun, engaging, and a standout in its genre. Graphics are impressive, though performance can dip if you build too ambitiously. Overall, it’s a great game worth recommending, especially for fans of strategy and survival hybrids.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game to play alone or with friends, will be buying the some of the DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect combination of Starcraft and Diablo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a  fantastic game, even more with the DLC's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Easy to Play. Well worth the cost",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love robots, hate xenos, simple as.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, especially now that we have co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SP is grindy - but MP is fun with friends.\nRecommended 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun hack n slash and base builder!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can try to check back in after I've got more time into it, but I can already tell I'm going to love this enough to keep coming back years down the line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really liked the main menu and the settings! what a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really scratches that basebuilding itch with the new update",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow its like factorio meets starship trooper\r\nlots of bugs to squish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Factorio for dummies with a LOT of action instead.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very cool game, great to play in co-op :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Diablo meets Factorio, good stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game that deserves the labour of love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite repetitive yet very addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its insane! And it keeps getting better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs well and plays well.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Until the endgame update and the mega structures, this was great. It had many options and ways you could tackle the game. You could do the DLC in any order if you're far enough, you could progress the story regardless of your skills, and get the full experience.\n\nWith the mega structures, the focus has become singular - do the DLC to get the nukes, obliterate everything. There is no more, \"We must save the world and us, too.\" There is no more balance - it is literally, \"Waste all of the resources on this mega structure and kill everything that comes to destroy it.\"\n\nThe mega structures take colossal amounts of resources to maintain and build. That's understandable since that's literally all they're meant for. Sure, they have some good benefits, like showing the entire map and its mining spots, or increasing farm yield, but... they're thankless and full of bugs.\n\nGet this. I built the entire thing up and powered the final structure. Mr. Riggs told me, \"Hey, the last wave is coming, better be ready.\" I was like like, well, ok, good, bring it on. I had good defenses, I had good items and gear, so start it up. What happened next was just pathetic.\n\nMy entire base was obliterated. My mega structures, which you can build more of on one map because nothing stops you, well, one bit the dust. More than half of my base, despite finishing all of the DLC and having upgrades everywhere, was just wiped out because multiple mega units came out and just killed everything. The mods these things have are stupid - heal all in an area, prevent damage to it unless you're in its bubble, and so forth. How is a tower supposed to kill that? This isn't that kind of game!\n\nThe worst thing is you can't repair your dead mega structures, you have to just dismantle it and start from zero. I had all of them maxed. I had all of their research maxed - I literally cannot research anything else in this game and have to start over mining titanium and uranium because of these monstrosities.\nThe entire tone is off here, you're not solving anything and are instead killing literally all life with nukes to build stupid structures to strip-mine the planet. I can no longer maintain titanium because all of the cooling needed for these things, like what is that? The power plants alone rip apart an entire mining outpost!\n\nOk, so whatever. I build it back up and try again, thinking, \"I have the power, I have the cooling, I have the magma and whatever else it needs. Turn it on - I died once, the final wave won't come again. That'd be dumb.\" The final wave comes again and just rips it all apart again. I built it all up a second time, it gets utterly annihilated again. I revert to my save and can't build my arcology again because I can't repair my dead structures.\n\nWhat a cycle of hate toward the player. You make it unwinnable, you make the structures unfixable, you make the economy function on death and strip mines, and you make it endless. Every time you power the final building, the death wave comes and literally kills some feeble part of your base, restarting the cycle. At that point, one of your outposts is out of resources, so you're now forced to spend hours building another to try again.\n\nWhat happened here? Why do I have to fight monsters with affixes like in an ARPG with just bullet sponges and healing all over the place, not to mention invicibility zones? Why does my base mean nothing? Why is research thrown away in favor of just killing everything? Why do the resource outposts just get spat on by the requirements of endgame buildings? Are you serious with this game, because I don't get it anymore. You had something special and now have this mess where you have you spam special attacks, your towers just die all the time, you waste our lives with buildings that can't be repaired, and you're merciless in failure. Are you happy?",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Used to be great, mods don't load anymore, they broke things with 2.0 it seems.\r\n\r\nEven if you can start a new game with mods, your save game won't load the mods the next day. \r\n\r\nAvoid purchase for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a fairly fun time right up until maybe 2 hours before the \"end.\" I found out there was a postgame section, and I was down to do it right up until I saw the material requirements of the very first postgame building. I promptly looked up everything else, and saw how brutal everything got, and I'm fine never seeing the rest of this game, nor do I care to play the DLC.\n\nI think the idea of the game is neat, but having to constantly stop what I'm doing because Mr. Riggs has a new swarm of enemies for me to fight was frustrating. Sure, every now and then, yeah. It's fun and engaging when its a surprise. But, it felt like I was getting interrupted every 5 minutes. I'm just trying to figure out pipes and power stuff, please Mr. Riggs, I need a minute. I played this game in Co-op and I cannot imagine doing it by yourself without very heavily investing in defenses for every base you build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love the game, really, but the bugs, the performances, and the missing of Linux compatibility, this is a real technical shit. It is sad to see a mostly great game design (even if the end game is free), with a such shit on the technical point. I got stuck with mission progression, and I can't manage to continue my campaign, lost hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is way too difficult and when swarms attack, you loose overview. There happens too much at the same time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coop is unplayable due to heavy lags. My network connection is good, because I can play Factorio and Satisfactory in coop with little lag, so the problem is on Riftbreaker's side.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "max graphics playing 144hz\nthen why the game lag so bad when everything containing Supercharged Plasma was destroyed\nveins do not disappear on mini map",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game lags to the point where you can not play. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game but sadly just too buggy. It constantly will open on the wrong monitor. If you try to move it or use the config tool it wont recognize the main monitor resolution. The most recent DLC just crashes constantly. Its a shame that such a fun game has just become unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me. It seems good. I really wanted to like this. But I just don't understand how anyone finds this type of game fun. There's so much going on at once on the screen (yet weirdly very little that's helpful) and there are too many things to keep track of. You could argue it's realistic but it's just not....fun.\n\nI'm sure others will like it. The graphics are good, and the devs seem responsive and are giving it updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun yet confusing! But overall, the controls suck! It runs like crap! I can't even play with my friend and it slows down constantly, the only positives is the game looks beautiful, the loading screen looks amazing! And overall the presentation while good is poorly executed. I still struggle because the controls feel like I'm being sucked into a vaccum cleaner and I have no idea half the time if it's the game of the devs fault. Because that's how God awful these controls are and it doesn't satisfy me not even in the slightest. The controls do run better with a PS4 controller but my God they still suck!\n\nUpdate: I hope the devs fix it, I really want to give them a better review. I hate leaving a negative review for this game. At first, it reminded me of Neo Contra now, it reminds me of a game that breaks! Hence the name, The Riftbreaker and I am about to break some rifts before long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor controls re base building on controller. refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i didnt win the screenshot contest   *throws middle finger*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the endgame update and the mega structures, this was great. It had many options and ways you could tackle the game. You could do the DLC in any order if you're far enough, you could progress the story regardless of your skills, and get the full experience.\n\nWith the mega structures, the focus has become singular - do the DLC to get the nukes, obliterate everything. There is no more, \"We must save the world and us, too.\" There is no more balance - it is literally, \"Waste all of the resources on this mega structure and kill everything that comes to destroy it.\"\n\nThe mega structures take colossal amounts of resources to maintain and build. That's understandable since that's literally all they're meant for. Sure, they have some good benefits, like showing the entire map and its mining spots, or increasing farm yield, but... they're thankless and full of bugs.\n\nGet this. I built the entire thing up and powered the final structure. Mr. Riggs told me, \"Hey, the last wave is coming, better be ready.\" I was like like, well, ok, good, bring it on. I had good defenses, I had good items and gear, so start it up. What happened next was just pathetic.\n\nMy entire base was obliterated. My mega structures, which you can build more of on one map because nothing stops you, well, one bit the dust. More than half of my base, despite finishing all of the DLC and having upgrades everywhere, was just wiped out because multiple mega units came out and just killed everything. The mods these things have are stupid - heal all in an area, prevent damage to it unless you're in its bubble, and so forth. How is a tower supposed to kill that? This isn't that kind of game!\n\nThe worst thing is you can't repair your dead mega structures, you have to just dismantle it and start from zero. I had all of them maxed. I had all of their research maxed - I literally cannot research anything else in this game and have to start over mining titanium and uranium because of these monstrosities.\nThe entire tone is off here, you're not solving anything and are instead killing literally all life with nukes to build stupid structures to strip-mine the planet. I can no longer maintain titanium because all of the cooling needed for these things, like what is that? The power plants alone rip apart an entire mining outpost!\n\nOk, so whatever. I build it back up and try again, thinking, \"I have the power, I have the cooling, I have the magma and whatever else it needs. Turn it on - I died once, the final wave won't come again. That'd be dumb.\" The final wave comes again and just rips it all apart again. I built it all up a second time, it gets utterly annihilated again. I revert to my save and can't build my arcology again because I can't repair my dead structures.\n\nWhat a cycle of hate toward the player. You make it unwinnable, you make the structures unfixable, you make the economy function on death and strip mines, and you make it endless. Every time you power the final building, the death wave comes and literally kills some feeble part of your base, restarting the cycle. At that point, one of your outposts is out of resources, so you're now forced to spend hours building another to try again.\n\nWhat happened here? Why do I have to fight monsters with affixes like in an ARPG with just bullet sponges and healing all over the place, not to mention invicibility zones? Why does my base mean nothing? Why is research thrown away in favor of just killing everything? Why do the resource outposts just get spat on by the requirements of endgame buildings? Are you serious with this game, because I don't get it anymore. You had something special and now have this mess where you have you spam special attacks, your towers just die all the time, you waste our lives with buildings that can't be repaired, and you're merciless in failure. Are you happy?",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "TLDR, devs released a massive update that reworked a load of the game into a botched mess that isn't fun or exciting anymore.\n\nPutting a negative review on this game is kinda heartbreaking. For a long time this was one of the easiest recommendations I've been making to people. Hands down one of my favourite games of all time. I even did some speed running. However the coop updates have pretty much ruined the game imo. I played maybe 20 minutes into a new game once the update was out and haven't touched it since. Reading the dev log for the latest update that reworks movement skills (around mid October 2025) has been depressing, and a clear indication the game is going in a direction that I don't enjoy.\n\nThere are big issues and small issues. Some of the biggest issues have been how the economy was reworked. As the amount of bases you can have has increased, the amount of resources you can be harvesting at once has increased. To compensate, all researches now have a huge resource cost associated with them. Even the first ones you can do. You might be sitting afk for 10+mins waiting for resources because you don't get lots of resources outposts until the late game. Why this massive roadblock exists early is bizare and fun killing.\nTier 2 and 3 resource extractors now harvest half the amount. These changes mean that you need a higher amount of resource outposts simply to get to the level we had before. Why increase the amount of bases we can have when there is no benefit to it, and the huge downside of butchering the early game and wasting our time with setting up all these extra bases?\n\nThe resource cost to researches has other side effects. A lot of researches that unlock things that need rarer or later game resources also need said resource to research. This may not sound like an issue, after all if you don't have the resource you can't use the results of the research. However some items that require resources X are gated by researches that unlock items that use resource Y. Before you could research the item you can't use to get the item you can use. Now you can't. This forces a much more linear and fixed path through the game, rather than the more open choices we had before. You can turn down resource costs to 1% but not 0%, you can't get this choice back.\n\nPreviously, weapons and gear you crafted had some degree of randomness to them. The higher tier the weapon/item, the more random bonuses it would have. I can understand why some players would find making 20 of a weapon, choosing the best, and then dismantling the other 18 or 19 to be boring. Personally I found it a nice addition that let me have a little more choice in what I wanted from my gear. Do I want something super ammo efficient? Then build a weapon with better efficiency and throw on some ammo cost reduction mods. Weapons with different stats still exist, but they have to be gathered either from 'anomalies' in the environment, or as random drops from enemies. This is a pure downgrade, as we are now massively timegated in trying to aquire the gear we want. While the game does have some ARPG elements to the how combat works, it's not an ARPG and was never trying to be one. I don't want an ARPG. Stop moving the game into a new genre I beg.\n\nThe movement skill reworks have gone in this direction to. Rather than simple functional movement skills, they've all becoming flashy damaging abilities like in an ARPG. The teleport skill, one of my 2 most core movement skills, has been made visually and functionally frustrating going by the gifs they've shown off/the devs descriptions of how it works now.\n\nThen there are the smaller issues, mainly visual. With coop being a new focus, the devs have decided to reduce a lot of visuals to make things more 'readable'. This makes the game less visually interesting and dynamic. Smaller, shorter lived explosions. Effects removed. All in the service of a mode I'm not even playing.\n\nThere is *one* half good thing in this update. The devs have let us keep the original version of the game via a beta branch. Unfortunately that means no more updates, being locked out of the expanded late game (might have been good? I don't know, can't stomach the early game anymore so I'll never get to play it), and the further expansions. I don't have enough time to spend modding the game's visuals back to pre-nerf, removing the resource costs, restoring the economy, etc. I won't play the old version anymore since this has left such a bad taste, and I'll be lamenting missing out on potentially good new content buried deep in the botched rework of a game that was previously amazing and never needed it.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Game starts really cool with really good ideas\r\nBut the final moments of the game, oh my god, every second is a nightmare\r\nThe game does not get harder, only more time consuming. Play until mid/end campaign and then pretend that you have finished it",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Used to be great, mods don't load anymore, they broke things with 2.0 it seems.\r\n\r\nEven if you can start a new game with mods, your save game won't load the mods the next day. \r\n\r\nAvoid purchase for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a fairly fun time right up until maybe 2 hours before the \"end.\" I found out there was a postgame section, and I was down to do it right up until I saw the material requirements of the very first postgame building. I promptly looked up everything else, and saw how brutal everything got, and I'm fine never seeing the rest of this game, nor do I care to play the DLC.\n\nI think the idea of the game is neat, but having to constantly stop what I'm doing because Mr. Riggs has a new swarm of enemies for me to fight was frustrating. Sure, every now and then, yeah. It's fun and engaging when its a surprise. But, it felt like I was getting interrupted every 5 minutes. I'm just trying to figure out pipes and power stuff, please Mr. Riggs, I need a minute. I played this game in Co-op and I cannot imagine doing it by yourself without very heavily investing in defenses for every base you build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Feels like an endless tutorial[/h1]\nI might have gotten the wrong impression, but I envisioned The Riftbreaker as Factorio but with an emphasis on combat and exploration. On a surface level that assumption was accurate, but in practice the two halves of the game did not mesh. \n\nThe combat and exploration part is passable enough. Combat looks and feels great, but most of it just amounts to gunning down massive hordes of creatures. Except for a few tougher enemies, it was more about being at the right place at the right time and conserving ammo. Defending you base is a bit odd since it grows quite large and you cannot possible use turrets to defend yourself from the big hordes. Unlike Factorio, where you can predict which direction enemies are going to attack from, as well as being able to wall of big sections of the map, in The Riftbreaker enemies attack from random locations, the terrain is too open to section off and turrets are too limited to make static defenses viable. You are better off just teleporting to where enemies are attacking and shoot them yourself. Outside of attack waves, the enemies never pose any threat and do not attack your base, so it is a bit of all or nothing.\n\nThe base building was promising at first. Gather resources to build new buildings and upgrade your factory as well as forging new equipment. But it quickly plateaus and never increases in complexity. There is no logistics management and only a few multi-stage recipes. Most of your expansion is just building more and more of the same buildings.\n\nWhen the game started to lose me entirely is when I realized that the game just followed the same loop over and over. Explore a new area, find new resources, unlock the next tier of stuff and return to your base. In essence it is what every survival crafting game should be about, but it was so repetitive and it felt copy pasted. Progression is also mostly linear with set objectives to complete in a set order. It kept waiting for the tutorial to be over so I could explore the game freely, but it never happened. So sense of freedom or problem solving, just follow orders.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Riftbreaker is one of those games I wish I could put like a little middling thumb on. I think it's... fine, for about half of it, and then the other half just becomes a bit of a chore. It goes from \"Oh, this is novel!\" to \"The Keywords for today are: Repetitive, tedious.\"\n\nA lot of this game is... straightforward, or simple? And I don't think that's a bad thing, it was probably the right choice for this game, I can't help that it also makes the game feel a bit mindless. There isn't really that much complexity to the building, nor the defending, nor the combat really. Sometimes it's fun to hold the mouse buttons and watch hordes of creatures turn into groups of red mists, othertimes it's really dull. There's an initial satisfaction to watching a tower-line hold a group of enemies all on its own, but then it... Now I'm repeating myself.\nThat is a *lot* of this game. Busy work and chores. I don't dislike it enough to give it a hard no, but I also don't like it enough to give it a hard yes.\n\nThis is only made worse when you're exploring other areas. The flow is like this:\nDeploy to an area -> oh no there's something we didn't see that complicates things -> we should research a solution to this -> go to new place -> Oh there's new materials here -> hunt around for ages gathering small amounts of this resource -> get enough to scan for big deposit -> also there's some optional material (but go get it because you need new guns) -> setup two entirely new bases and then half ass them because if you aren't here you don't need to defend it.\n\nExcept it gets more irritating each time? I don't think it's bad in isolation, but these issues are rarely complex enough to have to dedicate entire... chunks of gameplay around it. The Acid area has fungus that rapidly grows all over the map. So now you get to spend ages running around the corners of the map isolating the fungus colonies with flooring that doesn't stop them from growing sometimes, or you just blow up the acid colonies because despite all of Ashley's cautioning of \"This could have negative effects on the ecosystem\", there apparently isn't any.\n\nOr the lava area. You can't build anywhere that's outside of cold areas. THis is initially interesting, since you're forced to build outposts around the cold plants that naturally spring up around this zone. And also there's big magnetic rocks that stop you from building near them - I hope you went to the acid zone first to get the acid gun that destroys them, not that you'd know without constant sustained fire with a dialogue that \"sort of\" hints at this.\nAnd that's skipping the part where you go here, find the complication, go to a new area to research a solution, go to a new area to get material samples, go to a new area to actually get the materials, etc.\nAnd when you're done with all of that, you go back to HQ and build your big portal back to home and then defend it for a few minutes against huge attack waves that are a problem if you haven't prepared properly (get some long range artillery in there and a few shield generators at your frontlines), and... wait for 2 minutes because the attack waves stopped and the portal is halfway done. Huh.\nThat's like, basically the whole game. Do a thing, have ashley and riggs back and forth about things they both know but you're being tutorialised. Go to a new place. Dont do anything at new place but scan (thank god for scanner turrets). Go to new place. Find thing. Research thing. Unlock the solution. Build a real base at the new place. Half ass it because you're tired of defending everything. Repeat several times. Now win the game.\n\nI'll throw up my hands and admit I dragged this out longer for myself. You see, I was tired of building the same solution to every biome: A bunch of walls close to the map edges in choke points that funnel monsters into killwalls. SO I came up with a solution: Wait, some areas [i]have no monster invasions.[/i] Some areas have SCRIPTED monster attacks that are [i]predictable.[/i]\nSo I went back to my cultivator farms I setup hours ago that were needed for getting specific materials to build new guns/upgrades/research. And I spent AGES setting up cultivator farms for Cobalt and Uranium. I then went to the acid zone cultivators, since it's free of the ever expanding acid fungus, and spentAGES making palladium/titanium farms. I then went to the lava \"grow\" quest (where you arent tasked with growing anything in defiance of this trend, and instead get a pittance of material to build things with), imported some water via compressors, setup MORE titanium here (more efficient), and then spent AGES setting up dozens and dozens of lava power plants to sustain my dozens of tower munition factories and Carbonium/Ironium Fabricators so I could have infinite basic materials forever. And then I built so much storage I had 200K+ storage for all materials. That one is on me, and to be fair: I kinda had fun doing it!\n\n[h1] post game spoiler discussions! [/h1]\n\nSo, the post game comes with building these megastructures. I was reassured that, yes, these buildings will be hard to construct. They cost a huge amount of resources, require a lot of logistics, and I need to plan around them!\n... Nnno, not really. Okay, yes, I set up the big special boy lab in a new zone, kitted it up with everything it needed, and then waited there for all the upgrades and research. And then after that, I took the cultivator megastructure, put it in my acid zone with all those farms I mentioned from before, and then built 20 water purifiers (or however many it took) in the old reliable MANIFOLD style.\nI then built the drone megastructure somewhere in one of my desert bases, since all I needed was shit loads of energy, and just build rows and rows and rows and rows of solar panels and batteries to power the thing.\nI built the gravity lens thing in the lava area with all my fabricators, and just made all the supercoolant onsite - manifold style.\nAnd... whatever the other one was. And that was it. Sitting there, with maxed out \"build for cheap and fast\" items equipped, cycling between these structures as they upgraded. Yes, it was really hard waiting 20 minutes REAL TIME, doing nothing, waiting for the next level of megastructure to unlock.\nThe best part of this, in my opinion, was actually the big final structure we didn't tell you about until now, and that's even bigger! And requires a lot of everything!!! And requires even MORE resources to operate!!! I'll give it credit, and say it took me a bit of utilising structures I hadn't up until this point.\n But it was beaten like all the rest. In the old, faithful combat style of industrialisation...\nMANIFOLD STYLE.\n\nBut the resulting defence was not hard. Nah. It went the same way. As every other defence did. Walls in choke points. Setup clump of turrets, back them up with shield gens and long-range artillery. The only reason it got hairy was because I couldn't be bothered setting up all the defences to make it snoozingly easy.\n\n\nSome of it was cool, like how the megastructures give you big buffs - like being able to see what all deposits are on the map, even when not revealed. That's cool. Or the megastructure cultivator thing massively buffing all cultivators in that region. But the rest of it felt like a chore, especially for the underwhelming ending.\n\nThis isn't even going into the story, which is... like it's there. It's not a bad premise or anything, it just frustrates me in a way I can't quite explain with the word count I have and what I decided to focus on. In short: Ashley, look, you have a noble goal, but there is no \"Nice\" colonisation. You at least achieved your goal of not destroying the planet, but that was still built on the hundreds of thousands of indigenous fauna we turned into mists of red with the soul-piercing anti-materiel rifle, and the miniature nuclear warheads from the heavy artillery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has me torn between liking and disliking it, the co op does make the game more enjoyable, however mid to late game turns the game into a resource grind rather then a combat / base building game. We found ourselves more often then not setting up more / new outposts to keep up with the resources needed to progress the game then we did playing the actual campaign which lead to us pretty much getting bored of it and never finishing it. \r\n\r\nOn top of this the \"quests\" you had to do seemed very generic, Go here  couple times and look around, ok now go back and look around! Also the sheer amount of time you waste listening to the back and forth between the main characters is just staggering. I tried looking up a way to skip the dialog but people have been requesting this feature since the games release YEARS AGO and they never choose to implement it. Often times missions would take longer to complete just because you had to hear them talking endlessly over something you already did while they where endlessly talking.\r\n\r\nOverall id give it a 6/10 as a game to play when you have nothing else to do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Came back to try the 2.0 update. I cannot recommend this.\n\nThe game seems to just have everything in it, to the point that the games focus is sacrificed. Ostensibly, the game should be a medium-fast paced base-building w/ tower defense + exploration experience, but somehow manages to be a slow-paced twin-stick looter-shooter. It feels as if the latter cannibalized the former.\n\nEverything feels like a massive chore.\n\n#1 The bioscanner, it takes 3-4 seconds per scan but you'll need 30+ scans of a creature to learn what damage type it's weak to. So you are subject to this incredibly boring mechanic unless you google the information instead.\n\n#2 The research, it takes forever, you can't just build more labs b/c there's a maximum number you are allowed to build. Research also costs a mountain of resources for some reason, meaning the typical experience is to dump the majority of your resources into *just starting the research process*, then wait around doing nothing b/c you are out of resources for the next 5 minutes. Or you might try...\n\n#3 Exploring, there is another pod of enemies every 5 feet so just walking around looking for stuff is like trudging through deep mud, it's so obnoxious that the best upgrade for your mech is stealth. And you will want stealth for...\n\n#4 The geoscanner, slightly more tolerable than the bioscanner, a ton of resource patches are hidden so get used to holding space-bar everywhere you go.\n\n#5 No blueprints, practically a mortal sin for a game like this.\n\n#6 The loot. Jesus Christ what is with the loot. You could probably finish this game without ever crafting a weapon b/c the wildlife on this unexplored alien planet are constantly dropping miniguns and rocket launchers; Mech cosmetics, different color floors & lamps, statues, weapon attachments, you name it and some space-raptor you disintegrated has it in their pocket. From what I've experienced the exploration objects (\"bioanomalies\") hold maybe 1 - 2 loot items and you need to explore (see above) to find them, but a typical attack wave will drop a dozen or so loot items so why even bother.\n\n#7 Charge-Mode on weapons. The combat in this game consists of *several thousand* enemies rushing at you very fast, so why, why, why does *almost every weapon* have a charge-mode. Charge-mode (holding the button down), forces the player to split their concentration between the tsunami of space-raptors chasing them and watching/listening to the mechs right arm for the correct time to release the right mouse button; additionally charge-mode slows the mech down thus eliminating the ability to kite opponents. These are design decisions which strongly conflict. Aside from some charge-modes just being downright silly (you can charge the nuke launcher to make it nuke harder), most offer little to no advantage at all. But let us be real, you're only going to use about 10% of the arsenal anyway, none of them with charge-mode, minigun/plasmagun/laser/boxing-gloves/chainsaws.\n\n\n\nI remember liking the game on my first go through back in v1.0... but now...\nThe game in current state is extremely slow and laborious, has multiple conflicting design decisions, and IMO has lost focus on what the experience should be, seemingly in pursuit of some kind of RPG grindfest.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Very clunky and unpolished. Even in \"version 2.0\", four years after its original release, it feels like an early beta. The elevator pitch for the game is that it wants to synergize several different genres by feeding rewards from doing well in one area into doing well in other areas. It's a neat idea, and it's executed well enough that I did play one whole campaign, but the execution is so messy that I would not recommend it for single player and probably not for multiplayer.\n\nFor me, the nail in the coffin of this recommendation is that the balance between different game aspects is bad. There is one right way to play in terms of power scaling and it makes all the other ways minor fiddly obstacles. In single player this is annoying, and I imagine that in multiplayer it would just be sad that the people who focus on different aspects see far less award for their efforts.\n\nThere is a very simple exponential loop in base building resource generation that shows up a few hours in and stays for the rest of the game. It removes most of the challenge and most incentive to engage with all the other mechanics. Base building stops being a puzzle and just becomes a matter of manually printing a template. Enemies die to \"just use more gun\". Even narratively this option is the \"green\" one. Tech is cheap compared to the power potential of base building.\n\nEquipment handling is a nightmare. Maybe that's subjective, but the reward for doing it well is objectively pitiful. While base building gives you orders of magnitude improvement, equipment bonuses are less than +50% even at the highest level of equipment slot. Your equipment dps improves by one (1) order of magnitude over the course of the game, but the majority of that is locked behind technologies that take resources from base building.\n\nCombat is serviceable but doesn't really evolve over the course of the game. In the endgame, it starts lagging even in singleplayer, with over a second of input lag and a much reduced game speed even though Steam reports a 100fps framerate. Every weapon exists at every tech level, all the enemies that matter just become tougher reskins rather than requiring a different approach, and boss enemies are too weak to reward planning. Bioscanning adds some extra challenge but its rewards are miniscule and become logarithmically more miniscule (did you like that +5% for scanning a hundred enemies instead of shooting them? How about +10% for scanning a thousand?), and there is no complexity to it.\n\nExploration is fine but seems underdeveloped. There are three biomes and you only need four bases, though each of the other three bases has a short fetch quest sequence where some missions actually require creative puzzle solving. Strangely, despite the game giving you multiple different options and despite the tech tree having resource requirements that incentivize you to prioritize specific biomes depending on your basebuilding and/or weapon choice, the explanation of mechanics expects one specific order (top to bottom in the hub menu). Doing it \"out of order\" means hearing voice lines that refer to events that haven't happened yet and lacking information about how to use unintuitive UI elements.\n\nThe story is bare-bones, but from the amount of voice lines you wouldn't think so. They even have the characters lampshade how perfunctory their voicelines are. The characters are one-dimensional and there is no character development to speak of, and the first time the pilot's supposed care for the environment actually translates into a mechanical choice is choosing whether to go for the True Ending or not. The plot up to this point is just \"do the work necessary to open a rift gate back to earth\", with not even a hint of any other option until you're one keypress away from opening the gate.\n\nAudio design is subpar. There is no volume limiter for multiple entities producing the same noise so upgrading a field of solar panels blows out your speakers. The pilot's voice actor doesn't seem to have been given good direction for her lines: her tone of voice and use of emphasis don't correlate with the gameplay and story implications of what she's saying.\n\nThe graphics design is inoffensive. Customization is perfunctory. There are at most 10 texture-only skins for your character, and a few buildings that do nothing and cost a small amount of resources.\n\nPerformance-wise, the game is poorly optimized, even within the confines of the engine. As mentioned above, endgame combat lags even on a €1000 PC, but even just the bases necessary for the first ending seemed to cause a bit of lag despite only one base being visible at a time. And while mines do run out while you're not looking, enemies do not spawn, so there's no gameplay justification for rendering other bases in enough detail to cause lag. One enemy (the yeast) expands on its own and starts lagging the game if it is left unchecked for 15 minutes, despite just being a stationary field that is safe to ignore from a game mechanics perspective. There is no engine reason for this enemy to take this many resources to render, it's just less programming.\n\nIf this game was in early beta, I would say that it's brimming with potential. Tweak the game balance and performance, do a second pass on the voice lines, and it would honestly be great. But given it's four years after release, with a bunch of DLCs and with 2,0 adding more features rather than polishing the existing ones, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like the concept. The art is gorgeous. Jay for a factory builder that isn't brown, a different shade of brown and grey. But it also crashes frequently on my system regardless of how I changed the settings around (modern setup with RTX 4070). Played for a total of about 40 minutes and had three crashes. Spent about the same time googling in between sessions for solutions but couldn't find anything that worked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: Played in party of 4 with 2 adepts of base building games on hardest base difficulty (Brutal). Finished campaign in less than 15 hours. You end up repeating the same stuff beyond the first 2 hours. Definitely not recommended unless you're an absolute addict for those base building, busy work types of games.\r\n\r\n---\r\n\r\nFun for about 2 hours, then you realize you'll be repeating most of what you did for the other 12 hours it took our party to finish the campaign. I was convinced by my gaming group to buy this, but if, like me, you don't have this urge for busy work or optimization in your games, then this will be a massive letdown. Even for those min/maxers out there, the Brutal difficulty hardly challenges you, especially if you play in a group.\r\n\r\n[spoiler]After you're done with the campaign, it seems it's more of the same busy work: There is no more main objective if you choose the alternate ending.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cant in good faith recommend what would be a super sold game due to the nature of scaling that just pushes things far too much. \r\n\r\nNormal Mode, but facing enemies that I will empty a million rounds from turrets and only stop 40% of a wave. Just tired of the scaling never ending. At this point, I could have depopulated the planet for sheer amount of dead.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game does a really good job at so many things. The combat is fun, the building is fun, and the tower defense aspect is great.\n\nThe job does a Horrendous job at telling you what to do next. I cant' build the research station or any building in that tree and all of my mission objectives are great.\n\nDevs : Please give a much clearer path to the next objective, Its killing the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am at almost 100 hours, I have finished up to the metal dlc and I figured it had been a couple years since I played. It is very evident they have tweaked this game for co-op, researching did not cost resources last I played. So all they did was make the slow beginning even slower if not painful since certain early mobs are made of rock, aka immune to normal non explosive damage. A few years ago I would have recommended this game no questions asked, now? Go play palworld or something. I am too far in and will probably not play past the dlc I own unless it is very cheap or free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could I would rate it neutral, but no such option exists so I will default to using negative rating - if you can stomach these downsides, you will have a good time I guess. I decided to buy Riftbreaker because I enjoyed playing Co-op survival - it was really challenging mode and had tons of fun on the playtest, why not buy it and enjoy the campaign?\n\nGAMEPLAY LOOP\nThe game is less of a Factorio/factory builder but a more complex Supreme Commander with buildings-only instead of units. Hack n slash elements are fun, but there feels that there are too many buildings and weapons with too little distinction between them (what's the difference between SMG, shotgun and minigun turret? they all use same ammo). Brutal difficulty is a joke comparing to normal survival settings I've played on with co-op buddies - I never struggled in the Campaign resource-wise or with enemies. \n\nThe difficulty gap between the two is insane and more casual players WILL get scared of Survival which is fun mode that respects your time more and expects you to play very aggressively as if it was a competitve RTS match. Exceptions are bosses which range from 'joke' to 'bullshit' territory, worst of those being bulletsponges with ensnare ability that will constantly cage you and kill you with DoT. DLC seem to be expected for the game as they exist in the game in very confusing state - I was wondering why particular research branches remain locked to me. Turns out developers didn't bother gracefully adding them AFTER Player purchases them, so you will always have missing research because fuck you, you didn't pay enough.\nBugs - besides enemies, there are bunch of spelling typos, hangups after dialogues that need a minute or two to 'unfreeze' so the new objective is available or a research can be activated. I had a few 'invisible unplaceable zones' that were apparently managed by a nearby loot crystal summoning enemies - NOT the crystal itself but apparently the spawn zone of one group prevented me placing objects there. OK. \n\nVOICE ACTING & WRITING\nHonestly the less story writing there is, the better. The premise is pretty good, ultimately ruined by pro-bug activist that has bleeding heart for the local environment that would maul anyone within seconds. One thing that factory building games should avoid is making cringy voice-acting, limiting it just to prompts - Factorio does this masterfully, Satisfactory does it good as it only does per-research basis.  \nThis game doesn't know this and it will play dialogue at every step - not enough resources, bad placement, attack incoming, storyline blabbering and so on. The mech AI is OK and I can stomach him, however the main Mary Sue is unbearable to listen to. No, I don't care about bugs, I don't care to hear how you lost your arm for 100th time that we never see anyway. Mr Riggs rightfully calls MC insane and I wish AI would court-martial her in the field by just throwing her out of the suit and leaving to live with the bugs if her bleeding heart loves them so much.\n\nUPDATE TWO-POINT-POO\nTerrible waiting times for 'end game content' - even with max labs (which are limited), you can do ONLY THREE RESEARCHES PER HOUR, AND THERE ARE 20 NEEDED! Making long research makes sense IF there is a way to make it faster. Factorio allows you to build more research labs and supply to accelerate it as much as you wish, and Satisfactory allows you to do the same with Space Elevator progress (but just industry). Yes, you CAN upgrade labs but with limited quantity and 'end-game' you will already have those maxed. This either feels like a bad joke or a malicious move to make Players 'enjoy more content with 2.0' which is clearly seen with insane growth of resource cost and research length. More time spent does not mean its better.\n\n__\nTo be honest, Survival is more fun than Campaign itself, especially if you do it with your friends. But if you want to commit to a campaign, play Factorio, Satisfactory or another factory builder game that respects your time and doesn't beat your head with environmentalism. If you adjust research sliders to 10%, turn off dialogue volume I think you will enjoy the game if its on the sale.\n\nEdit: just experienced a bug where I'm permanently stuck in Headquarters zone and I cannot leave because of 'imminent attack' except... they have been coming and going for past few hours I've been waiting for research to end. My save is fucked.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the game, really, but the bugs, the performances, and the missing of Linux compatibility, this is a real technical shit. It is sad to see a mostly great game design (even if the end game is free), with a such shit on the technical point. I got stuck with mission progression, and I can't manage to continue my campaign, lost hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is way too difficult and when swarms attack, you loose overview. There happens too much at the same time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coop is unplayable due to heavy lags. My network connection is good, because I can play Factorio and Satisfactory in coop with little lag, so the problem is on Riftbreaker's side.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "max graphics playing 144hz\nthen why the game lag so bad when everything containing Supercharged Plasma was destroyed\nveins do not disappear on mini map",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game lags to the point where you can not play. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game but sadly just too buggy. It constantly will open on the wrong monitor. If you try to move it or use the config tool it wont recognize the main monitor resolution. The most recent DLC just crashes constantly. Its a shame that such a fun game has just become unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me. It seems good. I really wanted to like this. But I just don't understand how anyone finds this type of game fun. There's so much going on at once on the screen (yet weirdly very little that's helpful) and there are too many things to keep track of. You could argue it's realistic but it's just not....fun.\n\nI'm sure others will like it. The graphics are good, and the devs seem responsive and are giving it updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun yet confusing! But overall, the controls suck! It runs like crap! I can't even play with my friend and it slows down constantly, the only positives is the game looks beautiful, the loading screen looks amazing! And overall the presentation while good is poorly executed. I still struggle because the controls feel like I'm being sucked into a vaccum cleaner and I have no idea half the time if it's the game of the devs fault. Because that's how God awful these controls are and it doesn't satisfy me not even in the slightest. The controls do run better with a PS4 controller but my God they still suck!\n\nUpdate: I hope the devs fix it, I really want to give them a better review. I hate leaving a negative review for this game. At first, it reminded me of Neo Contra now, it reminds me of a game that breaks! Hence the name, The Riftbreaker and I am about to break some rifts before long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor controls re base building on controller. refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i didnt win the screenshot contest   *throws middle finger*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the endgame update and the mega structures, this was great. It had many options and ways you could tackle the game. You could do the DLC in any order if you're far enough, you could progress the story regardless of your skills, and get the full experience.\n\nWith the mega structures, the focus has become singular - do the DLC to get the nukes, obliterate everything. There is no more, \"We must save the world and us, too.\" There is no more balance - it is literally, \"Waste all of the resources on this mega structure and kill everything that comes to destroy it.\"\n\nThe mega structures take colossal amounts of resources to maintain and build. That's understandable since that's literally all they're meant for. Sure, they have some good benefits, like showing the entire map and its mining spots, or increasing farm yield, but... they're thankless and full of bugs.\n\nGet this. I built the entire thing up and powered the final structure. Mr. Riggs told me, \"Hey, the last wave is coming, better be ready.\" I was like like, well, ok, good, bring it on. I had good defenses, I had good items and gear, so start it up. What happened next was just pathetic.\n\nMy entire base was obliterated. My mega structures, which you can build more of on one map because nothing stops you, well, one bit the dust. More than half of my base, despite finishing all of the DLC and having upgrades everywhere, was just wiped out because multiple mega units came out and just killed everything. The mods these things have are stupid - heal all in an area, prevent damage to it unless you're in its bubble, and so forth. How is a tower supposed to kill that? This isn't that kind of game!\n\nThe worst thing is you can't repair your dead mega structures, you have to just dismantle it and start from zero. I had all of them maxed. I had all of their research maxed - I literally cannot research anything else in this game and have to start over mining titanium and uranium because of these monstrosities.\nThe entire tone is off here, you're not solving anything and are instead killing literally all life with nukes to build stupid structures to strip-mine the planet. I can no longer maintain titanium because all of the cooling needed for these things, like what is that? The power plants alone rip apart an entire mining outpost!\n\nOk, so whatever. I build it back up and try again, thinking, \"I have the power, I have the cooling, I have the magma and whatever else it needs. Turn it on - I died once, the final wave won't come again. That'd be dumb.\" The final wave comes again and just rips it all apart again. I built it all up a second time, it gets utterly annihilated again. I revert to my save and can't build my arcology again because I can't repair my dead structures.\n\nWhat a cycle of hate toward the player. You make it unwinnable, you make the structures unfixable, you make the economy function on death and strip mines, and you make it endless. Every time you power the final building, the death wave comes and literally kills some feeble part of your base, restarting the cycle. At that point, one of your outposts is out of resources, so you're now forced to spend hours building another to try again.\n\nWhat happened here? Why do I have to fight monsters with affixes like in an ARPG with just bullet sponges and healing all over the place, not to mention invicibility zones? Why does my base mean nothing? Why is research thrown away in favor of just killing everything? Why do the resource outposts just get spat on by the requirements of endgame buildings? Are you serious with this game, because I don't get it anymore. You had something special and now have this mess where you have you spam special attacks, your towers just die all the time, you waste our lives with buildings that can't be repaired, and you're merciless in failure. Are you happy?",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "TLDR, devs released a massive update that reworked a load of the game into a botched mess that isn't fun or exciting anymore.\n\nPutting a negative review on this game is kinda heartbreaking. For a long time this was one of the easiest recommendations I've been making to people. Hands down one of my favourite games of all time. I even did some speed running. However the coop updates have pretty much ruined the game imo. I played maybe 20 minutes into a new game once the update was out and haven't touched it since. Reading the dev log for the latest update that reworks movement skills (around mid October 2025) has been depressing, and a clear indication the game is going in a direction that I don't enjoy.\n\nThere are big issues and small issues. Some of the biggest issues have been how the economy was reworked. As the amount of bases you can have has increased, the amount of resources you can be harvesting at once has increased. To compensate, all researches now have a huge resource cost associated with them. Even the first ones you can do. You might be sitting afk for 10+mins waiting for resources because you don't get lots of resources outposts until the late game. Why this massive roadblock exists early is bizare and fun killing.\nTier 2 and 3 resource extractors now harvest half the amount. These changes mean that you need a higher amount of resource outposts simply to get to the level we had before. Why increase the amount of bases we can have when there is no benefit to it, and the huge downside of butchering the early game and wasting our time with setting up all these extra bases?\n\nThe resource cost to researches has other side effects. A lot of researches that unlock things that need rarer or later game resources also need said resource to research. This may not sound like an issue, after all if you don't have the resource you can't use the results of the research. However some items that require resources X are gated by researches that unlock items that use resource Y. Before you could research the item you can't use to get the item you can use. Now you can't. This forces a much more linear and fixed path through the game, rather than the more open choices we had before. You can turn down resource costs to 1% but not 0%, you can't get this choice back.\n\nPreviously, weapons and gear you crafted had some degree of randomness to them. The higher tier the weapon/item, the more random bonuses it would have. I can understand why some players would find making 20 of a weapon, choosing the best, and then dismantling the other 18 or 19 to be boring. Personally I found it a nice addition that let me have a little more choice in what I wanted from my gear. Do I want something super ammo efficient? Then build a weapon with better efficiency and throw on some ammo cost reduction mods. Weapons with different stats still exist, but they have to be gathered either from 'anomalies' in the environment, or as random drops from enemies. This is a pure downgrade, as we are now massively timegated in trying to aquire the gear we want. While the game does have some ARPG elements to the how combat works, it's not an ARPG and was never trying to be one. I don't want an ARPG. Stop moving the game into a new genre I beg.\n\nThe movement skill reworks have gone in this direction to. Rather than simple functional movement skills, they've all becoming flashy damaging abilities like in an ARPG. The teleport skill, one of my 2 most core movement skills, has been made visually and functionally frustrating going by the gifs they've shown off/the devs descriptions of how it works now.\n\nThen there are the smaller issues, mainly visual. With coop being a new focus, the devs have decided to reduce a lot of visuals to make things more 'readable'. This makes the game less visually interesting and dynamic. Smaller, shorter lived explosions. Effects removed. All in the service of a mode I'm not even playing.\n\nThere is *one* half good thing in this update. The devs have let us keep the original version of the game via a beta branch. Unfortunately that means no more updates, being locked out of the expanded late game (might have been good? I don't know, can't stomach the early game anymore so I'll never get to play it), and the further expansions. I don't have enough time to spend modding the game's visuals back to pre-nerf, removing the resource costs, restoring the economy, etc. I won't play the old version anymore since this has left such a bad taste, and I'll be lamenting missing out on potentially good new content buried deep in the botched rework of a game that was previously amazing and never needed it.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Game starts really cool with really good ideas\r\nBut the final moments of the game, oh my god, every second is a nightmare\r\nThe game does not get harder, only more time consuming. Play until mid/end campaign and then pretend that you have finished it",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Used to be great, mods don't load anymore, they broke things with 2.0 it seems.\r\n\r\nEven if you can start a new game with mods, your save game won't load the mods the next day. \r\n\r\nAvoid purchase for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a fairly fun time right up until maybe 2 hours before the \"end.\" I found out there was a postgame section, and I was down to do it right up until I saw the material requirements of the very first postgame building. I promptly looked up everything else, and saw how brutal everything got, and I'm fine never seeing the rest of this game, nor do I care to play the DLC.\n\nI think the idea of the game is neat, but having to constantly stop what I'm doing because Mr. Riggs has a new swarm of enemies for me to fight was frustrating. Sure, every now and then, yeah. It's fun and engaging when its a surprise. But, it felt like I was getting interrupted every 5 minutes. I'm just trying to figure out pipes and power stuff, please Mr. Riggs, I need a minute. I played this game in Co-op and I cannot imagine doing it by yourself without very heavily investing in defenses for every base you build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Feels like an endless tutorial[/h1]\nI might have gotten the wrong impression, but I envisioned The Riftbreaker as Factorio but with an emphasis on combat and exploration. On a surface level that assumption was accurate, but in practice the two halves of the game did not mesh. \n\nThe combat and exploration part is passable enough. Combat looks and feels great, but most of it just amounts to gunning down massive hordes of creatures. Except for a few tougher enemies, it was more about being at the right place at the right time and conserving ammo. Defending you base is a bit odd since it grows quite large and you cannot possible use turrets to defend yourself from the big hordes. Unlike Factorio, where you can predict which direction enemies are going to attack from, as well as being able to wall of big sections of the map, in The Riftbreaker enemies attack from random locations, the terrain is too open to section off and turrets are too limited to make static defenses viable. You are better off just teleporting to where enemies are attacking and shoot them yourself. Outside of attack waves, the enemies never pose any threat and do not attack your base, so it is a bit of all or nothing.\n\nThe base building was promising at first. Gather resources to build new buildings and upgrade your factory as well as forging new equipment. But it quickly plateaus and never increases in complexity. There is no logistics management and only a few multi-stage recipes. Most of your expansion is just building more and more of the same buildings.\n\nWhen the game started to lose me entirely is when I realized that the game just followed the same loop over and over. Explore a new area, find new resources, unlock the next tier of stuff and return to your base. In essence it is what every survival crafting game should be about, but it was so repetitive and it felt copy pasted. Progression is also mostly linear with set objectives to complete in a set order. It kept waiting for the tutorial to be over so I could explore the game freely, but it never happened. So sense of freedom or problem solving, just follow orders.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Riftbreaker is one of those games I wish I could put like a little middling thumb on. I think it's... fine, for about half of it, and then the other half just becomes a bit of a chore. It goes from \"Oh, this is novel!\" to \"The Keywords for today are: Repetitive, tedious.\"\n\nA lot of this game is... straightforward, or simple? And I don't think that's a bad thing, it was probably the right choice for this game, I can't help that it also makes the game feel a bit mindless. There isn't really that much complexity to the building, nor the defending, nor the combat really. Sometimes it's fun to hold the mouse buttons and watch hordes of creatures turn into groups of red mists, othertimes it's really dull. There's an initial satisfaction to watching a tower-line hold a group of enemies all on its own, but then it... Now I'm repeating myself.\nThat is a *lot* of this game. Busy work and chores. I don't dislike it enough to give it a hard no, but I also don't like it enough to give it a hard yes.\n\nThis is only made worse when you're exploring other areas. The flow is like this:\nDeploy to an area -> oh no there's something we didn't see that complicates things -> we should research a solution to this -> go to new place -> Oh there's new materials here -> hunt around for ages gathering small amounts of this resource -> get enough to scan for big deposit -> also there's some optional material (but go get it because you need new guns) -> setup two entirely new bases and then half ass them because if you aren't here you don't need to defend it.\n\nExcept it gets more irritating each time? I don't think it's bad in isolation, but these issues are rarely complex enough to have to dedicate entire... chunks of gameplay around it. The Acid area has fungus that rapidly grows all over the map. So now you get to spend ages running around the corners of the map isolating the fungus colonies with flooring that doesn't stop them from growing sometimes, or you just blow up the acid colonies because despite all of Ashley's cautioning of \"This could have negative effects on the ecosystem\", there apparently isn't any.\n\nOr the lava area. You can't build anywhere that's outside of cold areas. THis is initially interesting, since you're forced to build outposts around the cold plants that naturally spring up around this zone. And also there's big magnetic rocks that stop you from building near them - I hope you went to the acid zone first to get the acid gun that destroys them, not that you'd know without constant sustained fire with a dialogue that \"sort of\" hints at this.\nAnd that's skipping the part where you go here, find the complication, go to a new area to research a solution, go to a new area to get material samples, go to a new area to actually get the materials, etc.\nAnd when you're done with all of that, you go back to HQ and build your big portal back to home and then defend it for a few minutes against huge attack waves that are a problem if you haven't prepared properly (get some long range artillery in there and a few shield generators at your frontlines), and... wait for 2 minutes because the attack waves stopped and the portal is halfway done. Huh.\nThat's like, basically the whole game. Do a thing, have ashley and riggs back and forth about things they both know but you're being tutorialised. Go to a new place. Dont do anything at new place but scan (thank god for scanner turrets). Go to new place. Find thing. Research thing. Unlock the solution. Build a real base at the new place. Half ass it because you're tired of defending everything. Repeat several times. Now win the game.\n\nI'll throw up my hands and admit I dragged this out longer for myself. You see, I was tired of building the same solution to every biome: A bunch of walls close to the map edges in choke points that funnel monsters into killwalls. SO I came up with a solution: Wait, some areas [i]have no monster invasions.[/i] Some areas have SCRIPTED monster attacks that are [i]predictable.[/i]\nSo I went back to my cultivator farms I setup hours ago that were needed for getting specific materials to build new guns/upgrades/research. And I spent AGES setting up cultivator farms for Cobalt and Uranium. I then went to the acid zone cultivators, since it's free of the ever expanding acid fungus, and spentAGES making palladium/titanium farms. I then went to the lava \"grow\" quest (where you arent tasked with growing anything in defiance of this trend, and instead get a pittance of material to build things with), imported some water via compressors, setup MORE titanium here (more efficient), and then spent AGES setting up dozens and dozens of lava power plants to sustain my dozens of tower munition factories and Carbonium/Ironium Fabricators so I could have infinite basic materials forever. And then I built so much storage I had 200K+ storage for all materials. That one is on me, and to be fair: I kinda had fun doing it!\n\n[h1] post game spoiler discussions! [/h1]\n\nSo, the post game comes with building these megastructures. I was reassured that, yes, these buildings will be hard to construct. They cost a huge amount of resources, require a lot of logistics, and I need to plan around them!\n... Nnno, not really. Okay, yes, I set up the big special boy lab in a new zone, kitted it up with everything it needed, and then waited there for all the upgrades and research. And then after that, I took the cultivator megastructure, put it in my acid zone with all those farms I mentioned from before, and then built 20 water purifiers (or however many it took) in the old reliable MANIFOLD style.\nI then built the drone megastructure somewhere in one of my desert bases, since all I needed was shit loads of energy, and just build rows and rows and rows and rows of solar panels and batteries to power the thing.\nI built the gravity lens thing in the lava area with all my fabricators, and just made all the supercoolant onsite - manifold style.\nAnd... whatever the other one was. And that was it. Sitting there, with maxed out \"build for cheap and fast\" items equipped, cycling between these structures as they upgraded. Yes, it was really hard waiting 20 minutes REAL TIME, doing nothing, waiting for the next level of megastructure to unlock.\nThe best part of this, in my opinion, was actually the big final structure we didn't tell you about until now, and that's even bigger! And requires a lot of everything!!! And requires even MORE resources to operate!!! I'll give it credit, and say it took me a bit of utilising structures I hadn't up until this point.\n But it was beaten like all the rest. In the old, faithful combat style of industrialisation...\nMANIFOLD STYLE.\n\nBut the resulting defence was not hard. Nah. It went the same way. As every other defence did. Walls in choke points. Setup clump of turrets, back them up with shield gens and long-range artillery. The only reason it got hairy was because I couldn't be bothered setting up all the defences to make it snoozingly easy.\n\n\nSome of it was cool, like how the megastructures give you big buffs - like being able to see what all deposits are on the map, even when not revealed. That's cool. Or the megastructure cultivator thing massively buffing all cultivators in that region. But the rest of it felt like a chore, especially for the underwhelming ending.\n\nThis isn't even going into the story, which is... like it's there. It's not a bad premise or anything, it just frustrates me in a way I can't quite explain with the word count I have and what I decided to focus on. In short: Ashley, look, you have a noble goal, but there is no \"Nice\" colonisation. You at least achieved your goal of not destroying the planet, but that was still built on the hundreds of thousands of indigenous fauna we turned into mists of red with the soul-piercing anti-materiel rifle, and the miniature nuclear warheads from the heavy artillery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has me torn between liking and disliking it, the co op does make the game more enjoyable, however mid to late game turns the game into a resource grind rather then a combat / base building game. We found ourselves more often then not setting up more / new outposts to keep up with the resources needed to progress the game then we did playing the actual campaign which lead to us pretty much getting bored of it and never finishing it. \r\n\r\nOn top of this the \"quests\" you had to do seemed very generic, Go here  couple times and look around, ok now go back and look around! Also the sheer amount of time you waste listening to the back and forth between the main characters is just staggering. I tried looking up a way to skip the dialog but people have been requesting this feature since the games release YEARS AGO and they never choose to implement it. Often times missions would take longer to complete just because you had to hear them talking endlessly over something you already did while they where endlessly talking.\r\n\r\nOverall id give it a 6/10 as a game to play when you have nothing else to do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Came back to try the 2.0 update. I cannot recommend this.\n\nThe game seems to just have everything in it, to the point that the games focus is sacrificed. Ostensibly, the game should be a medium-fast paced base-building w/ tower defense + exploration experience, but somehow manages to be a slow-paced twin-stick looter-shooter. It feels as if the latter cannibalized the former.\n\nEverything feels like a massive chore.\n\n#1 The bioscanner, it takes 3-4 seconds per scan but you'll need 30+ scans of a creature to learn what damage type it's weak to. So you are subject to this incredibly boring mechanic unless you google the information instead.\n\n#2 The research, it takes forever, you can't just build more labs b/c there's a maximum number you are allowed to build. Research also costs a mountain of resources for some reason, meaning the typical experience is to dump the majority of your resources into *just starting the research process*, then wait around doing nothing b/c you are out of resources for the next 5 minutes. Or you might try...\n\n#3 Exploring, there is another pod of enemies every 5 feet so just walking around looking for stuff is like trudging through deep mud, it's so obnoxious that the best upgrade for your mech is stealth. And you will want stealth for...\n\n#4 The geoscanner, slightly more tolerable than the bioscanner, a ton of resource patches are hidden so get used to holding space-bar everywhere you go.\n\n#5 No blueprints, practically a mortal sin for a game like this.\n\n#6 The loot. Jesus Christ what is with the loot. You could probably finish this game without ever crafting a weapon b/c the wildlife on this unexplored alien planet are constantly dropping miniguns and rocket launchers; Mech cosmetics, different color floors & lamps, statues, weapon attachments, you name it and some space-raptor you disintegrated has it in their pocket. From what I've experienced the exploration objects (\"bioanomalies\") hold maybe 1 - 2 loot items and you need to explore (see above) to find them, but a typical attack wave will drop a dozen or so loot items so why even bother.\n\n#7 Charge-Mode on weapons. The combat in this game consists of *several thousand* enemies rushing at you very fast, so why, why, why does *almost every weapon* have a charge-mode. Charge-mode (holding the button down), forces the player to split their concentration between the tsunami of space-raptors chasing them and watching/listening to the mechs right arm for the correct time to release the right mouse button; additionally charge-mode slows the mech down thus eliminating the ability to kite opponents. These are design decisions which strongly conflict. Aside from some charge-modes just being downright silly (you can charge the nuke launcher to make it nuke harder), most offer little to no advantage at all. But let us be real, you're only going to use about 10% of the arsenal anyway, none of them with charge-mode, minigun/plasmagun/laser/boxing-gloves/chainsaws.\n\n\n\nI remember liking the game on my first go through back in v1.0... but now...\nThe game in current state is extremely slow and laborious, has multiple conflicting design decisions, and IMO has lost focus on what the experience should be, seemingly in pursuit of some kind of RPG grindfest.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Very clunky and unpolished. Even in \"version 2.0\", four years after its original release, it feels like an early beta. The elevator pitch for the game is that it wants to synergize several different genres by feeding rewards from doing well in one area into doing well in other areas. It's a neat idea, and it's executed well enough that I did play one whole campaign, but the execution is so messy that I would not recommend it for single player and probably not for multiplayer.\n\nFor me, the nail in the coffin of this recommendation is that the balance between different game aspects is bad. There is one right way to play in terms of power scaling and it makes all the other ways minor fiddly obstacles. In single player this is annoying, and I imagine that in multiplayer it would just be sad that the people who focus on different aspects see far less award for their efforts.\n\nThere is a very simple exponential loop in base building resource generation that shows up a few hours in and stays for the rest of the game. It removes most of the challenge and most incentive to engage with all the other mechanics. Base building stops being a puzzle and just becomes a matter of manually printing a template. Enemies die to \"just use more gun\". Even narratively this option is the \"green\" one. Tech is cheap compared to the power potential of base building.\n\nEquipment handling is a nightmare. Maybe that's subjective, but the reward for doing it well is objectively pitiful. While base building gives you orders of magnitude improvement, equipment bonuses are less than +50% even at the highest level of equipment slot. Your equipment dps improves by one (1) order of magnitude over the course of the game, but the majority of that is locked behind technologies that take resources from base building.\n\nCombat is serviceable but doesn't really evolve over the course of the game. In the endgame, it starts lagging even in singleplayer, with over a second of input lag and a much reduced game speed even though Steam reports a 100fps framerate. Every weapon exists at every tech level, all the enemies that matter just become tougher reskins rather than requiring a different approach, and boss enemies are too weak to reward planning. Bioscanning adds some extra challenge but its rewards are miniscule and become logarithmically more miniscule (did you like that +5% for scanning a hundred enemies instead of shooting them? How about +10% for scanning a thousand?), and there is no complexity to it.\n\nExploration is fine but seems underdeveloped. There are three biomes and you only need four bases, though each of the other three bases has a short fetch quest sequence where some missions actually require creative puzzle solving. Strangely, despite the game giving you multiple different options and despite the tech tree having resource requirements that incentivize you to prioritize specific biomes depending on your basebuilding and/or weapon choice, the explanation of mechanics expects one specific order (top to bottom in the hub menu). Doing it \"out of order\" means hearing voice lines that refer to events that haven't happened yet and lacking information about how to use unintuitive UI elements.\n\nThe story is bare-bones, but from the amount of voice lines you wouldn't think so. They even have the characters lampshade how perfunctory their voicelines are. The characters are one-dimensional and there is no character development to speak of, and the first time the pilot's supposed care for the environment actually translates into a mechanical choice is choosing whether to go for the True Ending or not. The plot up to this point is just \"do the work necessary to open a rift gate back to earth\", with not even a hint of any other option until you're one keypress away from opening the gate.\n\nAudio design is subpar. There is no volume limiter for multiple entities producing the same noise so upgrading a field of solar panels blows out your speakers. The pilot's voice actor doesn't seem to have been given good direction for her lines: her tone of voice and use of emphasis don't correlate with the gameplay and story implications of what she's saying.\n\nThe graphics design is inoffensive. Customization is perfunctory. There are at most 10 texture-only skins for your character, and a few buildings that do nothing and cost a small amount of resources.\n\nPerformance-wise, the game is poorly optimized, even within the confines of the engine. As mentioned above, endgame combat lags even on a €1000 PC, but even just the bases necessary for the first ending seemed to cause a bit of lag despite only one base being visible at a time. And while mines do run out while you're not looking, enemies do not spawn, so there's no gameplay justification for rendering other bases in enough detail to cause lag. One enemy (the yeast) expands on its own and starts lagging the game if it is left unchecked for 15 minutes, despite just being a stationary field that is safe to ignore from a game mechanics perspective. There is no engine reason for this enemy to take this many resources to render, it's just less programming.\n\nIf this game was in early beta, I would say that it's brimming with potential. Tweak the game balance and performance, do a second pass on the voice lines, and it would honestly be great. But given it's four years after release, with a bunch of DLCs and with 2,0 adding more features rather than polishing the existing ones, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like the concept. The art is gorgeous. Jay for a factory builder that isn't brown, a different shade of brown and grey. But it also crashes frequently on my system regardless of how I changed the settings around (modern setup with RTX 4070). Played for a total of about 40 minutes and had three crashes. Spent about the same time googling in between sessions for solutions but couldn't find anything that worked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: Played in party of 4 with 2 adepts of base building games on hardest base difficulty (Brutal). Finished campaign in less than 15 hours. You end up repeating the same stuff beyond the first 2 hours. Definitely not recommended unless you're an absolute addict for those base building, busy work types of games.\r\n\r\n---\r\n\r\nFun for about 2 hours, then you realize you'll be repeating most of what you did for the other 12 hours it took our party to finish the campaign. I was convinced by my gaming group to buy this, but if, like me, you don't have this urge for busy work or optimization in your games, then this will be a massive letdown. Even for those min/maxers out there, the Brutal difficulty hardly challenges you, especially if you play in a group.\r\n\r\n[spoiler]After you're done with the campaign, it seems it's more of the same busy work: There is no more main objective if you choose the alternate ending.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cant in good faith recommend what would be a super sold game due to the nature of scaling that just pushes things far too much. \r\n\r\nNormal Mode, but facing enemies that I will empty a million rounds from turrets and only stop 40% of a wave. Just tired of the scaling never ending. At this point, I could have depopulated the planet for sheer amount of dead.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game does a really good job at so many things. The combat is fun, the building is fun, and the tower defense aspect is great.\n\nThe job does a Horrendous job at telling you what to do next. I cant' build the research station or any building in that tree and all of my mission objectives are great.\n\nDevs : Please give a much clearer path to the next objective, Its killing the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am at almost 100 hours, I have finished up to the metal dlc and I figured it had been a couple years since I played. It is very evident they have tweaked this game for co-op, researching did not cost resources last I played. So all they did was make the slow beginning even slower if not painful since certain early mobs are made of rock, aka immune to normal non explosive damage. A few years ago I would have recommended this game no questions asked, now? Go play palworld or something. I am too far in and will probably not play past the dlc I own unless it is very cheap or free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could I would rate it neutral, but no such option exists so I will default to using negative rating - if you can stomach these downsides, you will have a good time I guess. I decided to buy Riftbreaker because I enjoyed playing Co-op survival - it was really challenging mode and had tons of fun on the playtest, why not buy it and enjoy the campaign?\n\nGAMEPLAY LOOP\nThe game is less of a Factorio/factory builder but a more complex Supreme Commander with buildings-only instead of units. Hack n slash elements are fun, but there feels that there are too many buildings and weapons with too little distinction between them (what's the difference between SMG, shotgun and minigun turret? they all use same ammo). Brutal difficulty is a joke comparing to normal survival settings I've played on with co-op buddies - I never struggled in the Campaign resource-wise or with enemies. \n\nThe difficulty gap between the two is insane and more casual players WILL get scared of Survival which is fun mode that respects your time more and expects you to play very aggressively as if it was a competitve RTS match. Exceptions are bosses which range from 'joke' to 'bullshit' territory, worst of those being bulletsponges with ensnare ability that will constantly cage you and kill you with DoT. DLC seem to be expected for the game as they exist in the game in very confusing state - I was wondering why particular research branches remain locked to me. Turns out developers didn't bother gracefully adding them AFTER Player purchases them, so you will always have missing research because fuck you, you didn't pay enough.\nBugs - besides enemies, there are bunch of spelling typos, hangups after dialogues that need a minute or two to 'unfreeze' so the new objective is available or a research can be activated. I had a few 'invisible unplaceable zones' that were apparently managed by a nearby loot crystal summoning enemies - NOT the crystal itself but apparently the spawn zone of one group prevented me placing objects there. OK. \n\nVOICE ACTING & WRITING\nHonestly the less story writing there is, the better. The premise is pretty good, ultimately ruined by pro-bug activist that has bleeding heart for the local environment that would maul anyone within seconds. One thing that factory building games should avoid is making cringy voice-acting, limiting it just to prompts - Factorio does this masterfully, Satisfactory does it good as it only does per-research basis.  \nThis game doesn't know this and it will play dialogue at every step - not enough resources, bad placement, attack incoming, storyline blabbering and so on. The mech AI is OK and I can stomach him, however the main Mary Sue is unbearable to listen to. No, I don't care about bugs, I don't care to hear how you lost your arm for 100th time that we never see anyway. Mr Riggs rightfully calls MC insane and I wish AI would court-martial her in the field by just throwing her out of the suit and leaving to live with the bugs if her bleeding heart loves them so much.\n\nUPDATE TWO-POINT-POO\nTerrible waiting times for 'end game content' - even with max labs (which are limited), you can do ONLY THREE RESEARCHES PER HOUR, AND THERE ARE 20 NEEDED! Making long research makes sense IF there is a way to make it faster. Factorio allows you to build more research labs and supply to accelerate it as much as you wish, and Satisfactory allows you to do the same with Space Elevator progress (but just industry). Yes, you CAN upgrade labs but with limited quantity and 'end-game' you will already have those maxed. This either feels like a bad joke or a malicious move to make Players 'enjoy more content with 2.0' which is clearly seen with insane growth of resource cost and research length. More time spent does not mean its better.\n\n__\nTo be honest, Survival is more fun than Campaign itself, especially if you do it with your friends. But if you want to commit to a campaign, play Factorio, Satisfactory or another factory builder game that respects your time and doesn't beat your head with environmentalism. If you adjust research sliders to 10%, turn off dialogue volume I think you will enjoy the game if its on the sale.\n\nEdit: just experienced a bug where I'm permanently stuck in Headquarters zone and I cannot leave because of 'imminent attack' except... they have been coming and going for past few hours I've been waiting for research to end. My save is fucked.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the game, really, but the bugs, the performances, and the missing of Linux compatibility, this is a real technical shit. It is sad to see a mostly great game design (even if the end game is free), with a such shit on the technical point. I got stuck with mission progression, and I can't manage to continue my campaign, lost hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is way too difficult and when swarms attack, you loose overview. There happens too much at the same time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coop is unplayable due to heavy lags. My network connection is good, because I can play Factorio and Satisfactory in coop with little lag, so the problem is on Riftbreaker's side.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "max graphics playing 144hz\nthen why the game lag so bad when everything containing Supercharged Plasma was destroyed\nveins do not disappear on mini map",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game lags to the point where you can not play. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game but sadly just too buggy. It constantly will open on the wrong monitor. If you try to move it or use the config tool it wont recognize the main monitor resolution. The most recent DLC just crashes constantly. Its a shame that such a fun game has just become unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me. It seems good. I really wanted to like this. But I just don't understand how anyone finds this type of game fun. There's so much going on at once on the screen (yet weirdly very little that's helpful) and there are too many things to keep track of. You could argue it's realistic but it's just not....fun.\n\nI'm sure others will like it. The graphics are good, and the devs seem responsive and are giving it updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun yet confusing! But overall, the controls suck! It runs like crap! I can't even play with my friend and it slows down constantly, the only positives is the game looks beautiful, the loading screen looks amazing! And overall the presentation while good is poorly executed. I still struggle because the controls feel like I'm being sucked into a vaccum cleaner and I have no idea half the time if it's the game of the devs fault. Because that's how God awful these controls are and it doesn't satisfy me not even in the slightest. The controls do run better with a PS4 controller but my God they still suck!\n\nUpdate: I hope the devs fix it, I really want to give them a better review. I hate leaving a negative review for this game. At first, it reminded me of Neo Contra now, it reminds me of a game that breaks! Hence the name, The Riftbreaker and I am about to break some rifts before long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor controls re base building on controller. refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i didnt win the screenshot contest   *throws middle finger*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the endgame update and the mega structures, this was great. It had many options and ways you could tackle the game. You could do the DLC in any order if you're far enough, you could progress the story regardless of your skills, and get the full experience.\n\nWith the mega structures, the focus has become singular - do the DLC to get the nukes, obliterate everything. There is no more, \"We must save the world and us, too.\" There is no more balance - it is literally, \"Waste all of the resources on this mega structure and kill everything that comes to destroy it.\"\n\nThe mega structures take colossal amounts of resources to maintain and build. That's understandable since that's literally all they're meant for. Sure, they have some good benefits, like showing the entire map and its mining spots, or increasing farm yield, but... they're thankless and full of bugs.\n\nGet this. I built the entire thing up and powered the final structure. Mr. Riggs told me, \"Hey, the last wave is coming, better be ready.\" I was like like, well, ok, good, bring it on. I had good defenses, I had good items and gear, so start it up. What happened next was just pathetic.\n\nMy entire base was obliterated. My mega structures, which you can build more of on one map because nothing stops you, well, one bit the dust. More than half of my base, despite finishing all of the DLC and having upgrades everywhere, was just wiped out because multiple mega units came out and just killed everything. The mods these things have are stupid - heal all in an area, prevent damage to it unless you're in its bubble, and so forth. How is a tower supposed to kill that? This isn't that kind of game!\n\nThe worst thing is you can't repair your dead mega structures, you have to just dismantle it and start from zero. I had all of them maxed. I had all of their research maxed - I literally cannot research anything else in this game and have to start over mining titanium and uranium because of these monstrosities.\nThe entire tone is off here, you're not solving anything and are instead killing literally all life with nukes to build stupid structures to strip-mine the planet. I can no longer maintain titanium because all of the cooling needed for these things, like what is that? The power plants alone rip apart an entire mining outpost!\n\nOk, so whatever. I build it back up and try again, thinking, \"I have the power, I have the cooling, I have the magma and whatever else it needs. Turn it on - I died once, the final wave won't come again. That'd be dumb.\" The final wave comes again and just rips it all apart again. I built it all up a second time, it gets utterly annihilated again. I revert to my save and can't build my arcology again because I can't repair my dead structures.\n\nWhat a cycle of hate toward the player. You make it unwinnable, you make the structures unfixable, you make the economy function on death and strip mines, and you make it endless. Every time you power the final building, the death wave comes and literally kills some feeble part of your base, restarting the cycle. At that point, one of your outposts is out of resources, so you're now forced to spend hours building another to try again.\n\nWhat happened here? Why do I have to fight monsters with affixes like in an ARPG with just bullet sponges and healing all over the place, not to mention invicibility zones? Why does my base mean nothing? Why is research thrown away in favor of just killing everything? Why do the resource outposts just get spat on by the requirements of endgame buildings? Are you serious with this game, because I don't get it anymore. You had something special and now have this mess where you have you spam special attacks, your towers just die all the time, you waste our lives with buildings that can't be repaired, and you're merciless in failure. Are you happy?",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "TLDR, devs released a massive update that reworked a load of the game into a botched mess that isn't fun or exciting anymore.\n\nPutting a negative review on this game is kinda heartbreaking. For a long time this was one of the easiest recommendations I've been making to people. Hands down one of my favourite games of all time. I even did some speed running. However the coop updates have pretty much ruined the game imo. I played maybe 20 minutes into a new game once the update was out and haven't touched it since. Reading the dev log for the latest update that reworks movement skills (around mid October 2025) has been depressing, and a clear indication the game is going in a direction that I don't enjoy.\n\nThere are big issues and small issues. Some of the biggest issues have been how the economy was reworked. As the amount of bases you can have has increased, the amount of resources you can be harvesting at once has increased. To compensate, all researches now have a huge resource cost associated with them. Even the first ones you can do. You might be sitting afk for 10+mins waiting for resources because you don't get lots of resources outposts until the late game. Why this massive roadblock exists early is bizare and fun killing.\nTier 2 and 3 resource extractors now harvest half the amount. These changes mean that you need a higher amount of resource outposts simply to get to the level we had before. Why increase the amount of bases we can have when there is no benefit to it, and the huge downside of butchering the early game and wasting our time with setting up all these extra bases?\n\nThe resource cost to researches has other side effects. A lot of researches that unlock things that need rarer or later game resources also need said resource to research. This may not sound like an issue, after all if you don't have the resource you can't use the results of the research. However some items that require resources X are gated by researches that unlock items that use resource Y. Before you could research the item you can't use to get the item you can use. Now you can't. This forces a much more linear and fixed path through the game, rather than the more open choices we had before. You can turn down resource costs to 1% but not 0%, you can't get this choice back.\n\nPreviously, weapons and gear you crafted had some degree of randomness to them. The higher tier the weapon/item, the more random bonuses it would have. I can understand why some players would find making 20 of a weapon, choosing the best, and then dismantling the other 18 or 19 to be boring. Personally I found it a nice addition that let me have a little more choice in what I wanted from my gear. Do I want something super ammo efficient? Then build a weapon with better efficiency and throw on some ammo cost reduction mods. Weapons with different stats still exist, but they have to be gathered either from 'anomalies' in the environment, or as random drops from enemies. This is a pure downgrade, as we are now massively timegated in trying to aquire the gear we want. While the game does have some ARPG elements to the how combat works, it's not an ARPG and was never trying to be one. I don't want an ARPG. Stop moving the game into a new genre I beg.\n\nThe movement skill reworks have gone in this direction to. Rather than simple functional movement skills, they've all becoming flashy damaging abilities like in an ARPG. The teleport skill, one of my 2 most core movement skills, has been made visually and functionally frustrating going by the gifs they've shown off/the devs descriptions of how it works now.\n\nThen there are the smaller issues, mainly visual. With coop being a new focus, the devs have decided to reduce a lot of visuals to make things more 'readable'. This makes the game less visually interesting and dynamic. Smaller, shorter lived explosions. Effects removed. All in the service of a mode I'm not even playing.\n\nThere is *one* half good thing in this update. The devs have let us keep the original version of the game via a beta branch. Unfortunately that means no more updates, being locked out of the expanded late game (might have been good? I don't know, can't stomach the early game anymore so I'll never get to play it), and the further expansions. I don't have enough time to spend modding the game's visuals back to pre-nerf, removing the resource costs, restoring the economy, etc. I won't play the old version anymore since this has left such a bad taste, and I'll be lamenting missing out on potentially good new content buried deep in the botched rework of a game that was previously amazing and never needed it.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Game starts really cool with really good ideas\r\nBut the final moments of the game, oh my god, every second is a nightmare\r\nThe game does not get harder, only more time consuming. Play until mid/end campaign and then pretend that you have finished it",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Used to be great, mods don't load anymore, they broke things with 2.0 it seems.\r\n\r\nEven if you can start a new game with mods, your save game won't load the mods the next day. \r\n\r\nAvoid purchase for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a fairly fun time right up until maybe 2 hours before the \"end.\" I found out there was a postgame section, and I was down to do it right up until I saw the material requirements of the very first postgame building. I promptly looked up everything else, and saw how brutal everything got, and I'm fine never seeing the rest of this game, nor do I care to play the DLC.\n\nI think the idea of the game is neat, but having to constantly stop what I'm doing because Mr. Riggs has a new swarm of enemies for me to fight was frustrating. Sure, every now and then, yeah. It's fun and engaging when its a surprise. But, it felt like I was getting interrupted every 5 minutes. I'm just trying to figure out pipes and power stuff, please Mr. Riggs, I need a minute. I played this game in Co-op and I cannot imagine doing it by yourself without very heavily investing in defenses for every base you build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Feels like an endless tutorial[/h1]\nI might have gotten the wrong impression, but I envisioned The Riftbreaker as Factorio but with an emphasis on combat and exploration. On a surface level that assumption was accurate, but in practice the two halves of the game did not mesh. \n\nThe combat and exploration part is passable enough. Combat looks and feels great, but most of it just amounts to gunning down massive hordes of creatures. Except for a few tougher enemies, it was more about being at the right place at the right time and conserving ammo. Defending you base is a bit odd since it grows quite large and you cannot possible use turrets to defend yourself from the big hordes. Unlike Factorio, where you can predict which direction enemies are going to attack from, as well as being able to wall of big sections of the map, in The Riftbreaker enemies attack from random locations, the terrain is too open to section off and turrets are too limited to make static defenses viable. You are better off just teleporting to where enemies are attacking and shoot them yourself. Outside of attack waves, the enemies never pose any threat and do not attack your base, so it is a bit of all or nothing.\n\nThe base building was promising at first. Gather resources to build new buildings and upgrade your factory as well as forging new equipment. But it quickly plateaus and never increases in complexity. There is no logistics management and only a few multi-stage recipes. Most of your expansion is just building more and more of the same buildings.\n\nWhen the game started to lose me entirely is when I realized that the game just followed the same loop over and over. Explore a new area, find new resources, unlock the next tier of stuff and return to your base. In essence it is what every survival crafting game should be about, but it was so repetitive and it felt copy pasted. Progression is also mostly linear with set objectives to complete in a set order. It kept waiting for the tutorial to be over so I could explore the game freely, but it never happened. So sense of freedom or problem solving, just follow orders.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Riftbreaker is one of those games I wish I could put like a little middling thumb on. I think it's... fine, for about half of it, and then the other half just becomes a bit of a chore. It goes from \"Oh, this is novel!\" to \"The Keywords for today are: Repetitive, tedious.\"\n\nA lot of this game is... straightforward, or simple? And I don't think that's a bad thing, it was probably the right choice for this game, I can't help that it also makes the game feel a bit mindless. There isn't really that much complexity to the building, nor the defending, nor the combat really. Sometimes it's fun to hold the mouse buttons and watch hordes of creatures turn into groups of red mists, othertimes it's really dull. There's an initial satisfaction to watching a tower-line hold a group of enemies all on its own, but then it... Now I'm repeating myself.\nThat is a *lot* of this game. Busy work and chores. I don't dislike it enough to give it a hard no, but I also don't like it enough to give it a hard yes.\n\nThis is only made worse when you're exploring other areas. The flow is like this:\nDeploy to an area -> oh no there's something we didn't see that complicates things -> we should research a solution to this -> go to new place -> Oh there's new materials here -> hunt around for ages gathering small amounts of this resource -> get enough to scan for big deposit -> also there's some optional material (but go get it because you need new guns) -> setup two entirely new bases and then half ass them because if you aren't here you don't need to defend it.\n\nExcept it gets more irritating each time? I don't think it's bad in isolation, but these issues are rarely complex enough to have to dedicate entire... chunks of gameplay around it. The Acid area has fungus that rapidly grows all over the map. So now you get to spend ages running around the corners of the map isolating the fungus colonies with flooring that doesn't stop them from growing sometimes, or you just blow up the acid colonies because despite all of Ashley's cautioning of \"This could have negative effects on the ecosystem\", there apparently isn't any.\n\nOr the lava area. You can't build anywhere that's outside of cold areas. THis is initially interesting, since you're forced to build outposts around the cold plants that naturally spring up around this zone. And also there's big magnetic rocks that stop you from building near them - I hope you went to the acid zone first to get the acid gun that destroys them, not that you'd know without constant sustained fire with a dialogue that \"sort of\" hints at this.\nAnd that's skipping the part where you go here, find the complication, go to a new area to research a solution, go to a new area to get material samples, go to a new area to actually get the materials, etc.\nAnd when you're done with all of that, you go back to HQ and build your big portal back to home and then defend it for a few minutes against huge attack waves that are a problem if you haven't prepared properly (get some long range artillery in there and a few shield generators at your frontlines), and... wait for 2 minutes because the attack waves stopped and the portal is halfway done. Huh.\nThat's like, basically the whole game. Do a thing, have ashley and riggs back and forth about things they both know but you're being tutorialised. Go to a new place. Dont do anything at new place but scan (thank god for scanner turrets). Go to new place. Find thing. Research thing. Unlock the solution. Build a real base at the new place. Half ass it because you're tired of defending everything. Repeat several times. Now win the game.\n\nI'll throw up my hands and admit I dragged this out longer for myself. You see, I was tired of building the same solution to every biome: A bunch of walls close to the map edges in choke points that funnel monsters into killwalls. SO I came up with a solution: Wait, some areas [i]have no monster invasions.[/i] Some areas have SCRIPTED monster attacks that are [i]predictable.[/i]\nSo I went back to my cultivator farms I setup hours ago that were needed for getting specific materials to build new guns/upgrades/research. And I spent AGES setting up cultivator farms for Cobalt and Uranium. I then went to the acid zone cultivators, since it's free of the ever expanding acid fungus, and spentAGES making palladium/titanium farms. I then went to the lava \"grow\" quest (where you arent tasked with growing anything in defiance of this trend, and instead get a pittance of material to build things with), imported some water via compressors, setup MORE titanium here (more efficient), and then spent AGES setting up dozens and dozens of lava power plants to sustain my dozens of tower munition factories and Carbonium/Ironium Fabricators so I could have infinite basic materials forever. And then I built so much storage I had 200K+ storage for all materials. That one is on me, and to be fair: I kinda had fun doing it!\n\n[h1] post game spoiler discussions! [/h1]\n\nSo, the post game comes with building these megastructures. I was reassured that, yes, these buildings will be hard to construct. They cost a huge amount of resources, require a lot of logistics, and I need to plan around them!\n... Nnno, not really. Okay, yes, I set up the big special boy lab in a new zone, kitted it up with everything it needed, and then waited there for all the upgrades and research. And then after that, I took the cultivator megastructure, put it in my acid zone with all those farms I mentioned from before, and then built 20 water purifiers (or however many it took) in the old reliable MANIFOLD style.\nI then built the drone megastructure somewhere in one of my desert bases, since all I needed was shit loads of energy, and just build rows and rows and rows and rows of solar panels and batteries to power the thing.\nI built the gravity lens thing in the lava area with all my fabricators, and just made all the supercoolant onsite - manifold style.\nAnd... whatever the other one was. And that was it. Sitting there, with maxed out \"build for cheap and fast\" items equipped, cycling between these structures as they upgraded. Yes, it was really hard waiting 20 minutes REAL TIME, doing nothing, waiting for the next level of megastructure to unlock.\nThe best part of this, in my opinion, was actually the big final structure we didn't tell you about until now, and that's even bigger! And requires a lot of everything!!! And requires even MORE resources to operate!!! I'll give it credit, and say it took me a bit of utilising structures I hadn't up until this point.\n But it was beaten like all the rest. In the old, faithful combat style of industrialisation...\nMANIFOLD STYLE.\n\nBut the resulting defence was not hard. Nah. It went the same way. As every other defence did. Walls in choke points. Setup clump of turrets, back them up with shield gens and long-range artillery. The only reason it got hairy was because I couldn't be bothered setting up all the defences to make it snoozingly easy.\n\n\nSome of it was cool, like how the megastructures give you big buffs - like being able to see what all deposits are on the map, even when not revealed. That's cool. Or the megastructure cultivator thing massively buffing all cultivators in that region. But the rest of it felt like a chore, especially for the underwhelming ending.\n\nThis isn't even going into the story, which is... like it's there. It's not a bad premise or anything, it just frustrates me in a way I can't quite explain with the word count I have and what I decided to focus on. In short: Ashley, look, you have a noble goal, but there is no \"Nice\" colonisation. You at least achieved your goal of not destroying the planet, but that was still built on the hundreds of thousands of indigenous fauna we turned into mists of red with the soul-piercing anti-materiel rifle, and the miniature nuclear warheads from the heavy artillery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has me torn between liking and disliking it, the co op does make the game more enjoyable, however mid to late game turns the game into a resource grind rather then a combat / base building game. We found ourselves more often then not setting up more / new outposts to keep up with the resources needed to progress the game then we did playing the actual campaign which lead to us pretty much getting bored of it and never finishing it. \r\n\r\nOn top of this the \"quests\" you had to do seemed very generic, Go here  couple times and look around, ok now go back and look around! Also the sheer amount of time you waste listening to the back and forth between the main characters is just staggering. I tried looking up a way to skip the dialog but people have been requesting this feature since the games release YEARS AGO and they never choose to implement it. Often times missions would take longer to complete just because you had to hear them talking endlessly over something you already did while they where endlessly talking.\r\n\r\nOverall id give it a 6/10 as a game to play when you have nothing else to do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Came back to try the 2.0 update. I cannot recommend this.\n\nThe game seems to just have everything in it, to the point that the games focus is sacrificed. Ostensibly, the game should be a medium-fast paced base-building w/ tower defense + exploration experience, but somehow manages to be a slow-paced twin-stick looter-shooter. It feels as if the latter cannibalized the former.\n\nEverything feels like a massive chore.\n\n#1 The bioscanner, it takes 3-4 seconds per scan but you'll need 30+ scans of a creature to learn what damage type it's weak to. So you are subject to this incredibly boring mechanic unless you google the information instead.\n\n#2 The research, it takes forever, you can't just build more labs b/c there's a maximum number you are allowed to build. Research also costs a mountain of resources for some reason, meaning the typical experience is to dump the majority of your resources into *just starting the research process*, then wait around doing nothing b/c you are out of resources for the next 5 minutes. Or you might try...\n\n#3 Exploring, there is another pod of enemies every 5 feet so just walking around looking for stuff is like trudging through deep mud, it's so obnoxious that the best upgrade for your mech is stealth. And you will want stealth for...\n\n#4 The geoscanner, slightly more tolerable than the bioscanner, a ton of resource patches are hidden so get used to holding space-bar everywhere you go.\n\n#5 No blueprints, practically a mortal sin for a game like this.\n\n#6 The loot. Jesus Christ what is with the loot. You could probably finish this game without ever crafting a weapon b/c the wildlife on this unexplored alien planet are constantly dropping miniguns and rocket launchers; Mech cosmetics, different color floors & lamps, statues, weapon attachments, you name it and some space-raptor you disintegrated has it in their pocket. From what I've experienced the exploration objects (\"bioanomalies\") hold maybe 1 - 2 loot items and you need to explore (see above) to find them, but a typical attack wave will drop a dozen or so loot items so why even bother.\n\n#7 Charge-Mode on weapons. The combat in this game consists of *several thousand* enemies rushing at you very fast, so why, why, why does *almost every weapon* have a charge-mode. Charge-mode (holding the button down), forces the player to split their concentration between the tsunami of space-raptors chasing them and watching/listening to the mechs right arm for the correct time to release the right mouse button; additionally charge-mode slows the mech down thus eliminating the ability to kite opponents. These are design decisions which strongly conflict. Aside from some charge-modes just being downright silly (you can charge the nuke launcher to make it nuke harder), most offer little to no advantage at all. But let us be real, you're only going to use about 10% of the arsenal anyway, none of them with charge-mode, minigun/plasmagun/laser/boxing-gloves/chainsaws.\n\n\n\nI remember liking the game on my first go through back in v1.0... but now...\nThe game in current state is extremely slow and laborious, has multiple conflicting design decisions, and IMO has lost focus on what the experience should be, seemingly in pursuit of some kind of RPG grindfest.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Very clunky and unpolished. Even in \"version 2.0\", four years after its original release, it feels like an early beta. The elevator pitch for the game is that it wants to synergize several different genres by feeding rewards from doing well in one area into doing well in other areas. It's a neat idea, and it's executed well enough that I did play one whole campaign, but the execution is so messy that I would not recommend it for single player and probably not for multiplayer.\n\nFor me, the nail in the coffin of this recommendation is that the balance between different game aspects is bad. There is one right way to play in terms of power scaling and it makes all the other ways minor fiddly obstacles. In single player this is annoying, and I imagine that in multiplayer it would just be sad that the people who focus on different aspects see far less award for their efforts.\n\nThere is a very simple exponential loop in base building resource generation that shows up a few hours in and stays for the rest of the game. It removes most of the challenge and most incentive to engage with all the other mechanics. Base building stops being a puzzle and just becomes a matter of manually printing a template. Enemies die to \"just use more gun\". Even narratively this option is the \"green\" one. Tech is cheap compared to the power potential of base building.\n\nEquipment handling is a nightmare. Maybe that's subjective, but the reward for doing it well is objectively pitiful. While base building gives you orders of magnitude improvement, equipment bonuses are less than +50% even at the highest level of equipment slot. Your equipment dps improves by one (1) order of magnitude over the course of the game, but the majority of that is locked behind technologies that take resources from base building.\n\nCombat is serviceable but doesn't really evolve over the course of the game. In the endgame, it starts lagging even in singleplayer, with over a second of input lag and a much reduced game speed even though Steam reports a 100fps framerate. Every weapon exists at every tech level, all the enemies that matter just become tougher reskins rather than requiring a different approach, and boss enemies are too weak to reward planning. Bioscanning adds some extra challenge but its rewards are miniscule and become logarithmically more miniscule (did you like that +5% for scanning a hundred enemies instead of shooting them? How about +10% for scanning a thousand?), and there is no complexity to it.\n\nExploration is fine but seems underdeveloped. There are three biomes and you only need four bases, though each of the other three bases has a short fetch quest sequence where some missions actually require creative puzzle solving. Strangely, despite the game giving you multiple different options and despite the tech tree having resource requirements that incentivize you to prioritize specific biomes depending on your basebuilding and/or weapon choice, the explanation of mechanics expects one specific order (top to bottom in the hub menu). Doing it \"out of order\" means hearing voice lines that refer to events that haven't happened yet and lacking information about how to use unintuitive UI elements.\n\nThe story is bare-bones, but from the amount of voice lines you wouldn't think so. They even have the characters lampshade how perfunctory their voicelines are. The characters are one-dimensional and there is no character development to speak of, and the first time the pilot's supposed care for the environment actually translates into a mechanical choice is choosing whether to go for the True Ending or not. The plot up to this point is just \"do the work necessary to open a rift gate back to earth\", with not even a hint of any other option until you're one keypress away from opening the gate.\n\nAudio design is subpar. There is no volume limiter for multiple entities producing the same noise so upgrading a field of solar panels blows out your speakers. The pilot's voice actor doesn't seem to have been given good direction for her lines: her tone of voice and use of emphasis don't correlate with the gameplay and story implications of what she's saying.\n\nThe graphics design is inoffensive. Customization is perfunctory. There are at most 10 texture-only skins for your character, and a few buildings that do nothing and cost a small amount of resources.\n\nPerformance-wise, the game is poorly optimized, even within the confines of the engine. As mentioned above, endgame combat lags even on a €1000 PC, but even just the bases necessary for the first ending seemed to cause a bit of lag despite only one base being visible at a time. And while mines do run out while you're not looking, enemies do not spawn, so there's no gameplay justification for rendering other bases in enough detail to cause lag. One enemy (the yeast) expands on its own and starts lagging the game if it is left unchecked for 15 minutes, despite just being a stationary field that is safe to ignore from a game mechanics perspective. There is no engine reason for this enemy to take this many resources to render, it's just less programming.\n\nIf this game was in early beta, I would say that it's brimming with potential. Tweak the game balance and performance, do a second pass on the voice lines, and it would honestly be great. But given it's four years after release, with a bunch of DLCs and with 2,0 adding more features rather than polishing the existing ones, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like the concept. The art is gorgeous. Jay for a factory builder that isn't brown, a different shade of brown and grey. But it also crashes frequently on my system regardless of how I changed the settings around (modern setup with RTX 4070). Played for a total of about 40 minutes and had three crashes. Spent about the same time googling in between sessions for solutions but couldn't find anything that worked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: Played in party of 4 with 2 adepts of base building games on hardest base difficulty (Brutal). Finished campaign in less than 15 hours. You end up repeating the same stuff beyond the first 2 hours. Definitely not recommended unless you're an absolute addict for those base building, busy work types of games.\r\n\r\n---\r\n\r\nFun for about 2 hours, then you realize you'll be repeating most of what you did for the other 12 hours it took our party to finish the campaign. I was convinced by my gaming group to buy this, but if, like me, you don't have this urge for busy work or optimization in your games, then this will be a massive letdown. Even for those min/maxers out there, the Brutal difficulty hardly challenges you, especially if you play in a group.\r\n\r\n[spoiler]After you're done with the campaign, it seems it's more of the same busy work: There is no more main objective if you choose the alternate ending.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cant in good faith recommend what would be a super sold game due to the nature of scaling that just pushes things far too much. \r\n\r\nNormal Mode, but facing enemies that I will empty a million rounds from turrets and only stop 40% of a wave. Just tired of the scaling never ending. At this point, I could have depopulated the planet for sheer amount of dead.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game does a really good job at so many things. The combat is fun, the building is fun, and the tower defense aspect is great.\n\nThe job does a Horrendous job at telling you what to do next. I cant' build the research station or any building in that tree and all of my mission objectives are great.\n\nDevs : Please give a much clearer path to the next objective, Its killing the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am at almost 100 hours, I have finished up to the metal dlc and I figured it had been a couple years since I played. It is very evident they have tweaked this game for co-op, researching did not cost resources last I played. So all they did was make the slow beginning even slower if not painful since certain early mobs are made of rock, aka immune to normal non explosive damage. A few years ago I would have recommended this game no questions asked, now? Go play palworld or something. I am too far in and will probably not play past the dlc I own unless it is very cheap or free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could I would rate it neutral, but no such option exists so I will default to using negative rating - if you can stomach these downsides, you will have a good time I guess. I decided to buy Riftbreaker because I enjoyed playing Co-op survival - it was really challenging mode and had tons of fun on the playtest, why not buy it and enjoy the campaign?\n\nGAMEPLAY LOOP\nThe game is less of a Factorio/factory builder but a more complex Supreme Commander with buildings-only instead of units. Hack n slash elements are fun, but there feels that there are too many buildings and weapons with too little distinction between them (what's the difference between SMG, shotgun and minigun turret? they all use same ammo). Brutal difficulty is a joke comparing to normal survival settings I've played on with co-op buddies - I never struggled in the Campaign resource-wise or with enemies. \n\nThe difficulty gap between the two is insane and more casual players WILL get scared of Survival which is fun mode that respects your time more and expects you to play very aggressively as if it was a competitve RTS match. Exceptions are bosses which range from 'joke' to 'bullshit' territory, worst of those being bulletsponges with ensnare ability that will constantly cage you and kill you with DoT. DLC seem to be expected for the game as they exist in the game in very confusing state - I was wondering why particular research branches remain locked to me. Turns out developers didn't bother gracefully adding them AFTER Player purchases them, so you will always have missing research because fuck you, you didn't pay enough.\nBugs - besides enemies, there are bunch of spelling typos, hangups after dialogues that need a minute or two to 'unfreeze' so the new objective is available or a research can be activated. I had a few 'invisible unplaceable zones' that were apparently managed by a nearby loot crystal summoning enemies - NOT the crystal itself but apparently the spawn zone of one group prevented me placing objects there. OK. \n\nVOICE ACTING & WRITING\nHonestly the less story writing there is, the better. The premise is pretty good, ultimately ruined by pro-bug activist that has bleeding heart for the local environment that would maul anyone within seconds. One thing that factory building games should avoid is making cringy voice-acting, limiting it just to prompts - Factorio does this masterfully, Satisfactory does it good as it only does per-research basis.  \nThis game doesn't know this and it will play dialogue at every step - not enough resources, bad placement, attack incoming, storyline blabbering and so on. The mech AI is OK and I can stomach him, however the main Mary Sue is unbearable to listen to. No, I don't care about bugs, I don't care to hear how you lost your arm for 100th time that we never see anyway. Mr Riggs rightfully calls MC insane and I wish AI would court-martial her in the field by just throwing her out of the suit and leaving to live with the bugs if her bleeding heart loves them so much.\n\nUPDATE TWO-POINT-POO\nTerrible waiting times for 'end game content' - even with max labs (which are limited), you can do ONLY THREE RESEARCHES PER HOUR, AND THERE ARE 20 NEEDED! Making long research makes sense IF there is a way to make it faster. Factorio allows you to build more research labs and supply to accelerate it as much as you wish, and Satisfactory allows you to do the same with Space Elevator progress (but just industry). Yes, you CAN upgrade labs but with limited quantity and 'end-game' you will already have those maxed. This either feels like a bad joke or a malicious move to make Players 'enjoy more content with 2.0' which is clearly seen with insane growth of resource cost and research length. More time spent does not mean its better.\n\n__\nTo be honest, Survival is more fun than Campaign itself, especially if you do it with your friends. But if you want to commit to a campaign, play Factorio, Satisfactory or another factory builder game that respects your time and doesn't beat your head with environmentalism. If you adjust research sliders to 10%, turn off dialogue volume I think you will enjoy the game if its on the sale.\n\nEdit: just experienced a bug where I'm permanently stuck in Headquarters zone and I cannot leave because of 'imminent attack' except... they have been coming and going for past few hours I've been waiting for research to end. My save is fucked.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the game, really, but the bugs, the performances, and the missing of Linux compatibility, this is a real technical shit. It is sad to see a mostly great game design (even if the end game is free), with a such shit on the technical point. I got stuck with mission progression, and I can't manage to continue my campaign, lost hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is way too difficult and when swarms attack, you loose overview. There happens too much at the same time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Coop is unplayable due to heavy lags. My network connection is good, because I can play Factorio and Satisfactory in coop with little lag, so the problem is on Riftbreaker's side.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "max graphics playing 144hz\nthen why the game lag so bad when everything containing Supercharged Plasma was destroyed\nveins do not disappear on mini map",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game lags to the point where you can not play. DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game but sadly just too buggy. It constantly will open on the wrong monitor. If you try to move it or use the config tool it wont recognize the main monitor resolution. The most recent DLC just crashes constantly. Its a shame that such a fun game has just become unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me. It seems good. I really wanted to like this. But I just don't understand how anyone finds this type of game fun. There's so much going on at once on the screen (yet weirdly very little that's helpful) and there are too many things to keep track of. You could argue it's realistic but it's just not....fun.\n\nI'm sure others will like it. The graphics are good, and the devs seem responsive and are giving it updates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun yet confusing! But overall, the controls suck! It runs like crap! I can't even play with my friend and it slows down constantly, the only positives is the game looks beautiful, the loading screen looks amazing! And overall the presentation while good is poorly executed. I still struggle because the controls feel like I'm being sucked into a vaccum cleaner and I have no idea half the time if it's the game of the devs fault. Because that's how God awful these controls are and it doesn't satisfy me not even in the slightest. The controls do run better with a PS4 controller but my God they still suck!\n\nUpdate: I hope the devs fix it, I really want to give them a better review. I hate leaving a negative review for this game. At first, it reminded me of Neo Contra now, it reminds me of a game that breaks! Hence the name, The Riftbreaker and I am about to break some rifts before long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poor controls re base building on controller. refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i didnt win the screenshot contest   *throws middle finger*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Until the endgame update and the mega structures, this was great. It had many options and ways you could tackle the game. You could do the DLC in any order if you're far enough, you could progress the story regardless of your skills, and get the full experience.\n\nWith the mega structures, the focus has become singular - do the DLC to get the nukes, obliterate everything. There is no more, \"We must save the world and us, too.\" There is no more balance - it is literally, \"Waste all of the resources on this mega structure and kill everything that comes to destroy it.\"\n\nThe mega structures take colossal amounts of resources to maintain and build. That's understandable since that's literally all they're meant for. Sure, they have some good benefits, like showing the entire map and its mining spots, or increasing farm yield, but... they're thankless and full of bugs.\n\nGet this. I built the entire thing up and powered the final structure. Mr. Riggs told me, \"Hey, the last wave is coming, better be ready.\" I was like like, well, ok, good, bring it on. I had good defenses, I had good items and gear, so start it up. What happened next was just pathetic.\n\nMy entire base was obliterated. My mega structures, which you can build more of on one map because nothing stops you, well, one bit the dust. More than half of my base, despite finishing all of the DLC and having upgrades everywhere, was just wiped out because multiple mega units came out and just killed everything. The mods these things have are stupid - heal all in an area, prevent damage to it unless you're in its bubble, and so forth. How is a tower supposed to kill that? This isn't that kind of game!\n\nThe worst thing is you can't repair your dead mega structures, you have to just dismantle it and start from zero. I had all of them maxed. I had all of their research maxed - I literally cannot research anything else in this game and have to start over mining titanium and uranium because of these monstrosities.\nThe entire tone is off here, you're not solving anything and are instead killing literally all life with nukes to build stupid structures to strip-mine the planet. I can no longer maintain titanium because all of the cooling needed for these things, like what is that? The power plants alone rip apart an entire mining outpost!\n\nOk, so whatever. I build it back up and try again, thinking, \"I have the power, I have the cooling, I have the magma and whatever else it needs. Turn it on - I died once, the final wave won't come again. That'd be dumb.\" The final wave comes again and just rips it all apart again. I built it all up a second time, it gets utterly annihilated again. I revert to my save and can't build my arcology again because I can't repair my dead structures.\n\nWhat a cycle of hate toward the player. You make it unwinnable, you make the structures unfixable, you make the economy function on death and strip mines, and you make it endless. Every time you power the final building, the death wave comes and literally kills some feeble part of your base, restarting the cycle. At that point, one of your outposts is out of resources, so you're now forced to spend hours building another to try again.\n\nWhat happened here? Why do I have to fight monsters with affixes like in an ARPG with just bullet sponges and healing all over the place, not to mention invicibility zones? Why does my base mean nothing? Why is research thrown away in favor of just killing everything? Why do the resource outposts just get spat on by the requirements of endgame buildings? Are you serious with this game, because I don't get it anymore. You had something special and now have this mess where you have you spam special attacks, your towers just die all the time, you waste our lives with buildings that can't be repaired, and you're merciless in failure. Are you happy?",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "TLDR, devs released a massive update that reworked a load of the game into a botched mess that isn't fun or exciting anymore.\n\nPutting a negative review on this game is kinda heartbreaking. For a long time this was one of the easiest recommendations I've been making to people. Hands down one of my favourite games of all time. I even did some speed running. However the coop updates have pretty much ruined the game imo. I played maybe 20 minutes into a new game once the update was out and haven't touched it since. Reading the dev log for the latest update that reworks movement skills (around mid October 2025) has been depressing, and a clear indication the game is going in a direction that I don't enjoy.\n\nThere are big issues and small issues. Some of the biggest issues have been how the economy was reworked. As the amount of bases you can have has increased, the amount of resources you can be harvesting at once has increased. To compensate, all researches now have a huge resource cost associated with them. Even the first ones you can do. You might be sitting afk for 10+mins waiting for resources because you don't get lots of resources outposts until the late game. Why this massive roadblock exists early is bizare and fun killing.\nTier 2 and 3 resource extractors now harvest half the amount. These changes mean that you need a higher amount of resource outposts simply to get to the level we had before. Why increase the amount of bases we can have when there is no benefit to it, and the huge downside of butchering the early game and wasting our time with setting up all these extra bases?\n\nThe resource cost to researches has other side effects. A lot of researches that unlock things that need rarer or later game resources also need said resource to research. This may not sound like an issue, after all if you don't have the resource you can't use the results of the research. However some items that require resources X are gated by researches that unlock items that use resource Y. Before you could research the item you can't use to get the item you can use. Now you can't. This forces a much more linear and fixed path through the game, rather than the more open choices we had before. You can turn down resource costs to 1% but not 0%, you can't get this choice back.\n\nPreviously, weapons and gear you crafted had some degree of randomness to them. The higher tier the weapon/item, the more random bonuses it would have. I can understand why some players would find making 20 of a weapon, choosing the best, and then dismantling the other 18 or 19 to be boring. Personally I found it a nice addition that let me have a little more choice in what I wanted from my gear. Do I want something super ammo efficient? Then build a weapon with better efficiency and throw on some ammo cost reduction mods. Weapons with different stats still exist, but they have to be gathered either from 'anomalies' in the environment, or as random drops from enemies. This is a pure downgrade, as we are now massively timegated in trying to aquire the gear we want. While the game does have some ARPG elements to the how combat works, it's not an ARPG and was never trying to be one. I don't want an ARPG. Stop moving the game into a new genre I beg.\n\nThe movement skill reworks have gone in this direction to. Rather than simple functional movement skills, they've all becoming flashy damaging abilities like in an ARPG. The teleport skill, one of my 2 most core movement skills, has been made visually and functionally frustrating going by the gifs they've shown off/the devs descriptions of how it works now.\n\nThen there are the smaller issues, mainly visual. With coop being a new focus, the devs have decided to reduce a lot of visuals to make things more 'readable'. This makes the game less visually interesting and dynamic. Smaller, shorter lived explosions. Effects removed. All in the service of a mode I'm not even playing.\n\nThere is *one* half good thing in this update. The devs have let us keep the original version of the game via a beta branch. Unfortunately that means no more updates, being locked out of the expanded late game (might have been good? I don't know, can't stomach the early game anymore so I'll never get to play it), and the further expansions. I don't have enough time to spend modding the game's visuals back to pre-nerf, removing the resource costs, restoring the economy, etc. I won't play the old version anymore since this has left such a bad taste, and I'll be lamenting missing out on potentially good new content buried deep in the botched rework of a game that was previously amazing and never needed it.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Game starts really cool with really good ideas\r\nBut the final moments of the game, oh my god, every second is a nightmare\r\nThe game does not get harder, only more time consuming. Play until mid/end campaign and then pretend that you have finished it",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Used to be great, mods don't load anymore, they broke things with 2.0 it seems.\r\n\r\nEven if you can start a new game with mods, your save game won't load the mods the next day. \r\n\r\nAvoid purchase for now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was a fairly fun time right up until maybe 2 hours before the \"end.\" I found out there was a postgame section, and I was down to do it right up until I saw the material requirements of the very first postgame building. I promptly looked up everything else, and saw how brutal everything got, and I'm fine never seeing the rest of this game, nor do I care to play the DLC.\n\nI think the idea of the game is neat, but having to constantly stop what I'm doing because Mr. Riggs has a new swarm of enemies for me to fight was frustrating. Sure, every now and then, yeah. It's fun and engaging when its a surprise. But, it felt like I was getting interrupted every 5 minutes. I'm just trying to figure out pipes and power stuff, please Mr. Riggs, I need a minute. I played this game in Co-op and I cannot imagine doing it by yourself without very heavily investing in defenses for every base you build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Feels like an endless tutorial[/h1]\nI might have gotten the wrong impression, but I envisioned The Riftbreaker as Factorio but with an emphasis on combat and exploration. On a surface level that assumption was accurate, but in practice the two halves of the game did not mesh. \n\nThe combat and exploration part is passable enough. Combat looks and feels great, but most of it just amounts to gunning down massive hordes of creatures. Except for a few tougher enemies, it was more about being at the right place at the right time and conserving ammo. Defending you base is a bit odd since it grows quite large and you cannot possible use turrets to defend yourself from the big hordes. Unlike Factorio, where you can predict which direction enemies are going to attack from, as well as being able to wall of big sections of the map, in The Riftbreaker enemies attack from random locations, the terrain is too open to section off and turrets are too limited to make static defenses viable. You are better off just teleporting to where enemies are attacking and shoot them yourself. Outside of attack waves, the enemies never pose any threat and do not attack your base, so it is a bit of all or nothing.\n\nThe base building was promising at first. Gather resources to build new buildings and upgrade your factory as well as forging new equipment. But it quickly plateaus and never increases in complexity. There is no logistics management and only a few multi-stage recipes. Most of your expansion is just building more and more of the same buildings.\n\nWhen the game started to lose me entirely is when I realized that the game just followed the same loop over and over. Explore a new area, find new resources, unlock the next tier of stuff and return to your base. In essence it is what every survival crafting game should be about, but it was so repetitive and it felt copy pasted. Progression is also mostly linear with set objectives to complete in a set order. It kept waiting for the tutorial to be over so I could explore the game freely, but it never happened. So sense of freedom or problem solving, just follow orders.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Riftbreaker is one of those games I wish I could put like a little middling thumb on. I think it's... fine, for about half of it, and then the other half just becomes a bit of a chore. It goes from \"Oh, this is novel!\" to \"The Keywords for today are: Repetitive, tedious.\"\n\nA lot of this game is... straightforward, or simple? And I don't think that's a bad thing, it was probably the right choice for this game, I can't help that it also makes the game feel a bit mindless. There isn't really that much complexity to the building, nor the defending, nor the combat really. Sometimes it's fun to hold the mouse buttons and watch hordes of creatures turn into groups of red mists, othertimes it's really dull. There's an initial satisfaction to watching a tower-line hold a group of enemies all on its own, but then it... Now I'm repeating myself.\nThat is a *lot* of this game. Busy work and chores. I don't dislike it enough to give it a hard no, but I also don't like it enough to give it a hard yes.\n\nThis is only made worse when you're exploring other areas. The flow is like this:\nDeploy to an area -> oh no there's something we didn't see that complicates things -> we should research a solution to this -> go to new place -> Oh there's new materials here -> hunt around for ages gathering small amounts of this resource -> get enough to scan for big deposit -> also there's some optional material (but go get it because you need new guns) -> setup two entirely new bases and then half ass them because if you aren't here you don't need to defend it.\n\nExcept it gets more irritating each time? I don't think it's bad in isolation, but these issues are rarely complex enough to have to dedicate entire... chunks of gameplay around it. The Acid area has fungus that rapidly grows all over the map. So now you get to spend ages running around the corners of the map isolating the fungus colonies with flooring that doesn't stop them from growing sometimes, or you just blow up the acid colonies because despite all of Ashley's cautioning of \"This could have negative effects on the ecosystem\", there apparently isn't any.\n\nOr the lava area. You can't build anywhere that's outside of cold areas. THis is initially interesting, since you're forced to build outposts around the cold plants that naturally spring up around this zone. And also there's big magnetic rocks that stop you from building near them - I hope you went to the acid zone first to get the acid gun that destroys them, not that you'd know without constant sustained fire with a dialogue that \"sort of\" hints at this.\nAnd that's skipping the part where you go here, find the complication, go to a new area to research a solution, go to a new area to get material samples, go to a new area to actually get the materials, etc.\nAnd when you're done with all of that, you go back to HQ and build your big portal back to home and then defend it for a few minutes against huge attack waves that are a problem if you haven't prepared properly (get some long range artillery in there and a few shield generators at your frontlines), and... wait for 2 minutes because the attack waves stopped and the portal is halfway done. Huh.\nThat's like, basically the whole game. Do a thing, have ashley and riggs back and forth about things they both know but you're being tutorialised. Go to a new place. Dont do anything at new place but scan (thank god for scanner turrets). Go to new place. Find thing. Research thing. Unlock the solution. Build a real base at the new place. Half ass it because you're tired of defending everything. Repeat several times. Now win the game.\n\nI'll throw up my hands and admit I dragged this out longer for myself. You see, I was tired of building the same solution to every biome: A bunch of walls close to the map edges in choke points that funnel monsters into killwalls. SO I came up with a solution: Wait, some areas [i]have no monster invasions.[/i] Some areas have SCRIPTED monster attacks that are [i]predictable.[/i]\nSo I went back to my cultivator farms I setup hours ago that were needed for getting specific materials to build new guns/upgrades/research. And I spent AGES setting up cultivator farms for Cobalt and Uranium. I then went to the acid zone cultivators, since it's free of the ever expanding acid fungus, and spentAGES making palladium/titanium farms. I then went to the lava \"grow\" quest (where you arent tasked with growing anything in defiance of this trend, and instead get a pittance of material to build things with), imported some water via compressors, setup MORE titanium here (more efficient), and then spent AGES setting up dozens and dozens of lava power plants to sustain my dozens of tower munition factories and Carbonium/Ironium Fabricators so I could have infinite basic materials forever. And then I built so much storage I had 200K+ storage for all materials. That one is on me, and to be fair: I kinda had fun doing it!\n\n[h1] post game spoiler discussions! [/h1]\n\nSo, the post game comes with building these megastructures. I was reassured that, yes, these buildings will be hard to construct. They cost a huge amount of resources, require a lot of logistics, and I need to plan around them!\n... Nnno, not really. Okay, yes, I set up the big special boy lab in a new zone, kitted it up with everything it needed, and then waited there for all the upgrades and research. And then after that, I took the cultivator megastructure, put it in my acid zone with all those farms I mentioned from before, and then built 20 water purifiers (or however many it took) in the old reliable MANIFOLD style.\nI then built the drone megastructure somewhere in one of my desert bases, since all I needed was shit loads of energy, and just build rows and rows and rows and rows of solar panels and batteries to power the thing.\nI built the gravity lens thing in the lava area with all my fabricators, and just made all the supercoolant onsite - manifold style.\nAnd... whatever the other one was. And that was it. Sitting there, with maxed out \"build for cheap and fast\" items equipped, cycling between these structures as they upgraded. Yes, it was really hard waiting 20 minutes REAL TIME, doing nothing, waiting for the next level of megastructure to unlock.\nThe best part of this, in my opinion, was actually the big final structure we didn't tell you about until now, and that's even bigger! And requires a lot of everything!!! And requires even MORE resources to operate!!! I'll give it credit, and say it took me a bit of utilising structures I hadn't up until this point.\n But it was beaten like all the rest. In the old, faithful combat style of industrialisation...\nMANIFOLD STYLE.\n\nBut the resulting defence was not hard. Nah. It went the same way. As every other defence did. Walls in choke points. Setup clump of turrets, back them up with shield gens and long-range artillery. The only reason it got hairy was because I couldn't be bothered setting up all the defences to make it snoozingly easy.\n\n\nSome of it was cool, like how the megastructures give you big buffs - like being able to see what all deposits are on the map, even when not revealed. That's cool. Or the megastructure cultivator thing massively buffing all cultivators in that region. But the rest of it felt like a chore, especially for the underwhelming ending.\n\nThis isn't even going into the story, which is... like it's there. It's not a bad premise or anything, it just frustrates me in a way I can't quite explain with the word count I have and what I decided to focus on. In short: Ashley, look, you have a noble goal, but there is no \"Nice\" colonisation. You at least achieved your goal of not destroying the planet, but that was still built on the hundreds of thousands of indigenous fauna we turned into mists of red with the soul-piercing anti-materiel rifle, and the miniature nuclear warheads from the heavy artillery.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has me torn between liking and disliking it, the co op does make the game more enjoyable, however mid to late game turns the game into a resource grind rather then a combat / base building game. We found ourselves more often then not setting up more / new outposts to keep up with the resources needed to progress the game then we did playing the actual campaign which lead to us pretty much getting bored of it and never finishing it. \r\n\r\nOn top of this the \"quests\" you had to do seemed very generic, Go here  couple times and look around, ok now go back and look around! Also the sheer amount of time you waste listening to the back and forth between the main characters is just staggering. I tried looking up a way to skip the dialog but people have been requesting this feature since the games release YEARS AGO and they never choose to implement it. Often times missions would take longer to complete just because you had to hear them talking endlessly over something you already did while they where endlessly talking.\r\n\r\nOverall id give it a 6/10 as a game to play when you have nothing else to do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Came back to try the 2.0 update. I cannot recommend this.\n\nThe game seems to just have everything in it, to the point that the games focus is sacrificed. Ostensibly, the game should be a medium-fast paced base-building w/ tower defense + exploration experience, but somehow manages to be a slow-paced twin-stick looter-shooter. It feels as if the latter cannibalized the former.\n\nEverything feels like a massive chore.\n\n#1 The bioscanner, it takes 3-4 seconds per scan but you'll need 30+ scans of a creature to learn what damage type it's weak to. So you are subject to this incredibly boring mechanic unless you google the information instead.\n\n#2 The research, it takes forever, you can't just build more labs b/c there's a maximum number you are allowed to build. Research also costs a mountain of resources for some reason, meaning the typical experience is to dump the majority of your resources into *just starting the research process*, then wait around doing nothing b/c you are out of resources for the next 5 minutes. Or you might try...\n\n#3 Exploring, there is another pod of enemies every 5 feet so just walking around looking for stuff is like trudging through deep mud, it's so obnoxious that the best upgrade for your mech is stealth. And you will want stealth for...\n\n#4 The geoscanner, slightly more tolerable than the bioscanner, a ton of resource patches are hidden so get used to holding space-bar everywhere you go.\n\n#5 No blueprints, practically a mortal sin for a game like this.\n\n#6 The loot. Jesus Christ what is with the loot. You could probably finish this game without ever crafting a weapon b/c the wildlife on this unexplored alien planet are constantly dropping miniguns and rocket launchers; Mech cosmetics, different color floors & lamps, statues, weapon attachments, you name it and some space-raptor you disintegrated has it in their pocket. From what I've experienced the exploration objects (\"bioanomalies\") hold maybe 1 - 2 loot items and you need to explore (see above) to find them, but a typical attack wave will drop a dozen or so loot items so why even bother.\n\n#7 Charge-Mode on weapons. The combat in this game consists of *several thousand* enemies rushing at you very fast, so why, why, why does *almost every weapon* have a charge-mode. Charge-mode (holding the button down), forces the player to split their concentration between the tsunami of space-raptors chasing them and watching/listening to the mechs right arm for the correct time to release the right mouse button; additionally charge-mode slows the mech down thus eliminating the ability to kite opponents. These are design decisions which strongly conflict. Aside from some charge-modes just being downright silly (you can charge the nuke launcher to make it nuke harder), most offer little to no advantage at all. But let us be real, you're only going to use about 10% of the arsenal anyway, none of them with charge-mode, minigun/plasmagun/laser/boxing-gloves/chainsaws.\n\n\n\nI remember liking the game on my first go through back in v1.0... but now...\nThe game in current state is extremely slow and laborious, has multiple conflicting design decisions, and IMO has lost focus on what the experience should be, seemingly in pursuit of some kind of RPG grindfest.",
      "voted_up": false,
      "votes_helpful": 23
    }
  ]
}