{
  "positive": [
    {
      "review": "Wow just WOW!\r\n\r\nI already thought DOOM (2016) was a masterpiece, but this game surpasses it.\r\nBoth the toys, the amount of monsters and the cutscenes are many times better than in the previous game.\r\n\r\nWhat i like most about this game are the toys, the secrets, the design of the monsters and the bosses and the levels\r\n\r\nOverall a 10/10 game!",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "DOOM Eternal is gorgeous to behold, a technological tour-de-force and an exciting new chapter in the Doom narrative, but it's not quite as fun to play as DOOM 2016. The problem is not that DOOM Eternal is too hard, rather it is too hard unless you play by its specific rules, which, for all its mechanical complexity, makes its combat chess less freeform and satisfying than its predecessors.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Pure, aggressive, beautiful chaos. The combat flow is like heavy metal ballet — once it clicks, it’s perfection.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "every game should thrive to be as optimized as doom eternal, god bless you doom eternal, god bless you.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "the art of gore, murder, ripping and tearing, truly at its peak",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Honestly , I know that this game is not for everyone, and I understand if some people find the gameplay a little boring after a a few hours , but I love this game , its not the best game ever , sure , but it gives me a feeling that no other game gives me , personally I like the boss fights ( other than the Khan mayker ) , but they're not that special, but I recommend this game everyday , especially if on sale",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "AMAZING. Game is perfect. Loving every second of it. Coming from someone who has played nearly ALL Doom games since DOS and N64.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nightmare only. After such gameplay u'll quick swap anything around u with various combo sets. \nGameplay 10 swaps/10.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Good graphics and good gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just when I thought DOOM (2016) was better, DOOM Eternal decided to get in kick demons harder in their asses. This game is so good, surprisingly addictive.\n\nFirst of all, I want to talk about the pacing and gameplay. This game is pretty fast, higher octane than the previous installment, you gotta keep moving more unless you want your ass get kicked by multiple demons, or worse, cornered. The gameplay, dang, it's so good. starting from the new dash mechanic, climbing, the satisfying bloodpunch, and the good uses of quick-switching, allowing you to utilize every single weapon you have and synegizing it. Not to mention of how useful the chainnsaw is now in Eternal. The atmosphere, while DOOM (2016) still won this category, DOOM Eternal is still pretty good, now implementing with the \"semi-fantasy\" setting. Lastly. the music. Mick Gordon nailed it again, banger music that keeps you on the move.\n\nOverall, this game has a lot variety and might be better than DOOM (2016). This game is an absolute must play, 10/10.\n\nHaven't played the Ancient Gods DLCs, and I hope I can play it in the future",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "game was pretty good could have played sex with hitler but chose this instead its a 6/10 in my honest opinion doom not sex with hitler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is better than 1st DOOM(2016)\r\ngameplay still monotone, u just killing bots, but it is way more active now and u have a lot of devices and upgrades, its a good part\r\nlocations is bigger and more opportunities to unify your own playstyle\r\n7 of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome fast-paced game, difficulty is on point and with the multiple abilities you gain throughout the game it really is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You cant really go wrong with game. doesnt matter if you are a Doom fan or not. Its a good shooter has an entertaining story, its a great feeling ripping everything apart and just having fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doom is a must play classic.  Spent many days at work with no sound but it still kicked ass.  It still kicks ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the best game in the world, and everyone knows why, go ask Maxor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminder that this game lost 2020's GOTY to a Wattpad-level story written by a deranged individual who likes bald girls.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very good gameplay excellent story and music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another great addition to arguably the most Christian game series worldwide",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to spend time \ngreat shooting combat \n\nand  runs eexceptional on Steam Deck Oled in ultra nightmare graphics and\nalmost perfect 60fps\n\none of the best DOOM game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall the visuals are amazing, the music is amazing, the level design is really intricate and well done, with some poorly designed puzzles at times. Lots of secrets to hunt for, which satisfies the obsessive part of my brain that liked 90s shooters.\r\n\r\nThe takedown animations are really fun because of how they're worked into gameplay, and it's satisfying that the most annoying enemies have the best takedown animation, because you really wanna rip their eyes out. \r\n\r\nThe Marauder isn't as bad as a lot of people think - he is simultaneously the hardest and easiest enemy, if you know what to do. Don't shoot him when he's got his shield up, and hit him with the double barrel shotgun when his eyes flash - the dogs will never come out. The annoying thing is that enemies will often set him off and release the dogs, and if the enemies are empowered because of a blood totem or that annoying Archvile, the game gets so flashy with effects you barely see anything, and get killed.\r\n\r\nOverall it's a great time, more similar to Half Life and Quake than classic Doom, but that's a good thing in my book. Also Bethesda.com and the online connection can f*** right off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playability / Enjoyment 10/10\nGraphics / Sound 9/10\nWoke / DEI score 0/10\nStory / Writing 3/10\nReplayability 10/10\n\nThis game is FPS perfection.  I do not believe it will ever be surpassed (although I hope I am proven wrong).   It gets better each time you play it and is simply the most fun you will have in an FPS game.  It is so good I wonder if the Devs sold their souls to the Devil to get it made.  It is very fast and you have to keep moving or die, at the same time planning how to beat each encounter.  The added jumping sections (which I found annoying on my first play through) add to the enjoyment once you get used to them,  The only real criticism is that it makes other FPS games suck by comparison (with the exception of DOOM 2016, which while not as good as this, is still great).\n\nIf forced to find any sort of issue,  I could say the story is pointless but nobody buys a Doom game for the writing.  If that is what you want, go and read Shakespeare.  It also requires a lot of processing power, but if there was a reason to buy a hefty PC, this is it.\n\nI have not played Doom: the Dark Ages yet as I just bought it on sale because I do not believe any game, however good is worth more than $50 (and even then, it will have to be super special) but I doubt it is better than Eternal as this is, as I mentioned before, true Perfection.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already finished it on PS, got it to do it all over again, best Doom game, extremely recommended for when you're going through shit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and easy on nightmare difficulty, the base game is amazing, don't buy the DLC's, it's just repackaged slop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on Steam Deck OLED\n—\n\nPerformance: Ran mostly good. It required some tinkering with the settings to get a consistent frame rate and occasionally it would still dip. Overall, it ran way better than expected.\n\nGameplay: This one is the perfect execution of a simple concept (kill all of the enemies) but layered with fun strategy and over the top gameplay elements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best action game I have played. Literally Ever. \n\nBy the end it almost feels like you no longer play game but rather an instrument. The game feels so rewarding for mastering its mechanics and the combat is so complex that you dont stop learning not even when you have played through the game on Nightmare for a second time. It's that good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute banger of a videogame! The wild and immersive combat with guns that never get boring to use makes you feel like a literal god, ripping and tearing through every demon that stood in your way. The world design is a banger, with hellish, yet beautiful landscapes that makes you feel like you stepped into Hell itself. 9/10, recommended for sure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doom Eternal is pretty fun! The combat is really engaging, the power high is huge, but it doesn't ever hold your hand (unless you're playing I'm Too Young To Die, but that's for all-around noobs anyway). The story is okay; I never read the codex, so I'm obviously not there for story, but the cutscenes are great! Overall, Doom Eternal is a solid game! A nice game to sick back, relax, and obliterate demons to. 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite FPS of all time. Ive put almost 100 hours into this game its very addicting. It really rewards mastering the system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, the game is so well designed. I love how every weapon gives you a different consumable (chainsaw=ammo, flame=armor, glory kill=health), forcing you to use each one. Chopping a demon in half with a chainsaw will never not be satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game! Super engaging, love the soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, the combat is fun, but I think it's a little step further away from the \"classic Doom feel\", I love the original Doom so I'm not very fond of all the platforming and verticality in this game. I think I enjoyed 2016 more, that one had jumping but somehow felt closer to the \"spirit\" of Doom 1 and 2. That doesn't mean this is bad at all, that's just personal taste. (Some levels are like ruins of a fantasy castle. That didn't feel \"doomish enough\". To name a couple of examples, the levels on the city or in Ancient Gods 1 the UAC base felt like \"yep, this looks like a Doom level\").\nLet's say I give Doom 1 a 10 out of 10, Doom 2 a 9, Doom 64 an 8,  Doom 2016 a 9, This is an 8 too. Very good, fun fights, and I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY good game, and the deals on it made it an actual steal to get. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably directly tied with DOOM 2016 for my favorite game ever. Period. Yeah, the online sucks, but I'm only here for the singleplayer and the relatively new official mod support means I'll probably never get bored! This and DOOM 2016 will likely be my go to stress relief games and metal albums for a very long time as they have been for years. Dark Ages is pretty good too I guess lol. Doesn't top these two for me personally however...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game! Pure adrenaline. Another 10/10 for Id Soft. The expansion of story beats pairs along well with the mayhem they allow you to wreak with the Slayer. By the end of the game you will be zooming through demons as you rip and tear to the sensational soundtrack!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game.I played the full game with mods without knowing that achievements will be locked by doing so 😭.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an actual video game. good for stress management and the satifaction of oblitterating demons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun. The movement is great and the ability for Doom slayer so swing around like spiderman is unique. The game is difficult enough for it not to feel boring but not too difficult for it to feel unfair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, great lore, amazing soundtrack, and sword",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game, it gave me like 100 orgasms, this is pure testosterone, the story is absolute cinema, and the gameplay is simply perfect, 10/10 and GOTY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love fast challenging combat, this is a must buy. \nIf you want to become good at fast paced combat, this is a must buy.\nIf you want to improve your reaction times and overcharge your synapses, this is a must buy.\n\nIf this is a must buy, you must buy it. What are you waiting for?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "opened the game and instantly boosted my testosterone would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect balance of Lore and action. Both first person cutscene that makes this immersive and 3rd person cutscenes to show how bug the story is. You truly feel like the only thing they fear in this game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow, this game is so fast paced and heavy. I had never played a game like this before but had a lot of fun shooting my way through waves and waves of enemies. this game is epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the whole of the doom series. I am kind of a fan boy so somewhat Bias. Not sure where to find anything like it what a rush.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aurafarming at it's finest.\n\nMick Gordon hired bethesda to make a game for his soundtracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Improves on Doom 2016 in just about every way in my opinion, although I can totally respect the simplicity of 2016 compared to this as it's more just raw gameplay and less flash. Quite possibly the most well optimised PC game out there with incredible visuals, rapid gameplay, weapon and enemy variety, a badass soundtrack and the introduction of the parkour elements which at first seem pretty basic and annoying but in fact seriously help with pacing as well as the smorgasbord of new gadgets at your disposal. If you like games where you shoot things then play this and you will not be disappointed. \n\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Палач рока принес добра и счастья « что такое доброта  что такое доброта. И увидит ее нельзя и потрогать, доброта это когда мы помогаем друг другу и уничтожим всю нечисть »",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Against all the evil that Hell can conjure, all the wickedness that mankind can produce, we will send unto them... only you. Rip and tear, until it is done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs a tad choppy on my admittedly old hardware, but still playable and a truly addictive playing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun and challenging sequel to doom 2018. really enjoyed the story, have yet to check out the dlc or multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "does everything that 2016 did, but more. \r\n\r\nmore gun. more move fast. more chainsaw. more throw grenade. more glory kill. \r\n\r\ngameplay wise, it's perfection - a beautiful dance of cooldown rotation, ability combos, and desparing at the \"LOW AMMO\" notification as you chainsaw your 15th zombie in 3 minutes. \r\n\r\neverything else? the worldbuilding, environmental storytelling, immersion? forgotten about. even the music suffered (not in musical quality, but mixing / production value), due to id completely shafting mick gordon so they could get out of paying him his worth. \r\n\r\nbut, the gameplay is SO good, SO satisfying, that i'm willing to accept these trade offs. there's nothing like the feeling of beating a master level on the highest difficulty after mastering the loop. it's a bit like mastering a musical instrument. \r\n\r\nif you're looking for more of 2016 in terms of gameplay, you're in luck. you'll be disappointed if you wanted more from the rest of the game, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played this game for a few hours and yes its worth it whatya think but i recoment to play doom 2016 its a totorial to the sweaty but fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOW, as a THE FINALS and Cyberpunk movement player, this game is so cool and fast paced. I LIKE IT! AND REMEMBER, RIP AND TEAR!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is HEAVY. Amazing progression systems, rewarding exploration, nice maps, gorgeous demons, very reminiscent of older shooters with a combination of the original doom (it feels really close to the mood of the original - and i dont mean the remake). One of the few immersive games ive played lately, worth your time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's DOOM and it's not relying on past glories. The game still feels fresh to this greybeard and is one of my first choices when I find increasingly less time to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doom Eternal is a game that does fantastic at making a fun power trip. The narrative helps you still feel heroic as you take up utterly relentless blood lust for demons that have and will take everything if you don't crush them so dramatically that you make monsters fear a mere mortal. Great graphics, fun gameplay loop, and a satisfying campaign. Don't forget the soundtrack that helps inspire you to be aggressive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doing another run before I get Dark Ages and the game is just so good!\n\nEvery aspect of the game work so well together and it's just such pure fun all the way. It feels like the devs really knew what players want and made such a masterpiece of a game!\n\nUsually I'm more of an RPG and adventure kinda guy but I do try all sorts of different genres if the game looks good. And this one beat all my expectations, even though I liked DOOM 2016 quite a bit.\n\nIt is rare I can honestly say I enjoy every single second of gameplay but man is it true for DOOM Eternal! The game can be really challenging a lot of the time but not once did it feel unfair. It is also very nice that every time I come back to the game I feel like I'm a much better player than last time.\n\nBest single player FPS game ever imo. If it's not on your wishilist or library, you're missing out!\n\nCan't wait to see what Dark Ages is like after I'm through my current playthrough of Eternal\n\n(as a sidenote, how is a game that looks this freaking good so well optimized??? I've played it on 3 different graphics cards and all have done very well framerate wise!)\nRIP AND TEAR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best fps games I've ever played the gameplay, the soundtrack, and even just the scenery was a  10/10\ncan't recommend this enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think I'm at a position to say that this's my favorite game of all time\nReasons why:\n-The music is burned into my head from how good it is (subjective)\n-Amazing FPS accuracy \n-Amazing Graphics\n-Tight game play mechanics where it feels like you're being given tools to fix a problem and it happens so seamlessly \n-Collectibles except for one (The Pain Elemental Toy) are easy to find and give you fun and funnier rewards\n-The story is that of peak fiction\n-It's infinitely re playable down to difficulty and new mod support\n-Battle passes always swapping out seasonally and it's the same items every year so you don't miss any cosmetics\n\nIt feels like the definitive FPS game of this century and I think it's going to be hard for the team over at id soft wear to top it and I don't blame them, for this is a masterpiece\n\n\"I am a believer now - I feel it is in DOOM that I have faith. The Slayer is the spear that stabs at the heart of our attackers, and those that would seek to harm us should feel warned - for there is only one dominant life form in this universe and it carries a steel barreled sword of vengeance. All hail the coming of the Destroyer - the Slayer's time is now.\" - Dr. Elena Richardson Log IV",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jumped into this right after beating the 2016 Doom on nightmare so I have immediate comparisons. LOVED the last game. here I havent got far at all, the difficulty is the same setting, but WAYYY harder in this game. Doom Marine takes way more damage and there are way more enemies. I can only play so long before its no longer fun.\nAlso the weapons just dont have the oomph in this game for some reason. \nupdate- needed some getting used to. so instead of relying on ammo and armor pick ups, you can make them yourself with chainsaw and flame attack that you get later. on top of the glory kill dash, you get a double dash which can be refreshed on a glory kill. this can send you flying around the map providing way more mobility than the prior game. while it was hard at first, getting used to the weak spot system and the item drop system, its been rewarding in a way other games have no.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is worse than DOOM 2016 in just about every way. It plays much more arcadey and the fact that you have to use certain guns to kill certain enemies is really annoying. It is too much thinking involved for a game that is just supposed to be a run and gun kill everything in your path type of game. It takes away from the simplicity of the previous title. But, with the lack of single player FPS games these days, this game is still worth the play through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DOOM Eternal takes everything that made DOOM (2016) great and pushes it even further. It is faster, harder, smarter, and more intense in every possible way. The result is one of the most exhilarating and skill-based shooters ever made.\n\nGameplay & Fun\n\nThe gameplay in DOOM Eternal is pure chaos — in the best possible way. Movement is quicker, combat arenas are bigger, and enemies are more aggressive.\nWhat really stands out is how much the game encourages you to think while fighting. Ammo, armor, and health all depend on using different tools:\n\nChainsaw for ammo\n\nFlame belch for armor\n\nGlory kills for health\n\nThis system makes every battle feel like a fast-paced puzzle where you’re constantly switching weapons, abilities, and movement tricks. When everything “clicks,” the game becomes insanely fun and satisfying.\n\nChallenge\n\nDOOM Eternal is significantly more challenging than DOOM (2016). Even normal difficulty requires you to stay active, aim well, and use every part of your kit.\nEnemies have weak points, special behaviors, and attack patterns you need to learn. It’s a game that respects your skill and expects you to improve.\nIf you enjoy mastery and want a shooter that actually tests you, this game delivers that perfectly.\n\nStory\n\nSurprisingly, DOOM Eternal expands the DOOM universe with much deeper lore. You get more information about the Doom Slayer’s past, Hell’s hierarchy, the Maykrs, and the wider universe.\nThe story is bigger, more cinematic, and has epic moments that feel almost mythological.\nEven though DOOM is an action-focused series, Eternal manages to tell a more ambitious story without slowing down the gameplay.\n\n Soundtrack & Effects\n\nMick Gordon’s soundtrack is legendary. The heavy industrial metal vibes perfectly match the game’s pace, and when the music hits during a fight, it feels incredible.\nThe sound effects are brutal and crisp, with every weapon having a strong and unique impact.\nVisually, DOOM Eternal is stunning:\n\nBright, detailed environments\n\nSmooth animations\n\nRidiculously cool demon designs\n\nExplosive particle effects\n\nIt’s one of the best-looking and best-sounding shooters on the market.\n\nOverall Experience\n\nDOOM Eternal is a masterpiece of fast, skill-based FPS gameplay. It’s a game that constantly pushes you to improve, rewards aggressive play, and delivers unforgettable combat encounters.\nIt’s bigger, louder, and more ambitious than DOOM (2016) — and it absolutely succeeds.\n\nIf you want a shooter that gives you speed, challenge, and style all at once, DOOM Eternal is a must-play.\n\nA phenomenal experience. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought Doom 2016 was great but this is a different class. The gameplay loop is so addictive. The \"Fun Zone\" as I've heard it called is the ultimate flow state and it really tickles my brain in the right way. You could get away with no really caring about ammo, health or armor in Doom 2016 but you have to be constantly harvesting the fodder in Eternal to stay alive long enough to attack the heavies. \r\n\r\nThere is a lot of dying, a lot of frustrating moments where you're so close and just can't make it but the euphoria of actually beating the levels in this game is unmatched. Also shout out to the optimisation in this game. I get 200+ FPS on an Intel Arc B580 with everything set to max and 1440p. I have had a few crashes though, not sure if that's an Intel driver problem or this game. \r\n\r\nI bought the DLCs for this as I didn't want the game to end. I haven't bought DLC for a game in years. That should say it all really.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after over 200 hours of slaying, getting all achievments and completing ultra-nightmare, I can say that whoever is saying the game has bad gameplay is a lil bro.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Without a doubt one of my favorite games of all time. the combat loop is insanely addicting and I'm constantly getting better. the performance and visuals are incredible as always, and i would say it isn't a stretch to call DOOM Eternal one of the best Bethesda games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got lost in this game an embarrassing ammount of times, especially considering they mark the way you're supposed to go in bright green.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dude it is so realistic and fun cant wait to play later they should make a better 2nd verson",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It sucks that it doesn't save after you unlock the unmaykr and doesn't let you go back for it after starting the last mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that has good movement fundamentals and a high skill ceiling when playing on a higher difficulty. Thoroughly enjoyable and quite cathartic when tired or stressed, and the music is phenomenal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as a dude who has finished ultrakill and P ranked P-2 on my second atempt i can confirm this is a chalanging game but a really, and i mean REALLY fun. Honestly i can't stop playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game rewards a player for being good. Couldnt be anymore fair than it is. Truly a game for a real gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Doom Eternal is a relentless, high-speed shooter\nthat hit me with an insane adrenaline spike almost every level.\nCombat feels like a non-stop puzzle of movement, resource juggling, and brutal weaponry. \nAll backed by Mick Gordon’s soundtrack that hits this perfect mix of pounding industrial metal, distorted synths, and rhythmic aggression that syncs with the combat so well it almost feels like part of the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sequal to an already great game. Mick Gordan was done dirty though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game taught me one thing: if it moves — rip it. If it doesn’t move — rip it anyway, just takes longer. The soundtrack is better than therapy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hated this game at first, couldn't bring myself to keep going due to how frustrating the game feels. Years later, I came back to it, said fu*k it and try it out again in nightmare mode! I died so much, but eventually something just clicked in my brain, and I figured out how to properly play it.\r\n\r\nTurns out the game is pretty damn fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They fear me as a force of nature... a dealer of thunder and death.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First played this on Xbox, loved it. Ever since I switched to Steam Deck with this game, i absolutely fell in love. The gyros, the track pads, the virtual menu acting as 'keys', it really takes it up a notch and plays very well. The combat loop especially feels much smoother.\n\nOverall though, 100% recommend the game, that is if you're willing to put time into killing demons and enjoy the fast pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You have to defeat each monster in a specific way or else you run out of ammo and die. Incredibly frustrating that you are forced to play this game a single way, but once you do play it that way, it is a nonstop adrenaline rush.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a big fan of action games but WOW the graphics really got me petrified. I'm at a loss for words about how beautiful this game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun didnt feel short pretty challenging and nice to look at better than cod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best FPS games ive played on pc and amazingly optimised would def recommend 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of variety.  Crazy cool demons.  Fun upgrade of weapons and abilities.  Sometimes jumping and dashing to places is too hard though.  :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has so much testosterone it made me have a son by mitosis. this just might be the best game, i love it, havent played the dark ages yet but this game is truly a wonder for a blonde petite anime loli like me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game series ever. Love Doom, Eternal and The Dark Ages. All slightly different with new ways to play and to get the hang of, but all DOOM, Brilliant games made by the masters. Rip and Tear then do it again never gets boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best soundtracks of all time this one and Doom 2016, very good game also, it rans very good on the steam deck even on high settings, its a very optimized game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played before the DLC release, so I can't comment on balance changes. Flow state the game, Rip and Tear until it is done",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast, Fun, Gory and each DLC doubles down on that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thought the Doom franchise couldn't get better. I was wrong and I'm so happy about it. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The singleplayer is extremely boring BUT this game has a strong community behind SvDD battlemode and there is an amazing mod called Slayer VS Slayer that makes this the BEST true FPS on the market. Great movement, depth to the mechanics, good interplay/combat options, and smart+friendly communicable real human players. I don't recommend the price tag for the campaign, but the multiplayer is worth it. The only innovative and modern FPS game worth playing. Get the game, look up SvS (slayer vs slayer de mod), and join the community for patch updates and LFG. Still alive and active!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best fps ever made.\n\n2x the game 2016 was and 3x the game the dark ages is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think I enjoyed Doom 2016 better but this was still a good game. I had a handful of technical problems though. Opening on the wrong monitor, changing my monitors refresh rate in windows settings, changing the resolution upon start up, and 1-2 crashes. Minimal issues but worth mentioning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing!!!\ni played the game twice and a lot of multiplayer on Bethesda launcher before it got shutdown and moved to steam thats why u see 6hrs of gameplay on steam.\ni was scrolling through library and thought i had to drop a review here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great doom game, there was a fight slightly before the final boss which was seriously hard and I got stuck there for too long, in that fight it's the last time you get the annoying shield guy and the tiger he sends sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay a bit better than Doom 2016 (much faster)\r\nStory is too much, D2016 was much more subtle which I prefer\r\nMultiplayer and non singleplayer is way too pushed for a singleplayer game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found this to be my favorite modern DOOM game and the action, gore and ferocity it brings is unmatched my favorite DOOM game as well second being the OG 90s DOOM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. I just love the feeling you get when you slaughter hundreds of demons and barely get hit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No chance of getting bored, at first it was tuff af but now im completely hooked. Btw its very difficult with controller but its fine im used to it, getting better every fight",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a shame that this game needs a constant online contact, randomly pauses when it loses online and it cannot handle bluetooth devices that got headphone and headset modes - you actually have to disable the headset modes of every headphone you want to use, otherwise there is no sound. This, paired with the chaotic hellstorm of demons even on  normal difficulty is so freaking annoying, that I cannot wholeheartedly recommend the game. This is the first game that gave me a hand cramp, as I had to use E,F,G,C Control, Shift, Space and WASD in such rapid succession that a speed typer would envy my hand movements. Doom 2016 was way better, had better pacing and no apparently random difficulty spikes.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I love doom series, I was so hyped about this game and still am, but I hate the fact that you need to be online all the time even when I am only playing the offline mode honestly sucks, I tried to change settings, I got stuck in loading until I alt+F4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Keep in mind this is my first DOOM game. Unfortunately it was not really what I expected. I felt like the world was kind of empty and the game was much more of a 3D platformer than the gorefest bullet hell game that I was expecting. I was hoping it was more of a more hardcore/faster solo, level-based game version of Killing Floor but what I got was a grim and hell-themed 3D Mario game with guns. It was still worth the 90% off I got it for, but I cannot recommend it for full price or even 50% off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is fantastic however the way id software treated Mick Gordon should warrant no ones purchase. Wish I knew before purchasing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Uses a mandatory launcher that you cannot disable. If you close the launcher, it closes the GAME as well. Absolutely bonkers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Sure, default difficulty is for ADHD kids..normal can't even keep up, do yourself a favor and put diffi on easiest, you get good old OG doom vibes..It's strange trend to put every fucking game at Souls difficulty levels by default. In olden days default diffi was for ALL with  good balanced challenge.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "From brutal to bloated!\n\nDoom Eternal is bloated and cartoonish, stripping away the raw brutality that made Doom legendary. Doom 2016 and The Dark Ages prove you don’t need endless systems or clumsy platforming to deliver pure, intense combat. Eternal? I’m only grinding achievements – not enjoying myself.\n\nThe platforming in Ancient Gods is so atrocious that I flipped my recommendation from Yes to No. This is the worst Doom I’ve ever played. Frustrating doesn’t even begin to cover it.\n\nI avoided this game for years because reviews warned me about the platforming. Eventually I gave it a chance. Big mistake. Eternal has flashes of brilliance, but every platforming section kills the momentum. Most levels leave me thinking: “I don’t want to play this anymore.” \nAs someone who has played every Doom since 1993, Eternal feels like the first true misstep. I’ll drag myself through to 100% achievements – and then I’m done with Eternal forever. Eternally.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So I launched the game for the first time, and it automatically runs on my second monitor, which is a pivot monitor in 9:16. When I searched online, I found out that people were having the same problem five years ago. This is really annoying and ridiculous. I’m never going to recommend this game to anyone. This is just stupidity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely stale gameplay for my taste. I got bored really fast and there was no incentive to continue playing. I'd prefer Metal: Hellsinger over this every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm mixed about the game itself, but the mandatory connecting to bethesda services and a separate launcher just so that one can access \"features\" that are an absolute blight is beyond annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Killed not only did they Mick Gordons interest in making music for video games  but marty straton took this mans work and did not pay him for it fuck I.D software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "probably a great game. idk, i didnt get to play it cause i needed an account and then to log in then accept all of the random bull it threw at me. didnt even get to play the game cause i got so annoyed at just trying to log in\nOH AND ALSO!! you cant delete a bethesda.net account manually. you have to ask them <3\ntook the company 12 minutes to make me hate it. beautiful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This sequel to Doom is not fun to play at all.  There is not enough ammo, and when you are out you have absolutely no chance of killing anything with your punches so you just have to sit and wait to die and respawn.  Even on easy you are by far the weakest part of the game with every single monster requiring copious amounts of ammo to destroy even if you are waiting for them to stun so that you can punch them to death for extra drops.  Bosses take multiple tries to try to figure out even what to do in order to kill them, and even then some bosses have a second level that catches you immediately off guard causing you to die and respawn at any earlier point in the game.  I am only in stage 5 out of 12 and the entire game has lost all of the charm and fun of the first game as well as the original in the series.  The whole experience feels like endless grinding with absolutely no point in continuing on other than the fact that you spent money to play this game and have no way to get a refund at this point in time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I get why people like it and it's got great reviews. It looks great, runs great and is excellent at what it does. But the constant chainsaw to get ammo, finisher for health, the awful platforming...  Its just not for me. I'de describe it as a tactical FPS, where you are repeatedly changing weapons due to low ammo and getting swarmed and killed. In an fps I just want to move and blast things with my favourite weapons, like DOOM 2016. 5/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Get stuck on the starting menu whilst exceeding the required hardware standards. My PC just freezes . Have never had an issue like this whilst playing other games",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "More of a thumbs sideways, but giving a thumbs down because for the opportunity cost of 20 hours, you can do much better:\n\nPros:\n-Great level design\n-Great enemy design, they fun to fight (except for the marauder)\n-Weapons are unique, feel fantastic, and are customizable to your own liking\n-Movement and platforming are a lot of fun\n\nCons:\n-The game gets worse the longer you play. It's completely overstimulating with all the flashing lights, lightning fast gameplay and hyper aggressive enemies\n-After a while through the campaign, there is nothing new. Encounters are just existing enemy types spawned in ever increasing quantities. Eventually the arenas get smaller and smaller and more and more stressful to play in. Enemies start spawning behind you and inevitably box you in, leading to some frustrating moments.\n-Story is incomprehensible for the player unless you take a deep dive into all the text codices found in-game. Even if you try reading everything, the story is still just weird and uninteresting. It gave me little motivation to continue.\n-There isn't really anything to break up the gameplay loop, which becomes tedious after a while. You shoot, platform, and sometimes stop to upgrade your weapons, then repeat. This is a problem for all shooters, but Doom Eternal does not do much to address it.\n-Secrets hidden throughout the levels may be seen as good game design to encourage exploration, but I disagree. \nThey encouraged me to constantly alt+tab to an external guide so I don't miss anything. I could have just missed them, but that is no fun.\n\nI finished it, but felt like I did it more out of obligation than out of enjoyment. Here are two other shooters that I would recommend you play instead:\n\nAmid Evil - It doesn't do much to break up the core gameplay loop either, but I found this one more enjoyable and just as fast without being totally overwhelming after a while\nImmortals of Aveum - This may be controversial, but I enjoyed this one much more than Doom. Story, though imperfect, was better, gameplay was just as good, customization was better, levels were just more beautiful, weapons were more interesting, just super slick. Check it out!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish I understood. The Doom remake that preceded this game was good. But this one, so far, has been just ok. I don't like the new mechanics where you need to switch to the chainsaw in order to get more ammo. IKR. So that's like what this game pushes. I don't like the level designs as much either.\n\nOk, so why the thumbs down. I figured, why not finish the game and I guess there's a new launcher or its updated or something. So when I launch the game from steam everything goes crazy and the launcher appears. I click launch the game (or whatever it says.) and nothing happened. second third time, then the game launches on the incorrect monitor and also launches a web browser somehow that starts playing an ad. So finally got my computer under control. and I'm about to go check out where I had my last save at when I realize that the entire game closed when I closed the launcher.\n\nSeemed to work fine the first time I played this so ... IDK. No thank you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Requested a refund after 30 minutes. This game is just a worse version of DOOM. Its like the laziest sequel possible. It like the developers never played the original. They just took the old game, made a couple new maps, ZERO story what so ever (which I dont totally mind but it is shockingly bare), and worst of all they removed melee from the game almost entirely (it stuns low level enemies with no damage), AND removed the pistol. The melee was by far the best part about the combat in DOOM. Getting rid of both the pistol and melee causes major issues with how combat works in the game. The pistol had infinite ammo and was your weapon when you ran out, and the melee would actually do damage. So you had options to conserve ammo, or just not be a sitting duck when you ran out. Ammo management is a HUGE part of the game. Now minor enemies that you used to be able to punch to death now take 2 out of 14 of your shotgun shells, which you will never find refills for. The refills you do find only give you 4 shells. You're just screwed. The only way you can conserve ammo is to get as close as possible to enemies to do as much damage per shot. At that point you are just playing a melee game WITH NO MELEE. The game is unplayable. I play DOOM on the hardest setting. I'm not just bad at the game. It's not a fun kind of difficult. Its just a bad, broken game. \n\nSeriously, whoever made this sequel never played the original once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is dull.  They made Doom great in 2016 but Doom Eternal feels ridiculous.   The game starts with the Doom guy floating above earth in his space mansion and VEGA is basically Jarvis from the Iron Man movies.   This is Bethesda trying to ride the wave of Super Hero movies and not even knowing what made Doom 2016 such a fun game.  \n\nHe can now do too much and they literally made him an immortal super hero that swings on bars and all this other stupid crap.   Its just ridiculous now and they made the game super colorful and good looking but when you play it, it just feels like a hollow imitation.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "God... Another shitty Bethesda game.... Can I change this game for DOOM and DOOM II please? Graphics looks terrible. Even Doom 3 had much better graphics than this crap and the crap before this crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rubbish. Game looks nice. Cant stand games swinging across bars etc. Enemies spawn everywhere. Not enough ammo. Constantly having to look for ammo. Not much fun in a game where you want to kill. No sprint, No slide, no crouch. No real exploration. Just follow this path. Just pointless spamming trying to survive. Not enjoyable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nice graphics... thats the only good thing i can say about this game...\n\nCompared to Doom 2016 this is utter garbage, its a jumping simulator and having to use a specific glory kill to get health armor or ammo is garbage.  I played it back in 2020, never liked it and hoped it would get better... i was wrong...\n\nI feel annoyed that i liked doom 2016 to buy the deluxe version back when it came out....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 Years and 3 platforms and despite my best attempts I still don't like this game.\n\nDoom 2016 was a breath of fresh air with doom guy ripping and tearing his way through hoards of enemies. This game on the other hand has always felt more like a forced puzzle in the middle of combat; wanna kill a Cacodemon with your Machine Gun? Too bad, you Have to use an explosive.\nSee a basic grunt and want to punch him to death? Guess what, outside of glory kills doom guy hits like a rotten asparagus and you die to a basic enemy.\n\nWhy should I care if you made the game \"fast paced\" by removing reloads and sprinting, if I have to treat every encounter like it's from a deck builder?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst Doom game ever. Platforming is not what Doom should be. Bunch of bs if you ask me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe I am saying this, but I am utterly disgusted as how little I like this game. There isn't any doom game that I disliked before as much as this one. I don't dislike this game 'cause it's bad but because it took the fun away from the franchise I actually love. Objectively speaking this is a good game, very polished, good controls, good shooting mechanics, etc, but the new added mechanics I absolutely despise.\r\n\r\n     First and foremost I hate the extremely limited ammo on guns and the mandatory chainsaw mechanic to collect ammo. It led to a repetitive gameplay loop where I used a gun to kill 2 big guys, switch to another gun kill 2 more, switch to another gun kill 2 more, chainsaw a little guy return to the same loop. It killed player expression and agency on how to approach combat. You either FOLLOW the correct way to play or suffer for it.\r\n     Second I can't main a gun, me as a player I felt forced to use the correct gun for the correct demon or risk being punished for it.\r\n     Third: There are way to many cooldowns to manage while there are way to many enemies and to little time to think about it. I assume they wanted you to be able to make strategic choices with the different tools you have like the flame thingie, ice grenade, punch, glory kills, double dodge, double jump but due to how encounters and arenas are designed it simply fails. There are to many enemies and they can simply spawn on top of you and when you are in the thick of it there is not time to think strategically you either react correctly or you don't. This had the consequence of you having to manage 4 different resources while dodging hundreds of projectile, running away from 10 - 15 demons, jumping, dodging, shooting while also keeping my eyes on the cooldowns for ammo recovery, health recovery, armor recovery, super punch recovery and gloy kills timing. Instead of having fun running around demolishing demons as a badass doomguy, most of the time it felt like I was playing a simulation game on how to manage resources. Do I have enough ammo? Is it time to chainsaw a guy? What about my health is it okay? Is my flame out of cd to recover some armor?? Should I glory kill the demon that is surrounded by 20 dudes? Or is it a death sentence?, etc\r\n     Fifth: Level design felt plastic, artificial boring and lacked exploration. While I love parkouring the level design is just lacking. IT doesn't make sense in any kind of way. I would have understood that after earth we go to hell and we have floaty thingies everywhere, but as it stands every level feels false and unrealistic.\r\n     Sixth: While they spent more time to develop the story than doom 2016 it felt worse in almost every way. I am the kind of guy that stops and read every lore entry but with this game it felt bad for some reason. I can't say why but so far I find the story to be lacking and confusing.\r\n     Seventh: The plasma rifle design is atrociously ugly. One of my favorite guns in the series and they made it so freaking ugly. \r\n\r\n     I will probably push to finish the game and maybe play it on the hardest difficulty because I love a challenge but that is more due to my stubbornness and my  wish to get value form my purchase. If you want a good Doom game go back and play they 2016 one. I can't recommend this one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately I cant refund this as I sat on it for a while. Really just not feeling it compared to 2016, maybe misremembering but there seems to be a lot more hop-and-bop jumping around platforming nonsense than rip-and-tear fun from the first game. Also not too keen on the using specific weapon attachments to crit enemies, I'm just here to mow demons down.Probably not the game for me, just going to go replay 2016 again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay: 10/10, most likely the best single player action shooter ever made.\n\nNoob breeding: fk you / 10 and get these pathetic cheats out of my fucking face! \n\nFound a secret? Great, here's a cheat for infinite ammo. Found another secret? Here's a cheat for all armor upgrades. Died twice to a boss? Hey, here, why don't you JUST use an immortality cheat, we won't judge! It is so god damn patronizing and disrespectful, I hate everything about it. Can't aim? Go to the options and turn on auto aim. \n\nThey call these \"accessibility\" features, but the only slimy subhuman species they are made for is the same people who are willing to go out of their way to install shady third party programs in multiplayer games in order to ruin the fun of everyone else involved. So why the hell cater to them so vehemently? \n\nI know that the latest installment is even worse in this regard and they deserve every ounce of scorn they get for it. It's like eating the best steak of your life with a plate filled with diarrhea as your side dish. Yeah, you don't HAVE TO eat it, but it's still there staring at you and smelling rancid!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do I need to have a Bethesda account when I bought it on steam? Had to disable internet to this game just to avoid having to make an account",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing Doom (2016) and previous installments, I just don't understand how anyone can like doom eternal. This  is designed like an old-fashioned arcade video game, perhaps all the reviews are from nostalgic players who only care about combat. I found it a big downgrade in terms of immersion in a diabolic world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of the jumpy jumpy tombraider nonsense. Was looking for a mindless shooter with some storyline. this felt more like a jump around puzzle shooter which was annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shockingly bad coming from 2016. It's a QTE fest, not a shooter game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible game, full of bugs, stuck in a room in the last mission of the game with ever spawning monsters and the stupid music wont fucking stop\r\nwhat a fucking turd, and to think the doom before this one was an actually really good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy twitchy-style and exhaustingly hard challenges... this game is for you.... I can't stand the direction they went with this DOOM game... Going from Doom 2016 to Eternal was a massive downgrade.... Too many times I've had to take a break from this game due to being annoyingly hard and luck has more to do with it than skill... I played through about 90% of this game and more times I found myself asking \"Why am I still playing this game.\" Safe to say, walking away from this one feels really good because Nightmare difficulty on this game is just.... terrible.... not challenging.... just god awful. I could not recommend this game.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely unclear and there are hidden walls EVERYWHERE. and annoying popups ALL THE TIME! This is just really bad imo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The dark lord fight made me be done with this one all together. usually Bethesda does better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tldr: Bethesda = malware, you need their account to play offline, which setting up is pain in the ass, and you need to opt-out of ad (sorry they call it \"marketing\" or whatnot) emails\n\nFirst of all - in intro blasting music full volume without option to skip that intro\nThen when youre \"in-game\" you need to create account and you cant access settings to change that volume\nThen it tells you that in order to play (offline) (later i found it that it is connected to steam anyway and it already has my steam username in bottom left of menu) you need their shitty-ass bethesda account\nThen when you finally go to create account, it shows you like 8 pages of update patch notes whatever which you cant skip and need to wait so you can click \"continue\" for like 3seconds (I guess they want you to read that useless crap so much)\nThen when you finally go to create their useless account, it says that \"password needs to be between 8 and 64characters\" even tho it is 25 chars long........\nNot to mention it needs to have special characters and whatnot like Im trying to create secure bank account and not shitty burner acc to play shitty game I already am authorized by Steam that I own\nThen you need to opt-out of ad emails - when you create account you cant continue without accepting to them - after you create account and have to login AGAIN to manage your account\nFunnily on that screen when I had to accept it they said \"you can manage preferences AT ANY TIME\" - what about RIGHT FUCKING NOW??????????\nThen they ask you to put \"security question\" for this stupid useless account\nThen when I go to opt-out of this stupid emails, it said that I need to fill in that securiyt question lol as if its some security-related matter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after a couple of hours i had to admit to myself that i hated every second of doom eternal. i hate how power was rebalanced away from your weapons arsenal towards abilities. i hate the new arcadey tone everything has. i hate how everything in this game is flying around the map at supersonic speeds. i hate how all the dashing and ability spam makes me feel like i'm playing fucking league of legends again. i hate how they butchered the solid and fun platforming of the previous game. i hate how goddamn long the levels are. i hate how they removed the gauss. i hate extra lives. i hate this game\n\n i love doom 2016 to death and this feels like one hell of an insult. i wish i could refund it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't feel right that a game like this doesn't allow you to sprint so you have to use your very limited rune slots if you want movement options other than relying on the meat hook and dashing. \n\nDon't get me wrong game is fun and challenging  but the fact that you don't really have much freedom when it comes to movement doesn't sit right with me. \n\nIt's a game where you're going around slaughtering demons, doesn't make sense to me why mobility in this game wouldn't be more accessible.\n\n(Beat this game on Ultra-Violence without many problems not skill issue)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. This game absolutely sucks.  Mental gymnastics required.  I just want to fight the undead not figure out where to jump.  Where to hit shift to fly to some weird gymnast finale. DOOM 2016 is vastly superior imo.  This is ONE of those games, where they forgot about what matters and someone on their staff decided to troll us.  It's absolutely awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not beginner-friendly. it told my i don't have permissions for the tutorial, and made no attempt to try to tell me what i'm there to do or why. and the popups for \"earned rewards\" never stop coming, even though i have no reason to care seeing as i'm new...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent shooter up until the parkour nonsense. I guess I'm off to YouTube to find a guide for where to jump/dash/whatever in order to progress.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "These new doom games suck. I said it. Its not just this one it's all of the modern Doom games. It's the constant forcing you to juggle between weapons and gimmicks. Light enemies on fire or else you won't have armor. Chainsaw enemies or else you won't have ammo. Melee or else you won't get health. But, you need gas to chainsaw and light on fire and when you go to glory kill, when desperate for health, you will do a regular melee instead and get crumbs. Then there's the, aim in a specific spot on the enemy or they will become a bullet sponge nightmare, mechanic. Hurray! The real kicker is these mechanics are still heavily in play, even at the easiest mode. Maybe it's because I play with a controller, but even on the easiest level I find some areas nearly impossible and I have been a long time Doom player(over 30yrs). I still play Doom 1 and 2 to this day and they far outshine these modern turds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doom slayer is even more pathetic here than in 2016, AND I DON'T WANT TO USE THE FUCKING RIFLE ALL THE TIME! I WANT TO USE THE PUMP ACTION SHOTGUN!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "CrackHead Movement needed im not down for that blah there 1st game that they did was good this is not",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much platforming and Puzzles but the combat is good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "new update makes the game crash on launch every time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's too much like a console game. You feel like Donkey Kong, not the Doom Slayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jumping simulator almost like Roblox. Doom 2016 was better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just couldnt get into the game, its just way too fast for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too complicated, some ways you get stuck not knowing where to go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The puzzles in this game rune the experience, would not buy again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is DEI doom with popups every few minutes and more jumping than Super Mario",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really liked Doom 2016. The platforming was dreadful but there wasn't much of it. The platforming in DE is worse and there's way more of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just a me problem. Aiming in this game feels weird, and the gameplay feels too \"bulky\"? It just has that modern Bethesda feeling of combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clown Eternal. Not a DooM game. \n\nA souls-like PvE Mario circus in MK lore with Halo-clown in a Predator suit as the main character. Not a space marine's tragedy. \nOnce upon a time, it's Halo plagiarized DooM.. and Predator was utterly inimitable... \nNovadays, the confronting anime-buffoon raises his shield due to your pressing the mouse1 button. And if you hit the timing well (since there is no need to reload after firing anymore, while the n-o-r-m-a-l weapon-specs are locked behind leveling-up) - cartoonish stars will spin over his head and then you can attack. \n\n* Have to admit that the KhanMaykr boss-fight is being conducted at a noticeably more acceptable level than it was in a 2016' disgrace and than it is in other boss-battles here.\n\n\n(Ultra-Violence; no HUD/UI, no crosshair, no f99y Predator-shoulder-cannon, no runes, no suit-token leveling, no dash in combat, no slo-mo;\nno full-auto/m.missles/h.blast/r.detonation/hook/d.blade/e.shield used; \nno Crusible used in missions 10-13) \n* Tried hard not to use Crusible in the end of mission 9, but the game just wouldn't let me out, spawning a DoomHunter after killing Arch-Vile, while spawning no zombies/imps to heal/reload (a bug?).\n\nGameplay: 20% of skill, 60% of consolish mystical-anime garbage, 20% of being lucky with enemy respawns&behavior > >\ncombat mechanics [gore is present, but with non-lethal melee, cr@ppy hitboxes & balance/specs; inadequate TTK besides the SuperShotgun use; modern id are incompetent] 4/10\ncombat logic [purple goo & traps for you only, absurd grind system, absurd SSG-hook; punching a walls/boxes/GreenButtons, but it's not lethal in melee] 0/10 \nparkour mechanics [forced 140kg-Mario double-doubledash idiocy] 3/10\natmosphere [reviving system, really? SSG-hook magic, outer-space and flying-rocks arcade, forced grind, AvP2010's spectral sentinels, green wolfs & 1UPs, floating weapons & power-ups, cutscenes in AFPS stages, VEGA-secretary radio-spam] 0/10\n\nLore and setting [not sci-fi anymore, no logics in; thanks to the real things been touched on, it's not zer0] 3/10\n<Story>\nPlot and characters/semiotics [infantile mystical trash; modern id are incompetent] 2/10\n\nGraphics [poor details besides FP-weapons, poor art, awful style & desing besides ZombieSoldiers and PlasmaGun] 6/10\n\nSound work [gives almost no info] 4/10\nSound design & music [even worse than 2016, but the HeavyCannon fire and Exultia/TarasNabad theme hold it up] 6/10\n[WelcomeHomeGreatSlayer, BargingIn and EndOfLevel are masterclass too]\n\n.\nJust a spit in the face of DooM connoisseurs. \nH. Martin, get lost already. And never touch the Quake franchise.\n\n\"3/10\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much platforming. Doom 2016 is much better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bethesda took all the lessons they learned about making Doom 2016 so good and tossed them out the window. Got bored after the first level. Save some time and money by watching the cut scene highlights on YouTube.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Parkour sucks. I want to kill demons, not play on monkey bars.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most overrated boring game of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Your bussiness model disgust me more than demons. Creep comp.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not need another launcher / online account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "feels so much worse then it did on playstation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get it running at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doom 2016 is more fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doom 2016 was way better than this trash.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too cluttered compared to the first one",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No hold to crouch.\nNo hold to sprint.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overdesigned mess. A chore to play. 2k16 remake is much better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mick Gordon",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Combat Loop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who put a launcher?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hueta",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unimaginable downgrade from DOOM in 2016, terrible launcher, forced TAA smear, blown-out cartoon color palette, visual downgrades in weapons, visual downgrades in enemy designs, downgrades in weapons upgrades, downgrade in weapon balancing, cluttered UI, bloated/overcomplicated equipment, terrible monster balancing, bad level design (arenas are often too cluttered, too small and full of silly gimmick mechanics like the monkey bars, etc...), forced platforming segments, juvenile puzzles, silly cutscenes, AWFUL Warhammer 40k/marvel multiverse ripoff story (plot holes galore).  Devs also lied about Mick Gordon, stole the credit to his music and fired him without pay.  \n[b] Avoid. [/b]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game, but a horrible publisher. Why do I have to create a meaningless Bethesda account to play the game? You guys are truly the cancer of the gaming industry.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "Is this game good? Well, it's complicated. I really enjoyed Doom (2016), and, like many others, prefer it over Eternal. I just found there to be too many frustrating elements to this game to give me the drive to see it through to the end.\n\nI've bounced off the game a couple of times now in an attempt to play through it, and I've come to a conclusion that it's just not for me. I enjoy the arena-style battles and shooting mechanics, but the constant need for resource management, thinking about when to glory kill, when to flamethrower, etc. to get different resources, made it feel like more of a puzzle game than a shooter. The platforming is okay, and I didn't hate it, but it didn't feel necessary half the time. The story felt wasn't captivating either.\n\nIt's a shame, because it's clearly a good game, just know that it may not be for you and that it might be worth playing Doom (2016) and leaving it at that.",
      "voted_up": false,
      "votes_helpful": 136
    },
    {
      "review": "Don't honestly know if it is a good game but I'm not connecting or creating a bethesda account to play a single player game.  I could disconnect my internet each time, or block it in the firewall/hosts but I shouldn't have to.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Opening the game for the first time is absolute cancer. Forced login to a Bethesda account and then needing to click through 10 different screens before even getting to the main menu. WHat the actual fuck is wrong with you Bethesda?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Unskippable Bethesda account requirement and no ability to play offline in single player game is a joke.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I pains me so much to give a thumbs down to this game, as I love Doom games.\n\n\n[b]TL;DR: They made killing demons a boring chore of specialized tools, and if you don't use them you don't get to have ammo, armor, and health.[/b]\n\n\nHere's why I can not recommend Doom Eternal:\n[list]\n\t[*]- It's a puzzle game: You can't just shoot the demon that you want to kill, you need to switch to the right mod on the right weapon.\n\t[*]- It's a boring puzzle game: You can't just shoot and kill demons and use your movement to find ammo, health and armor around the map. No, you need to do light the demons on fire to get armor, execute them to get health, chainsaw them to get ammo. Why am I thinking about using the right special tool just to have ammo and armor!? I just want to kill demons!\n[/list]\n\n\nDoom 2016 was the best Doom game because I could just have fun. This is a step back in the most important thing, the gameplay. You have made killing demons a chore with a TODO list of: set on fire, then chainsaw and if you don't do that, you don't get to have ammo and armor. This is so very boring.\n\n\nThe performance, art style, music, story and everything else, except for the gameplay is incredible. With that said, I can not recommend Doom Eternal because I don't want to encourage this type of boring gameplay.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The game is way better than I expected, it's really well balanced, just challenging enough to be fun, and not frustrating, appropriately for the difficulty level selected. It really keeps me on the edge of my seat.\n\nThe thumbs down is because of irksome quirks, such as:\n\nRight from the start you have to create a \"Bethesda account\" or else it won't let you play. Although legends tell of two heroes who found a way to play it without a Bethesda account.\n\nThe game recreates the retro feel of a 2000's netbook pre-loaded with crap (check out this new skin, check out that dlc, you wanna go to DOOMICON?).\n\nUnskippable intro vids every time you run the game. And you have to restart it a lot, bc if you Alt-Tab even once, Tab will stop working.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I want to preface this by saying...it's not really bad.  It's just not what I expected, and not in any ways that are good.\n\nWhat I expected was Doom 2016, but MORE.  What I got is something that doesn't feel like any sort of continuation of that game.  The tone of the lore dumps is off, with way too much mystical nobility horseshit that doesn't feel like it's lifted either from the corporate insanity of Doom 2016 (which, while present in Eternal is turned up to 11 for laughs but with no apparent in-universe reason) or from the Hell that it portrayed.  I don't need an organization chart of Hell, I don't need a fleshed out backstory for Doomguy.  This is ruining the Doom Slayer created in Doom 2016 the way Jason Momoa's Conan ruins Conan.  Doom 2016 set up everything in it piece by piece, and any gravitas the dialogue carried was earned.  Doom Eternal is just heavyhanded loredumps.  \n\nI've seen clips online that suggested to me that I was gonna get more Doom 2016, and I dunno maybe eventually I'll get that far in the game, but for now I think I want the disk space back.  The tone is what really is putting me off here.  But that's not the whole problem.\n\nThere is way too much tutorial, because it needs way too much tutorial.  People have complained about the platforming, but it's actually pretty good for FPS platforming (shiniest turd and all I guess).  That's...fine.  It's fine.  It's the pacing.  It's the disjointed environments that mess up the flow of battle that 2016 had.  There's too much getting cornered with no way to get ammo, too much finding yourself out in the open far from your enemies and they have no fucking chance, it's just all over the place.  I power through sections then hit a brick wall made out of a specific arrangement of low to mid enemies.  This would be okay, I guess, if the enemy tutorial items were actually useful.  Yes, you can disable a revenant by hitting its rocket launchers, very nice.  It takes less ammo to just kill it.  What is the point?  \n\nWhat it carries over from Doom 2016 it doesn't do as well.  What it adds is all pointless, annoying, or broken.  \n\nThis is not a bad game.  It is just following up a masterpiece, while not being one.  Some of the things that bother me won't bother most people.  Some of the things that bother a lot of others didn't bother me.  But there's something here to bother everyone.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "love it. it is beautifully.  but tired of all the jumping around. sometimes very difficult to understand how to continue a map/ mission. but i really had enough of the jumping and grabbing and swinging. not going to play anymore. is there a mod without the jumping?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I need to create a Bethesda account just to start the game.\n\nStop doing this, please.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "such a fucking awesome game but bethesda.net is actual cancer, and keep disconnecting me. After disconnecting me it just interrupts my gameplay to tell me that I'm offline while playing  a singleplayer game, and then when I die and try to restart it just gets stuck in a perpetual loop, very cool design thank you I love being trapped in an online service for a singplayer game very quaint and interesting it makes me happy as fook tbh\n\n\ngame doesn't even work anymore just blackscreens trying to start missions, absolute trash PTOO spit on this game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's a shame that this game needs a constant online contact, randomly pauses when it loses online and it cannot handle bluetooth devices that got headphone and headset modes - you actually have to disable the headset modes of every headphone you want to use, otherwise there is no sound. This, paired with the chaotic hellstorm of demons even on  normal difficulty is so freaking annoying, that I cannot wholeheartedly recommend the game. This is the first game that gave me a hand cramp, as I had to use E,F,G,C Control, Shift, Space and WASD in such rapid succession that a speed typer would envy my hand movements. Doom 2016 was way better, had better pacing and no apparently random difficulty spikes.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Just bought the game and can't even start it... About to refund it. Good job developers! 👍🏻",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love doom series, I was so hyped about this game and still am, but I hate the fact that you need to be online all the time even when I am only playing the offline mode honestly sucks, I tried to change settings, I got stuck in loading until I alt+F4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You have to create an account in order to play. Then, instead of letting you play, the game pauses every 5 seconds with a big popup explaining every little detail, just let me shoot the freaking demons. Terrible experience.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "beat it on ultra violence, really loved 2016 but the way they chose to add a pile of incongruous mechanics on top of what was pretty polished combat is just kind of irritating. the combat loop of any longer encounter is just picking off 1 or 2 of a horde then spending 10 times that long regenerating the health and ammo you used to do that because you get mulched in 2 hits by any enemy, repeat for 10 minutes, move onto the next one. boss fights are a repetitive slog, muted the music after 3 levels because I could not take it seriously, story is inane and masturbatory, muted the voices too\n\n3/10, a game designed to piss me off",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Doom is one of my favorite franchises. I really enjoyed playing the original Doom and its remake, Doom (2016). However, if I can confess my honest opinion about this game, I’m afraid I don’t find any pleasure in playing it. I try to be objective, but the parkour mechanism feels frustrating, and the weird, insufferable levels are truly puzzling to me. If you want to experience true hell while fighting god-forsaken creatures, this game might be highly recommended for you. But for me, it’s a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "TL;DR: The game has some innovation and was partially fun, but becomes a slog and has some glaring issues. Check DOOM 2016 first and play this afterward if you still crave it.\r\n\r\nA ton of the concepts are good and fun on paper. Weapon sandbox is very nice, dash is a good addition, infighting between demons still exists (as it should), and rooms are still well built for scrambles. The only problem I have with the weapons is some of them are strictly better picks than others. The [spoiler]unlockable BFG alternative[/spoiler] has strictly worse damage to ammo ratio, with practically no use given how few and far between that ammo type is. The scoped HMG takes too long for it's DPS in a game all about the scramble, and is only made good in one level due to a gimmick. Mini rocket HMG is such a busted pick for everything but the final boss, where it simply does not work. I could go on, but it's not that big an issue.\r\n\r\nThe story isn't really good (not what we are here for, let's be real) but the way they try to focus on it and make a worse story than DOOM 2016 (where they didn't try to focus on it as much) hurts my soul. The dialogue definitely isn't good either; Samuel emphasized TWICE that we needed to hurry in almost the exact same sentence with almost no gap between both instances. It also doesn't help when you hear Samuel tell you on repeat to speed up and then the game throws three 15-minute scramble fights with really strong enemies at you (the reuse of the gladiator boss as an enemy was the worst decision they could make for the game, anywhere he exist the fights go from rip-and-tear to run-and-tear and you are basically forced to isolate him).\r\n\r\nBoss fights aren't their strong suit either, some of them are simple, others are ammo and DPS checks, and the final one forces you into an almost stalemate if he repeats the same move. On top of that, I spent 15 minutes per phase on the final boss, and before I could kill it, the game auto-killed it for me and jarringly threw me into the kill cutscene, before roll credits. I couldn't even get that last bit of satisfaction for killing the boss i spent time on, because they ripped it from my hands.\r\n\r\nI really wish I could give this game a recommend, but the game became so much of a slog that I skipped collectible hunts and challenges on the last few levels just to get it over with, and ending the game with what felt like an ill-deserved boss kill is not a good feeling.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The parkour and always running out of ammo just ruins the fun of doom. I loved Doom 2016. I have tried to get into this game twice now, and each time I end up leaving frustrated due to all the terrible jumping mechanics.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The base game up to the Icon of sin ain't bad. Fast paced and some great musics to boot.\nthat's really the only kudos I feel like giving it.\nI don't play DOOM to platform.  what idiot thought DOOM needed jumping puzzles...\nI disliked the weapon mix & match with enemy types. kill the way the game wants you to kill or get punished at harder difficulties. \nI think the dlc story was just kinda garbage.  \nMarauder fights were so overly used that when 2 spawned I wasn't excited for a challenging encounter, I just groaned anticipating the mediocre slog.\nthe end boss of dlc was an absolute joke.\nEternal 7 / 10\nDLC 3 / 10\nDoom 2016 10/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Honestly after 2016, i really had high hopes for this, everyone praised this game.\nBut tbfh it's meh. Maps are worse, lot's of cheap death/bad mechanics, And lacks dynamic feeling of the first one. At this point i'm forcing myself to finish dlc.\n\nFor example. One of the enemies is invulnerable aside from when he's attacking, and only sometimes.\nAnother one keeps on summoning hordes of enemies and teleporting/running away from you on the map.\nEnemies are way more bullet spongy.\nA lot of situations where it's not very clear where you have to go, and have to stop and look around.\nA lot of sitatuations where you move around map and die due to cheap trap mechanic, and you have to do it all over again.\nIf you enjoy wasting time then it's game for you. If not might as well drop it.\n\nTbfh I'm amazed how the hell they managed to break a game that felt so good.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As of writing, I think I'd still refer to most of the comments from my Doom 2016 review: The gameplay loop is repetitive, the world it takes place in is overly generic sci-fi (much worse in this game, which adds a lot of junk to the half-assed \"lore\" of the franchise without really adding any depth), and the glory kill system really kills the pace and flow of combat once you realize how gimmicky it is. Particular to this game, I just can't stand the writing (this game takes that moment in Doom 2016 where Doom Slayer stomps on some argent energy processors while Samuel Hayden keeps yelling \"Please stop, we need those for our evil plans!\", and makes that the standard for every one of its obnoxiously incompetent villains, all of whom for some reason keep under-estimating the Doom Slayer's tendency to break everything as a way of solving plot issues), and it's overabundance of mechanics (beyond that awful glory kill system still conflicting with your natural tendency to just gun down all your enemies from a distance, there's now several other mechanics which the game tries to force you to use by making your ammo count woeful unless you use them, to the point that 90% of my deaths happened while searching my weapon wheel for something I still had bullets for). There's lots of content here, I did really enjoy fighting the more difficult enemies like the Tyrant or the Marauder, I thought the Doom Hunter's voice sounded cool, but the world of Doom is as shallow toxic-masculine as ever, if not more so (the first game [2016 I mean] at least made an effort to make its levels somewhat immersive in design, making you feel more like a badass even though it was itself a pretty linear experience in a generic sci-fi world, where-as this one has obtusely old school and archaic levels, complete with floating 1-up powerups and arbitrary floating platforms everywhere, which not only is objectively a huge regression in level design, but also makes it feel much more like your journey to stop the forces of hell is much more funneled even than before), and so is the gameplay once you get past how needlessly demanding the combat is mechanically. I honestly think I'd prefer to play Doom 2016 because at least it doesn't make you do a silly song and dance for ammo.\n\n5/10 - I'm tempted to give it a lower score because I just did not have a very good time until near the end, but I must concede that as of writing, I just hurriedly beat the game and didn't really try to milk it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't comment on the games quality but the fact that when i load the game and it forces me to make an account only for it to say servers are down is an imminent uninstall and pirate \nLOL\ngo fuck yourself",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Doesn't keep me wanting to play, the previous installment was much better, and even that one has its issues.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ultimately Doom Eternal might be looking like a good sequel to doom 2016, but the more you play it, the more you realize how terrible its new ideas are. They should have stayed on paper instead.\n\n+Excellent optimization. Probably the only game that runs RTX without the need of DLSS\n+Glory Kills are great\n+Lots of unlockables and hidden items for those who enjoy hunting that kind of stuff\n+Replayability\n+Hard difficulty and Slayer Gore Nests will kick your ass\n+Can be fun in the first half of its runtime\n+Solid music score\n\n-Bad aesthetics. Some levels can look cool, but others are meh. Also too much of color usage.\n-Muddy Texturework\n-Plot and lore. Come on man its Doom. Having an actual plot goes against the series logic. Also, Doom slayer speaks a few lines. Eff that.\n-Platforming is just okay. Its not as bad as people say online. \n-Constant weapon and ability micromanaging. Its gets extremely annoying when you get all the weapons, and using the weapon cycle (its mostly for controller players) is a no go with a kb+m because its breaking the game's super fast flow.\n-Enemies as ammo/health piniatas. Enjoy watching your weapons going out of ammo whenever you need them the most, and then be forced to dash around the arena to find a zombieniatas to chainsaw for ammo. I'd rather have the traditional fps ammo/health management instead.\n-Pacing that starts good, then becomes tiring. The game enjoys throwing new bull at you to keep things \"fresh\", and it gets extra tiresome in the later stages when they throw everything at you, all the time.\n-Special demons with special abilities like the marauder and doom hunter. They are annoying because they are here to kill the pace and to unnecessarily extend the duration of a fight.\n-Thanks to game's incredible speed and the countless number of colorful enemies(with their colorful attacks) on screen, the game's image more than often turns into a blurry, color vomit mess.\n-Demons dont do damage when they are fighting each other. Its just for show.\n-Bethesda's online account requirement (can be bypassed)\n-The persistence of adding a multiplayer mode that bloats the size of the game.\n\nDoom Eternal was a disappointment for me. I know that this kind of gameplay will appeal to a certain kind of git gud audience, but if you are a boomer shooter enthusiast, this aint it. If you want to try it, better buy it on sale. \n8/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "By far the worst gaming experience I can remember.\n\n- upon launching i'm forced to create a bethesda account\n- I'm then greeted by 7-8 advertisements that I cannot quickly dismiss, all while listening to loud music I couldn't turn down\n- the menu sound effects were so high pitched they made me uncomfortable\n- there was input lag of around a second, just moving around menus was a pain. I tried multiple fixes and nothing worked.\n- each time I launched the game trying a new fix for the input lag i had to sit through 20 seconds of unskippable branding\n\nJust a complete and utter mess that wasted 20 minutes of my life.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}