{
  "positive": [
    {
      "review": "Long story short: The game is good fun and stomping around in big robots never gets old.\n\nBut the only reason I will give a good rating or a recommendation for this game is due to the following reasons:\n1: Base game + older DLC's are dirt cheap during sales.\n2: Modding support.\n\nDo not get the game when its not on sale.\nDo not play the game if you can not mod it. (Workshop support is enabled, so modding is easy, but if for any reason...)\nSimply said: The base game without mods is simply wayyy too barebones to even be considered a proper Mechwarrior title. PGI (developer/publisher) poured a lot of love in to the game, i will admit to that. The attention to lore, timeline events and more is simply astounding. The way they tried to balance the game around all of that is also proper. But therein also lies the kicker. It feels like they tried to balance out the game too much and neglected a ton of stuff that would make the game feel more like a 'game' and not an empty slog of \"go here, blow this up, get out, buy/maintain mechs\".\n\nMods will put everything in to the game that should have been in there from the beginning and will make it so much better while also making sure you're not wasting time on the stuff that becomes a chore and doing stuff that is simply fun (it is a 'singleplayer/coöp game after all, not a sweaty online PvP fest).\n\nAnd its weird. They have created Mechwarrior Online, one of the deepest and most customizable PvP games out there in terms of Mech battles, with tons of options to min-max mechs at your own desire. But then didnt do the same for this game? Was this for balance? Was this to accomodate to some sort of self-sustained lore reason? I dont know. It feels weird that they left this game so minimal and you need to turn towards modding to 'fix' the stuff that PGI simply didnt include.\n\nIn any case, if you want my mod list to enhance vanilla version with just the right things:\n- HeatWarn XL 2.0\n- Mech Delivery (not necessary if you want to keep things difficult, but space Amazon can be handy if you soft-lock yourself or if you want to make the entire game too easy for yourself)\n- Serious Heat Sink Fix\n- QOL Upgrades - Thermals and Headlights (why this isnt in the base game still baffles me to this day)\n- Star Map Tips enhanced (Not necessary if you want to keep every star visit a 'mystery', But for all the people out there who dont want to waste a lot of time, this will save you time and will make the game slightly easier to reduce punishment of looking around for stuff)\n- Enable Infantry (created by PGI themselves, because putting this in the game base would have jumped their age rating)\n- Glassbreak\n- Cockpit Glass\n- Sounds of War - An ode to battletech (For all past Mechwarrior game fans)\n\nIf you want to go ALL OUT with modding and make the game the best version you can make it:\n- YAML and All YAML accessories. It's really insane how this overhauls the game to great lengths.",
      "voted_up": true,
      "votes_helpful": 158
    },
    {
      "review": "Conditional recommend- only buy on sale. \n\nFor a vet of Mechwarrior games (in my case, 2mercs and 4mercs) This game feels wrong. Mechs are far too fast, too 'floaty', and time to kill everything is way, way too short. There's no feeling of it being any sort of slugging match, instead it feels like a twitch shooter with some battlemech skin on it. Missions are repetitive and missions exist where you cannot clear a map- hostiles just endlessly spawn in. Most planets won't have too many contracts there, and you're encouraged to leave warzones to repair and refit, with massive time and cost penalties to repair and refit in them. The problem is that warzones are the only place to actually  get any sort of contract beyond arena missions. \n\nThere's excellent variety in both mechs and weapons, though weapons, in particular, are a little odd, especially if you're used to tabletop rules. Lots of variation inside weapon classes- Burst fire autocannons that do more damage over a longer time, short burst lasers that don't require you to hold a beam on a moving target, stream LRMs vs. normal LRMs.... and so on. Generally this isn't too bad, though it does get a little bewildering for someone used to an AC/10 being an AC/10 without any other considerations. There's also perks and improvements that can be applied to mechs, which are sort of like design quirks, but ones you assign- so more like perks to an RPG character. \n\nThat all said, there's a healthy mod community, with several mods looking to redress the balance and feel issues. It's because of that mod community that I think this game is worth picking up on sale- otherwise, it would be a hard pass.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The end game gets really easy even on harder difficulty missions since you can drop 4 atlas mechs in and grind everything into a fine powder but the gameplay feels really smooth and you feel like an absolute monster in the bigger mechs",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Dear new players,turn on throttle decay and then have fun.\r\n\r\nmy inner child loves making big robots fight",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I rarely leave reviews but here we are, this is a helluva game.  I remember loving MechWarrior way back in the late 90's, this is all that and then some.  Big stompy Mechs, great game play loop, coop, endless customization and Mechs to choose from.  Click a couple of buttons to add some mods from the workshop if you want to unlock the full potential, big one's being fixing the AI and adding a fully fleshed out lab with endless weapon options, engines and more Mechs.  Play through some or all of the Vanilla first though, to appreciate the updates.  Either way you go, it's a great gaming experience.  I've spent 3 days strait on it, I need a shower.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The continued advancement of the BattleTech timeline in the MechWarrior 5 games is a return to form, and a great reintroduction to the IP for both new and old fans alike! The DLC has added so much of the story that we've never seen in the MW games, and the quality of life improvements have been welcome from the developers.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "its exactly what i always wanted from MWO, PvE, that i can play with my friends.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Good story line, graphics and lots of variety in allowable play styles.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As a ClanFan I probably would like Clans better. But it doesn't work on my new pc. So I am saddened. However, this game with all its DLC is great for fans of the Battletech/Mechwarrior universe. \r\n\r\nAnd it actually runs on my pc. \r\n\r\nI'm not upset at the DLC's using MWO recycled assets, because MWO was also great. Would it be NICE if they made all new models? Sure. But the models are still lovely anyway. I've also installed a classic mech mod for more variety. \r\n\r\nThis is a mission grinding gameplay loop so if you don't like doing similar things repeatedly, you'll probably have a bad time. If you, like me, want to pilot a gigantic hulking mass of metal and blow up everything. Then yes. \r\n\r\nIt's giant robots.\r\n\r\nJust yes. That's the review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a wonderful stompy shooty mech game. Always a blast, and can play with a few friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I crammed 4 PPCs into my Catapult K2. Absolutely superb game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The core game is good and well supported by the developer with ongoing updates for both content and fixes. The game heavily benefits from mods such as YAML (Yet Another Mech Lab) and associated mods such as YAML IS Mechs which overhauls the customisation features and equipment available to a very high degree. Other mods such as TTRulez AI enhancement also greatly benefit gameplay to the point where I highly recommend not playing without them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this before on playstation5 and i just love the game.\r\ngreat fun with stompy mechs and lots of configuration options. Got all the dlc i missed out on last time and at some point will try it with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't expecting them to still support the game but PGI never gave up on it. It is a great mech game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No Guts, No Galaxy. \r\n\r\nMuch more sandbox-y, but honestly as a Battletech fan and nut of the lore - the main campaign, checking the news tickers, and four of the more 'narrative' focused DLCS (Kestrel Lancers, Rise of Rasalhague, Dragon's Gambit, & Shadow of Kerensky) are incredible. Co-op is great too. Highly recommended for Battletech/Mechwarrior fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best mechwarrior game to be honest, would like to see more stuff added maybe add a clanner turned merc start? would be cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MechWarrior 5: Mercenaries blew me away with its intense battles, immersive world, and deep customization. Piloting massive BattleMechs through war-torn planets feels incredible, and the strategic layer of managing your mercenary company adds real depth. I didn’t just enjoy the game — I fell in love with the entire BattleTech universe. A must-play for anyone who dreams of stomping across the battlefield in a giant mech!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game so far. I'm still learning the controls. Playing in Mech Control mode is much harder, I think. I've done a few missions in FPS mode and it kind of makes it too easy, I think. Anyway, it's worth your time if you like combat simulation games. The world building is also very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like battletech, and piloting mechs in first person, you will probably enjoy this game.  You get to run and manage your own mercenary company in the 3rd secession war.  As a battletech fan, I have very much enjoyed playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Mechwarriors are super as always. Managing the mechs is to complicated sometimes and takes more time, thats the only think I dont like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this game even though I am late to the party. Decent story, and enough tweaking of the mechs to keep things interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm conflicted on this one. It hits enough right notes, but it just does a lot of really small, annoying things. You can buy rifles, but you can't buy the ammo unless you have a specific DLC. You'll run at a rep deficit so you have to game that out instead of taking whatever contract seems good. Arbitrary drop tonnage limits instead of making it cost ineffective to drop assaults for small missions. Pirates only operating in conflict zones for some reason. Can't swap engines, slots in the base game are basically irrelevant. No partial salvage. Lostech is RNG if it shows up but not expensive, and you have to go places to see their inventory instead of just... paying a fee (or checking for free). No upgrading the Leopard so money is almost entirely for salaries and new parts the few times they show up. Some of these issues are intrinsic design flaws, but the rifle/ammo thing is basically a bug fix. Mods can fix a lot, but not everything. Battletech hits the notes a lot better, but it's still just as fun to stomp around and alpha strike someone as it ever was.\n\nGet it on sale. Use mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, although it doesn't really sing without quite extensive modding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MechWarrior 5: Mercenaries delivers a visceral, deeply satisfying cockpit experience that successfully captures the colossal scale and slow-motion destruction of BattleTech combat. Piloting these metallic behemoths—from the zippy flanker to the slow, indestructible Atlas—is where the game truly shines. However, the accompanying mercenary management layer feels slightly thin, and the reliance on numerous, often pricey, DLCs to deliver a complete experience ultimately weighs down the final score. It’s a great 'Mech sim trapped within a merely acceptable strategy game.\n\nThe 'Mech Experience: Weight and Power\nPiranha Games absolutely nailed the feeling of piloting a BattleMech. The sense of weight and momentum is palpable, creating a genuinely distinct feel between chassis classes. Jumping into a light Raven feels like piloting a nimble \"hotrod,\" while the heavy-hitting Centurion strikes a satisfying balance as a \"medium tank.\" Cruising toward the enemy at 45 km/h in an Atlas lives up to the fantasy of being an \"indestructible\" force of nature. The visual fidelity is superb, featuring gorgeous graphics, excellent 'Mech models, and satisfying destruction physics that make walking through entire city blocks feel truly amazing. This power is complemented by an equally impressive soundscape; the weapon feedback and effects are nothing short of amazing.\n\nMercenary Life and Progression\nThe strategic layer of running your mercenary company is acceptable but misses opportunities for deeper engagement. While the core loop of contracts, travel, and upgrading is functional, it feels \"dumbed down\" compared to the deep customization expected from the BattleTech tabletop heritage. For instance, the simple maintenance costs are a minor gripe; the game doesn't even charge for replacing armor or ammo—elements standard to the lore and expected after every mission.\n\nThe campaign and story are acceptable, serving as a solid framework for the mission-to-mission combat. However, the immersion is sometimes broken by underwhelming cutscenes that would have benefited greatly from higher production value or even live-action video reminiscent of older titles.\n\nThe Biggest Flaw: Pathfinding and Polish\nThe most significant drag on the experience is the erratic allied AI. The pathfinding for your lance-mates is often god-awful, frequently requiring player intervention and occasionally compromising mission success. Fixing this solitary issue would drastically improve the flow of combat and elevate the game to a 9/10 experience.\n\nContent and Longevity (The DLC Question)\nThe game is supported by a large volume of DLC. While the content itself is solid and supporting the developers is admirable, much of it feels overpriced. Locking features like melee weapons out of the base game was a questionable move that feels like an egregious cash-grab, forcing players to purchase expansions for core gameplay features. The overall longevity is decent, driven by the procedural mission generation and the ever-present pull of 'Mech collection.\n\nFinal Tally\nMechWarrior 5: Mercenaries is a game of magnificent highs and middling lows. It succeeds wildly in making you feel like a powerful 'Mech pilot, but it struggles to match that fidelity in its strategic and technical execution. It’s a lot of fun, earning a firm 7.5/10, and is a must-play for fans of the franchise, provided they are willing to navigate its technical rough edges and investment in its many add-ons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game!! Bash enemy mechs and customize your lance. The base story and DLC's campaigns are very entertaining and emotional. With a great mod community I keep coming back for a new play through constantly!! Well worth the purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game brings back memories. destruction is fun stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The open world mechwarrior game I wanted when I was a kid.  Be sure to check out the modding; it makes an excellent game all the better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. The developers have done an incredible job, especially considering the size of their team. It’s clear they’re deeply passionate about the BattleTech universe, and that passion shines through in every mission, mech, and moment.\r\nTurning MechWarrior 5 into a massive sandbox was a brilliant decision. The replayability is phenomenal, and the customization options are deeply satisfying. My only real wish? A more in-depth paint customization system. The ability to create and apply decals — especially something akin to the system seen in the Forza racing games — would be a game changer. It would unlock unlimited potential for personalization and give players even more ways to express their inner MechWarrior.\r\nBut hey, this is a review, not a dev wishlist. Bottom line: I 100% recommend this game. It’s well-priced, endlessly entertaining, and a must-play for anyone who loves stompy robots, tactical combat, and immersive sci-fi worlds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, the level of customization and the size of the map makes it the best Mechwarrior game I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terrific game, great community, kept fresh and fun by one word - MODDERS.  I love the modding community, spectacular people, really skilled, and most of them do it FREE.  Giant space robots with big guns \"coring\" other giant space robots with big guns.  While we would all PREFER the Mercenaries register and \"follow the rules\", you have to admire their tenacity and grit.  TRUE PATRIOTS OF THE INNER SPHERE!\n\n9.1/10, I like giant robots with big guns.\n\nThank you for your attention to this matter!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I need more of this game, The new DLC is amazingly good! \r\n\r\nthe mods too make this game even better and add to the immersive qualities for both classic and new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive put in 166 hrs thus far, completed untold amounts of missions, restarted twice without regret, and still every couple of months go back for a bit more.  That more than makes up for my own $1/hr gameplay rule for purchase happiness.  \r\nGood controls, fun weapons, and more mods than you can shake a stick at. Go ham, have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always liked the battletech universe and Mechwarrior4 mercs was my favorite of the francise. No real complaints. I hope the Pirana games will do the followup to Kerinskie DLC and give us the fedcom civilwar from the Specter timeline",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the turn based play.  It makes this game closer to a table top gaming experience.  The special scenarios in the campaign are lots of fun as well.  Great system for upgrading your mechs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid, if ye like mech games good choice, of you played gundam crossfire back in the day this is that dreem realized just without the gundams.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Lancers, we have been called to war![/h1]\r\n\r\nWhile development of Mechwarrior 5 may have been rocky, and their early alignment/release with Epic Games may have resulted in cut features we've still not seen (Rest in peace rumored VR support), in the modern day Mechwarrior 5 is a fantastic simulation game, where the more manage-y simulation game aspect of running your mercenary company and keeping it afloat is interjected with a small array of missions that place you in your mechs to duke it out and keep the game from getting stale, even if it could use more mission types after 100 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game, gives back vibes of pen and paper style. It was a little wonky at first learning the controls, but got use to them. Only have about 12 hours into the game, so this review is kind of early on in my experience with it; yet gamed enough to know this one is addictive. The mechanics of the game are explore and conquer. Which I love those type of games that I can rabbit hole into and go off course. The mechs are as I remember back in the 80's playing pen and paper; cool flashback. Story line is on par with what I remember too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Battletech and I love this game. So far I am impressed with the missions, the voice acting and the graphics and sound. Most of all, it's fun to play; the missions are fun, configuring mechs and pilots is fun, the setting and backstory are fun. I do really like Battletech, though, so maybe you shouldn't believe everything I say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Its a brilliant blend of open‑world freedom and deep mech customization. The sandbox galaxy lets you choose contracts, build faction reputations, and shape your own mercenary legend. The main campaign and all the side quests feel interesting and compelling. DLCs feel like natural extensions, adding fresh story-lines, new factions, and exclusive mechs without breaking immersion. Polished combat, striking visuals, and a supportive community round out an experience that keeps you coming back for more. Highly recommended for anyone who loves tactical mech action or just stomping around in giant robots and blowing the crap out of things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it is a solid game, but...\r\n\r\nPros.:\r\n- Mechs.\r\n- Graphics.\r\n- The feeling of the game and succession with the predecessors.\r\n- Customization.\r\n\r\nCons.:\r\n- Music.\r\n- Repeatable content.\r\n- Story.\r\n- Feeling that there is so much potential but it was not fulfilled.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Punching other battlemechs is extraordinarily exhilarating and quite frankly the best part of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you've been a BattleTech fan for a while, or just want to stomp things in a big robot, I highly recommend this game. With 7 DLC, the game is in a great spot right now and with loads of difficulty options, you can play like an FPS/TPS, a 'Mech sim, or somewhere in between.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, many variations. ok story. Need to play with friends for the best play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't had this much fun in a game in a long time. I cant stop playing it and it just gets better the longer I play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game with tons of replayability. The DLCs are also very good, and I need to speak out against their poor ratings, which actually kept me from buying them for a while...\n\nMy recommendation:\n- Buy and play the vanilla game, and finish it a few times.\n- Buy and play the Heroes of the Inner Sphere DLC. Play for each faction until you can beat level 100 difficulty missions.\n- Buy the rest of the DLCs, on discount if you want. Play each DLC separately, then in career mode, to have them in chronological order.\n\nThis way, you’ll experience everything the game has to offer and spend a lot of time having fun doing it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only writing this because I lambasted Clans. I'll do this out of a desire for Karmic Balance, if you will.\n\nAlmost 2.5K hours in this game, and I play vanilla, no mods.\n\nCan't praise it enough; that said, it has issues. \n\nNamely AI. PGI can't touch their AI spaghetti code without breaking it in a half dozen annoying ways apparently. Hoping it gets fixed in a future patch; but I know PGI. If they fix it, it'll be in the next DLC.\n\nBunch of new mechs are currently bugged: Mad Dog-As Missile Hardpoints aren't all aligned with the sights, so a 1/3rd of your missile volley veers off to the stars rather than towards your target; all the Clan Light Mechs are currently gimped by grossly improper Integrated DHS Heat Capacity; The Timberwolf-Prime fires it's RT Large Energy Hardpoint out of the LT weapon mount... Just to name a few. Hopefully they get patched.\n\nOther than that, the fact this entry will infuriate lore purists, and some mission breaking enemy spawns... This game is fun. The business management side is fun, the vanilla mechlab is fun (Fight me YAML users), the hunt for mechs is fun, and the missions are random and unpredictable as hell, courtesy of proc gen.\n\nAnd everything is two to four times as fun with coop; even the Lore Purists agree, cause they can flex their BT esoterica to a captive audience.\n\n2.5K hours of my life invested, and it's fun is all I really can say. Which does makes you think, how could a commendation get anymore glowing than that?\n\n2.5K hours in, and it's still fun; and it will still be fun up until the Heat Death of the universe wipes us all out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "لعبة رائعة وفيها تحدي وصعوبة في البداية لكن مع التعمق فيها فهي ممتعة للغاية وتحتاج الى الكثير من التركيز لعبة تستحق",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like mechs, this is an amazing game. The mod support is truly superb and adds hundreds of hours of free content. I come back and do a big playthrough every year. Starting another 100 hours now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily the best Action/RPG/Sandbox game of the last decade. ITS PRETTY GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big fan of the Battletech franchise. I have a lot of hours in MWO online so naturally I gravitated towards this. Great visuals and sound more big stompy robots. Only thing I was disappointed with was the barebones mech lab after coming from the online version however YAML(Yet another mechlab) series solves this in spades. The lance mate AI could use some love too but overall gets the job done. Helpful community,outstanding workshop/mods. Really enjoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Mech game ever. Best modding scene to support it.. a must buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So addictive once you get used to the torso versus legs directional movement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The potential for many hours of fun with a couple of friends.\r\nModding highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big mechs stomp things really good, sandbox can be tiring, but booming makes fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is beauty in putting 4 PPC-X on a single mech. I laugh like a little gremlin when 4 shotguns blast away a mech in one hit.\r\nThen some new DLCs hit, you can put 8 L-ER Lasers on a mech, ooooh boy. I might be cookin, but you sure arnt alive to see it.\r\n\r\nI wish you luck on your next playthrough. May your ultra autocannon 5 never seize up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing mech shooter.  Shooting mechs with big lasers and cannons is pretty fun, who knew.  But, there's also some pretty good story to go along with it.  The graphics are great, and it runs well on older hardware, such as my 2070(msi non-super / ti).  I personally like the, somewhat, slower mech combat compared to other titles such as the \"armored core\" series; you aren't gonna be flying around at mach Jesus to stab a tank with any plasma weaponry here, but you could dome a mech with a gauss cannon, or set them on fire with some incendiary missiles.  Oh, and you get to design the mechs with your own choice of weapons and some accessories.  The only issue I have with the game is that the ai can be a bit annoying at times, however the devs are still updating this game as of 11/13/2025 with new DLC and ai improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ai is dumb and loves to walk infront of you but otherwise it's a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Generally fun.  But missions can get repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Great DLC's, Great mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've had an absolute blast playign this with my friends, 10/10 mech game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a great game that you can sink endless hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun merc company management sim with great mod support",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "thumbs up because i like btech but its one of those games where your teammate AI has downs syndrome compared to enemy AI.  Also the characters have that kalergi plan thing going on so they are all ugly as hell.  the dumpy asian clanner from the dlc was just lol.  imagine a eugenically engineered human from an honor based society and still looking like a middle aged lady who doesn't work out and eats too many sweets",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With the many mods, and the many DLC's this game has awesome staying power.  I come back to it all the time.  Thanks to the creators and modder's for putting in so much time in creating this gem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good mech game, feels impactful. Progressionplay is nice as well, not everything unlocked at start. gotta put work in to unlock cooler and heavier shit",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is dope, especially with all the expansions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game, especially if you like the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You dig giant robots\nI dig giant robots\nWe dig giant robots\nChicks dig giant robots\nNice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game hard at points but great overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mech game been playing for long time really enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mod it for a few hours, get the DLC on sale and never play anything else forever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The year is 3049, I have managed to tape the MechLab guard to the wall and weld the door shut. My entire lance hates me, but the Triple Strength Myomer calls out to me like a siren. Soon thyne enemies shall know the true power of being cut in half with a sword on an 80 ton 'Mech with Blazers.\n\n10/10 Do not let me into the MechLab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always loved Mechwarrior PC games.  Lotsa funige.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many variables to control if you want to prevail.\r\naka: Mostironyalowed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like getting up to badassery in walking tonks :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better simulator games i have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like giant mechs? Do you like money? Do you like lasers? Yes? Money well spent, simple as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first was skeptical. Good job!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but its the mods that really awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked the robots with lasers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big mech with big guns, what more can I ask for?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is the bizzomb!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My mech is very warriored 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "doing dirty work in giant war machines? sing me up i'll go on every drop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good MW action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wait up...\nThat's not titanfall",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "just for badge",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its Battletech !!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Freebirth scum",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mech and game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gay mecha 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've lost so much time...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is Mech Warrior.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stompy fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I would normally recommend, but the lastest patch update really messed things up.\n\n- Lancemates getting stuck on terrain.\n- Lancemates ignoring commands a few seconds after being issued.\n- Enemies spawning below the map. Really frustrating when the mission requires a certain amount of enemy kills to complete.\n- Random game stuttering.\n- Still gets fatal errors and crashes from ray tracing being enabled.\n- In arena matches, enemies either stand in place or run to the furthest corner of the map and do nothing until you approach them.\n\nUntil these things are fixed, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "It's an incredible shame how poorly this game is made despite how good it looks in trailers. Character animations are stiff and plastic, combat is repetitive, mechanics are not explained, the post-tutorial difficulty is a cliff. The game starts you out with garbage light mechs and expects you to kill 3-4 times your weight in enemy forces. After savescumming the mission a dozen times i lose half my weapons and have to spend the entire paycheck fixing all the damage I take. This is not fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great sandbox still plagued by bugs. I have had to restart missions more times than i can count because of enemies stuck out of bounds blocking captures. After 7 DLC's this basic bug has still NEVER been fixed and the game is unplayable without mods to fix this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game but the multiplayer has many bugs, such as the player will be stuck in an infinite load",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty cool game, tons of mech and weapon variety, totally screwed over by the fact the AI is utterly incapable of navigating the game world, and constantly gets irrevocably stuck. This happens to both enemy and allied AI and has occurred in almost every mission I have played of this game. Why the hell is the AI so bad it can't even MOVE AROUND successfully?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got banned from using Battle Tech's online modes on this game for making in-offensive trans Jokes on another game (MWO).\r\nCan't use co-op or other features. \r\nLife time ban. \r\nIf you break their TOS for offensive speech they won't go easy on you or refund you.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Incredible potential ruined by abysmal dogshit lancemate AI.\n\nWhen 3/4 of your lance is controlled by brain dead slugs that can't even follow properly and spend 25% of the match unloading into your rear armor, it stops being fun. \nThere's more babysitting friendly lancemates to prevent them from getting stuck than shooting.\n\n\nOther significant issues with friendly lancemate AI include: \n\n    -Walking into line of fire while you are actively shooting. (frequent)\n\n    -Getting stuck on tiny rocks. (you have to switch to that mech and walk them off the rock every time)\n\n    -Pathing the long way around destructible terrain. (assault mechs pathing incorrectly around trees/rocks/obstacles they can walk through)\n\n    -You can equip them with jump jets, but there's no way to get them to use jump jets, even if its just a *use jumpjets to get unstuck* mode.\n\n    -Dumping missiles into terrain/cover and running out of ammo.\n\n    -If you let them punch (if you have punch assigned as on a weapon group) Your mech becomes a melee mech and rushes the enemy to punch them, neglecting other weapons, and damaging the arm and arm weapons (it doesn't care if you have a melee weapon or a fist, it just punches)\n\n    -they are unable to reverse, so if you ask them to come back they turn 180 degrees and show their rear armor to the enemy in front of you while facing you. They do this instead of going into reverse and backing up while facing forwards.\n\n   -cutting corners behind you and getting stuck on corners/big rocks. (have to go slow and micro lance around corners, f1 f3 f1 f3 f1 f3 f1 f3 etc)\n\n   -there's more.\n\nIf you can get past how bad the lancemate AI is, the game is pretty fun.\nWorth if you can get for more than 50% off. Cannot recommend full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stale gameplay, limited mission variety, absolutely brain dead AI team mate and a mediocre campaign story line. There's nothing to recommend about this game unless you are a Battletech fan like me AND you install a dozen mods that may or may not be updated with each patch. \r\n\r\nDLCs will add a bit more variety to the game but the core gameplay will continue to be disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are so many things wrong with this game...\n\nMissions objectives, payouts, and repair fees incentivize playstyles that are very un-mech warrior like, get in do the objective get out, don't waste a single second fighting enemies you won't get paid for killing, otherwise damage will rack up so high you don't ever turn a profit.\n\nRepetitive missions with the same boring maps over and over and over so you can grind out enough cash to upgrade your mech.\n\nRare equipment that gets destroyed just from a sneeze makes upgrading equipment not a financially sound decision. And don’t even think about given nice equipment to a lance mate, esp in an arm sections, it’ll get blown up within 15 seconds of mission start.\n\nYou spend alot of time just flying around from system to system to see what things are in stock. Most of the time you waste 30 in game days going somewhere that has a \"hero mech\" to only find out its some shit 30ton light mech...\n\nDifficulty artificially inflated by throwing wave after wave after wave of dumb as nails opponents. It gets old watching mechs literally spawn in the air a kilo out and fall to the ground like cs:go or tf2 spawns from 2 decades ago.\n\nA faction system that is constantly working against you…\n\nMechs designed so poorly heavy mechs don’t feel as strong as lighter mechs because the weapons profiles are always the same, like heavier mechs should have more weapons but it’s always the same 4 medium energy weapons and 2 medium missile hardpoints.\n\nNPC have the dumbest British accent and always run their mouth and are always saying the same crap over and over and over.\n\nGraphis so shitty you have to use the TAA Anti-Aliasing otherwise your eyes bleed from the sharpness turned up so high everything has jagged edges.\n\nAnd the thing that irritates me the most, sensors are so freaking horrible you are constantly losing radar sigs just because the enemy runs behind a ant hill.\n\nAlso so much time just spent walking, walking, walking. Its more walking sim then mech sim...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game bundle has an average value if you get it on sale.\n\nIt's nice that the latest version of the game has gameplay modifiers to alter difficulty and C-Bills economy if desired, as the base settings for game economy were rather atrocious.\n\nThough, I'm not very fond of the mission structure, as a sandbox type game, the content is very wide but also shallow because of the random generation, sort of like Skyrim. Infinitely spawning tank and helicopter mobs get annoying after a while. I preferred the MW4 Mercenaries mission structure, as those missions were handcrafted and had lots of unique and interesting situations, like the Beach Fight mission for fighting two Clan Jade Falcon Stars using a maximum of two assault Lances, or the mission split where Backstab lets you ambush the clanners in the middle of the night. The MW5 Mercenaries missions aren't as interesting in comparison, even the 'story' / DLC missions.\n\nI also feel like the user interface, Mechlab and Free Market in MW5 Mercenaries are all downgrades compared to what was implemented in MW4 Mercenaries (especially the thing where a mech's loadout display defaults to weapon view instead of detailed view, there is no option to make the detailed view the default).\n\nMW5 Mercenaries is good if you love a shallow sandbox loop, quantity over quality.\n\nMW4 Mercenaries is better if you love an interesting campaign mission sandbox with fun mech balancing and quality over quantity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While the only way to play a decent campaign, lance type mech game, it only truely shines with numerous mods active. That is ruined by game patches that always break those mods and it's annoying enough to have to wait for modders to catch up, that deleting it is preferable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is good but for whatever reason in the middle of playing it crashes my graphics drivers. It's gotten to the point where i'm like 30 hours into the game and now its unplayable. Huge waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got a lot of great moments out of this game, but also a massive amount of frustration. The feel of the mechs, the graphics, and the sound are all great, but the AI is so atrociously bad that it undermines all my enjoyment.\r\n\r\nFor example, put a human player in an LRM mech with small lasers and they will keep their distance and save the lasers for when enemies get too close. The AI in a similar situation might approach the enemy so they can use their small lasers, and in doing so will be be too close to use the missiles that provide most of their damage. Friendly AI also frequently gets stuck on terrain. The order options for friendly AI are also too simple to work around these issues. For example, you can tell an AI to stay put to keep them at roughly the right range, but you can't tell them to stay put [i] and [/i] prioritize a target. As soon as you tell them to prioritize, they will move as they please.\r\n\r\nMeanwhile enemy AI is almost as bad. They're very clearly programmed to prioritize the mech dealing the most damage. That's fine in theory, but in practice it means that an entire group of enemies will target the player and ignore other mechs, because the friendly AI is not competent enough to do comparable damage as the player. This also causes issues in arena matches, where getting involved in the match early on will give the player a high damage output, and the other mechs will start ignoring each other completely and attack the player en masse instead.\r\n\r\nSome of these AI issues would be forgivable if you could just ignore friendly AI, but the nature of the damage system means the missions are not really balanced for a player to complete them alone. I like that mid-mission repairs are rare, but it means if you attempt on your own, even weak enemies will chip down your health bit by bit.\r\n\r\nWith better AI this would be an easy 10/10, but as is it's more like a 5/10.\r\n\r\nFor the record I have all DLC except Shadow of Kerensky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "8 paid DLCs and they still haven't fixed AI pathing. I should not have to rely on community patches to make the npcs functional. Also still having enemy units spawn below the map rarely, making certain missions literally impossible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For a game that's been worked on this long, it's way too rough and unpolished. Why are there mechs that end up weighing 44.99 tons instead of 45 and why when you select a mission that allows 1 person, does it not automatically select just your character instead of making me exit out 3 other pilots and mechs before taking the mission and then adding them back after.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good parts: nostalgia points, meticulous attention to lore, satisfying play ergonomics and feedback, well made campaign missions, and lots of polished visuals.\r\n\r\nBad parts: utterly broken AI that is somehow less advanced than Mech 3's, incomplete and halfassed world assets everywhere, repetitive procedurally generated maps that are, again, somehow less advanced than Diablo 2, spawns that put enemies under the map, sticky traps or hidden voids in terrain, repetitive and predictable enemy drops, forced \"Offline Mode\" error that doesn't stop resurfacing after half a decade, ridiculous physics engine goofs, fundamental and common sense concepts / features / equipment for a BattleTech  game are missing, nonsensical and/or broken Clan mech loadouts, extremely exploitable arena economy, unbelievably huge memory requirements for gameplay and graphics that would have been considered B grade a decade ago, and a general lack of polish and quality control all around.\r\n\r\nThe game as a whole seems like a labor of love that suddenly got rushed for time and money, and the final product after all these progressively less polished yet massive DLCs and patches just feels like a 2010s EA job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all the core parts of this game play are hot ass the AI is soooo bad I don't know how they manage it the AI was better in Mechwarrior 1,2,3, and 4 also lone wolf.  The AI is soo bad it literally brakes the game making many missions an auto failure\n\n               This is a heart felt  note to any and all devs past and present\n\n                    if you are not on a graphic designer please find a new line of work you are bad at this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ever since this new DLC I cannot get my old mod combination to work. The game just gets a fatal error when trying to enter a mission. All the mods have been updated for the new DLC (but I dont own the DLC) and I suspect that is the reason why. Really sad that I will have to delete this game, there's nothing else like it out there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buddy Gifts me game, 5 hours spent trying to fix fatal error. \n\nAbsolute Dogshit Waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i've spent more time trying to figure out the menu and how to get a game going, ui is imo really bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Steam version of this game runs like sh!t and crashes Steam in most missions.\n\nI played a lot with the Game Pass version, it at least is playable.\nSince today I am no longer able to play coop, a problem that many people seem to have.\nWell they made a Gotcha Game before so no wonder the devs suck...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For years the Co-op Hangar load in bug is plaguing players already. First it was always the \"evil\" mods. But console players that don't even have mods or PC players not using mods also run into that issue. It can't be just the badly implemented inventory System. There is something fundamentally flawed in Co-Op that will not get fixed for years. I'm fed up. I want to love this game but every single day we get problems in Co-Op. 90% of the time we can \"fix\" it with the \"Host does a Single Player mission\" Ritual. But not today. Today we tried everything. We even transfered host. After a single mission the bug occured again. We Reduced the Savegame Filesize from 28 MB down to 10 MB by literally selling nearly everything. Ritual again. Still the bug.\n\nFix your game. It's embarassing. Stop pretending that this isn't a game breaking bug. The problem is the vanilla game. Fix it for gods sake.\n\nEDIT:\n- Make it possible for the host to force launch into a mission despite hangar bug.\n- Make it possible to reduce the amount of coop interactability as low as possible to prevent Hangar bug. People with Hangar bug can join missions when these missions are already started. So even when something fails we can play together via hotjoining. Why not reduce the amount of things that can fail in the first place as an option?\n- Any player joining should get an overview of what failed loading in\nRight now there is ZERO knowledge available ingame of what actually failed\n- Any player joining with mods should get a mod checksum comparison and a warning what mods don't have the correct checksum. It's not only about versions. Checksums will prevent players from having broken mods on their SSDs because of hardware failures.\n- Display a general Checksum like Stellaris in the main menu so people can quickly check if they have the same total version (Game + Mods)\n- Make a check and display for savegame corruption\n- Implement a Button to possibly a corrupted savegame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enemies get stuck in terrain (good for me), my Lance gets stuck in terrain (bad for me because I have to \r\nswitch cockpits and maneuver them out), heck even I sometimes get stuck in terrain. \r\nEnemies either ignore you or ignore everyone else to get to you. Allies walk in circles (seems to be an AI or pathfinding problem) or don't fire at enemies. Enemies get detected 4.5 clicks away and than vanish for 1 minute just to get detected again.  Do I have a spy-sat in high orbit or what is this supposed to be?\r\n\r\nThe missions objectives are super repetetive:\r\n- kill this amount of enemies\r\n- destroy this base\r\n- kill that special enemy\r\n- kill all enemies\r\n- defend that base\r\n\r\nThat's basically it.\r\n\r\nI liked the old games more, sure they were scripted but the objectives where more dynamic and at least they had someting like a story going on and your Lance/ was more talkative. The intro videos to the missions will most likely pass as cringe nowadays but the atmosphere was way better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "le sacan una actualizacion de 3 gb sin notas de parche y se rompe el coop cada vez que salimos de la partida con mi amigo, 5/10, esta entretenido el juego pero cada vez que queremos jugar es minimo una hora de webeo para entrar a la partida",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glitchy, messy, so dark you can't see. This is very low in quality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bored me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would normally recommend, but the lastest patch update really messed things up.\n\n- Lancemates getting stuck on terrain.\n- Lancemates ignoring commands a few seconds after being issued.\n- Enemies spawning below the map. Really frustrating when the mission requires a certain amount of enemy kills to complete.\n- Random game stuttering.\n- Still gets fatal errors and crashes from ray tracing being enabled.\n- In arena matches, enemies either stand in place or run to the furthest corner of the map and do nothing until you approach them.\n\nUntil these things are fixed, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "The game is fun, and is worth your time if you are a fan of the series...But I cannot recommend it fully. It has the potential to be more if they improved the spawn systems and AI. As it stands you need mods to get the full experience.\nIt isn't acceptable that it has been in such a poor state for so long. Modders should not be expected to compensate for these deficiencies. \n\nIf they ever implement these changes, it would really allow the game to shine. Its a shame that it doesn't seem to be a priority for them. I want to give this a recommend but their leaderships decision making doesn't allow for that.\nWe need to normalize targeting executives and their influence over development, as that is the reason the game is in this state. \n\nWhat good is it ragging on the actual employees working on the game when they do not get to decide what is worked on?\n\nEdit: I want to stress that I really enjoy this game! I want it to improve because I see potential in it.  I truly believe they could do great things for the game with better leadership. That change doesn't come without pressure! We can make that happen.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "This is one of my most played games on steam, yet I can't in good faith give this game a thumbs up. The lancemate AI is so brain dead that you'll spend half your time swapping between mech in order to unstick them from the most basic of terrain features. It's infuriating, if they stand on a rock they can't ever get off. The solution is to just move in any direction, but they won't do it. It makes every mission enormously frustrating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I played MechWarrior Online ages ago and decided to pick up this game to play with my friends after taking a break for several years. Sounded like a good idea, but I quickly discovered that they changed the UI in MW5 when compared to MWO. Where MWO I can play for hours, MW5 gives me motion sickness within 3-5 seconds of moving.\n\nSo, while I cannot say if the game is good or not: If you get motion sickness, stay away. \n\nThere's just no way I've found to alleviate the motion sickness problem. Looking at gameplay from MWO and MW5 side-by-side, it's clear to see that the UI was changed to move in-sync with the mech itself, rather than being independent. The cockpit bobbing moves in a wave pattern that just makes me feel very ill very quickly. So I just can't recommend the game for those who have motion sickness.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game still has numerous issues that were never fixed, despite all the DLC. The AI is plain bad and your AI lance mates can not handle mechs that aren't specifically designed for them. That S Laser on a Catapult? They're gonna use it to brawl. The same applies to the enemy AI, they love getting in your face.\n\nDifficulty in most missions comes down to \"Throw more mechs at the player\". You will pretty much ALWAYS be outnumbered and even if you bring 4 Atlas' it will turn into a war of attrition. \n\nThe Clans DLC only made this situation worse.\n\nMods help, but the vanilla game is not a particularly good version of MechWarrior.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Play campaign - incredibly slow opening, lost interest in the high school level of writing. That's fine - I'll just play Career mode instead.\n\nPlay career mode: Friendly AI gets caught up on every piece of geometry possible, requiring constant babysitting. Eventually, controls lock up entirely and I can't independently move my head separately from my legs. I've been fighting this for over an hour at this point. I gave up after that.\n\nI wish I had eaten a bowl of toenails instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's an incredible shame how poorly this game is made despite how good it looks in trailers. Character animations are stiff and plastic, combat is repetitive, mechanics are not explained, the post-tutorial difficulty is a cliff. The game starts you out with garbage light mechs and expects you to kill 3-4 times your weight in enemy forces. After savescumming the mission a dozen times i lose half my weapons and have to spend the entire paycheck fixing all the damage I take. This is not fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "PGI simply doesn’t understand what makes mech games special and what fans actually enjoy. MW5 shows that very clearly once again. In essence, MW5 is just the offline version of MechWarrior Online - but heavily neutered. For example, you can’t choose which reactor (engine) to use, what armor to equip, or whether your mech has an AMS system.\nWhy? Nobody knows. Basically: just because.\n\nEnemies don’t just exist in the world, they “spawn.” That means anything related to long-range combat - sniper weapons / long-range missiles; is basically pointless, since PGI decides when you can see an enemy and when you can’t. And to make it “more exciting,” they decided in their infinite wisdom that enemies should spawn practically in your lap. This means a brawler is always mandatory, especially since most mission triggers only activate when the player himself, not his AI teammates, walks into them.\n\nThe generic, non-story missions are always just quick runs across the map to blow something up, while the AI is so mind-numbingly dumb that it quickly kills any motivation. Because the AI - whether brawler or missile boat - only knows one tactic: Always rush straight into your lance. That instantly kills any immersion.\nThis is supposed to be a military simulation, where not only am I fighting for my life, but the enemy should also value theirs. Instead, two light mechs will happily charge straight into a lance of four 100-ton Mech´s - basically throwing their lives away.\n\nOverall, there’s zero strategy, zero tactics. Just shoot, shoot, shoot. If there weren’t tonnage limits, there’d be no reason for anything other than Assault class mechs to exist. There are no drawbacks to running an Assault. Things like “scouting the area” or “let’s take the high ground and attack from there” or anything resembling military procedure simply don’t exist. Just run and blast, run and blast - always at brawler range. The only time you play long range is before the enemy manages to rush into your formation.\nI’ve seen hobby projects by people who can’t even code properly with smarter AI than this. PGI really thought: “Eh, the idiots will buy anything. As long as it’s got mechs.” Why bother putting in effort?\n\nThe whole game feels like an “easy cash grab.” They already had a solid foundation with MechWarrior Online. All they did was strip out PvP and slap on a singleplayer mode - and did that terribly. The missions are brain-dead (run and blast), there’s no lore, no detailed descriptions of mechs, houses, the world, or anything else that could immerse players.\nInstead, they cut costs and corners everywhere. The result is basically an arcade game you could have found in any 90s game hall. It neither satisfies the BattleTech community with depth, nor attracts newcomers with lore. It’s just: run and blast. Everything around that is meant to distract from it - but fails.\n\nIn short: a game stuffed with artificial restrictions, offering nothing but “run and blast” on tiny maps, with the dumbest AI I’ve seen in 30 years of gaming, zero immersion because the game actively works against it, and a home base that serves no purpose at all.\n\nOn top of that, you’ve got technical issues like third-rate voice acting, a German localization that’s dramatically bad, with many sentences that make no sense, no ability to look around your cockpit, no ability to eject from it and AI-Lancemates that only have one Job: Stay in your way or run straigt in your line of fire.\nThat just rounds the whole thing off.\n\nEverything in this game has been carefully and deliberately crafted so that the average casual player, who only plays about 30 minutes a day, never experiences any frustration from anything that isn’t just running and blastig.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is fun when it works, however for me it's been an exercise in frustation. Bug after bug and glitch after glitch. The few times I was able to play a full mission was great though.\n\nStill can't recommend it due to all the problems I've had with it. Glad it was gifted to me for sure.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fun but the AI is just completely useless, play 4-man co-op or don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "new expansion is totally broken. Lancemates do not follow orders all enemys are now clan warriors (inner spere warriors calling you a freebirth Surat etc) and the solaris expansion has a fatal crash that stops the missions......they claim there is a hot fix comming in a week...been 21 days ...long ass week! DONE with this game until they fix it its TOTALLY BROKEN!!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A good game in concept, but in practice is a buggy mess. Don't buy full price. Grab on heavy discount and some of the DLC can be avoided entirely because it's low effort slop that adds like, one mech, a bunch of awful missions and balance-destroying/pointless weapons that are rehashes of guns already in the game at best and at worst makes your game crash a bunch more according to other user complaints.\n\nDLC positives:\n- Heroes of the Inner Sphere DLC is worth it but honestly should have been base game content, take that as you wish.\n- Kestrel Lancers DLC is a meaty side story campaign for you and a friend or two to chew on if you like the game's overall format and even has some meme-tier cringe dialogue to guffaw at past the halfway mark.\n- If you use Yet Another Mechlab and REALLY want to punch the heck out of stuff, Call to Arms is worth it  for the melee. Banshees are turbo melee mechs that can oneshot anything in the game if tuned right. If you don't use YAML you can skip it though as melee is entirely non-viable vanilla.\n\nDLC negatives:\n- Dragon's Gambit is awful slop that adds the longbow to the loot pool. Skip.\n- Solaris DLC is unforgivably bad. Skip.\n- Call to Arms costs half the base game and adds a single high reward quest with no challenge. Entirely skippable due to it's poor implementation, probably should have been base game content or a HOTIS improvement to maximise it's impact.\n- Kestrel Lancers DLC adds \"surprise artillery\" to missions which is exactly as unfun and overused as you think it is.\n\nThis game is at its most fun when with friends and even then you will most likely need mods to keep it from becoming frustrating or tedious. I feel there were some good ideas buried in here like controller support and crossplay but MW5 is the definition of \"mile wide, inch deep\" in terms of its content. Does the idea of you dropping into 100+ RNG-generated scenarios to do X mission in Y biome appeal to you? Do you want to play through a campaign mission set that feels barely more polished than said RNG missions where balance goes out the window soon after the tutorial is over? Does the concept of awful teammate (and enemy) AI please you, leaving you to micromanage them at every turn? Are you a diehard Battletech fan who just can't fathom the concept of playing something like the HBS Battletech game? This one might be for you, then.\n\nPGI have a history of putting out DLCs that are half baked, requiring multiple patches after the fact to fix only half the issues introduced by them. This has the knock-on effect of breaking mods all the time, albeit often for less than a day but the message is clear: the devs don't respect the modding community that single-handedly holds this game on it's shoulders like Atlas (heh, puns). This means the game can be turned from mostly functional to unenjoyably broken at the drop of a hat. Again, I recommend HBS Battletech over this even with it's large DLC portfolio especially for solo players.\n\nOh yeah, this game has like 7 DLCs that total waaay more than the price of the base game, so if you want the \"full experience\" get ready to open that wallet of yours and shell out a fat stack of cash for the epitome of minimum viable product. The most recent DLC adds Clan mechs, something that PGI tried to hock as an entirely separate game. I guess that didn't work out so good because lo and behold Clan mechs are now shoehorn-backported into MW5 Mercs via Shadow of Kerensky DLC.\n\nUnfortunately the stopgap measure fixes for what SoK broke on launch don't extend to my teammates constantly fighting invisible ninjas and ignoring actual targets right in front of them, a years long issue with no fix in sight. My squad will burn ammo and heat bar firing at literally nothing and turn in the wrong direction when there's 10+ targets the way I'm facing all dialled in on me. They appear to not want to engage air units or turrets at all unless they are fired upon or commanded to - seeing as the player is typically the focus of enemy attention due to their higher damage than braindead AI with no initiative this makes them doubly useless.\n\nI get AI squadmates not proactively attacking objectives otherwise they would burn through the mission faster than the player(s) can themselves but a lot more work needs to be done before computer teammates shed their liability status, something I'd wager won't happen very soon, if ever.\n\nVoice lines also overlap still when an enemy takes heavy damage and then dies a second or two later. Really gums up the soundscape with a dead mech pilot talking over himself.\n\nI also noticed tanks and mech feet now sink into the ground on some slopes. Not sure what that's all about.\n\nWould also love a setting to toggle off the weird plastic doll versions of Ryana and Forehead-- sorry, Fahad. Fahad also has tons of tiny little yellow dots all over his head. I think they're supposed to be hair, despite the fact they're the wrong colour (his facial hair is dark). [strike]At least they fixed the lighting issues causing his Kryten-itis in the latest patch.[/strike] <-- actually, it's not fixed lol\n\nTAA forced on bug during the leopard dropship loading cutscene is still in the game six years later, I genuinely think it's never getting patched.\n\nSo yeah... hard to recommend in any way at full price but if you can grab this on a big sale and your friends already have it, you could have some fun here tagging along with them. Solo it's a really tough sell, only recommended for absolute mech-dads with money to burn and/or are happy to heavily augment this game with mods to suit their play style.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- Very much dumbed down version of Mechwarrior for peasants. This thing is missing most of the lovely game mechanics introduced in earlier games of the series.\n\n- AI is _extremely_ bad, both in enemies and teammates alike. Feels like its capabilities are developing backwards. It used to be less bad before the latest DLC release wich \"updated\" the pilot system.\n\n- Normal difficulty way too easy, Hard difficulty is Nintendo hard.\n\n\nEDIT:\nUSE MODS. Mods truly make all the difference and address all the issues listed above.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great sandbox still plagued by bugs. I have had to restart missions more times than i can count because of enemies stuck out of bounds blocking captures. After 7 DLC's this basic bug has still NEVER been fixed and the game is unplayable without mods to fix this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game but the multiplayer has many bugs, such as the player will be stuck in an infinite load",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty cool game, tons of mech and weapon variety, totally screwed over by the fact the AI is utterly incapable of navigating the game world, and constantly gets irrevocably stuck. This happens to both enemy and allied AI and has occurred in almost every mission I have played of this game. Why the hell is the AI so bad it can't even MOVE AROUND successfully?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly want to recommend this. \nI love Mechwarrior, I've been playing a whole bunch of this and having fun probably as much as I've had hair-tearing scream-inducing frustration... \n\nDespite how many years it's been out, there are so. many. bugs. \nFrom small things like literally the first textures you see in game (if you skip the tutorial) being unloaded, the holograms clipping through the table or taking on the animations of other people, to game breaking failures like friendly ai not loading and sitting at the drop point, or enemy ai just not loading in what's supposed to be a free-for-all match, meaning you end up having to 1v1 eleven other mechs that are all factory fresh. \nIt's hard to tell if enemy reinforcements constantly dropping literally on top of you, sometimes infront AND behind, is a bug or a supposed feature but it's a baffling decision if the latter.\nThe friendly ai needs constant babysitting if and when it works at all, early game taking so much damage and barely hitting anything even late game. \nTwo assault mechs and a heavy Vs a single firestarter should not result in lost limbs. \n\nAdd to that the limitations on mech building and even hardpoint sizes making YAML (a mod) pretty nearly a requirement just to play, and the fact that you -need- multiple DLCs with minimal story, just to add weapons, mechanics, and mechs that should have been in the base game.\n\n\nGet it on super sale sometime, have some fun, mod the game into what it should be but PGI continues to shist the bed on this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Incredible potential ruined by abysmal dogshit lancemate AI.\n\nWhen 3/4 of your lance is controlled by brain dead slugs that can't even follow properly and spend 25% of the match unloading into your rear armor, it stops being fun. \nThere's more babysitting friendly lancemates to prevent them from getting stuck than shooting.\n\n\nOther significant issues with friendly lancemate AI include: \n\n    -Walking into line of fire while you are actively shooting. (frequent)\n\n    -Getting stuck on tiny rocks. (you have to switch to that mech and walk them off the rock every time)\n\n    -Pathing the long way around destructible terrain. (assault mechs pathing incorrectly around trees/rocks/obstacles they can walk through)\n\n    -You can equip them with jump jets, but there's no way to get them to use jump jets, even if its just a *use jumpjets to get unstuck* mode.\n\n    -Dumping missiles into terrain/cover and running out of ammo.\n\n    -If you let them punch (if you have punch assigned as on a weapon group) Your mech becomes a melee mech and rushes the enemy to punch them, neglecting other weapons, and damaging the arm and arm weapons (it doesn't care if you have a melee weapon or a fist, it just punches)\n\n    -they are unable to reverse, so if you ask them to come back they turn 180 degrees and show their rear armor to the enemy in front of you while facing you. They do this instead of going into reverse and backing up while facing forwards.\n\n   -cutting corners behind you and getting stuck on corners/big rocks. (have to go slow and micro lance around corners, f1 f3 f1 f3 f1 f3 f1 f3 etc)\n\n   -there's more.\n\nIf you can get past how bad the lancemate AI is, the game is pretty fun.\nWorth if you can get for more than 50% off. Cannot recommend full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stale gameplay, limited mission variety, absolutely brain dead AI team mate and a mediocre campaign story line. There's nothing to recommend about this game unless you are a Battletech fan like me AND you install a dozen mods that may or may not be updated with each patch. \r\n\r\nDLCs will add a bit more variety to the game but the core gameplay will continue to be disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gets repetitive fast. story is lackluster. the DLC is overpriced. but that's not even the worst part. the saddest thing about this game? it looks like trash. it's xbox 360 quality. the environments look especially bad. so many games out there that look a LOT better than this. for 85 gigs of space you'd think that would include decent textures. Sad state this franchise is in. Could be so much more.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Got banned from using Battle Tech's online modes on this game for making in-offensive trans Jokes on another game (MWO).\r\nCan't use co-op or other features. \r\nLife time ban. \r\nIf you break their TOS for offensive speech they won't go easy on you or refund you.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Amateur UI, 'Mecks ignoring terrain, uninspiring music, bare minimum story and dialogs, no FPS limit. Imagine doing MechWarrior games for a decade+ and coming up with this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There are so many things wrong with this game...\n\nMissions objectives, payouts, and repair fees incentivize playstyles that are very un-mech warrior like, get in do the objective get out, don't waste a single second fighting enemies you won't get paid for killing, otherwise damage will rack up so high you don't ever turn a profit.\n\nRepetitive missions with the same boring maps over and over and over so you can grind out enough cash to upgrade your mech.\n\nRare equipment that gets destroyed just from a sneeze makes upgrading equipment not a financially sound decision. And don’t even think about given nice equipment to a lance mate, esp in an arm sections, it’ll get blown up within 15 seconds of mission start.\n\nYou spend alot of time just flying around from system to system to see what things are in stock. Most of the time you waste 30 in game days going somewhere that has a \"hero mech\" to only find out its some shit 30ton light mech...\n\nDifficulty artificially inflated by throwing wave after wave after wave of dumb as nails opponents. It gets old watching mechs literally spawn in the air a kilo out and fall to the ground like cs:go or tf2 spawns from 2 decades ago.\n\nA faction system that is constantly working against you…\n\nMechs designed so poorly heavy mechs don’t feel as strong as lighter mechs because the weapons profiles are always the same, like heavier mechs should have more weapons but it’s always the same 4 medium energy weapons and 2 medium missile hardpoints.\n\nNPC have the dumbest British accent and always run their mouth and are always saying the same crap over and over and over.\n\nGraphis so shitty you have to use the TAA Anti-Aliasing otherwise your eyes bleed from the sharpness turned up so high everything has jagged edges.\n\nAnd the thing that irritates me the most, sensors are so freaking horrible you are constantly losing radar sigs just because the enemy runs behind a ant hill.\n\nAlso so much time just spent walking, walking, walking. Its more walking sim then mech sim...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to thumbs up this game, but it is only playable (enjoyable) with mods and the multiplayer is non-present.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great sandbox game made playable and more immersive with mods, Giving the negative review for a un-announced patch that broke the game and all the mods, also ray tracing sucks stop trying to make it a thing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very sad to say the game is bugged, regular crashes involving being booted from the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] Review for Single Player only[/h1]\n\n- Biggest flaw of this game are the eponymous \"mechwarriors\". They don't feel like characters. No personality. No agency. No reactivity or participation in the story. Just some modifiers you apply to your mechs.\n- The gameplay does not feel tactical. Lot of long tedious walks from point A to B, then some chaotic clickfest combat. No proper tactical planning or commanding of lance mates. Stealth is horrendous.\n- The content focuses on quantity over quality. There are massive numbers of mechs, variants, systems, weapons - but they do not feel substantially different. It feels like 4 hours of content stretched out into 40. Piloting one mech from another does not feel different.\n- Lot of mechanics like cantina, arena etc are just plain weird and nonsensical. \n- Coming from HBS' BattleTech, the customization of mechs does not seem as fulfilling, deep and layered.\n- The game is a complete eyesore. The UI is horrendous both in terms of functionality and style. The environments are ugly. Visuals get in the way of enjoyment.\n- The story and characters (such as they are) are entirely unengaging and uninteresting, including the drab main character, the ops officer Ryana with her awful accent, and engineer who seems perpetually high. Feels like a single player campaign tacked on to a multiplayer game.\n- We have this huge ship interior which is technically explorable in third person mode (space legs), but there is nothing to do there except go up and down the stairs between meeting with the two officers. Could have had other staff officers to interact with. Other actions to perform like meeting with your mechwarriors. Or simply being able to climb up into the mechs would have been something worth while. Wasted opportunity.\n- Despite the massive far future space opera setting, the technology present in the gameworld seems very backward in an implausible inauthentic kind of way. You don't even have technical capabilities available to 1960s aircrafts or naval ships. At some point \"lore\" became an excuse for lazy and unimaginative game design.\n\nI understand some of my concerns (visuals, story, characters, tactics) have been improved greatly in the subsequent Clans game. But that has come with the sacrifice of the sandbox gameworld. Those two sides of gameplay should not be mutually exclusive. 5 steps forward and 5 steps back.\n\nI hope they can released a MechWarrior 5.5, which combines Clans story and character driven gameplay into the sandbox format (e.g. Freelancer, the new Jagged Alliance, Gears Tactics etc). I will happily pay full price again and leave a positive review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I expect a game thats several years old to not crash and require me to go through flaiming hoops to make it work again. I'm so disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mous sensativeti dose nothing for me.\nSo it dose work as soon as you are in the mech but not befor so geting ther was hell for in every game i make a 90° turn now its 5 turns and that is very disorienting. Maybe it is good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game, again. Just so I could have it on Steam instead of the terrible EG Store.\n\nOne good thing about the game is that it still uses the more stable UE4 engine, usually runs well on older hardware. But there's no fancy stuff like native FSR support for AMD Radeon cards and regular ray-tracing is broken.\n\nOccasionally there's non-descriptive fatal error crashes ever since the DLC 7 release + updates, so I doubt they are fixable by the user.\n\nAI lancemates can still be a pain to play with until forcibly they're slightly better only after their skills are maxed out. In terms of navigation, they still need to be babysitted and especially if using lancemates with slower 'mechs, god-forbid if they fall out of formation that the player cannot change, it would be nice if we had some other formation choices other than what was there since the game's release. At least something so AI lancemates could go in front of the player instead, useful if lancemates have slower 'mechs or have more armor than whatever the player is piloting.\n\nSome of the DLC 7 missions could use a redesign, the missions can throw a bunch of AI opponents at you to make up for their lack of being able to play well. The missions from MW5: Clans were more varied in enemy encounters, interesting in terrain layout because they mostly feel like hand-crafted instead of generated randomly, albeit restrictive in where you can navigate during missions. Overall that game had a much better experience playing the missions than the recent MW5Mercs DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While the only way to play a decent campaign, lance type mech game, it only truely shines with numerous mods active. That is ruined by game patches that always break those mods and it's annoying enough to have to wait for modders to catch up, that deleting it is preferable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is good but for whatever reason in the middle of playing it crashes my graphics drivers. It's gotten to the point where i'm like 30 hours into the game and now its unplayable. Huge waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game bundle has an average value if you get it on sale.\n\nIt's nice that the latest version of the game has gameplay modifiers to alter difficulty and C-Bills economy if desired, as the base settings for game economy were rather atrocious.\n\nThough, I'm not very fond of the mission structure, as a sandbox type game, the content is very wide but also shallow because of the random generation, sort of like Skyrim. Infinitely spawning tank and helicopter mobs get annoying after a while. I preferred the MW4 Mercenaries mission structure, as those missions were handcrafted and had lots of unique and interesting situations, like the Beach Fight mission for fighting two Clan Jade Falcon Stars using a maximum of two assault Lances, or the mission split where Backstab lets you ambush the clanners in the middle of the night. The MW5 Mercenaries missions aren't as interesting in comparison, even the 'story' / DLC missions.\n\nI also feel like the user interface, Mechlab and Free Market in MW5 Mercenaries are all downgrades compared to what was implemented in MW4 Mercenaries (especially the thing where a mech's loadout display defaults to weapon view instead of detailed view, there is no option to make the detailed view the default).\n\nMW5 Mercenaries is good if you love a shallow sandbox loop, quantity over quality.\n\nMW4 Mercenaries is better if you love an interesting campaign mission sandbox with fun mech balancing and quality over quantity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashed my pc 4 times!!!! so many small things in the campaign are not explained like repair times and travel time affecting gameplay. and i could excuse that if not for the \"AI\" pilots. My god they will walk in front of you get shot and complain about friendly fire or run behind you and fire into your rear armor or run head long into enemy fire or refuse to save themselves when obviously surrounded. i got the game on sale with most of the dlc discounted so I can't complain on the price but the game itself is so jank and its so close to being good.  Unfourtunately its old by most standards so it likely will never get the updates and tweaks it needs. DO NOT BUY UNLESS YOU HAVE EXPERIENCE WITH THE SERIES OR REALLY LOVE THE IP.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy shit Piranha Games, learn how to make a functional co-op multiplayer mode before you start selling your damn product. Fuck this shit. Fuck you. Fix the fucking game you absolute cowards.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For a game that's been worked on this long, it's way too rough and unpolished. Why are there mechs that end up weighing 44.99 tons instead of 45 and why when you select a mission that allows 1 person, does it not automatically select just your character instead of making me exit out 3 other pilots and mechs before taking the mission and then adding them back after.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good parts: nostalgia points, meticulous attention to lore, satisfying play ergonomics and feedback, well made campaign missions, and lots of polished visuals.\r\n\r\nBad parts: utterly broken AI that is somehow less advanced than Mech 3's, incomplete and halfassed world assets everywhere, repetitive procedurally generated maps that are, again, somehow less advanced than Diablo 2, spawns that put enemies under the map, sticky traps or hidden voids in terrain, repetitive and predictable enemy drops, forced \"Offline Mode\" error that doesn't stop resurfacing after half a decade, ridiculous physics engine goofs, fundamental and common sense concepts / features / equipment for a BattleTech  game are missing, nonsensical and/or broken Clan mech loadouts, extremely exploitable arena economy, unbelievably huge memory requirements for gameplay and graphics that would have been considered B grade a decade ago, and a general lack of polish and quality control all around.\r\n\r\nThe game as a whole seems like a labor of love that suddenly got rushed for time and money, and the final product after all these progressively less polished yet massive DLCs and patches just feels like a 2010s EA job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all the core parts of this game play are hot ass the AI is soooo bad I don't know how they manage it the AI was better in Mechwarrior 1,2,3, and 4 also lone wolf.  The AI is soo bad it literally brakes the game making many missions an auto failure\n\n               This is a heart felt  note to any and all devs past and present\n\n                    if you are not on a graphic designer please find a new line of work you are bad at this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Two words; Infiltration Missions.\nThey're impossible, and not because they're challenging or any other sensible reason,  but because if you don't stay on level ground at ALL times tank NPCs will spawn right next to you with neither warning nor reason and they'll almost always automatically detect you. Even if you kill them they may be part of a group that's on the completely opposite side of the map, and so you can't possibly destroy them, then get to where they're tied to and destroy everything there in the one minute time limit that you have to kill them before you fail the mission by default.\n\nI actually like these missions, sometimes I just want to run around really fast, try to avoid being detected and steal stuff, but these missions are again impossible to handle because of some spawn bug that shouldn't be possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has the worst AI and pathfinding of any game I've played. Lancemates constantly get lost, or hang-up on terrain, or just randomly stop and wait while getting shot to pieces. Horrible. Frustrating. Also, The 2 main crew mates on our dropship need vented into space and replaced by people far less fkn opinionated and woke. Seriously, they just need to be deleted. Also, despite all the DLC, your mech still gets focus-fired all the time. Lancemates are virtually useless in this game in their current state. Finally, the voice acting is really bad, and the script was written by a 12 year old. Avoid. The game is inconsistant and still riddled with bugs. To top things off, I just lost all my saved progress when the Asus Zephryus random shutdown issue that has never been publically acknowledged or patched dropped me out of game (again), and all save files are now corrupted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ever since this new DLC I cannot get my old mod combination to work. The game just gets a fatal error when trying to enter a mission. All the mods have been updated for the new DLC (but I dont own the DLC) and I suspect that is the reason why. Really sad that I will have to delete this game, there's nothing else like it out there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not my cup of tea unfortunately, I wanted something more responsive and fast like Armored Core VI but the controls feel way too clunky and slow even with a light mech. Plus the meta only seems to encourage heavy mechs which is kinda lame, and on top of it, the game dosen't allow you to fight friends unless if you installed a mod. Pretty lazy game design imo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buddy Gifts me game, 5 hours spent trying to fix fatal error. \n\nAbsolute Dogshit Waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i've spent more time trying to figure out the menu and how to get a game going, ui is imo really bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not going to trouble shoot your game, get it together.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Until they fix the Co-op bugs that randomly do not allow the people you are playing with to actually ready up or do anything, I can not recommend this game. I love BattleTech and MechWarrior, but PGI needs to do to better, stop releases and FIX THE DAMN GAME.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy this at full price...wait for a sale.\n\nWhile I gave it a thumbs up, I  have played ALOT of this game as my hours played reflects. I still pick it up because I've been playing table top Battletech before the internet was born. This game could be so much better because over the years they've put in very little effort.\n\nIt's just a game, I get that... Having worked on games in the past I get it, I really do... but it comes to a point where the dev is just taking advantage of the community it says it cares so much about...\n\nPiranha is quickly following in the footsteps of Bethesda. They are depending on the modding community to much or they just don't give a shit... Just like Bethesda, Starfield was a giant piece of copy and paste with 20 hours of content for way to much money...so glad I didn't waste my time on that hunk of junk. Fallout 4 is a prime example, the unofficial player made fix mod is a must if you want to actually play the game without a lot of the legacy bugs, that Bethesda never fixed. And they want you to buy the same old game for another money grab... \n\nIn fact I would not be surprised if any of them have read 1 Battletech novel or source book other than the for references in weapons and mechs (enter sarcasm here). Every DLC is just showing the slide into we don't care, just give us your money...\n\nThe 3d model of Mason is a joke...light purple hair and balding...really? /facepalm It's unreal 5, how about letting us make mason how we envision him. Oh and maybe update his lack luster pilot icon with a cool looking helmet...oh but the retro 60's heli-pilot helm is great... Maybe match the icon to the new model... cuz they look nothing alike...now there is an idea... again the modding community to the rescue...\nRyanna has hips wider than a horse, and her French style eye liner doesn't start at the corner of her eye's...great attention to detail Piranha... I actually dated a French lady back in the early 90's when that was a new thing.\n\nThis latest DLC, the clans... the Clans are supposed to be these high-tech mech warriors that are fearless and have a code of honor. That reward bravery and sacrifice, well that's not what I am seeing, Everything but their assault mechs are weak, easy to core, they lack armor, their hit boxes are HUGE, easy to cockpit snipe... they hide behind hills, buildings etc, they do not face you directly until cornered. You have to chase them across the map. They drop in 2's and 3's despite being in Star. They do not use their speed or superior firepower, or their long range advantage... And the elementals... permanent flight, they do not jump, they fly around like bugs...bugs that can take 2 large laser hits and keep going... Is that your vision of a combat suit from the lore... seriously? \n\nI have to herd them into corners on the map to get a decent fight...oh that's right, we haven't seen a new map in how many years, still the same ole boring as maps, every drop.\n\nSame old boring bases I have to blow up. Walls count as infrastructure, so you don't even have to destroy the \"important\" buildings, like the HQ, or the Fuel pods, just smash the perimeter walls and presto, the base is destroyed..../facepalm...\n\nBeach Head maps - you don't blow up the guns, you blow up the radar dishes...seriously you cannot make this stuff up... who the hell came up with that idea... and do not even get me started on the point defenses ... again you dev's don't know the lore at all... ever heard of a Calliope Turret? Pretty much the standard turret used in the innersphere. Why...cuz it can actually fight at range... Not this pop up BS that gets destroyed before it can even return fire... again... your choices are mind blowing...\n\nHere let me help you: https://www.sarna.net/wiki/Calliope_Turret\n\nZero Mech lab. The part of the game that is the funniest, tweaking, experimenting, isn't even represented. Why would you worry about MWO competing with a PvE game... You should fire your marketing department, cuz I am willing to bet that \"great\" idea came from them. Alienating your PvE community is just stupid... plain stupid... And I played MWO for years but that's a rant for another time, well probably not cuz I gave up on that game a long time ago.\n\nHow many more DLC's will we get were they ignore the bugs that have been plaguing this game.\n\nHow many more DLC's will we get were they do not update the features of this game. \n\nIt maybe be year 3000+ but you do even get thermal hot/cold vision modes. You get a cheap version of Night Vision that doesn't work on most maps, not to mention your looking through a tube... Not even a virtual mode, which most of the previous MW games had. You know, it would help a lot of lower end systems play your game if you had a virtual vision mode... but shhhhhh...\n\nThe pathing sucks. Your lance mates get stuck on rocks all the time. They will walk halfway across the map to get into \"Formation\" because that formation spot is down on a canyon floor 60m below you. They are more worried about staying in formation so much that they will show their rears to the enemy rather than face the enemy. Who in their right mind would do that? Tell the group to go to a spot on the map, \nthen they don't hold formation, instead they all face the point in a circle jerk... you cannot make this stuff up...\n\nThe enemy uses jump jets, but your lance mates won't unless its a fixed point, which only the Call of Cali last mission has. In the almost 1400ish hrs I've played this game, I've never seen a lance mate use jets in combat on a flat field, not once... why even have them? But, but... you can switch to the mech and use them yourself..... le sigh...\n\nOnly 1 formation...yep just 1.  No column, no battle-line , no chevrons, no box. Really simple formations. You all do know that Mechs are just tanks that walk and carry more guns right...?(more sarcasm) Pretty sure Tank formations can be googled as open source. Its not rocket science... well maybe it is for you devs... cuz the pathing is such shit... ya I can see that, probably limited what you can do cuz the code is so bad... Am I close?\n\nThe target priorities of your lance mates is horrible. They get stuck on a tank that has no LOS and is 3500m away while a light mech approaches then circles them to take them apart. Eventually they will \"adjust\" but not before the damage is done. My only guess is... your code is shit, well its not really a guess. But but you the player can \"order\" them to attack... I can hear that excuse for your crap code all the way here in Nv.  Yep I can do that, then I have to take the time to reposition them all the while fighting. Usually I set them up on a hill and they strike out on my own, if they live great, if not oh well. A true Mech-warrior experience!  We don't even get a top-down tactical map that we can manipulate. The guys from No Guts no Galaxy tried that with a mod, Reloaded I think, it was good too, I wish they would of kept at it. Much better than the vanilla games features.\n\nI really wonder how many people actually play the game after the campaign and high reward missions are done. I am willing to bet not that many, at least not that may without mod's.\n\nJust like Bethesda, Bioware, and Ubisoft, just to name a few. You've became complacent in your success, forgotten the roots of the IP, drunk off the money. Minimal effort for maximum profits is the new mantra right?\n\nIt won't last forever, cuz nothing does.\n\nEnjoy the game you all, it could be so much better than it is. When you get bored of the vanilla game please do check out these mods:\n\nYet another mech Lab \"Series\" ( There are multiple but YAML is the base mod ) - steam workshop\n\nCoyote's Mission Pack - the way the Operations, missions and a few bonus items should have been - nexus website\n\nTarget Zoom - Again, 30th century and no real zoom optics - this fixes that - steam workshop\n\nGrab these to extend the life of the game and really see how pathic MW devs are becoming.\n\n-Drake",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Steam version of this game runs like sh!t and crashes Steam in most missions.\n\nI played a lot with the Game Pass version, it at least is playable.\nSince today I am no longer able to play coop, a problem that many people seem to have.\nWell they made a Gotcha Game before so no wonder the devs suck...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For years the Co-op Hangar load in bug is plaguing players already. First it was always the \"evil\" mods. But console players that don't even have mods or PC players not using mods also run into that issue. It can't be just the badly implemented inventory System. There is something fundamentally flawed in Co-Op that will not get fixed for years. I'm fed up. I want to love this game but every single day we get problems in Co-Op. 90% of the time we can \"fix\" it with the \"Host does a Single Player mission\" Ritual. But not today. Today we tried everything. We even transfered host. After a single mission the bug occured again. We Reduced the Savegame Filesize from 28 MB down to 10 MB by literally selling nearly everything. Ritual again. Still the bug.\n\nFix your game. It's embarassing. Stop pretending that this isn't a game breaking bug. The problem is the vanilla game. Fix it for gods sake.\n\nEDIT:\n- Make it possible for the host to force launch into a mission despite hangar bug.\n- Make it possible to reduce the amount of coop interactability as low as possible to prevent Hangar bug. People with Hangar bug can join missions when these missions are already started. So even when something fails we can play together via hotjoining. Why not reduce the amount of things that can fail in the first place as an option?\n- Any player joining should get an overview of what failed loading in\nRight now there is ZERO knowledge available ingame of what actually failed\n- Any player joining with mods should get a mod checksum comparison and a warning what mods don't have the correct checksum. It's not only about versions. Checksums will prevent players from having broken mods on their SSDs because of hardware failures.\n- Display a general Checksum like Stellaris in the main menu so people can quickly check if they have the same total version (Game + Mods)\n- Make a check and display for savegame corruption\n- Implement a Button to possibly a corrupted savegame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enemies get stuck in terrain (good for me), my Lance gets stuck in terrain (bad for me because I have to \r\nswitch cockpits and maneuver them out), heck even I sometimes get stuck in terrain. \r\nEnemies either ignore you or ignore everyone else to get to you. Allies walk in circles (seems to be an AI or pathfinding problem) or don't fire at enemies. Enemies get detected 4.5 clicks away and than vanish for 1 minute just to get detected again.  Do I have a spy-sat in high orbit or what is this supposed to be?\r\n\r\nThe missions objectives are super repetetive:\r\n- kill this amount of enemies\r\n- destroy this base\r\n- kill that special enemy\r\n- kill all enemies\r\n- defend that base\r\n\r\nThat's basically it.\r\n\r\nI liked the old games more, sure they were scripted but the objectives where more dynamic and at least they had someting like a story going on and your Lance/ was more talkative. The intro videos to the missions will most likely pass as cringe nowadays but the atmosphere was way better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "le sacan una actualizacion de 3 gb sin notas de parche y se rompe el coop cada vez que salimos de la partida con mi amigo, 5/10, esta entretenido el juego pero cada vez que queremos jugar es minimo una hora de webeo para entrar a la partida",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glitchy, messy, so dark you can't see. This is very low in quality.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bored me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would normally recommend, but the lastest patch update really messed things up.\n\n- Lancemates getting stuck on terrain.\n- Lancemates ignoring commands a few seconds after being issued.\n- Enemies spawning below the map. Really frustrating when the mission requires a certain amount of enemy kills to complete.\n- Random game stuttering.\n- Still gets fatal errors and crashes from ray tracing being enabled.\n- In arena matches, enemies either stand in place or run to the furthest corner of the map and do nothing until you approach them.\n\nUntil these things are fixed, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "The game is fun, and is worth your time if you are a fan of the series...But I cannot recommend it fully. It has the potential to be more if they improved the spawn systems and AI. As it stands you need mods to get the full experience.\nIt isn't acceptable that it has been in such a poor state for so long. Modders should not be expected to compensate for these deficiencies. \n\nIf they ever implement these changes, it would really allow the game to shine. Its a shame that it doesn't seem to be a priority for them. I want to give this a recommend but their leaderships decision making doesn't allow for that.\nWe need to normalize targeting executives and their influence over development, as that is the reason the game is in this state. \n\nWhat good is it ragging on the actual employees working on the game when they do not get to decide what is worked on?\n\nEdit: I want to stress that I really enjoy this game! I want it to improve because I see potential in it.  I truly believe they could do great things for the game with better leadership. That change doesn't come without pressure! We can make that happen.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "This is one of my most played games on steam, yet I can't in good faith give this game a thumbs up. The lancemate AI is so brain dead that you'll spend half your time swapping between mech in order to unstick them from the most basic of terrain features. It's infuriating, if they stand on a rock they can't ever get off. The solution is to just move in any direction, but they won't do it. It makes every mission enormously frustrating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I played MechWarrior Online ages ago and decided to pick up this game to play with my friends after taking a break for several years. Sounded like a good idea, but I quickly discovered that they changed the UI in MW5 when compared to MWO. Where MWO I can play for hours, MW5 gives me motion sickness within 3-5 seconds of moving.\n\nSo, while I cannot say if the game is good or not: If you get motion sickness, stay away. \n\nThere's just no way I've found to alleviate the motion sickness problem. Looking at gameplay from MWO and MW5 side-by-side, it's clear to see that the UI was changed to move in-sync with the mech itself, rather than being independent. The cockpit bobbing moves in a wave pattern that just makes me feel very ill very quickly. So I just can't recommend the game for those who have motion sickness.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game still has numerous issues that were never fixed, despite all the DLC. The AI is plain bad and your AI lance mates can not handle mechs that aren't specifically designed for them. That S Laser on a Catapult? They're gonna use it to brawl. The same applies to the enemy AI, they love getting in your face.\n\nDifficulty in most missions comes down to \"Throw more mechs at the player\". You will pretty much ALWAYS be outnumbered and even if you bring 4 Atlas' it will turn into a war of attrition. \n\nThe Clans DLC only made this situation worse.\n\nMods help, but the vanilla game is not a particularly good version of MechWarrior.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Play campaign - incredibly slow opening, lost interest in the high school level of writing. That's fine - I'll just play Career mode instead.\n\nPlay career mode: Friendly AI gets caught up on every piece of geometry possible, requiring constant babysitting. Eventually, controls lock up entirely and I can't independently move my head separately from my legs. I've been fighting this for over an hour at this point. I gave up after that.\n\nI wish I had eaten a bowl of toenails instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's an incredible shame how poorly this game is made despite how good it looks in trailers. Character animations are stiff and plastic, combat is repetitive, mechanics are not explained, the post-tutorial difficulty is a cliff. The game starts you out with garbage light mechs and expects you to kill 3-4 times your weight in enemy forces. After savescumming the mission a dozen times i lose half my weapons and have to spend the entire paycheck fixing all the damage I take. This is not fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "PGI simply doesn’t understand what makes mech games special and what fans actually enjoy. MW5 shows that very clearly once again. In essence, MW5 is just the offline version of MechWarrior Online - but heavily neutered. For example, you can’t choose which reactor (engine) to use, what armor to equip, or whether your mech has an AMS system.\nWhy? Nobody knows. Basically: just because.\n\nEnemies don’t just exist in the world, they “spawn.” That means anything related to long-range combat - sniper weapons / long-range missiles; is basically pointless, since PGI decides when you can see an enemy and when you can’t. And to make it “more exciting,” they decided in their infinite wisdom that enemies should spawn practically in your lap. This means a brawler is always mandatory, especially since most mission triggers only activate when the player himself, not his AI teammates, walks into them.\n\nThe generic, non-story missions are always just quick runs across the map to blow something up, while the AI is so mind-numbingly dumb that it quickly kills any motivation. Because the AI - whether brawler or missile boat - only knows one tactic: Always rush straight into your lance. That instantly kills any immersion.\nThis is supposed to be a military simulation, where not only am I fighting for my life, but the enemy should also value theirs. Instead, two light mechs will happily charge straight into a lance of four 100-ton Mech´s - basically throwing their lives away.\n\nOverall, there’s zero strategy, zero tactics. Just shoot, shoot, shoot. If there weren’t tonnage limits, there’d be no reason for anything other than Assault class mechs to exist. There are no drawbacks to running an Assault. Things like “scouting the area” or “let’s take the high ground and attack from there” or anything resembling military procedure simply don’t exist. Just run and blast, run and blast - always at brawler range. The only time you play long range is before the enemy manages to rush into your formation.\nI’ve seen hobby projects by people who can’t even code properly with smarter AI than this. PGI really thought: “Eh, the idiots will buy anything. As long as it’s got mechs.” Why bother putting in effort?\n\nThe whole game feels like an “easy cash grab.” They already had a solid foundation with MechWarrior Online. All they did was strip out PvP and slap on a singleplayer mode - and did that terribly. The missions are brain-dead (run and blast), there’s no lore, no detailed descriptions of mechs, houses, the world, or anything else that could immerse players.\nInstead, they cut costs and corners everywhere. The result is basically an arcade game you could have found in any 90s game hall. It neither satisfies the BattleTech community with depth, nor attracts newcomers with lore. It’s just: run and blast. Everything around that is meant to distract from it - but fails.\n\nIn short: a game stuffed with artificial restrictions, offering nothing but “run and blast” on tiny maps, with the dumbest AI I’ve seen in 30 years of gaming, zero immersion because the game actively works against it, and a home base that serves no purpose at all.\n\nOn top of that, you’ve got technical issues like third-rate voice acting, a German localization that’s dramatically bad, with many sentences that make no sense, no ability to look around your cockpit, no ability to eject from it and AI-Lancemates that only have one Job: Stay in your way or run straigt in your line of fire.\nThat just rounds the whole thing off.\n\nEverything in this game has been carefully and deliberately crafted so that the average casual player, who only plays about 30 minutes a day, never experiences any frustration from anything that isn’t just running and blastig.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is fun when it works, however for me it's been an exercise in frustation. Bug after bug and glitch after glitch. The few times I was able to play a full mission was great though.\n\nStill can't recommend it due to all the problems I've had with it. Glad it was gifted to me for sure.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fun but the AI is just completely useless, play 4-man co-op or don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "new expansion is totally broken. Lancemates do not follow orders all enemys are now clan warriors (inner spere warriors calling you a freebirth Surat etc) and the solaris expansion has a fatal crash that stops the missions......they claim there is a hot fix comming in a week...been 21 days ...long ass week! DONE with this game until they fix it its TOTALLY BROKEN!!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A good game in concept, but in practice is a buggy mess. Don't buy full price. Grab on heavy discount and some of the DLC can be avoided entirely because it's low effort slop that adds like, one mech, a bunch of awful missions and balance-destroying/pointless weapons that are rehashes of guns already in the game at best and at worst makes your game crash a bunch more according to other user complaints.\n\nDLC positives:\n- Heroes of the Inner Sphere DLC is worth it but honestly should have been base game content, take that as you wish.\n- Kestrel Lancers DLC is a meaty side story campaign for you and a friend or two to chew on if you like the game's overall format and even has some meme-tier cringe dialogue to guffaw at past the halfway mark.\n- If you use Yet Another Mechlab and REALLY want to punch the heck out of stuff, Call to Arms is worth it  for the melee. Banshees are turbo melee mechs that can oneshot anything in the game if tuned right. If you don't use YAML you can skip it though as melee is entirely non-viable vanilla.\n\nDLC negatives:\n- Dragon's Gambit is awful slop that adds the longbow to the loot pool. Skip.\n- Solaris DLC is unforgivably bad. Skip.\n- Call to Arms costs half the base game and adds a single high reward quest with no challenge. Entirely skippable due to it's poor implementation, probably should have been base game content or a HOTIS improvement to maximise it's impact.\n- Kestrel Lancers DLC adds \"surprise artillery\" to missions which is exactly as unfun and overused as you think it is.\n\nThis game is at its most fun when with friends and even then you will most likely need mods to keep it from becoming frustrating or tedious. I feel there were some good ideas buried in here like controller support and crossplay but MW5 is the definition of \"mile wide, inch deep\" in terms of its content. Does the idea of you dropping into 100+ RNG-generated scenarios to do X mission in Y biome appeal to you? Do you want to play through a campaign mission set that feels barely more polished than said RNG missions where balance goes out the window soon after the tutorial is over? Does the concept of awful teammate (and enemy) AI please you, leaving you to micromanage them at every turn? Are you a diehard Battletech fan who just can't fathom the concept of playing something like the HBS Battletech game? This one might be for you, then.\n\nPGI have a history of putting out DLCs that are half baked, requiring multiple patches after the fact to fix only half the issues introduced by them. This has the knock-on effect of breaking mods all the time, albeit often for less than a day but the message is clear: the devs don't respect the modding community that single-handedly holds this game on it's shoulders like Atlas (heh, puns). This means the game can be turned from mostly functional to unenjoyably broken at the drop of a hat. Again, I recommend HBS Battletech over this even with it's large DLC portfolio especially for solo players.\n\nOh yeah, this game has like 7 DLCs that total waaay more than the price of the base game, so if you want the \"full experience\" get ready to open that wallet of yours and shell out a fat stack of cash for the epitome of minimum viable product. The most recent DLC adds Clan mechs, something that PGI tried to hock as an entirely separate game. I guess that didn't work out so good because lo and behold Clan mechs are now shoehorn-backported into MW5 Mercs via Shadow of Kerensky DLC.\n\nUnfortunately the stopgap measure fixes for what SoK broke on launch don't extend to my teammates constantly fighting invisible ninjas and ignoring actual targets right in front of them, a years long issue with no fix in sight. My squad will burn ammo and heat bar firing at literally nothing and turn in the wrong direction when there's 10+ targets the way I'm facing all dialled in on me. They appear to not want to engage air units or turrets at all unless they are fired upon or commanded to - seeing as the player is typically the focus of enemy attention due to their higher damage than braindead AI with no initiative this makes them doubly useless.\n\nI get AI squadmates not proactively attacking objectives otherwise they would burn through the mission faster than the player(s) can themselves but a lot more work needs to be done before computer teammates shed their liability status, something I'd wager won't happen very soon, if ever.\n\nVoice lines also overlap still when an enemy takes heavy damage and then dies a second or two later. Really gums up the soundscape with a dead mech pilot talking over himself.\n\nI also noticed tanks and mech feet now sink into the ground on some slopes. Not sure what that's all about.\n\nWould also love a setting to toggle off the weird plastic doll versions of Ryana and Forehead-- sorry, Fahad. Fahad also has tons of tiny little yellow dots all over his head. I think they're supposed to be hair, despite the fact they're the wrong colour (his facial hair is dark). [strike]At least they fixed the lighting issues causing his Kryten-itis in the latest patch.[/strike] <-- actually, it's not fixed lol\n\nTAA forced on bug during the leopard dropship loading cutscene is still in the game six years later, I genuinely think it's never getting patched.\n\nSo yeah... hard to recommend in any way at full price but if you can grab this on a big sale and your friends already have it, you could have some fun here tagging along with them. Solo it's a really tough sell, only recommended for absolute mech-dads with money to burn and/or are happy to heavily augment this game with mods to suit their play style.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- Very much dumbed down version of Mechwarrior for peasants. This thing is missing most of the lovely game mechanics introduced in earlier games of the series.\n\n- AI is _extremely_ bad, both in enemies and teammates alike. Feels like its capabilities are developing backwards. It used to be less bad before the latest DLC release wich \"updated\" the pilot system.\n\n- Normal difficulty way too easy, Hard difficulty is Nintendo hard.\n\n\nEDIT:\nUSE MODS. Mods truly make all the difference and address all the issues listed above.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great sandbox still plagued by bugs. I have had to restart missions more times than i can count because of enemies stuck out of bounds blocking captures. After 7 DLC's this basic bug has still NEVER been fixed and the game is unplayable without mods to fix this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game but the multiplayer has many bugs, such as the player will be stuck in an infinite load",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty cool game, tons of mech and weapon variety, totally screwed over by the fact the AI is utterly incapable of navigating the game world, and constantly gets irrevocably stuck. This happens to both enemy and allied AI and has occurred in almost every mission I have played of this game. Why the hell is the AI so bad it can't even MOVE AROUND successfully?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly want to recommend this. \nI love Mechwarrior, I've been playing a whole bunch of this and having fun probably as much as I've had hair-tearing scream-inducing frustration... \n\nDespite how many years it's been out, there are so. many. bugs. \nFrom small things like literally the first textures you see in game (if you skip the tutorial) being unloaded, the holograms clipping through the table or taking on the animations of other people, to game breaking failures like friendly ai not loading and sitting at the drop point, or enemy ai just not loading in what's supposed to be a free-for-all match, meaning you end up having to 1v1 eleven other mechs that are all factory fresh. \nIt's hard to tell if enemy reinforcements constantly dropping literally on top of you, sometimes infront AND behind, is a bug or a supposed feature but it's a baffling decision if the latter.\nThe friendly ai needs constant babysitting if and when it works at all, early game taking so much damage and barely hitting anything even late game. \nTwo assault mechs and a heavy Vs a single firestarter should not result in lost limbs. \n\nAdd to that the limitations on mech building and even hardpoint sizes making YAML (a mod) pretty nearly a requirement just to play, and the fact that you -need- multiple DLCs with minimal story, just to add weapons, mechanics, and mechs that should have been in the base game.\n\n\nGet it on super sale sometime, have some fun, mod the game into what it should be but PGI continues to shist the bed on this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Incredible potential ruined by abysmal dogshit lancemate AI.\n\nWhen 3/4 of your lance is controlled by brain dead slugs that can't even follow properly and spend 25% of the match unloading into your rear armor, it stops being fun. \nThere's more babysitting friendly lancemates to prevent them from getting stuck than shooting.\n\n\nOther significant issues with friendly lancemate AI include: \n\n    -Walking into line of fire while you are actively shooting. (frequent)\n\n    -Getting stuck on tiny rocks. (you have to switch to that mech and walk them off the rock every time)\n\n    -Pathing the long way around destructible terrain. (assault mechs pathing incorrectly around trees/rocks/obstacles they can walk through)\n\n    -You can equip them with jump jets, but there's no way to get them to use jump jets, even if its just a *use jumpjets to get unstuck* mode.\n\n    -Dumping missiles into terrain/cover and running out of ammo.\n\n    -If you let them punch (if you have punch assigned as on a weapon group) Your mech becomes a melee mech and rushes the enemy to punch them, neglecting other weapons, and damaging the arm and arm weapons (it doesn't care if you have a melee weapon or a fist, it just punches)\n\n    -they are unable to reverse, so if you ask them to come back they turn 180 degrees and show their rear armor to the enemy in front of you while facing you. They do this instead of going into reverse and backing up while facing forwards.\n\n   -cutting corners behind you and getting stuck on corners/big rocks. (have to go slow and micro lance around corners, f1 f3 f1 f3 f1 f3 f1 f3 etc)\n\n   -there's more.\n\nIf you can get past how bad the lancemate AI is, the game is pretty fun.\nWorth if you can get for more than 50% off. Cannot recommend full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stale gameplay, limited mission variety, absolutely brain dead AI team mate and a mediocre campaign story line. There's nothing to recommend about this game unless you are a Battletech fan like me AND you install a dozen mods that may or may not be updated with each patch. \r\n\r\nDLCs will add a bit more variety to the game but the core gameplay will continue to be disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}