{
  "positive": [
    {
      "review": "There's two sides to this game: Non-Realistic Mode and Realistic Mode\n\nNon-Realistic Mode scratches the itch for those of you who frothed at the mouth when Cities Skylines: Industries rolled out. It's a really fun game of connecting industry buildings and optimizing logistics while also managing the needs of your citizens. The difficulty doesn't come from cheating the numbers or making your citizens more and more demanding of the same goods, but instead from the complexity of different systems interacting.\n\nRealistic mode is a punishing but rewarding tier of fun where you roleplay an actual city planner with a Comissar watching over you. Your citizens will die. Your first city will burn down because your immigrants missed the bus to the fire station. People will starve because your tractors got stuck in traffic 2 months ago and the food plant had a nightly blackout. 20 hours in, you will have built up perhaps your first housing district.",
      "voted_up": true,
      "votes_helpful": 64
    },
    {
      "review": "Communist Factorio but way more difficult. I don't understand how 95% of the game works but its still my favorite. Worth every penny",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This has got to be one of the best and most underrated city builders out there. It's $40 regularly, down to $20 on sale sometimes. It is easily worth both prices in my opinion. I am not a super city builder aficionado but I dabble a fair bit. Three main things make this game stand out from other city builders I've played or seen:\r\n\r\nThe unique premise/setting: it's not a medieval survival city builder where you have 20 residents and get attacked by raiders, it's not a futuristic utopia where food is 3D-printed and jobs are done by robots, and it's not some post-apocalyptic wasteland with a mix of the two. You're a struggling nation in the Soviet bloc in the height of the Cold War. This game isn't flashy, it isn't really cinematic, and it isn't a case of giving some people furniture and they magically elevate from artisan to entrepreneur or whatever and pay 2x the taxes, no, this game is gritty, it's realistic, and in this game, life is hard for your citizens, and it's up to you to help them. The people are the key, most essential resource, and they will work for the greater good of the glorious republic BUT...they are not mindless, nameless sheep and you have to provide for their needs. Foreign attack or invasion isn't a concern because you're under the protection of the Soviet Union, but global events like epidemics and trade fluctuations happen, and can significantly hurt or help you. \r\n\r\nThe level of detail: a building with 100 occupants is not a building of 100 workers, it is a building of 100 individuals with different needs, different wants, different routines, different traits, and different thoughts. Unhappy citizens will work slower, and the most unhappy citizens will defect entirely.  Every citizen needs food, which is distributed at the store (needs workers), where it is brought from the factory, after it's been made from crops, which are grown on a farm, which needs the right equipment. Clothing has a similar path as food. Citizens need exercise, for which they prefer sporting facilities, which have to be staffed, but many sporting facilities are outdoor and not useable in the winter/cold weather. Citizens need alcohol, or so they say...they're actually just addicted, and if you give it to them it has to be made and distributed similar to food (with pubs instead of stores). If you don't want to give it to them they will be slightly more unhappy, but healthier ultimately, and they will eventually be free from their alcohol addiction. Citizens need entertainment, in the form of theaters/radio/television. There is a full propaganda system - all citizens have different loyalties to the cause, depending on their individual traits and their prior life experiences (someone who regularly has unmet needs will be less loyal), but the same radio/television can be used as propaganda. There is a full crime system, all citizens have different levels of criminality, the higher criminality the more likely to commit a crime (and more severe). These criminals have to be arrested, tried in court, sentenced depending on the degree of crime, and then put in prison where you dictate how long they will be there and what their rehabilitation program will generally look like. Children of criminals who are imprisoned need to go to an orphanage, otherwise they will grow up in a broken home and they too, will likely become criminals. Citizens need to be educated which affects their usefulness (uneducated workers can't even work, workers with basic education can do some basic jobs, and university level workers can do anything). Workers with young children need kindergartens (daycares) or else they will not be able to work since they need to dedicate their time to childcare instead. Education ties to propaganda, as low loyalty teachers will influence their students accordingly, and same with high loyalty teachers. There is a full day/night weather system, wind affects your wind turbines and their power gen, nighttime (and rain/snow depending on cloud cover) affects your solar plants, snow covers your roads which slows down vehicles until the roads are plowed. There is a full waste system, full building construction system, full water supply system, full power (building power/vehicle fuel) system, full heating system, full traffic system, full tourism system, and more. \r\n\r\nThe ability to almost completely customize difficulty: last section, I went over most (probably forgot some) of the detailed and complete systems in the game. It is a lot to manage, and unlike real life where a country would no doubt have a minister/director/secretary of education, energy, justice, etc...it is all you in this game. So the best part is, if you find that the education system is too tedious and want the game to always be day, you can set that. If you want buildings to instantly be built (as opposed to needing to go through the whole construction process) you can enable that. If you want to skip the production chain of food (or anything), you can import it from the border, but at a cost. Really anything can be customized to suit individual playstyles except for basic citizen needs (but even that, you can change how drastically they respond to unmet needs). I, for example, have found the crime system to be a little buggy/confusing and I find needing to provide fuel to every vehicle to be extremely tedious and annoying, so I play with those off now. \r\n\r\nAs far as I know, development has largely ended on this game, so don't expect a bunch of major updates in the future, but what is there now is excellent.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "An very detailed game if all the settings are turned on, it basically is a full on simulator at that point. There's some headaches in the learning process, I would say it's a harder game to pickup, lots of things are a bit unintuitive and I also miss a good tooltip system.\r\n\r\nCompared to other city builders my favourite thing is that you will face very real decisions due to constraints that other games don't offer. Be it financial, time or space constraints. While in other games it's virtually free to fix mistakes or do upgrades, here you might have to complete a full demolish, provide temporary means for your citizens, wait for the construction time and all you wanted was a new substation but you forgot to include a safety switch.\r\n\r\nRoad upgrades? Can be a nightmare, just like in real life.\r\n\r\nOne thing I will suggest for new players (or anyone, really) is that don't be hard on yourself and try to be the most efficient/perfect in planning. Just look outside your window, I guarantee your city is full of messes. It's okay to have dingy cities, falling apart infrasturcture and being on the brink of financial ruin. It's all more realistic that way.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I've been playing Factorio, Satisfactory, and Civilization on rotation for a few years now, never expecting to find any other games that might scratch the addictive itch that they can. After some attempts at Transport Fever, Anno, Cities Skylines, and other similar games, I experienced some glimmers of it but not in the way I truly hoped. \n\nFor the first time in years I found a new source of that creative and addicting outlet while playing Workers and Resources. It merges the addicting \"just-one-more-turn\" style gameplay loop with the problem solving/planning fun of factory games and the creative rewards of a city builder to create a perfect combination of these other titles' offerings. \n\nThe game's systems are deeply complex but fairly intuitive to piece together and scale once you understand their core mechanics. The setting and theme creates a perfect backdrop for the gameplay, making you fall in love with the city and world you're building from scratch. Nothing brings me quite as much joy as seeing my rail distribution office bring supplies from factory storage to a construction office, or seeing open hull trucks haul the pavers and excavators to the roads I just placed for construction. I spend a lot of time in this game just watching my vehicles, trains, and people move around, watching the city live and breathe. I'll just sit and watch my train bring steel to the border, for no reason other than the appreciate the effort of planning, management, construction, and implementation that went into it. The construction aspect alone is one of the most rewarding mechanics I've experienced in gaming, and I encourage anyone to play this game without building anything with rubles. Without construction, a lot of the systems that make this game so enjoyable kind of fall apart and it kind of descends into \"Cities Skylines, but you place everything individually\". \n\nThe only big issues with this game are really around the learning curve, and a couple of the mechanics being a bit janky. With the former, I felt that the tutorials were split between \"place this here, then do this thing, congrats you did it\" and \"here's a goal, now figure it out\", but there wasn't a good sweet spot in between that helped me truly \"get\" W&R. It took me a few watches of YouTube let's plays and a few hours of upfront investment for things to click. I've found all my favorite games in the past took that similar upfront investment and so I was naturally willing to make it, but I do not blame anyone else for being put off by the sheer complexity. \n\nWith the latter, while so many systems and mechanics work amazingly, there are some weirdly stringent rules you run into with very little context on why they're limiting you. Roads needing to clip into specific nodes or you can't build them at all, conveyors never connecting to anything because of undefined limitations, boats that just drive into the earth and get stuck, oh and the construction trains oh my GOD the construction trains. They ruin your ENTIRE logistics network, and require so much micromanagement. Even after 80 hours and a solid grasp on train signals from similar games, I still am yet to figure out how to build even a single 100m length of track without creating a cascading nightmare of stuck trains. I just find myself having to google issues, and discovering rules and limitations that the game doesn't explicitly communicate. \n\nWith that being said I really really love W&R and am so impressed that such a small dev team made such a intricate and complex game that works as well as it does, especially on their own proprietary engine. I'm so excited to have found that same addicting creative outlet with I did with these other games, and encourage anyone who fans of those other titles to give W&R a try. It can seem intimidating at first but it's so, SO worth it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "has this game for years now and on and off been playing its a very long lasting game which is good and for a city builder type game is one of the most advanced you will get",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Love this game even though it sometimes frustrates me a lot. Wouldn't recommend this game to people that are impatient or want to spend time into learning a game by trial and error.  I haven't seen anything like realistic mode before, which in my opinion makes this game so special. Building a nation starting with nothing, just some dirt roads to lay down and some dirt parking spaces from which construction can be handled feels really satisfying, if... I manage to pull it off.\r\n\r\nCan't help but point out some of the negatives, this game shows a great potential of what a city... better said nation builder can look like, that I feel like some things definitely need improvement (though given the old engine, that would probably for a next iteration of this game).\r\n-I've seen way better road traffic in other games, you got two lane roads but it feels like they function as 2 single lane roads next to each other. Apart from early near the customs house, traffic jams are rarely a problem to me, so it is only a small frustration (haven't played with a city with personal cars yet though). Can't thank the creator enough for the new large customs house, major relieve to me, I still don't like that some buildings can have 1 vehicle arrive/leave at the same time.\r\n-Construction Offices kinda automatic select what to build or reconstruct, but they just take so many tasks automatically. So when a critical factory decides to replace machines, it might not get all the necessairy CO's assigned. Sure, you can set them by hand, but:\r\n-Some more customizable warnings would be great. You can select to be informed when a factory stops working, but not because of what reason. So I get annoyed by messages that my waste treatment has no workers all the time, turn the messages of, then don't notice that production stopped because machine replacement is taking place... You can also set stores only to send message when they are empty, way too late if you need to arrange a quick shipment of food to get in (would be great to get a message if the water tower is empty too btw). Still many more messages that come too often, too little or too late, but that's in the end also just quality of life for the players.\r\n\r\nThat overall makes me often still micromanaging stuff, while it feels intended to be automated. That said, most annoying things are on features I miss entirely in any other game.\r\n\r\nWhat I really love is how the game combines a city planner and a production chain manager. The communist setting might be a bit of a scarecrow to some, but I guess it also adds some \"realism\", seeing the nation as a giant company/factory where you have to treat your people well as well, but you still control them.\r\nThe game can be really punishing, which is kinda what I like. Again it can be daunting especially to new players, but, very important tip: don't go straight to realistic mode at it hardest. And once you do, expect to fail the first few times, because the game thinks about almost everything, which feels like a unique selling point. Once I get my first city/industries/belts running in realistic mode, I felt great joy in it as it felt as a great accomplishment.\r\n\r\nI'm a bit mixed about the dlc's. Don't have biomes, feels like that is more about the looks, which I don't care a lot about (still enjoy the scenery, and onboards and how beautiful it looks when everything comes together, but not that important to me). But biomes either remove snow from the map or make it last even longer. Snow is a bit love/hate for me, one season of snow a year is enough for me. I love the aspect of winter, snow plowing and taking care of heat, but it hurts my eyes (so bright) and it becomes really hard to plan and follow construction.\r\nI have the maps DLC, but in the end it is just a bunch of maps (and some extra buildings I believe) while the game has a great random map generator. Also I love the idea of prepopulated maps for the setting, but after a playthrough with dozens of trips at 2% of truck/bus capacity to fix all these small homes with some low quality houses (and more small reasons), I decided to stay away from that (or you can demolish buildings, but then what is the point of a prepopulated map?).\r\nNow Early Start brings some really nice features, but overall makes the game even slower. Right now I play with a mod that slows down time, else I've passed the early start era before I really noticed anything of it. Nice to see the dev listening to the community, but I sometimes feel like the game wasn't made/balanced for it, at least in realistic mode. Overall the game on itself feels really great and the DLC's are a little extra to support the dev and/or get a little extra once you got some more hours in the game.\r\n\r\nOverall I think it's a great game that pushes the limits of city/nation builders, but also has it limitations that can be frustrating, but still beats anything I've seen out there.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best city builder, based on my own personal bias.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love the details and complexity Workers & Resources: Soviet Republic allows. It's a very deep city builder with settings to change how complex you want your gameplay to be. But I enjoy the complexity. Because of the complexity, if your plans work out with the expected outcome, the game becomes ever so satisfying.\n\nYou make everything. Every segment of road, the cars on it, the fuel they drive, the food people get in the supermarket, the supermarket you built with the concrete, steel and other materials you produced in your factories that you built, everything comes from your hand. If you enjoy city builders and immense control and depth over the world you build, this one is for you.\n\nGraphics are alright, but not the reason you play W&R:SR. They are detailed, you can follow around every car and bus and they don't randomly disappear, they actually park or fuel up as cars and buses do, see construction animations progress in a very satisfying manner, and so many more things you can just endlessly enjoy watching. And that's what counts for me.\n\nHonestly, Workers & Resources: Soviet Republic is one of the best games I have ever played. Be careful though, on the \"just 5 more minutes\"-scale for me this is a rating of the Factorio of Citybuilders.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It'll consume your life, then you'll learn how train signalling works, and it'll consume even more. Absolutely one of the greatest and most challenging city builder/logistic sim/economic management games ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Slovak and building games on steam. I drowned more than 400 hours in it. I don´t recommend playing it when you have dead lines because you will get in trouble because of this game. Developers manage to add time travel feature to this game. You launched it at 18:00, play for 30 minutes and it´s already 22:00. \n\nBig thumb up. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a very complex game about managing all sorts of ressources in a city building game which is extremely satisfying to play. anyone who likes city builders would most likely like this and highly configurable including huge mod support to make this game truly feel like yours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Has got to be one of my #1 all time city builder games. There are so many systems that can be turned on and off to fit your play style and how in depth into realistic society you want to get. The Dev team also does their best to add and adjust things based on community feedback and ideas and keep us up to date on progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have over 1000hours in this game. Still managed to build only one working city in realism mode. It's called the \"Dark-souls of city builders\" for a reason...\r\n\r\n10/10 would recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cities Skylines but on steroids where you can build a successful country where you can achieve true socialism, but this time it works (after freezing and starving to death 75% of population because this one heat pipe was misplaced by 0.01 mm so it didn't connected to heat exchanger.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, only downside: its addictive af as soon as you know how to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome if you're into these types of games. Don't even try to play it without watching YouTube tutorials fiest. And just remember that Ctrl-Num Pad 2 makes the process of initially building your city much less painful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinly the most in-depth, stylized, and well made management/city builder out there. Countless hours in Cities Skylines, SimCity, Anno 1800 has brought me to this. One of few 10/10 games out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awsome game you need to have commo sense and a general understanding of infastructure and economics to play efficaintly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best city builder I ever play . Realistic mode is fantastic . Perfect game for long winter evenings .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My mission to create 100% self-sustained republic is still in \"work in progress\". You need to play in this game with a calculator, notebook and pen. And surprisingly, it is very interesting to do.\n\n9 production plans out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good very addicting, My nan played it once and wonts stop talking about how good comunism is and her 'five year plan'",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly in-depth game. The fact that the airplane runways actually change their numbers depending on the direction and whether there are other runways is an insane detail that alone deserves a positive review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tycoon game at his best: everything to do from scratch in a unfavorable cold war context. Nothing to complain except maybe some possible user interface improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not about fast gameplay and fast development. You go too fast and you won't have enough rubles, dollars or resources to complete what you want. Build too much buildings at the same time and your construction offices will not have enough vehicules to cope with them.\nGraphics style is nice, game is not too demanding. Gameplay is also nice and chill in most cases (just don't try to go fast ;-) ).\n\nNow about negative points.\nSometimes construction office ai not respect priorities. Would be nice to have startgame targeted buildings to use in relistic mode. For some of industries there is just not enough small buildings to build industry up in beginning.\n\nOverall I would recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent city builder and also great for people who love logistics games.  It has complex production chains needing you to not only transport and refine or use resources along the way, but account for the, as the game suggests, workers and resources to keep those chains moving.  Workers need to be transported to work, and done so somewhat efficiently - if they spend too long travelling they'll work a shorter shift.  Resources need to be moved too of course.  You need to maintain and have the resources for that transportation.  Even the simplest answer of trucks and busses still means bulldozers and dumptrucks to lay even just gravel roads, then fuel for those vehicles, and resources at repair depots to maintain them over their lifespan.  These fuel and maintenance requirements aren't simple running costs that deduct money every so often - they have to go get gas or get to a maintenance yard.  This means even these logistics needs thought put into their placement.\n\nYour workers also have to be managed and satisfied.  You cannot simply set some high wage at a job to produce magical satisfaction.  In fact, money is only used to trade with other countries.  A satisfied worker is a happy and productive worker.  Of course they need a place to live, which already comes with setting up a water, sewer, and power grid.  They need to be healthy, meaning clinics and hospitals but also trash service and residences built far enough away from heavy industry's pollution and smog.  Of course they need food, which means a store for them to collect it from and/or restaurants to eat at.  They demand access to arts, culture, and athletics, so you need gyms, football fields, museums, cinemas, etc.  All of these need workers too.  To get workers you can use money to hire temporary ones or pay costs to import workers or specialists, but primarily you need people happy and healthy enough to have and raise children.  If you don't provide early childcare facilities at least one parent will stay home to raise the child.  To do any job workers require a basic education, meaning schools.  If you want your society to thrive at all you will also need a university to train specialists - teachers, doctors, judges, nuclear technicians, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic city builder from the communist era. It brought back a ton of memories from my childhood. Planning residential complexes, collective farms, factories, plants, logistics for selling manufactured goods, selecting and maintaining a fleet of vehicles, and much more will completely immerse you in this wonderful game. I recommend it to anyone who enjoys this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best city builder game, comrade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From the very beginning — bugs and all — it’s obvious this game is a true labour of love, and a testament to how developers should approach their craft.\n\nWhat sets it apart from titles like Cities: Skylines is simple: you don’t just design infrastructure… you have to build it. Roads, water networks, factories, rail — every project requires planning, manpower, materials, and actual construction. That single design philosophy transforms the entire experience. Suddenly, infrastructure isn’t just a cosmetic layer. It’s functional, logistical, and genuinely challenging.\n\nAnd yes, sometimes you’ll upgrade a pipe network and half your town will panic or even die off — but that’s the beauty of it. The systems are deep, interconnected, and unforgiving in the best way. You feel the consequences of your decisions, and the satisfaction when everything finally works is unmatched.\n\nThe economic simulation, the political flavour, the detailed population behaviour — it all comes together into something special. It’s not just a city builder; it’s an industrial, economic, and societal simulator with an incredible amount of depth.\n\nIf you enjoy complex strategy, meaningful logistics, and games that reward thoughtful planning, Workers & Resources is genuinely in a league of its own.\n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very detailed and addictive once you figure out the gameplay. Has a bit of a learning curve (specifically in the older versions) but things start come naturally after a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly confusing game but extremely fun when you understand how it works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The deepest city builder I have ever played. Absolutely loving it and as a fellow post socialist country resident, it feels like home. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing sim game—clearly a labor of love. It moves at a slow pace, but that’s what makes it so relaxing. I loved just sitting back and watching my little community grow. Honestly, I had a ton of fun with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say, best city builder that's actually a nation builder I have ever played. The level of detail and scale is incredible. 334 hours in and I still haven't grasped every system or even played a game longer than 5ish in game years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love building my own Communism city. Peak game, I got sucked into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Workers & Resources: Soviet Republic is an incredibly rewarding city builder where the construction and supply chain systems make every building constructed and shop restocked feel earned. The Early Start DLC adds even more depth and immersion, allowing you to transition from small settlement to thriving republic. I also like that the game supports every major form of transportation; air, rail, highway, and water.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably my choice for best game.  I don't like the Cities Skylines games because they're just much to simple for my tastes, but this is something along the lines of city builder meets Transport Fever 2.  I've never tried it with the realism stuff off but you can turn off vehicle refueling, building and/or vehicle maintenance, heating, etc., if you want an easier time.  With all of the realism stuff turned on, this game is just a masterpiece.  There's a lot to get used to and not much hand holding, but when things click and you're putting up buildings with your own boards, steel, concrete, etc., and feeding and clothing your pop from your own farms, it actually feels like an accomplishment.  That's super rare in modern videogames, and I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game a little bit but haven't even tried everything yet, like producing my own ships or aircrafts.\n\nThis is the best city builder out there- as long as you play on realistic settings which makes this game so different from the rest of the genre.\nIn realistic mode you have to manage everything, and I do mean everything. \nAs the setting is soviet era your little republic won't be getting any money from your citizens but you will need them to produce almost everything, and you need to keep them content, loyal and most importantly, alive, and that can be an tall order.\nI've read some reviews pointing out there's a religious metric but no building to support it besides some pre-built maps (and ofc mods, this game has more than a lot of mods in general), this once again ties into the old ways of the soviet where the church got separated from the state, and just like alcohol in the game, if you can push through and cutting them off the supply having an immediately effect of unhappiness but once the addiction is gone people won't be unhappy that neither alcohol or religion is available.\nBack to when I mentioned you have to manage everything and thinking that's what makes this game so amazing, you have to plan ahead, a lot, mange both supply and waste when you set up your town or city, having sources of all sort of materials just to build your roads, houses, sewage pipes, powerlines- it all, gone are the standard of using a paint tool to drop down some roads and zones for people to come to your city and build, here you build it all, supply it all, handle the rubble/waste when you tear something down, fix it all when it breaks, save it all when pollution is killing your citizens- it's a tough challenge but one that feel really da** good when you succeed.\n\nSo if you're looking to play a city builder like you've never played before, you should dive into to this hidden gem on realistic setting, if you just play it on normal it looses its magic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, I really enjoy playing this game. This game really makes you to use your brain, Which I really enjoy. It required you to plan your production line, including producing, delivering and selling. However, I think this is the only issue on this game and the only one reason that I am disappointed is crashing. Along with your city growth, it happens more frequently. I can't count how many times I crash during my game time . It is fun, but only if you are not crashing. Btw It will make a automatic save when you are crashing , which make it not that serious but still not a good thing. Overall, if you are not a guy who care about crashing, you can buy it. It is fun. Oppositely, don't buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just deleted my first save because after 10 hours on realistic difficulty, I realized that I hadn't planned my infrastructure well enough in the first hour. As a result, everyone died because no one could get to the hospital quickly enough, and at the same moment, everything started burn since the fire department was stuck in traffic. I love the game <3 it’s exactly right for those who find Cities Skylines too easy and enjoy the brutalist architectural style of the Soviet Union (workshop is also realy cool)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if ur autistic for city builders and i mean ***AUTISTIC*** this is peak its basicly interlocking spreadsheets and logistics managment the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful. Might be the best game I have played. The level of detail is immaculate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planned economy demands great responsibility. Want to become great? Master this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game to practice capitalism in a soviet state and be a dirty revisionist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a blast. Designing production chains, managing your population, and balancing the budget is addicting, and the sheer variety of buildings, vehicles, and systems means you always have something new to work on. The developers packed an incredible amount of depth into every mechanic. After the tutorial, make sure to dive into the full campaign — it’s a well-crafted set of challenges that teaches you the game while keeping it fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that's called Soviet Republic, the fundamentals of capitalism is weirdly pretty crucial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy yourself with a game to explore your creativity, W&R is a good choice, deep yourself in an enviroment to manage a large city in diferent fields of development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. The game UI and graphics feel like a retro simulator / city builder with lots of nice heavy textures. \n\nThe detail in it's simulation and resource management is insane; I like to play the game in sandbox on realistic difficulty just so I can experience all the depth and technical detail put into it.\n\nStill trying to get a profitable republic on the hardest settings, and I wish I could speed up time a bit more for that!\n\nGreat game, clearly very passionate devs. Worth a go if you're up for a technical challenge and like the setting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive and deep game. Not really interesting in \"sandbox\" mode as other city builders, but \"realistic\" mode is cherry on top - resource and citizen management force to make progressive decisions that makes cities look and work lively. This creates beautiful realistic landscapes. Enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very good, But I had bought it to get a stronger understanding of urban planning. The low detail on maps of real life areas (Britain, American East Coast, France) makes planning intricate transit systems like I had hoped not possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love trains, i hope this game is stable and bug free!\n\n(this review has been posted after my 50th crash after removing a signal)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best city builider/logisitic sims/resource management games I've ever played.\r\n\r\nI've played a lot of Cities:Skylines, OpenTTD, Railroad Tycoon and Factorio, and they've all given me hundreds of hours of entertainment, but this sits somewhere between all of them and scratches an itch I didn't previously know was there.\r\n\r\nThe cities don't look as pretty as in Cities:Skylines, but its Soviet, gritty aesthetic just works and means your computer isn't heating the room to 80 degrees to make it look good.\r\n\r\nThe trains don't run with the efficiency you can achieve in OpenTTD, but it doesn't matter, because after 8 hours of tweaking and correcting mistakes, you've finally hooked up the coal mines to the steel mill, with workers brought in and a functioning waste removal service on a somewhat clogged up rail line; and it's beautiful.\r\n\r\nYou won't have the OCD compliant production chains of Factorio; you WILL have janky cargo connections where they fit, you will have sheer drops between buildings from the terraforming, you will do just about anything to avoid having to keep a new building inside of an existing power connection's range, you will have paths that weave in and out of the buildings clustered around a bus station to ensure they're reachable.\r\n\r\nThis game doesn't necessarily do any of these individual things as well as any other single game, but it does it ALL simultaneously and combines it into the most challenging and satisfying econ-based game ever.\r\n\r\nDO make sure you start out on easy. Give yourself loads of cash, replace your population as they inevitably die off, and slowly add elements (e.g. water, pollution, energy - be wary of education, waste and police as they can get very challenging to manage when starting out)\r\n\r\nThe learning curve is challenging (imagine a 45 degree line, but just going on indefinitely - it's not the steepest, but it really does just keep going!) and does require some persistence to really get the most out of the game. \r\n\r\nFantastic game, which I know I'll come back to again and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a magical level of mechanics, for a born in USSR a way to remember dull but well engeneered cities and a possibility to rebuild a city of childhood in a great detail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game truly has an amazingly detailed simulation and the possibilities are endless. If you enjoy city builders and want to dive deep into the mechanics of this game, it is highly rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill, love it, except when you end up with 9483948 infrastructure bullshit and do the job of 100 architect just so your citizens don't die, also sometimes too clean or bland for a soviet city, the buildings and all are too clean, I'm from eastern europe so...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still getting to grips with this one, but I love the tone and the level of detail!\nI'd highly recommend if you love detailed management / city builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Эта игра очень простая и сделана по типу Ситис скайлайн 2 только меньше багов и в советском вайбе",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My God, it is SO good. Games like these really scratch the micromanagement itch and just like with your allergic reactions you just can't stop scratchingggg...\n\nThe only wish that I have remaining is having citizens be able to make layovers, so I don't have to directly transport them to work. Otherwise, [i]\"Drank? Voor [b]MIJN[/b] burgers? Doe normaal!\"[/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very nice for build a city. I recommend this game for all gamers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good lord, the depth this game has is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the very best city builder I've played. Complex without being too complex. The setting is cool and brings back memories of visiting East Berlin in the 80s.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is amazing game something i can enjoy ore very long time great work!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent city builder which unlike a lot of recent entries doesn't treat city building simply as creating an art piece.\r\n\r\nThere is a lot to the management side to this involving some relatively complex production chains and the logistics of it all. From moving intermediates between factories to getting the goods to export/citizens to even getting constuction materials to building sites.\r\n\r\nMy only frustrations are that placing signals on tunnels and bridges can be very annoying and I find the road tools and lane management (both AI and road creation) to be somewhat limited. You have one ways which you can use together to make a 4 lane highway and then theres different tiers of road with a single lane but that's it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game is excellent, one of a kind, however the developers are anti-communist shills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the top city builder/economic simulation of the last years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A real diamond in the rough of city building and industry games. Workers and Resources is a mix of both genres where your citizens are a resource to power your factories. Instead of zoning districts, every building is placed by you and built by your construction companies. From there, citizens require transportation to their workplaces or places of interest also arranged by you. If any this sounds interesting, this game can fill a niche not many games can. \r\nThe difficulty options are incredibly customizable with almost any part of the simulation being able to be toggled on or off. The community does a great job adding buildings, vehicles, and maps to the already large pool of content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like extreme complexity, high realism, deep game mechanics and steep learning curve - this is for you.\nIf you want it simple and intuitive - no, this is not for you.\n\nHowever, you can have it simple too. The game has wide range of complexity options. So you an simplify most of the mechanics from very simple to extremely realistic where you need to care about literelly everything. The realism mode is where the game actually really shines and which is most challenging and most fun.\n\nI would describe it as a mix between city builder and industrial automation. You must take care of a lot of things, but its not so much about micromanagement but all about automating things. Factorio/Statisfactory on steroids in soviet era setting. Graphics are okisch, not an eye candy, but good enough for the purpose. After all, its not about graphics at all.\n\nBe careful, it has high addiction potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "everything about this game makes me want to blow my head off 10/10 would play again and get mad again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Comrade Stalin would send me straight to the gulag if he saw my city building crimes. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Citizens love union or go to uzbekistan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Average First Secretary experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deeper than you've probably got the length for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic mode is just on another level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Visuals\r\nGood Complexity\r\nA lot of fun\r\nGood Updates\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game hours of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very good with a lot of depth!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one could say its OUR game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super planned economy sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "time travel has been invented (but only forwards)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best City Builder of all time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The dark souls of city builders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, really enjoyed it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best city builder ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complex but fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game seems enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Самый детальный градострой",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Minimum specs should include Autism.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good gamee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice city tycoon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 C:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love how simple it is just to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "güzelmiş",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For our comrade chairman, we WILL complete the five-year plan in four!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is my autism diognosis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where did the time go?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Bravo!",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "...Comrades, forgive me but while I genuinely enjoy this game a lot, it just caused me so much frustration I simply feel the need to leave a negative review...\n\nPositives: \n- Graphics are fantastic\n- Sound design feels really good\n- Management ideas are amazing along with the production lines automation systems and import-export mechanics.\n- With the steam workshop it has support for assets of all sorts, giving the player even more freedom of choice\n- The general idea of the game is fantastic, however my problem is with the execution\n\nWhich brings me to the negatives.... where do I even begin.\n- Building and road placement: it's as precise as trying to do heart surgery with a shovel. it just doesn't work and there is no grid or anything for precise building placement, only for rotation while holding ctrl. Often the game will have you make a workaround to build things the way you want... let me explain: Let's say I want to build a house next to a road that also has a power line running alongside it into an already closed grid. It will not let me place the building. However if I first delete the power line, then build the house, and then put the power lines back to where they were, then it lets me... god please help my nerves, the amount of times this has happened... and there is more examples to this but the review is already too long as is.\nThe roads can't do a 90 degree bend from the end of a node, only away from the end. You cannot have a node have both a pedestrian and a road crossing. On top of all of this instead of having road types and being able to have them have bridge/elevated/tunnel versions, you need to select a different menu point for tunnel, bridge and elevated roads instead of having a simple sub-menu as you are building the roads. Overall feels very restrictive with what you can build and is very cumbersome. Also all of the building's technical size is larger than they appear, and it won't allow you to place buildings anywhere near eachother, or next to a road. This completely killed all of my attempts at detailing or optimalising layouts. (not to mention you cannot move buildings after placing them and if you want to build on uneven ground you have to first manually flatten the ground and only then you can place the building). \n- The UI: it's just not intuitive at all, even after 10 hours of gameplay I have to keep looking for certain buildings for a solid minute before finding which menu point they hid it under. Here I would have to add that you cannot make a bridge or elevated road/railway have intersections and therefore it can only have one connection on each end, which is still fine with car and pedestrian roads, but for trains you just have to build 2 separate bridges or make a loop-connection for the rails on each end if you want the trains to be able to go both ways. placing even pedestrian bridges/tunnels is also really cumbersome, because it only allows a certain bend, and anything beyond that is forbidden. placing pipes and other underground connections are also very restrictive because it needs \"a proper slope\". You just always need to find some sort of workaround to actually have the pipes connect unless you are building it on relatively flat ground.\n- Don't even know where to list this: while there is a religion mechanic in the game, there are no religious buildings in the base game to fulfil the religious needs of your people, only with mods or built in the pre-built towns around the map.\n- logistics: by default I think the logistics are in order and I love managing the connections between factories and warehouses, managing imports and exports. But the worst offense in my eyes is that while you can tell your trucks to load certain percentages of the weight they can carry of a certain product, if the destination building gets full, and it cannot unload all of that product, the whole truck is just going to fill up with one product in the end, making it virtually impossible to manage having one truck delivering several products unless it's for exports. If I set it to 50% it shouldn't allow the truck to pick up more than 50% of its maximum load at all. So because of this, manually setting up trucks is barely an option if it's for more than one type of product. Instead you have to get a separate truck for every product, and then you can have them deliver that single product to several destinations. You can then automate it by building distribution offices that will deliver missing products to all buildings automatically once set up correctly but at first you have to complete a research for that. Also I don't know if this is a bug or not, but when setting up the truck to take something like nuclear fuel or nuclear waste, there is a general menu for that in the logistics menu, but if you specify what to pick up, it just won't. somehow specifying the exact thing just won't have the truck pick up those items unless you just select the whole menu point. you can even go into the menu and select every single resource/vehicle under it, but it still won't pick up anything until you untick every single one of them.\n- Utilities: again, just feels incredibly cumbersome. Having to build a source, then the whole network consists of 2-3 pieces... which would be fine, but the range feels small, and sometimes you need to build several of them because just one of them would get too many connections or not have enough capacity to provide for all the buildings around it. In the end especially with all the power lines necessary (because you need to connect every single one of them to a power substation manually through power lines) it feels like an absolute mess and increasingly more difficult to make the build actually look nice.\n- Worker movement and worker counts: buses and trains are very nice, they carry passengers here and there, however just because you have a train connection to a semi-distant building still doesn't mean people are going to work there. I had buildings that were just standing empty despite having public transport connections to them, and they only got workers once I built a house within 400m's of the building. and I must add that after 10 hours I still don't understand the benefits of having public transport and cars available to people if it doesn't noticeably extend the range in which people can move around.\n- Weak introduction and tutorials: There is a campaign and some tutorials that are supposed to introduce you to the game and try to ease you into it, however there are still a lot of things it doesn't explain to you very well. And while often it tells you what to do, it doesn't always tell you how to do it. I think the below 10% achievement for completing the first campaign says it all. People like to be eased into the game they chose to play and it should be helping people to understand the the mechanics, because there will be people who might play this as their first game of this genre and will completely abandon it after a few hours of trying.\n\nTL;DR: it has a very enjoyable gameplay with the management of resources and the logistics and despite the negative review I will keep playing it for a while because I must say, despite all the negatives it's still a very fun game. But on the other hand it feels very unpolished, and does very little effort to help new players get into it, which has brought me a lot of frustration even after playing other strategy/management/city builder games for thousands of hours and having plenty of experience with similar games. Generally to me it feels like the difficulty of the game comes from a lot of things being really cumbersome and slow rather than being actually difficult.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I love the game,I do. Its hard, its a bit janky in some spots though, but its a fun game with a learning curve into it. The more you play, the more you learn and the more you WANT to play.\nSo I would recommend it...if it wasn't for the use of AI art in the game.\nYes the art is minimal, a few pieces here and there. But its not disclosed in the steam page, its not said anywhere, but its clearly AI art. And till that changes, my review stays negative. \nDon't support AI laziness and cheapness. You can do so much better than that, even for something so minimal and trivial really. It wouldn't cost that much to commission artists at all, instead the developers resorted to a machine that has stolen countless pieces of art from many artists without compensation that destroys the environment, \nIt is a shame that the developers decided to use this, and for something so trivial too. You didnt HAVE to include them at ALL really. But you did it anyways, so as such, I do not recommend purchasing this game till the developers understand that AI slop is a bad business decision, even if my recommendation goes so little so far.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game has very nice concept of building your socialist hellhole, designs of buildings are spot on. But unfortunately, the game has terrible UI, I had a hard time to get around everything, to figure out how everything works... The tutorial will not help you at all with the worst thing about this game and that is logistics. Took me a while to figure out how to build and get to function simple bus stations. Once you want to move your resources from one building to another, prepare for logistical nightmare and in the end I wasnt as much building as buying hundreds of trucks and planning their routes. It would be much better with little bit of automatization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As you can see from my hours, I have played this game a lot and enjoyed it too. However, I bought the game in early access. Things have changed from early access for the worst. The game has employed a bunch of AI art which I obviously wasn't going to be aware of when I bought the game 4 years ago in 2021. I cannot in good conscience support a game that uses genAI for the reasons that it is built off of the stolen work of artists without consent and also uses an EXORBITANT amount of electricity and water, depriving people of the resources they need which is ironically very capitalist for a game about communism. \n\nThe game sells for $40. The newest DLC sells for $20. 3Division can *easily* afford a few hundred dollars to pay to get all the AI art replaced. And there were zero AI images in early access before the game became as popular as it is now, so it's not exactly a huge feat that the developer is incapable of. \n\nI will not be playing the game again, and this review is for those who also don't support AI because there is zero disclaimer on the store page.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "complex game, but extra difficult because of bad ui.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eats up your CPU and GPU even at medium settings\r\nDevs kinda don't care anymore, recycle cut content and push workshop mods as DLC\r\nBuildings can't be precisely rotated\r\nTrains aparently do whatever they want\r\nUnrealistic way of building railways\r\nEditing maps can randomly cause the entire population to be erased\r\nTerraforming is very weird because the way the map is set up (grid like system with predetermined points for height) (this also causes roads and railways to look like rollercoasters)\r\nBase game without mod is kinda mid\r\n\r\nIt was fun for a while, that was when i took the issues stated above for what they were and tried to make the best of it. Running a big city with 5 fps max (decent pc, but not high end either, poor resource usage by game) or having your map being emptied of its citizens because an oopsie occured while saving nah bro that ain't it. I've had it. But the devs do care so much about changing the red cross symbol to green though lol.\r\n\r\nThe idea behind this game is great, still needs a lot of work that i'm afraid will not happen anytime soon. Deinstalling for now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really has only one thing going for it and that is the realism mode. Without that it is a very sub par city builder, but having to manage the entire construction process is pretty cool, until it isn't. You know that guy who only buys cars without power steering, power windows, AM only radio, yeah this game is that guy. Almost every phase of the game is almost designed to be annoying. The terrain tools are so bad it is like the devs went through every successful terrain tool in every game to make sure they did not use any of those successful functions. Water and sewer is so bad you almost get cold sweats when you need to do sewer or water works. You need a spreadsheet on the side to manage worker numbers and power, oh and the numbers will never make sense. The fanboys will avidly attack you with foam and spittle on their mouths if you even think about not saying how perfect this game is. I would just go to the dentist and get a root canal over buying this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is very primitive, plays like a game that came out in 2010. Nothing is clear on how things work and what you are supposed to do.  Looking things up on the web will be required to learn the game but this is convoluted because of the name of the game messes up the search results. I have bus stations set up, and purchased buses, but no idea how to get them running, Same thing for trains and so many other aspects of the game. Citizens refuse to go to one half of my city even though its all connected via roads, bus stops, and parking lots. Unemployment high, but commercial establishments i build remain unfilled and without workers. Maybe the game is a joke to teach us about the perils of communism? Going to try and keep learning the game and will update my review if i figure it out. Maybe worth it to get on sale for $20 but definitely not $40",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Отдавая деньги с DLC \"Помощь Урне\" на нужды Киевского режима , разработчики спонсируют террористический режим . Игра крутая , но разрабы ебанные русофобы. (И самый прикол что у них в игре есть символика за которую в этой самой Урне сроки дают)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game as someone who's played city builders since SC2, but the controls are god awful, and the UI is ugly, tiny and very unintuitive. Normally I'm willing to push through and I'm used to convoluted UI ([i] cough [/i] Stellaris), but this was so bad it's a complete no go for me, Then I built a big cinema and the game is trying to tell me people are not willing to walk three hundred meters to it. My god, I [i]drive[/i] for an hour to visit a cinema complex if I want to. Just a hint of the level of micromanagement that I knew is in the game, but just as my tiny town of lazy a***s I'm not willing to fight absolute bs on every step I take. instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a nice hardcore city builder here, but I can't tell if the UI is part of the joke or just one of the worst 'modern' interfaces I've seen.  Add to that a lack of adequate font scaling in 4K, and this is just a plain terrible experience, much like what I imagine living in a Soviet republic was.  Mission accomplished?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pathing seems to be broken. And this was during the tutorial for transporting crops from the farms to the factories. Pretty basic but essential stuff, so yea no donʻt waste your money on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wanna build a lifeless city with no soul, this is your game. There are \"people\" who walk along the road yes but they get to a playground, poof. Get to the shopping mall? Poof. Building connection are TERRIBLE they either auto connect or you will scream at your monitor why wont you connect! For some reason buildings don't have a fine tune rotate so if you want a nice town you better build your buildings first and then your roads.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game will eat your life i failed 3 exams because of this fuck as game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant run this on an i9 and 4070gpu wth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Socialism doesn't even work in game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "crashes constantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't like this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...Comrades, forgive me but while I genuinely enjoy this game a lot, it just caused me so much frustration I simply feel the need to leave a negative review...\n\nPositives: \n- Graphics are fantastic\n- Sound design feels really good\n- Management ideas are amazing along with the production lines automation systems and import-export mechanics.\n- With the steam workshop it has support for assets of all sorts, giving the player even more freedom of choice\n- The general idea of the game is fantastic, however my problem is with the execution\n\nWhich brings me to the negatives.... where do I even begin.\n- Building and road placement: it's as precise as trying to do heart surgery with a shovel. it just doesn't work and there is no grid or anything for precise building placement, only for rotation while holding ctrl. Often the game will have you make a workaround to build things the way you want... let me explain: Let's say I want to build a house next to a road that also has a power line running alongside it into an already closed grid. It will not let me place the building. However if I first delete the power line, then build the house, and then put the power lines back to where they were, then it lets me... god please help my nerves, the amount of times this has happened... and there is more examples to this but the review is already too long as is.\nThe roads can't do a 90 degree bend from the end of a node, only away from the end. You cannot have a node have both a pedestrian and a road crossing. On top of all of this instead of having road types and being able to have them have bridge/elevated/tunnel versions, you need to select a different menu point for tunnel, bridge and elevated roads instead of having a simple sub-menu as you are building the roads. Overall feels very restrictive with what you can build and is very cumbersome. Also all of the building's technical size is larger than they appear, and it won't allow you to place buildings anywhere near eachother, or next to a road. This completely killed all of my attempts at detailing or optimalising layouts. (not to mention you cannot move buildings after placing them and if you want to build on uneven ground you have to first manually flatten the ground and only then you can place the building). \n- The UI: it's just not intuitive at all, even after 10 hours of gameplay I have to keep looking for certain buildings for a solid minute before finding which menu point they hid it under. Here I would have to add that you cannot make a bridge or elevated road/railway have intersections and therefore it can only have one connection on each end, which is still fine with car and pedestrian roads, but for trains you just have to build 2 separate bridges or make a loop-connection for the rails on each end if you want the trains to be able to go both ways. placing even pedestrian bridges/tunnels is also really cumbersome, because it only allows a certain bend, and anything beyond that is forbidden. placing pipes and other underground connections are also very restrictive because it needs \"a proper slope\". You just always need to find some sort of workaround to actually have the pipes connect unless you are building it on relatively flat ground.\n- Don't even know where to list this: while there is a religion mechanic in the game, there are no religious buildings in the base game to fulfil the religious needs of your people, only with mods or built in the pre-built towns around the map.\n- logistics: by default I think the logistics are in order and I love managing the connections between factories and warehouses, managing imports and exports. But the worst offense in my eyes is that while you can tell your trucks to load certain percentages of the weight they can carry of a certain product, if the destination building gets full, and it cannot unload all of that product, the whole truck is just going to fill up with one product in the end, making it virtually impossible to manage having one truck delivering several products unless it's for exports. If I set it to 50% it shouldn't allow the truck to pick up more than 50% of its maximum load at all. So because of this, manually setting up trucks is barely an option if it's for more than one type of product. Instead you have to get a separate truck for every product, and then you can have them deliver that single product to several destinations. You can then automate it by building distribution offices that will deliver missing products to all buildings automatically once set up correctly but at first you have to complete a research for that. Also I don't know if this is a bug or not, but when setting up the truck to take something like nuclear fuel or nuclear waste, there is a general menu for that in the logistics menu, but if you specify what to pick up, it just won't. somehow specifying the exact thing just won't have the truck pick up those items unless you just select the whole menu point. you can even go into the menu and select every single resource/vehicle under it, but it still won't pick up anything until you untick every single one of them.\n- Utilities: again, just feels incredibly cumbersome. Having to build a source, then the whole network consists of 2-3 pieces... which would be fine, but the range feels small, and sometimes you need to build several of them because just one of them would get too many connections or not have enough capacity to provide for all the buildings around it. In the end especially with all the power lines necessary (because you need to connect every single one of them to a power substation manually through power lines) it feels like an absolute mess and increasingly more difficult to make the build actually look nice.\n- Worker movement and worker counts: buses and trains are very nice, they carry passengers here and there, however just because you have a train connection to a semi-distant building still doesn't mean people are going to work there. I had buildings that were just standing empty despite having public transport connections to them, and they only got workers once I built a house within 400m's of the building. and I must add that after 10 hours I still don't understand the benefits of having public transport and cars available to people if it doesn't noticeably extend the range in which people can move around.\n- Weak introduction and tutorials: There is a campaign and some tutorials that are supposed to introduce you to the game and try to ease you into it, however there are still a lot of things it doesn't explain to you very well. And while often it tells you what to do, it doesn't always tell you how to do it. I think the below 10% achievement for completing the first campaign says it all. People like to be eased into the game they chose to play and it should be helping people to understand the the mechanics, because there will be people who might play this as their first game of this genre and will completely abandon it after a few hours of trying.\n\nTL;DR: it has a very enjoyable gameplay with the management of resources and the logistics and despite the negative review I will keep playing it for a while because I must say, despite all the negatives it's still a very fun game. But on the other hand it feels very unpolished, and does very little effort to help new players get into it, which has brought me a lot of frustration even after playing other strategy/management/city builder games for thousands of hours and having plenty of experience with similar games. Generally to me it feels like the difficulty of the game comes from a lot of things being really cumbersome and slow rather than being actually difficult.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I love the game,I do. Its hard, its a bit janky in some spots though, but its a fun game with a learning curve into it. The more you play, the more you learn and the more you WANT to play.\nSo I would recommend it...if it wasn't for the use of AI art in the game.\nYes the art is minimal, a few pieces here and there. But its not disclosed in the steam page, its not said anywhere, but its clearly AI art. And till that changes, my review stays negative. \nDon't support AI laziness and cheapness. You can do so much better than that, even for something so minimal and trivial really. It wouldn't cost that much to commission artists at all, instead the developers resorted to a machine that has stolen countless pieces of art from many artists without compensation that destroys the environment, \nIt is a shame that the developers decided to use this, and for something so trivial too. You didnt HAVE to include them at ALL really. But you did it anyways, so as such, I do not recommend purchasing this game till the developers understand that AI slop is a bad business decision, even if my recommendation goes so little so far.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game seems amazing. Its full of a TON of details...but it crashes at almost every loading screen. I haven't even tried modding this game, cuz I can't get it to run reliably. I purchased the early start after playing a bit cuz its amazing, but I can't keep the game going to actually be able to use it. The game itself is absolutely great, but the crashing is too often to want to play it. It sucks, I really want to play this :(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "seems interesting but the game uses ass-ugly ai art and doesnt disclose this on the store page. scummy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only annoying thing I find with the game is the terrible way that roads, tracks and paths of all types interact. so much tiny little micro to do with you want straight roads. \r\n\r\nReason for the negative review is game crashes all the time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has very nice concept of building your socialist hellhole, designs of buildings are spot on. But unfortunately, the game has terrible UI, I had a hard time to get around everything, to figure out how everything works... The tutorial will not help you at all with the worst thing about this game and that is logistics. Took me a while to figure out how to build and get to function simple bus stations. Once you want to move your resources from one building to another, prepare for logistical nightmare and in the end I wasnt as much building as buying hundreds of trucks and planning their routes. It would be much better with little bit of automatization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As you can see from my hours, I have played this game a lot and enjoyed it too. However, I bought the game in early access. Things have changed from early access for the worst. The game has employed a bunch of AI art which I obviously wasn't going to be aware of when I bought the game 4 years ago in 2021. I cannot in good conscience support a game that uses genAI for the reasons that it is built off of the stolen work of artists without consent and also uses an EXORBITANT amount of electricity and water, depriving people of the resources they need which is ironically very capitalist for a game about communism. \n\nThe game sells for $40. The newest DLC sells for $20. 3Division can *easily* afford a few hundred dollars to pay to get all the AI art replaced. And there were zero AI images in early access before the game became as popular as it is now, so it's not exactly a huge feat that the developer is incapable of. \n\nI will not be playing the game again, and this review is for those who also don't support AI because there is zero disclaimer on the store page.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I heard a lot of good things about this game however I can't really recommend it. \nEven as a fan of other city builders, automation games, etc. This one feels clunky, the UI is not good and really unintuitive. It seems like it has a lot of depth, but I couldn't get past the first couple of hours to see that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "complex game, but extra difficult because of bad ui.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eats up your CPU and GPU even at medium settings\r\nDevs kinda don't care anymore, recycle cut content and push workshop mods as DLC\r\nBuildings can't be precisely rotated\r\nTrains aparently do whatever they want\r\nUnrealistic way of building railways\r\nEditing maps can randomly cause the entire population to be erased\r\nTerraforming is very weird because the way the map is set up (grid like system with predetermined points for height) (this also causes roads and railways to look like rollercoasters)\r\nBase game without mod is kinda mid\r\n\r\nIt was fun for a while, that was when i took the issues stated above for what they were and tried to make the best of it. Running a big city with 5 fps max (decent pc, but not high end either, poor resource usage by game) or having your map being emptied of its citizens because an oopsie occured while saving nah bro that ain't it. I've had it. But the devs do care so much about changing the red cross symbol to green though lol.\r\n\r\nThe idea behind this game is great, still needs a lot of work that i'm afraid will not happen anytime soon. Deinstalling for now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really has only one thing going for it and that is the realism mode. Without that it is a very sub par city builder, but having to manage the entire construction process is pretty cool, until it isn't. You know that guy who only buys cars without power steering, power windows, AM only radio, yeah this game is that guy. Almost every phase of the game is almost designed to be annoying. The terrain tools are so bad it is like the devs went through every successful terrain tool in every game to make sure they did not use any of those successful functions. Water and sewer is so bad you almost get cold sweats when you need to do sewer or water works. You need a spreadsheet on the side to manage worker numbers and power, oh and the numbers will never make sense. The fanboys will avidly attack you with foam and spittle on their mouths if you even think about not saying how perfect this game is. I would just go to the dentist and get a root canal over buying this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is very primitive, plays like a game that came out in 2010. Nothing is clear on how things work and what you are supposed to do.  Looking things up on the web will be required to learn the game but this is convoluted because of the name of the game messes up the search results. I have bus stations set up, and purchased buses, but no idea how to get them running, Same thing for trains and so many other aspects of the game. Citizens refuse to go to one half of my city even though its all connected via roads, bus stops, and parking lots. Unemployment high, but commercial establishments i build remain unfilled and without workers. Maybe the game is a joke to teach us about the perils of communism? Going to try and keep learning the game and will update my review if i figure it out. Maybe worth it to get on sale for $20 but definitely not $40",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Отдавая деньги с DLC \"Помощь Урне\" на нужды Киевского режима , разработчики спонсируют террористический режим . Игра крутая , но разрабы ебанные русофобы. (И самый прикол что у них в игре есть символика за которую в этой самой Урне сроки дают)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game as someone who's played city builders since SC2, but the controls are god awful, and the UI is ugly, tiny and very unintuitive. Normally I'm willing to push through and I'm used to convoluted UI ([i] cough [/i] Stellaris), but this was so bad it's a complete no go for me, Then I built a big cinema and the game is trying to tell me people are not willing to walk three hundred meters to it. My god, I [i]drive[/i] for an hour to visit a cinema complex if I want to. Just a hint of the level of micromanagement that I knew is in the game, but just as my tiny town of lazy a***s I'm not willing to fight absolute bs on every step I take. instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a nice hardcore city builder here, but I can't tell if the UI is part of the joke or just one of the worst 'modern' interfaces I've seen.  Add to that a lack of adequate font scaling in 4K, and this is just a plain terrible experience, much like what I imagine living in a Soviet republic was.  Mission accomplished?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pathing seems to be broken. And this was during the tutorial for transporting crops from the farms to the factories. Pretty basic but essential stuff, so yea no donʻt waste your money on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wanna build a lifeless city with no soul, this is your game. There are \"people\" who walk along the road yes but they get to a playground, poof. Get to the shopping mall? Poof. Building connection are TERRIBLE they either auto connect or you will scream at your monitor why wont you connect! For some reason buildings don't have a fine tune rotate so if you want a nice town you better build your buildings first and then your roads.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So far It is only annoying , even the tutorials don't work !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game will eat your life i failed 3 exams because of this fuck as game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant run this on an i9 and 4070gpu wth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes constantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't like this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...Comrades, forgive me but while I genuinely enjoy this game a lot, it just caused me so much frustration I simply feel the need to leave a negative review...\n\nPositives: \n- Graphics are fantastic\n- Sound design feels really good\n- Management ideas are amazing along with the production lines automation systems and import-export mechanics.\n- With the steam workshop it has support for assets of all sorts, giving the player even more freedom of choice\n- The general idea of the game is fantastic, however my problem is with the execution\n\nWhich brings me to the negatives.... where do I even begin.\n- Building and road placement: it's as precise as trying to do heart surgery with a shovel. it just doesn't work and there is no grid or anything for precise building placement, only for rotation while holding ctrl. Often the game will have you make a workaround to build things the way you want... let me explain: Let's say I want to build a house next to a road that also has a power line running alongside it into an already closed grid. It will not let me place the building. However if I first delete the power line, then build the house, and then put the power lines back to where they were, then it lets me... god please help my nerves, the amount of times this has happened... and there is more examples to this but the review is already too long as is.\nThe roads can't do a 90 degree bend from the end of a node, only away from the end. You cannot have a node have both a pedestrian and a road crossing. On top of all of this instead of having road types and being able to have them have bridge/elevated/tunnel versions, you need to select a different menu point for tunnel, bridge and elevated roads instead of having a simple sub-menu as you are building the roads. Overall feels very restrictive with what you can build and is very cumbersome. Also all of the building's technical size is larger than they appear, and it won't allow you to place buildings anywhere near eachother, or next to a road. This completely killed all of my attempts at detailing or optimalising layouts. (not to mention you cannot move buildings after placing them and if you want to build on uneven ground you have to first manually flatten the ground and only then you can place the building). \n- The UI: it's just not intuitive at all, even after 10 hours of gameplay I have to keep looking for certain buildings for a solid minute before finding which menu point they hid it under. Here I would have to add that you cannot make a bridge or elevated road/railway have intersections and therefore it can only have one connection on each end, which is still fine with car and pedestrian roads, but for trains you just have to build 2 separate bridges or make a loop-connection for the rails on each end if you want the trains to be able to go both ways. placing even pedestrian bridges/tunnels is also really cumbersome, because it only allows a certain bend, and anything beyond that is forbidden. placing pipes and other underground connections are also very restrictive because it needs \"a proper slope\". You just always need to find some sort of workaround to actually have the pipes connect unless you are building it on relatively flat ground.\n- Don't even know where to list this: while there is a religion mechanic in the game, there are no religious buildings in the base game to fulfil the religious needs of your people, only with mods or built in the pre-built towns around the map.\n- logistics: by default I think the logistics are in order and I love managing the connections between factories and warehouses, managing imports and exports. But the worst offense in my eyes is that while you can tell your trucks to load certain percentages of the weight they can carry of a certain product, if the destination building gets full, and it cannot unload all of that product, the whole truck is just going to fill up with one product in the end, making it virtually impossible to manage having one truck delivering several products unless it's for exports. If I set it to 50% it shouldn't allow the truck to pick up more than 50% of its maximum load at all. So because of this, manually setting up trucks is barely an option if it's for more than one type of product. Instead you have to get a separate truck for every product, and then you can have them deliver that single product to several destinations. You can then automate it by building distribution offices that will deliver missing products to all buildings automatically once set up correctly but at first you have to complete a research for that. Also I don't know if this is a bug or not, but when setting up the truck to take something like nuclear fuel or nuclear waste, there is a general menu for that in the logistics menu, but if you specify what to pick up, it just won't. somehow specifying the exact thing just won't have the truck pick up those items unless you just select the whole menu point. you can even go into the menu and select every single resource/vehicle under it, but it still won't pick up anything until you untick every single one of them.\n- Utilities: again, just feels incredibly cumbersome. Having to build a source, then the whole network consists of 2-3 pieces... which would be fine, but the range feels small, and sometimes you need to build several of them because just one of them would get too many connections or not have enough capacity to provide for all the buildings around it. In the end especially with all the power lines necessary (because you need to connect every single one of them to a power substation manually through power lines) it feels like an absolute mess and increasingly more difficult to make the build actually look nice.\n- Worker movement and worker counts: buses and trains are very nice, they carry passengers here and there, however just because you have a train connection to a semi-distant building still doesn't mean people are going to work there. I had buildings that were just standing empty despite having public transport connections to them, and they only got workers once I built a house within 400m's of the building. and I must add that after 10 hours I still don't understand the benefits of having public transport and cars available to people if it doesn't noticeably extend the range in which people can move around.\n- Weak introduction and tutorials: There is a campaign and some tutorials that are supposed to introduce you to the game and try to ease you into it, however there are still a lot of things it doesn't explain to you very well. And while often it tells you what to do, it doesn't always tell you how to do it. I think the below 10% achievement for completing the first campaign says it all. People like to be eased into the game they chose to play and it should be helping people to understand the the mechanics, because there will be people who might play this as their first game of this genre and will completely abandon it after a few hours of trying.\n\nTL;DR: it has a very enjoyable gameplay with the management of resources and the logistics and despite the negative review I will keep playing it for a while because I must say, despite all the negatives it's still a very fun game. But on the other hand it feels very unpolished, and does very little effort to help new players get into it, which has brought me a lot of frustration even after playing other strategy/management/city builder games for thousands of hours and having plenty of experience with similar games. Generally to me it feels like the difficulty of the game comes from a lot of things being really cumbersome and slow rather than being actually difficult.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I love the game,I do. Its hard, its a bit janky in some spots though, but its a fun game with a learning curve into it. The more you play, the more you learn and the more you WANT to play.\nSo I would recommend it...if it wasn't for the use of AI art in the game.\nYes the art is minimal, a few pieces here and there. But its not disclosed in the steam page, its not said anywhere, but its clearly AI art. And till that changes, my review stays negative. \nDon't support AI laziness and cheapness. You can do so much better than that, even for something so minimal and trivial really. It wouldn't cost that much to commission artists at all, instead the developers resorted to a machine that has stolen countless pieces of art from many artists without compensation that destroys the environment, \nIt is a shame that the developers decided to use this, and for something so trivial too. You didnt HAVE to include them at ALL really. But you did it anyways, so as such, I do not recommend purchasing this game till the developers understand that AI slop is a bad business decision, even if my recommendation goes so little so far.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game seems amazing. Its full of a TON of details...but it crashes at almost every loading screen. I haven't even tried modding this game, cuz I can't get it to run reliably. I purchased the early start after playing a bit cuz its amazing, but I can't keep the game going to actually be able to use it. The game itself is absolutely great, but the crashing is too often to want to play it. It sucks, I really want to play this :(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "seems interesting but the game uses ass-ugly ai art and doesnt disclose this on the store page. scummy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only annoying thing I find with the game is the terrible way that roads, tracks and paths of all types interact. so much tiny little micro to do with you want straight roads. \r\n\r\nReason for the negative review is game crashes all the time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has very nice concept of building your socialist hellhole, designs of buildings are spot on. But unfortunately, the game has terrible UI, I had a hard time to get around everything, to figure out how everything works... The tutorial will not help you at all with the worst thing about this game and that is logistics. Took me a while to figure out how to build and get to function simple bus stations. Once you want to move your resources from one building to another, prepare for logistical nightmare and in the end I wasnt as much building as buying hundreds of trucks and planning their routes. It would be much better with little bit of automatization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As you can see from my hours, I have played this game a lot and enjoyed it too. However, I bought the game in early access. Things have changed from early access for the worst. The game has employed a bunch of AI art which I obviously wasn't going to be aware of when I bought the game 4 years ago in 2021. I cannot in good conscience support a game that uses genAI for the reasons that it is built off of the stolen work of artists without consent and also uses an EXORBITANT amount of electricity and water, depriving people of the resources they need which is ironically very capitalist for a game about communism. \n\nThe game sells for $40. The newest DLC sells for $20. 3Division can *easily* afford a few hundred dollars to pay to get all the AI art replaced. And there were zero AI images in early access before the game became as popular as it is now, so it's not exactly a huge feat that the developer is incapable of. \n\nI will not be playing the game again, and this review is for those who also don't support AI because there is zero disclaimer on the store page.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I heard a lot of good things about this game however I can't really recommend it. \nEven as a fan of other city builders, automation games, etc. This one feels clunky, the UI is not good and really unintuitive. It seems like it has a lot of depth, but I couldn't get past the first couple of hours to see that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "complex game, but extra difficult because of bad ui.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eats up your CPU and GPU even at medium settings\r\nDevs kinda don't care anymore, recycle cut content and push workshop mods as DLC\r\nBuildings can't be precisely rotated\r\nTrains aparently do whatever they want\r\nUnrealistic way of building railways\r\nEditing maps can randomly cause the entire population to be erased\r\nTerraforming is very weird because the way the map is set up (grid like system with predetermined points for height) (this also causes roads and railways to look like rollercoasters)\r\nBase game without mod is kinda mid\r\n\r\nIt was fun for a while, that was when i took the issues stated above for what they were and tried to make the best of it. Running a big city with 5 fps max (decent pc, but not high end either, poor resource usage by game) or having your map being emptied of its citizens because an oopsie occured while saving nah bro that ain't it. I've had it. But the devs do care so much about changing the red cross symbol to green though lol.\r\n\r\nThe idea behind this game is great, still needs a lot of work that i'm afraid will not happen anytime soon. Deinstalling for now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really has only one thing going for it and that is the realism mode. Without that it is a very sub par city builder, but having to manage the entire construction process is pretty cool, until it isn't. You know that guy who only buys cars without power steering, power windows, AM only radio, yeah this game is that guy. Almost every phase of the game is almost designed to be annoying. The terrain tools are so bad it is like the devs went through every successful terrain tool in every game to make sure they did not use any of those successful functions. Water and sewer is so bad you almost get cold sweats when you need to do sewer or water works. You need a spreadsheet on the side to manage worker numbers and power, oh and the numbers will never make sense. The fanboys will avidly attack you with foam and spittle on their mouths if you even think about not saying how perfect this game is. I would just go to the dentist and get a root canal over buying this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is very primitive, plays like a game that came out in 2010. Nothing is clear on how things work and what you are supposed to do.  Looking things up on the web will be required to learn the game but this is convoluted because of the name of the game messes up the search results. I have bus stations set up, and purchased buses, but no idea how to get them running, Same thing for trains and so many other aspects of the game. Citizens refuse to go to one half of my city even though its all connected via roads, bus stops, and parking lots. Unemployment high, but commercial establishments i build remain unfilled and without workers. Maybe the game is a joke to teach us about the perils of communism? Going to try and keep learning the game and will update my review if i figure it out. Maybe worth it to get on sale for $20 but definitely not $40",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Отдавая деньги с DLC \"Помощь Урне\" на нужды Киевского режима , разработчики спонсируют террористический режим . Игра крутая , но разрабы ебанные русофобы. (И самый прикол что у них в игре есть символика за которую в этой самой Урне сроки дают)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game as someone who's played city builders since SC2, but the controls are god awful, and the UI is ugly, tiny and very unintuitive. Normally I'm willing to push through and I'm used to convoluted UI ([i] cough [/i] Stellaris), but this was so bad it's a complete no go for me, Then I built a big cinema and the game is trying to tell me people are not willing to walk three hundred meters to it. My god, I [i]drive[/i] for an hour to visit a cinema complex if I want to. Just a hint of the level of micromanagement that I knew is in the game, but just as my tiny town of lazy a***s I'm not willing to fight absolute bs on every step I take. instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a nice hardcore city builder here, but I can't tell if the UI is part of the joke or just one of the worst 'modern' interfaces I've seen.  Add to that a lack of adequate font scaling in 4K, and this is just a plain terrible experience, much like what I imagine living in a Soviet republic was.  Mission accomplished?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pathing seems to be broken. And this was during the tutorial for transporting crops from the farms to the factories. Pretty basic but essential stuff, so yea no donʻt waste your money on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wanna build a lifeless city with no soul, this is your game. There are \"people\" who walk along the road yes but they get to a playground, poof. Get to the shopping mall? Poof. Building connection are TERRIBLE they either auto connect or you will scream at your monitor why wont you connect! For some reason buildings don't have a fine tune rotate so if you want a nice town you better build your buildings first and then your roads.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So far It is only annoying , even the tutorials don't work !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game will eat your life i failed 3 exams because of this fuck as game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant run this on an i9 and 4070gpu wth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes constantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't like this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...Comrades, forgive me but while I genuinely enjoy this game a lot, it just caused me so much frustration I simply feel the need to leave a negative review...\n\nPositives: \n- Graphics are fantastic\n- Sound design feels really good\n- Management ideas are amazing along with the production lines automation systems and import-export mechanics.\n- With the steam workshop it has support for assets of all sorts, giving the player even more freedom of choice\n- The general idea of the game is fantastic, however my problem is with the execution\n\nWhich brings me to the negatives.... where do I even begin.\n- Building and road placement: it's as precise as trying to do heart surgery with a shovel. it just doesn't work and there is no grid or anything for precise building placement, only for rotation while holding ctrl. Often the game will have you make a workaround to build things the way you want... let me explain: Let's say I want to build a house next to a road that also has a power line running alongside it into an already closed grid. It will not let me place the building. However if I first delete the power line, then build the house, and then put the power lines back to where they were, then it lets me... god please help my nerves, the amount of times this has happened... and there is more examples to this but the review is already too long as is.\nThe roads can't do a 90 degree bend from the end of a node, only away from the end. You cannot have a node have both a pedestrian and a road crossing. On top of all of this instead of having road types and being able to have them have bridge/elevated/tunnel versions, you need to select a different menu point for tunnel, bridge and elevated roads instead of having a simple sub-menu as you are building the roads. Overall feels very restrictive with what you can build and is very cumbersome. Also all of the building's technical size is larger than they appear, and it won't allow you to place buildings anywhere near eachother, or next to a road. This completely killed all of my attempts at detailing or optimalising layouts. (not to mention you cannot move buildings after placing them and if you want to build on uneven ground you have to first manually flatten the ground and only then you can place the building). \n- The UI: it's just not intuitive at all, even after 10 hours of gameplay I have to keep looking for certain buildings for a solid minute before finding which menu point they hid it under. Here I would have to add that you cannot make a bridge or elevated road/railway have intersections and therefore it can only have one connection on each end, which is still fine with car and pedestrian roads, but for trains you just have to build 2 separate bridges or make a loop-connection for the rails on each end if you want the trains to be able to go both ways. placing even pedestrian bridges/tunnels is also really cumbersome, because it only allows a certain bend, and anything beyond that is forbidden. placing pipes and other underground connections are also very restrictive because it needs \"a proper slope\". You just always need to find some sort of workaround to actually have the pipes connect unless you are building it on relatively flat ground.\n- Don't even know where to list this: while there is a religion mechanic in the game, there are no religious buildings in the base game to fulfil the religious needs of your people, only with mods or built in the pre-built towns around the map.\n- logistics: by default I think the logistics are in order and I love managing the connections between factories and warehouses, managing imports and exports. But the worst offense in my eyes is that while you can tell your trucks to load certain percentages of the weight they can carry of a certain product, if the destination building gets full, and it cannot unload all of that product, the whole truck is just going to fill up with one product in the end, making it virtually impossible to manage having one truck delivering several products unless it's for exports. If I set it to 50% it shouldn't allow the truck to pick up more than 50% of its maximum load at all. So because of this, manually setting up trucks is barely an option if it's for more than one type of product. Instead you have to get a separate truck for every product, and then you can have them deliver that single product to several destinations. You can then automate it by building distribution offices that will deliver missing products to all buildings automatically once set up correctly but at first you have to complete a research for that. Also I don't know if this is a bug or not, but when setting up the truck to take something like nuclear fuel or nuclear waste, there is a general menu for that in the logistics menu, but if you specify what to pick up, it just won't. somehow specifying the exact thing just won't have the truck pick up those items unless you just select the whole menu point. you can even go into the menu and select every single resource/vehicle under it, but it still won't pick up anything until you untick every single one of them.\n- Utilities: again, just feels incredibly cumbersome. Having to build a source, then the whole network consists of 2-3 pieces... which would be fine, but the range feels small, and sometimes you need to build several of them because just one of them would get too many connections or not have enough capacity to provide for all the buildings around it. In the end especially with all the power lines necessary (because you need to connect every single one of them to a power substation manually through power lines) it feels like an absolute mess and increasingly more difficult to make the build actually look nice.\n- Worker movement and worker counts: buses and trains are very nice, they carry passengers here and there, however just because you have a train connection to a semi-distant building still doesn't mean people are going to work there. I had buildings that were just standing empty despite having public transport connections to them, and they only got workers once I built a house within 400m's of the building. and I must add that after 10 hours I still don't understand the benefits of having public transport and cars available to people if it doesn't noticeably extend the range in which people can move around.\n- Weak introduction and tutorials: There is a campaign and some tutorials that are supposed to introduce you to the game and try to ease you into it, however there are still a lot of things it doesn't explain to you very well. And while often it tells you what to do, it doesn't always tell you how to do it. I think the below 10% achievement for completing the first campaign says it all. People like to be eased into the game they chose to play and it should be helping people to understand the the mechanics, because there will be people who might play this as their first game of this genre and will completely abandon it after a few hours of trying.\n\nTL;DR: it has a very enjoyable gameplay with the management of resources and the logistics and despite the negative review I will keep playing it for a while because I must say, despite all the negatives it's still a very fun game. But on the other hand it feels very unpolished, and does very little effort to help new players get into it, which has brought me a lot of frustration even after playing other strategy/management/city builder games for thousands of hours and having plenty of experience with similar games. Generally to me it feels like the difficulty of the game comes from a lot of things being really cumbersome and slow rather than being actually difficult.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I love the game,I do. Its hard, its a bit janky in some spots though, but its a fun game with a learning curve into it. The more you play, the more you learn and the more you WANT to play.\nSo I would recommend it...if it wasn't for the use of AI art in the game.\nYes the art is minimal, a few pieces here and there. But its not disclosed in the steam page, its not said anywhere, but its clearly AI art. And till that changes, my review stays negative. \nDon't support AI laziness and cheapness. You can do so much better than that, even for something so minimal and trivial really. It wouldn't cost that much to commission artists at all, instead the developers resorted to a machine that has stolen countless pieces of art from many artists without compensation that destroys the environment, \nIt is a shame that the developers decided to use this, and for something so trivial too. You didnt HAVE to include them at ALL really. But you did it anyways, so as such, I do not recommend purchasing this game till the developers understand that AI slop is a bad business decision, even if my recommendation goes so little so far.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game seems amazing. Its full of a TON of details...but it crashes at almost every loading screen. I haven't even tried modding this game, cuz I can't get it to run reliably. I purchased the early start after playing a bit cuz its amazing, but I can't keep the game going to actually be able to use it. The game itself is absolutely great, but the crashing is too often to want to play it. It sucks, I really want to play this :(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "seems interesting but the game uses ass-ugly ai art and doesnt disclose this on the store page. scummy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only annoying thing I find with the game is the terrible way that roads, tracks and paths of all types interact. so much tiny little micro to do with you want straight roads. \r\n\r\nReason for the negative review is game crashes all the time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has very nice concept of building your socialist hellhole, designs of buildings are spot on. But unfortunately, the game has terrible UI, I had a hard time to get around everything, to figure out how everything works... The tutorial will not help you at all with the worst thing about this game and that is logistics. Took me a while to figure out how to build and get to function simple bus stations. Once you want to move your resources from one building to another, prepare for logistical nightmare and in the end I wasnt as much building as buying hundreds of trucks and planning their routes. It would be much better with little bit of automatization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As you can see from my hours, I have played this game a lot and enjoyed it too. However, I bought the game in early access. Things have changed from early access for the worst. The game has employed a bunch of AI art which I obviously wasn't going to be aware of when I bought the game 4 years ago in 2021. I cannot in good conscience support a game that uses genAI for the reasons that it is built off of the stolen work of artists without consent and also uses an EXORBITANT amount of electricity and water, depriving people of the resources they need which is ironically very capitalist for a game about communism. \n\nThe game sells for $40. The newest DLC sells for $20. 3Division can *easily* afford a few hundred dollars to pay to get all the AI art replaced. And there were zero AI images in early access before the game became as popular as it is now, so it's not exactly a huge feat that the developer is incapable of. \n\nI will not be playing the game again, and this review is for those who also don't support AI because there is zero disclaimer on the store page.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I heard a lot of good things about this game however I can't really recommend it. \nEven as a fan of other city builders, automation games, etc. This one feels clunky, the UI is not good and really unintuitive. It seems like it has a lot of depth, but I couldn't get past the first couple of hours to see that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "complex game, but extra difficult because of bad ui.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eats up your CPU and GPU even at medium settings\r\nDevs kinda don't care anymore, recycle cut content and push workshop mods as DLC\r\nBuildings can't be precisely rotated\r\nTrains aparently do whatever they want\r\nUnrealistic way of building railways\r\nEditing maps can randomly cause the entire population to be erased\r\nTerraforming is very weird because the way the map is set up (grid like system with predetermined points for height) (this also causes roads and railways to look like rollercoasters)\r\nBase game without mod is kinda mid\r\n\r\nIt was fun for a while, that was when i took the issues stated above for what they were and tried to make the best of it. Running a big city with 5 fps max (decent pc, but not high end either, poor resource usage by game) or having your map being emptied of its citizens because an oopsie occured while saving nah bro that ain't it. I've had it. But the devs do care so much about changing the red cross symbol to green though lol.\r\n\r\nThe idea behind this game is great, still needs a lot of work that i'm afraid will not happen anytime soon. Deinstalling for now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really has only one thing going for it and that is the realism mode. Without that it is a very sub par city builder, but having to manage the entire construction process is pretty cool, until it isn't. You know that guy who only buys cars without power steering, power windows, AM only radio, yeah this game is that guy. Almost every phase of the game is almost designed to be annoying. The terrain tools are so bad it is like the devs went through every successful terrain tool in every game to make sure they did not use any of those successful functions. Water and sewer is so bad you almost get cold sweats when you need to do sewer or water works. You need a spreadsheet on the side to manage worker numbers and power, oh and the numbers will never make sense. The fanboys will avidly attack you with foam and spittle on their mouths if you even think about not saying how perfect this game is. I would just go to the dentist and get a root canal over buying this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is very primitive, plays like a game that came out in 2010. Nothing is clear on how things work and what you are supposed to do.  Looking things up on the web will be required to learn the game but this is convoluted because of the name of the game messes up the search results. I have bus stations set up, and purchased buses, but no idea how to get them running, Same thing for trains and so many other aspects of the game. Citizens refuse to go to one half of my city even though its all connected via roads, bus stops, and parking lots. Unemployment high, but commercial establishments i build remain unfilled and without workers. Maybe the game is a joke to teach us about the perils of communism? Going to try and keep learning the game and will update my review if i figure it out. Maybe worth it to get on sale for $20 but definitely not $40",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Отдавая деньги с DLC \"Помощь Урне\" на нужды Киевского режима , разработчики спонсируют террористический режим . Игра крутая , но разрабы ебанные русофобы. (И самый прикол что у них в игре есть символика за которую в этой самой Урне сроки дают)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game as someone who's played city builders since SC2, but the controls are god awful, and the UI is ugly, tiny and very unintuitive. Normally I'm willing to push through and I'm used to convoluted UI ([i] cough [/i] Stellaris), but this was so bad it's a complete no go for me, Then I built a big cinema and the game is trying to tell me people are not willing to walk three hundred meters to it. My god, I [i]drive[/i] for an hour to visit a cinema complex if I want to. Just a hint of the level of micromanagement that I knew is in the game, but just as my tiny town of lazy a***s I'm not willing to fight absolute bs on every step I take. instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a nice hardcore city builder here, but I can't tell if the UI is part of the joke or just one of the worst 'modern' interfaces I've seen.  Add to that a lack of adequate font scaling in 4K, and this is just a plain terrible experience, much like what I imagine living in a Soviet republic was.  Mission accomplished?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pathing seems to be broken. And this was during the tutorial for transporting crops from the farms to the factories. Pretty basic but essential stuff, so yea no donʻt waste your money on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you wanna build a lifeless city with no soul, this is your game. There are \"people\" who walk along the road yes but they get to a playground, poof. Get to the shopping mall? Poof. Building connection are TERRIBLE they either auto connect or you will scream at your monitor why wont you connect! For some reason buildings don't have a fine tune rotate so if you want a nice town you better build your buildings first and then your roads.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So far It is only annoying , even the tutorials don't work !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game will eat your life i failed 3 exams because of this fuck as game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant run this on an i9 and 4070gpu wth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes constantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't like this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...Comrades, forgive me but while I genuinely enjoy this game a lot, it just caused me so much frustration I simply feel the need to leave a negative review...\n\nPositives: \n- Graphics are fantastic\n- Sound design feels really good\n- Management ideas are amazing along with the production lines automation systems and import-export mechanics.\n- With the steam workshop it has support for assets of all sorts, giving the player even more freedom of choice\n- The general idea of the game is fantastic, however my problem is with the execution\n\nWhich brings me to the negatives.... where do I even begin.\n- Building and road placement: it's as precise as trying to do heart surgery with a shovel. it just doesn't work and there is no grid or anything for precise building placement, only for rotation while holding ctrl. Often the game will have you make a workaround to build things the way you want... let me explain: Let's say I want to build a house next to a road that also has a power line running alongside it into an already closed grid. It will not let me place the building. However if I first delete the power line, then build the house, and then put the power lines back to where they were, then it lets me... god please help my nerves, the amount of times this has happened... and there is more examples to this but the review is already too long as is.\nThe roads can't do a 90 degree bend from the end of a node, only away from the end. You cannot have a node have both a pedestrian and a road crossing. On top of all of this instead of having road types and being able to have them have bridge/elevated/tunnel versions, you need to select a different menu point for tunnel, bridge and elevated roads instead of having a simple sub-menu as you are building the roads. Overall feels very restrictive with what you can build and is very cumbersome. Also all of the building's technical size is larger than they appear, and it won't allow you to place buildings anywhere near eachother, or next to a road. This completely killed all of my attempts at detailing or optimalising layouts. (not to mention you cannot move buildings after placing them and if you want to build on uneven ground you have to first manually flatten the ground and only then you can place the building). \n- The UI: it's just not intuitive at all, even after 10 hours of gameplay I have to keep looking for certain buildings for a solid minute before finding which menu point they hid it under. Here I would have to add that you cannot make a bridge or elevated road/railway have intersections and therefore it can only have one connection on each end, which is still fine with car and pedestrian roads, but for trains you just have to build 2 separate bridges or make a loop-connection for the rails on each end if you want the trains to be able to go both ways. placing even pedestrian bridges/tunnels is also really cumbersome, because it only allows a certain bend, and anything beyond that is forbidden. placing pipes and other underground connections are also very restrictive because it needs \"a proper slope\". You just always need to find some sort of workaround to actually have the pipes connect unless you are building it on relatively flat ground.\n- Don't even know where to list this: while there is a religion mechanic in the game, there are no religious buildings in the base game to fulfil the religious needs of your people, only with mods or built in the pre-built towns around the map.\n- logistics: by default I think the logistics are in order and I love managing the connections between factories and warehouses, managing imports and exports. But the worst offense in my eyes is that while you can tell your trucks to load certain percentages of the weight they can carry of a certain product, if the destination building gets full, and it cannot unload all of that product, the whole truck is just going to fill up with one product in the end, making it virtually impossible to manage having one truck delivering several products unless it's for exports. If I set it to 50% it shouldn't allow the truck to pick up more than 50% of its maximum load at all. So because of this, manually setting up trucks is barely an option if it's for more than one type of product. Instead you have to get a separate truck for every product, and then you can have them deliver that single product to several destinations. You can then automate it by building distribution offices that will deliver missing products to all buildings automatically once set up correctly but at first you have to complete a research for that. Also I don't know if this is a bug or not, but when setting up the truck to take something like nuclear fuel or nuclear waste, there is a general menu for that in the logistics menu, but if you specify what to pick up, it just won't. somehow specifying the exact thing just won't have the truck pick up those items unless you just select the whole menu point. you can even go into the menu and select every single resource/vehicle under it, but it still won't pick up anything until you untick every single one of them.\n- Utilities: again, just feels incredibly cumbersome. Having to build a source, then the whole network consists of 2-3 pieces... which would be fine, but the range feels small, and sometimes you need to build several of them because just one of them would get too many connections or not have enough capacity to provide for all the buildings around it. In the end especially with all the power lines necessary (because you need to connect every single one of them to a power substation manually through power lines) it feels like an absolute mess and increasingly more difficult to make the build actually look nice.\n- Worker movement and worker counts: buses and trains are very nice, they carry passengers here and there, however just because you have a train connection to a semi-distant building still doesn't mean people are going to work there. I had buildings that were just standing empty despite having public transport connections to them, and they only got workers once I built a house within 400m's of the building. and I must add that after 10 hours I still don't understand the benefits of having public transport and cars available to people if it doesn't noticeably extend the range in which people can move around.\n- Weak introduction and tutorials: There is a campaign and some tutorials that are supposed to introduce you to the game and try to ease you into it, however there are still a lot of things it doesn't explain to you very well. And while often it tells you what to do, it doesn't always tell you how to do it. I think the below 10% achievement for completing the first campaign says it all. People like to be eased into the game they chose to play and it should be helping people to understand the the mechanics, because there will be people who might play this as their first game of this genre and will completely abandon it after a few hours of trying.\n\nTL;DR: it has a very enjoyable gameplay with the management of resources and the logistics and despite the negative review I will keep playing it for a while because I must say, despite all the negatives it's still a very fun game. But on the other hand it feels very unpolished, and does very little effort to help new players get into it, which has brought me a lot of frustration even after playing other strategy/management/city builder games for thousands of hours and having plenty of experience with similar games. Generally to me it feels like the difficulty of the game comes from a lot of things being really cumbersome and slow rather than being actually difficult.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I love the game,I do. Its hard, its a bit janky in some spots though, but its a fun game with a learning curve into it. The more you play, the more you learn and the more you WANT to play.\nSo I would recommend it...if it wasn't for the use of AI art in the game.\nYes the art is minimal, a few pieces here and there. But its not disclosed in the steam page, its not said anywhere, but its clearly AI art. And till that changes, my review stays negative. \nDon't support AI laziness and cheapness. You can do so much better than that, even for something so minimal and trivial really. It wouldn't cost that much to commission artists at all, instead the developers resorted to a machine that has stolen countless pieces of art from many artists without compensation that destroys the environment, \nIt is a shame that the developers decided to use this, and for something so trivial too. You didnt HAVE to include them at ALL really. But you did it anyways, so as such, I do not recommend purchasing this game till the developers understand that AI slop is a bad business decision, even if my recommendation goes so little so far.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game seems amazing. Its full of a TON of details...but it crashes at almost every loading screen. I haven't even tried modding this game, cuz I can't get it to run reliably. I purchased the early start after playing a bit cuz its amazing, but I can't keep the game going to actually be able to use it. The game itself is absolutely great, but the crashing is too often to want to play it. It sucks, I really want to play this :(",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "seems interesting but the game uses ass-ugly ai art and doesnt disclose this on the store page. scummy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only annoying thing I find with the game is the terrible way that roads, tracks and paths of all types interact. so much tiny little micro to do with you want straight roads. \r\n\r\nReason for the negative review is game crashes all the time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has very nice concept of building your socialist hellhole, designs of buildings are spot on. But unfortunately, the game has terrible UI, I had a hard time to get around everything, to figure out how everything works... The tutorial will not help you at all with the worst thing about this game and that is logistics. Took me a while to figure out how to build and get to function simple bus stations. Once you want to move your resources from one building to another, prepare for logistical nightmare and in the end I wasnt as much building as buying hundreds of trucks and planning their routes. It would be much better with little bit of automatization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As you can see from my hours, I have played this game a lot and enjoyed it too. However, I bought the game in early access. Things have changed from early access for the worst. The game has employed a bunch of AI art which I obviously wasn't going to be aware of when I bought the game 4 years ago in 2021. I cannot in good conscience support a game that uses genAI for the reasons that it is built off of the stolen work of artists without consent and also uses an EXORBITANT amount of electricity and water, depriving people of the resources they need which is ironically very capitalist for a game about communism. \n\nThe game sells for $40. The newest DLC sells for $20. 3Division can *easily* afford a few hundred dollars to pay to get all the AI art replaced. And there were zero AI images in early access before the game became as popular as it is now, so it's not exactly a huge feat that the developer is incapable of. \n\nI will not be playing the game again, and this review is for those who also don't support AI because there is zero disclaimer on the store page.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I heard a lot of good things about this game however I can't really recommend it. \nEven as a fan of other city builders, automation games, etc. This one feels clunky, the UI is not good and really unintuitive. It seems like it has a lot of depth, but I couldn't get past the first couple of hours to see that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "complex game, but extra difficult because of bad ui.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eats up your CPU and GPU even at medium settings\r\nDevs kinda don't care anymore, recycle cut content and push workshop mods as DLC\r\nBuildings can't be precisely rotated\r\nTrains aparently do whatever they want\r\nUnrealistic way of building railways\r\nEditing maps can randomly cause the entire population to be erased\r\nTerraforming is very weird because the way the map is set up (grid like system with predetermined points for height) (this also causes roads and railways to look like rollercoasters)\r\nBase game without mod is kinda mid\r\n\r\nIt was fun for a while, that was when i took the issues stated above for what they were and tried to make the best of it. Running a big city with 5 fps max (decent pc, but not high end either, poor resource usage by game) or having your map being emptied of its citizens because an oopsie occured while saving nah bro that ain't it. I've had it. But the devs do care so much about changing the red cross symbol to green though lol.\r\n\r\nThe idea behind this game is great, still needs a lot of work that i'm afraid will not happen anytime soon. Deinstalling for now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really has only one thing going for it and that is the realism mode. Without that it is a very sub par city builder, but having to manage the entire construction process is pretty cool, until it isn't. You know that guy who only buys cars without power steering, power windows, AM only radio, yeah this game is that guy. Almost every phase of the game is almost designed to be annoying. The terrain tools are so bad it is like the devs went through every successful terrain tool in every game to make sure they did not use any of those successful functions. Water and sewer is so bad you almost get cold sweats when you need to do sewer or water works. You need a spreadsheet on the side to manage worker numbers and power, oh and the numbers will never make sense. The fanboys will avidly attack you with foam and spittle on their mouths if you even think about not saying how perfect this game is. I would just go to the dentist and get a root canal over buying this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is very primitive, plays like a game that came out in 2010. Nothing is clear on how things work and what you are supposed to do.  Looking things up on the web will be required to learn the game but this is convoluted because of the name of the game messes up the search results. I have bus stations set up, and purchased buses, but no idea how to get them running, Same thing for trains and so many other aspects of the game. Citizens refuse to go to one half of my city even though its all connected via roads, bus stops, and parking lots. Unemployment high, but commercial establishments i build remain unfilled and without workers. Maybe the game is a joke to teach us about the perils of communism? Going to try and keep learning the game and will update my review if i figure it out. Maybe worth it to get on sale for $20 but definitely not $40",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Отдавая деньги с DLC \"Помощь Урне\" на нужды Киевского режима , разработчики спонсируют террористический режим . Игра крутая , но разрабы ебанные русофобы. (И самый прикол что у них в игре есть символика за которую в этой самой Урне сроки дают)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game as someone who's played city builders since SC2, but the controls are god awful, and the UI is ugly, tiny and very unintuitive. Normally I'm willing to push through and I'm used to convoluted UI ([i] cough [/i] Stellaris), but this was so bad it's a complete no go for me, Then I built a big cinema and the game is trying to tell me people are not willing to walk three hundred meters to it. My god, I [i]drive[/i] for an hour to visit a cinema complex if I want to. Just a hint of the level of micromanagement that I knew is in the game, but just as my tiny town of lazy a***s I'm not willing to fight absolute bs on every step I take. instant refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a nice hardcore city builder here, but I can't tell if the UI is part of the joke or just one of the worst 'modern' interfaces I've seen.  Add to that a lack of adequate font scaling in 4K, and this is just a plain terrible experience, much like what I imagine living in a Soviet republic was.  Mission accomplished?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pathing seems to be broken. And this was during the tutorial for transporting crops from the farms to the factories. Pretty basic but essential stuff, so yea no donʻt waste your money on this one.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}