{
  "positive": [
    {
      "review": "i thought i was very stupid, and turns out this game proved that. i have the survival instincts of a lamp and i don't think i will be able to become a lawyer in the future (not that i was planning to)\r\nignoring my skill issue, this game is very fun. it made me think and actually read the dialogue, something i never though i'd be able to do. it's funny too which is a bonus.\r\none thing is that i hate the way they coloured the character sprites, i am aware this is an old game, but the airbrushed sort of feel simply does not appeal to me. it sort of fits in some way, i have to admit, with the rest of the aesthetics and i don't know how to explain.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "this is everything a visual novel should be, a fun and engaging video game",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Man oh man.\n\nMy first exposure to the Ace Attorney games came from The Henry Stickmin collection of flash games. Where Henry escapes prison by hiring Phoenix Wright as his lawyer (If my client was inside the bag...HOW DID HE TIE THE KNOT FROM THE OUTSIDE OF THE BAG?!) and I never thought about it again until I randomly discovered the Ace Attorney trilogy on Wii Virtual Console (I assume it was the DS release ported terribly to Wii) and picked up the first game. I realized it wasn't my type of game at the time and put it down\n\nFast forward to now around a decade later and owning many editions of the trilogy on various consoles, I finally FINALLY sat down and played through this trilogy...and holy shit. Some of these cases genuinely had me at the edge of my seat with how they tied into the overall story the trilogy was trying to tell. \n\nThis is the first game in my hundreds of steam games that I felt fully compelled to get all the achievements in, which I completed last night and capcom immediately got my money again for the Investigations collection and Apollo Justice trilogy. Just play as the funny spikey hair lawyer guy. You will NOT regret it",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Phoenix Wright: Ace Attorney Trilogy offers a fun mix of investigations and courtroom drama. Each case moves smoothly between gathering clues and presenting them in court, which keeps things fresh. All three games are strong, but the third one really stands out with its story and payoff. If you like mystery and deduction, this trilogy is easy to get into.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I don't think I've ever played a game so simple yet so amazing.\nIt's like watching an tv-show/anime but it's so full of humour and so overdramatic you should just grab popcorn to snack while playing.\nPhoenix Wright has to be one of the best Protagonists ever the way he just bullshits through every case, gets fucked by updated autopsy reports and still manages to come out on top.\nThe Soundtrack is amazing and everytime any Pursuit comes on I blast it throughtout the entire neighbourhood so everyone knows im about to call out the witnesses contradictions.\nAnd even though it has some of the most goofy ass gameplay you can bs your way through with save scumming it also manages to have some really interessting or even sad stories.\n\n10/10 but Apollo Justice has the better Pursuit theme\n\nOh and the Finale of T&T slaps so fucking hard playing a variation of the OG Pursuit being the best buildup ever\n\nEdit: I've just figured out that with the newest update they also updated Phoenix's voice lines and I kinda wanna be petty enough to change my review, i get they had their reasons for changing va but I do not approve of this",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Maya gets accused of murder atleast 8 times each chapter",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Replayed this game after almost 5 years for the sake of getting all of the achievements. HOLY I do not remember the last case hitting that hard, I'm partially embarrassed to say that I shed a couple of tears. What a fantastic game, definitely give this a shot if you like dialogue-heavy visual novels with puzzle solving (in other words, play this if you like danganronpa, eheh) !\r\n\r\n(I actually have >150 hours on this game, most of the data is out of sync due to me playing it offline, heh)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An amazing compilation of the best trilogy in video game history, made even better with the recent features added. I cannot recommend this enough for anyone who's a fan of visual novels, or even just a good story, that has never played through the games before. Just understand that it is very cartoony and very much not an accurate depiction of legal proceedings (discovery straight up doesn't exist), but once you immerse yourself in the game's world, it has a very compelling story throughout all three games.\n\nAs someone who played through this trilogy on both the DS and WiiWare releases growing up, I can confidently say this collection contains the best, most definitive versions of the games. The only real downside is that, since the update, Phoenix's original voice was completely removed from the game -- I understand the reasons why, but independent of the person behind the voice, it is so iconic. I wish it was at least available as an option. (Though I would imagine you could mod it in on PC anyway?)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the OG trilogy is just so charming even with all of its flaws and outdated [strike]autopsy report[/strike] aspects, its lasting power in the public consciousness and in my heart speaks for itself",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, but as I revisited it after the latest update, I'm very disappointed to hear Phoenix's voice lines have been changed from the original voice actor. Please add an option to toggle to the old one! I still own the games on DS, but it's much more convenient to play here, and I find it very jarring to not hear the familiar Phoenix I know and love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "변호사가 커피도맞고 채찍도맞고 전세계 변호사님들 화이팅입니다",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just beat the first Ace Attorney game in this trilogy. honestly i love this game to bits.\r\nthe first episode was great at introducing the concept and game play, a tutorial that was actually fun.\r\nthe second episode was a blast to go through, one of my favorite cases.\r\nwhile this third one had a lot of back and forth with investigations, the story was awesome, and the twists were impecable.\r\nthe fourth, being the original end was a perfect case, great brief, yet fufilling investigations, and the characters were great, all round my favorite from the game.\r\nand the fifth episode, while dragging on a bit longer then the others, having a ton of evidence, and new gimmick's, it was all round a really enjoyable case.\r\n\r\ni loved this game, and im excited to play the rest of the trilogy, and every other ace attorney.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "character writings are excellent, vn enjoyers shouldn't think twice about getting this or not. this trilogy is so fun however i think the justice for all is a bit off compared to the first and third game. still, this didn't stop me pulling all nighter to finish it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have less gameplay time on this than Fallout: New Vegas but this is definitely more of a hyper fixation. In order to make me think about a game when I'm not playing it, the game needs to have good characters. That's why Bioware and Ace Attorney are the ones that qualify. The gameplay loop is good in this game. I had more fun in the trials than the investigations to be sure, and it was not without occasional help from an online guide (some of those evidence presentations are tough man) but if I ever replay this game I'm going to switch on story mode and just read through it, VN style. The gameplay is definitely repetitive after you've learned all the plot twists and murders and such, but the dialogue is so good. I have rarely liked a protagonist as much as Phoenix Wright, and his interactions with the whole cast is delightful (even if it's mostly just him getting picked on by a bunch of losers). I will admit to getting frustrated with the cast at times (I know this is an overexaggerated world but no court of law would stand von Karma and Godot's styles of prosecution) but I suppose that's just a testament to how invested I was. The way Trials and Tribulations brought everything together and small cases you forgot about become clues to the very end is lovely. The games are all interconnected and it brings a sense of intentionality and consistency that makes the saga as a whole coherent and fun. I have not been up until 4 am playing a game in a long time, but Bridge to the Turnabout did it. Congratulations, Phoenix Wright: Ace Attorney, for making me care about your stupid characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, this game knows how to keep you hooked, and I'm all here for it!\nWould absolutely recommend it to anyone who's remotely interested in singleplayer games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A  better title for this game would be Phoenix Wright: Ace Detective due to the ridiculous amount of clue gathering instead of working as a lawyer. Nevertheless, i find it extremely fun when it comes to court trials.\n\n ★ ★ ★ ★ ★ 5/5 Stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty fun! i completed over 2 episodes, and they were fun to do. Looking at 14 episodes i BET the game is long which is good because fun games should last long before reaching the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest I found this game to be pretty boring. The characters are fun and the puzzles can be quite challenging, but perhaps age hasnt been kind the the slow, linear nature of the game. It's more of a visual novel than it is a puzzle/mystery game, and maybe thats where my expectations set me up for failure.\n\nStill, you can get it super cheap on sale, and it is a classic. Worth trying out, maybe you will get more out of it than I did!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoy the ace attorney games!! between the silliness of the courtroom dramas and the investigations its so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had a crush on Edgeworth in high school and still do. Very fun game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is pretty well thought out and the game is really enjoyable! Lots of likeable characters too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CAPCOM finally gave this franchise some attention. A long-awaited update that makes this game a little bit more modern and easy to replay. I hope this will continue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had the pleasure of getting to use this game for a highschool English semester so I didn't have to read a book and I had a blast with it! This game was a joy to watch letsplays of and now to play it for myself. Through all the courtroom drama and unnecessary... feelings, this is a game I will never forget!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretendo fazer direito logo após zerar este game maravilhoso.\r\nVou de Ti pra Advocacia, um bela mudança.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game while it was on sale for 1/3 of its original price and let me tell you it was SO worth it. if I wasn't broke asf I would buy all the other games ASAP, especially since they're also currently on sale. right now I've only played this game for 3.2 hours but that is DEFINITELY going to change. currently it doesn't seem like something with much replayability, but I'm not even 1/4 done with the game so we'll see if i'm right. plus, even if it isn't replayable, it's still super fun. overall, fun game, worth the price, quite captivating, and a hit with the autists and the geniuses (both of those are me lol). if you're broke like me and you're also an autist with a high IQ, PLEASE don't just ignore this game because it's $30. save up or, even better, wait for it to go on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Engaging, silly, fun, and absurd in all the best ways. About family and finding it in others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend you to all give this a try it has a very compelling storyline so far and very entertaining and engaging especially for those like me who are into solving mysteries and court cases",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of those classics that you hear about from people every now and then and pick it up wondering what the hype's about, only to realise they were ABSOLUTELY RIGHT!!\nIt's very unique in the way cases are handled, especially around the late second game to early third game territory.\nAlthough I will say the game definitely starts to get a little...chaotic... after a point since it goes from lawyer game to lawyer game with ghosts and amulets, but honestly I think that makes it all the more wacky of an experience and gives it a unique charm that you won't really find in other games similar to it. It was the inspiration for a lot of games for a reason and was definitely something quite fun for people who like challenging themselves and having fun!!!\nMy only real GRIPE with it is that sometimes the things you're expected to know can feel a little infuriating, and the occasional extra penalty without a forewarning beforehand CAN get annoying, but nothing that takes away from the experience. Very much recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot has been said about this trilogy, I do not think I can add anything meaningful. I bought this game In the peak of Nintendo DS life (it was secondhand and cheap) and promptly forgot about it: I rarely play visual novel games. One evening I was bored and decided to try this game for the lack of anything better to do. Next thing I knew it was 5 am and I had exactly 2 hours of sleep left before going to work.\n\nNeedless to say, the moment the trilogy appeared on Steam I bought a copy for full price, no questions asked. It is actually very easy to describe the game: have you ever read Perry Mason books (or watched the show) and thought you wanted to be in Perry Mason's shoes? This game lets you do exactly that. You play a defence lawyer who tries to defend seemingly hopeless cases by conducting your own investigations, finding clues, and interrogating people on witness stand in the court trying to make heads and tails in non-stop current of lies. \n\nSome of the mysteries are complicated enough to make both Sherlock Holmes and Hercule Poirot really use their grey cells. The characters - even the secondary - are great. There is a lot of humour to keep you at least smiling and enough tragic moments to shed some tears. I would be as bold as proclaiming the series to be the greatest visual novel game.\n\nMy recommendation: even if you do not like visual novels, try this this one. It might surprise you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak. The gameplay is somehow the worst part of it though (or im just stupid heh). The great writing and a walkthrough makes up for it though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\n-Compelling narratives\n-Unforgettable characters\n-The writing is completely insane\n\nCons:\nhonestly I just use a walkthrough for the exploration sections, sometimes it can be so easy to miss the specific pixel you're supposed to click on before you go off navigating the invisible flow chart of places to visit so you can show off a handkerchief to some dude and find out that the murder weapon was actually a ukulele\n\nin summary, I love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game is so Ba-\n\nOBJECTION!\n\nThis game deserves a fair review!\n\nLet’s start with the first part — Phoenix Wright: Ace Attorney.\n\nI think everyone knows at least something about this one thanks to the memes. I mean, come on, we have Edgeworth here!\nBut jokes aside, this is where you learn how the game works, and honestly, the cases are great. Especially the final case (Can't really say any other case otherweise it would be Spoiler).\nCombined with the amazing soundtrack, it’s just a really great start to the series!\n\nNow, on to Justice for All:\n\nHonestly... this is my least favourite part of the trilogy.\nThe only cases I really enjoyed were the first one which was funny even if the music wasn’t quite my thing and, of course, the final case, which had some absolutely epic comebacks.\nOverall though, the game felt kinda... meh.\n\nAnd finally, the grand finale Trials and Tribulations:\n\nThis one? Perfection.\nThe music? Way better.\nThe addition of Mia Fey cases? Brilliant.\nEvery single case felt unique and engaging, and the storytelling just kept getting better and better.\nAnd that ending it completely blew my mind and wrapped up the trilogy beautifully. ;(((((\n\nSo, what can I say in the end?\n\nOBJECTION! Don’t play the ga–\n\nOBJECTION! PLAY THIS GAME!\nIt’s absolutely worth it. I enjoyed every moment, and now I’m already hyped for Apollo Justice!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE the AA franchise. The game that gave me my dream of becoming a lawyer. The OG trilogy is a fantastic game. The remaster makes the graphics nicer and I no longer need to get my old DS up and running to enjoy it! Def an easy buy for me and an easy reccomendation for fans of mystery, drama, and visual novels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME SO MUCH!! I always dreamed of being a lawyer and now only does this game cover the definitions of roles in court and explains how court works, it can also unlock new ways of guessing outside the box. It may cost a lot, however it is definitely worth it if you like games that allow you to critically think, this game is the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game for those who are head over heels for crime and problem-solving. Comes along with an amazing story featuring the legendary attorney Pheonix Wright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute classic.\r\nThe third game alone makes it worth it, but the others are no slouch either (maybe except Turnabout Big Top). Those games really highlight how good sound design can enhance a game to a wonderful level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most lovable characters ever. This is the one and only game where I still developed a soft spot even for the annoying ones (there are many). The soundtrack is very very good, the random noises make the make recognizable and unique. I enoyed it story and gameplay wise, however all three games have their absurd moments. Highly recommended for visual novels and detective lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the last case in Ace Attorney 1 is too long. \nAlso there's no Labubu Phonk so I can't rationally call this a good game. Highly Recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was amazing being able to replay these games once again, remastered on the PC. Thank you for the port.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun, the story is peak, what else can i say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 comedy. cases take a bit of time so the price for the amount of content you get is fair",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "La verdad yo creo que deberian hacer este juego desde el inicio manteniendo todo igual pero en lugar de los sprites y nombres normales hacer que todos se llamen y se vean como Dick Gumshoe, solo por eso no es un 10/10, pero ignorando eso es muy buen juego",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best stories of any game series. Actual peak fiction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been an Ace Attorney fan for more than 5 years now, I bought this collection and the Apollo Justice collection on PC last year. I thought there was a huge disparity in content between this collection and other Ace Attorney collections. Since this was the first modern remaster (not counting the HD version) this was totally understandable. This update brings those extras from the later Ace Attorney releases, which I thought was nice, especially because this remaster is 6 years old now. Not hearing the previous VA after these years would be weird, so I modded it in. This update was magnificient and I can't wait to replay the series in the future.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "AWESOME. Great and funny game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "objection... Edgeworth says calmy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is John Objection and I approve of this game. OBJECTION",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So fun and funny, absolute peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CAPCOOOOOOOM THE CLASSIC VOICES CAPCOOOOOOM WHY DID YOU CHANGE THEEEEEEEM",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "These games are somehow both compelling mysteries and absolute fever dreams and I love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When I bought this game, I was expecting the expertly crafted murder mysteries. I was expecting the amazing soundtrack and the iconic minimalist animation. I was expecting the gameplay centred almost exclusively around saying \"Erm, actually...\"\r\n\r\nWhat I didn't expect, was to become immensely invested in the characters and the games overarching plot. The writing in this game is better than I had ever imagined. If you like murder mystery stories and character driven plots, this is a must play!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HOLD IT!!!!\nEven if you dont like visual novels I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "make another update to change rise from the ashes's name into turnabout reborn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow.amazknh rlly my fav after palestoffies adventures",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've learned the important lesson to never trust an attractive woman",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "edging to edgeworth\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played it for a bit, but I got no objections.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "T&T has some of the best writing I've ever seen holy shit bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sister made me buy it. i edge to edgeworth 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The real perjury, was the friends we made along the way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game made me buy the rest of the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone in this game should be disbarred",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun 100% reccomend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just got accepted to law school. Does this game count as studying?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I need a yaoi version with just Wright and Edgeworth :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "牛比 好玩 Absolutely master piece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i wanna rip my hair out. wonderful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I looove this game. Replayed it like 7 times (love edgyboy <3)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its so peak i love when the gay lawyers start kissing",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "its kind of like mgsv if you think about it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "CLUSSY CLUSSY CLUSSY CLUSSY CLUSSY CLUSSY CLUSSY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AHHHHHHHHHHHHHHHHHHHH LOVE THIS GAME!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game to exist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game easily became one of my favorite games of all time. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "absolutely cinematic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funnuy objectin man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best 100 hours of my life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PROTESTO Ahora si en español",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She Ace on my Attorney till I Objection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh my god, I get it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice game!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good. Very nice. I love Edgeworth ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like game, game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me queer",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fav game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awsome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I FUVKING LOVE THIS GAME RAHHHHHHHHHH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im attorneying it so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game oat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "毫无疑问的经典",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A faithful port of the [strike]dating[/strike] courtroom drama game. Kinda funny that they left the fingerprint taking minigame instead of just autosolving it.\r\n\r\nStill rating down because of Enigma being added to some of their titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring back the original voices, otherwise you can go fuck yourselves Capcom.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I was in the middle of a story and a random update completely changes the voice actor for the titular character? Very disappointing. Objection!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "why did y'all update the sounds effects? let us opt-in to use the classic sounds",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let people choose the original Phoenix Wright voice",
      "voted_up": false,
      "votes_helpful": 9
    }
  ]
}