{
  "positive": [
    {
      "review": "To this day no other game by Fromsoft has mechanics this good. The only problem the game has is that there's so little of it.",
      "voted_up": true,
      "votes_helpful": 50
    },
    {
      "review": "Top 3 best game ever for me periodt! Love this game so so much even tho is hard asf lol",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "If you're hesitating to get the game due to the difficulty, I encourage you to still get it.\n\nElden Ring was my first Souls game. And I think most people agree that Elden Ring is one of the easier entry of this type of games. But Sekiro caught my eye, due to it being the hardest Souls-like game (according to others). And indeed it was hard. I was stuck at the first major boss for a whole week, and I'd attempt to fight him at least an hour or two a day. But after that, everything just got easier. Of course another boss made me quit the game for a while but I came back and beat him, and at the end I managed to beat the final boss only after 11 tries.\n\nStory wise it isn't that strong, but I still find it interesting nonetheless. Combat is top notch and feels so smooth and satisfying. The game feels fair 95% of the time, although there is an optional boss that kinda throws away everything you've learnt so you have to improvise when fighting him. While in other Souls game you can cheese bosses or get overleveled and a super broken weapon to beat them, in this game you can't do all that. You actually need to get good and at least learn the moveset. I did cheese one of the bosses but that still requires you to look at his moveset and time your attacks. At the end it took me around 10-15 minutes to cheese him. If you're willing to learn and willing to be patient, this game will feel so rewarding.\n\nAgain I went from the easiest Souls-like to the hardest entry with no experience. And if I can beat this game, so can you.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "BEFORE YOU READ: THIS REVIEW CONTAIN SOME SPOILERS.\n\nWhen I first played this game, My expectation was this game is going to be hard to complete or infuriating or even insufferable judging by what people has said about this game and those sekiro no-hit bossfight videos. But no one told me that even though this game is hard for beginners, when you start to getting the feels of this game, It feels rewarding. And somewhat satisfying.\n\nOne of the aspect that i really enjoyed from this game is of course: the Deflect Mechanic where you can not only deal tons of posture damage to the enemies, you are also will be rewarded by the satisfying sound of \"TING\" and that sound alone made me want to learn to deflect more often. And this deflect mechanic is really really useful throughout the game when youre encountering enemies or bosses. Hell the game even encourage you to use this mechanic to the fullest so that you can enjoy the full potential of this game. (except youre that kind of person who does things differently which i respect, srsly tho no offense youre cool sauce.)\n\nThough I do have some critics for this game and it's mainly for the bosses and some areas that i don't quite enjoy. One of the bosses that i really am not keen to it is the Guardian Ape and the other Ape that you'll meet in the Poison Pool, I really don't know why they decided to put TWO giant bosses that has hard to predict moveset and they deal a lot of damage to you, And not only that, they throw sh*t at you lol. and the areas in this game are somewhat easy to just run pass through everything since you has unlimited stamina, which makes exploration a bit weird? not to mention theres hordes of enemies in some areas like at Mibu Village.\n\nAnother thing i liked in this game is the Shinobi Prosthethic where you can fully utilize these tools to beat the enemies, one of my favourite is the umbrella one and the firecracker. They both are very useful if you know how to use it making each fights feels strategic and very engaging to do. And if you've leveled enough skill points you can do sick combos with the Prosthethic making you feel like an actual Shinobi.\n\nAnd lastly, the last boss. Pure Cinema. Just 1 on 1 between You and the leader of Ashina. In the field of silvergrass, wind dusting through your ears. It's so cinematic. The fight starts and all you hear is just swords clashing each other with you focusing when to use your tools, when to time your deflect, when to attack.. AARGGH This whole bossfight is so enganging!! I have finished all of soulsborne (except bb and DeS ofc) and the last boss of Sekiro just beat all of them generally, in term of visual, soundtrack, and the fight itself is so fantastic and well made. I really REALLY adore this bossfight to my heart. it's that good!!\n\nWould 100% Recommend. 9,6/10.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Souls fan since 2011, bought this in 2019 and sold it after playing for 10 hours. HATED IT.\n\n2025 - Literally the best game ever made.\n\nG O A T",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Sekiro is honestly the darkest nightmare I’ve ever loved. This game feels like it was designed just to test my patience, my anger level, and my skill, everything at the same time. Sometimes I die so many times that even I start doubting myself, but then when I finally win… that feeling is unbeatable.\r\nThe world, the boss fights, the atmosphere, everything hits different. It’s beautiful, but it never shows mercy. every enemy teaches you something, every mistake punches you in the face, and every victory feels like you earned it after fighting your own limits.\r\nSekiro is the greatest and toughest game I’ve ever played. It frustrates me, scares me, challenges me, but still, I keep going back because no other game gives this level of satisfaction. It’s pain, patience, and pride all mixed together.\r\nfor me, Sekiro will always be that one game that broke me and built me at the same time.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I'm not joking when I say they might be the greatest single player game I have ever played in my life. Awesome story, greatest combat system I've ever encountered in a game, on my third playthrough and still not bored.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Sekiro is one of my favourite games ever. The combat, music, environments, lore, characters; everything is absolutely incredible from top to bottom. I've played through it multiple times and 100%'d it years ago, but I still come back periodically just to replay some of the boss fights and I'm always impressed with just how much I remember from pure muscle memory alone. \n\nI've seen some people call Sekiro a rhythm game, owing to how you sometimes wait for the enemy to attack to deflect, but I have to admit that's only half the battle. The game actively rewards you for putting pressure on the enemies with the posture system. Enemies can deflect and counter just like the player, making the combat feel more like the enemies react to your moves rather than simply dishing out their attacks in the same pattern every time you fight them. Even bosses react if you manage to cut off their combos with an attack of your own, or even move out of the way; [spoiler] Genichiro, for example, can be caught off guard and stumble backwards trying to block if you attack him after his jumping spin slash, just before he does his backhand grab. If you also move away during his big combo, Floating Passage, he'll actually adapt mid-combo and chase you down with his bow instead. [/spoiler] Many of the bosses even follow up on their combos differently depending on if you deflect, block, Mikiri Counter or even jump counter their final attack. It's honestly really hard to put into words how cool I think it is that enemies react so varyingly just by how YOU react. \n\nCompared to its Souls cousins, the game is far more linear and personal with its story, and if you expect more than some minor variation of katana combat, you'll probably be disappointed expecting something as diverse as Dark Souls or Elden Ring. Despite that, the Combat Arts the game gives you are each extremely cool and add some extra spice. I still would've liked some kind of hotbar or selection wheel to switch between these mid-combat instead of having to go to the menu to switch them out. \n\nSekiro also doesn't overstay its welcome, being just concise enough to have every location be relevant while also being expansive enough to reward you for exploring them thoroughly with cool items and even new prosthetic tools and NPCs (we love you Kotaro). You do however revisit some of the locations, but the game manages to freshen them up to make it interesting still. I also can't overstate how cool the music is, Yuka Kitamura absolutely killed it. \n\nI honestly could go on and on about how much I love this game, but I feel like it would just be a wall of text, more than the one I've already written. All in all I obviously recommend you get the game. There's a good reason why this game won GOTY, even while developed alongside the much bigger Elden Ring (which also won GOTY 3 years later).",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best game I have ever played, and the combat is entrancing",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Hated it at first but ended up loving it once I figuered out how the parry system works. 10/10 game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b] TLDR:  7.5/10. Extremely good game with a refreshing combat system and phenomenal voice acting to carry it's decent plot. Definitely recommend after you play games like Khazan and Lies of P to get used to the Souls-genre! [/b]\n\nBREAKDOWN:\n\n[b] Visuals: 8/10 [/b]\n\nFor 2019 standards, this game looks phenomenal. I especially love the fire and palace sequences, where it almost looks lifelike. The only reason why it doesn't get a perfect score is because some of the cutscenes are not quite up to par and it's lacking a bit of visual diversity in terms of settings it could've explored.\n\n[b] Plot: 6/10 [/b]\n\nWhile not the game's strongest point, it's a small, intimate and compelling story that is marred by FromSoft's idiotic way of storytelling. I don't understand their overreliance on having you read through text from items to understand what's going on around the world and expect you to remember everything during the entirety of the playthrough. I am one of the many who didn't understand what the HELL was going on during the final battle \"twist\". Alas, compared to the clusterfuck that was Elden Ring, this one was much easier to understand and appreciate.\n\n[b] Character Arcs: 8/10 [/b]\n\nMuch of the game's good plot is carried by the very compelling character arcs that unfold. The game treats it's characters in a very mature light and all of their respective arcs feel VERY deserved towards the end of the game.\n\n[b] Voice Acting: 10/10 [/b]\n\nThe best part about the game, hands down. The voice acting carried the plot in my opinion!\n\n[b] Combat: 9/10 [/b]\n\nOut of all the Souls-game I've played so far, this is my favorite combat experience by far! Having the posture bar be much prominent in fights than the health bar makes it an extremely immersive \"samurai showdown\", because you can't run away and heal without the enemy essentially \"gaining back their health.\" I would've given it a perfect score if not for the fact the game feels a little bit too reliant on the parry mechanic and doesn't have any much in the terms of combat versatility.\n\n[b] Open World: 6/10 [/b]\n\nThe open world is vast, albeit a bit sparse in content, which I found a tad bit disappointing. The side quests are largely what brings the score up here, because I thought they were fun and added much texture to the main story.\n\n[b] Music: 8/10 [/b]\n\nThe music is overall excellent and extremely high-octane, which serves it very well in the boss fights. However, one gripe I have with it is that the music that plays during mob encounters is quite frustrating to hear after the 50th time and I wish there would've been more diversity in that aspect.\n\n[b] Progression & Systems: 8/10 [/b]\n\nThis game's progression and power curve is almost flawlessly handled and the skill tree feels very impactful to put points into. The only small gripe is that some of the master skills take a little bit too long to farm up and aren't that useful, which sort of makes the time investment of grinding to them feel pretty bad. Additionally, I found the ability to pause between boss fights kind of janky as well.\n\n[b] Grindiness: 5/10 [/b]\n\nFor a FromSoft game, this game is surprisingly not too grindy. It's still annoying that this game feels very inaccessible without external content helping you out, but it's much better than the abomination that is Elden Ring.\n\n[b] Enjoyability: 9/10 [/b]\n\nLooking back on my month long journey playing this game, I was extremely surprised by the polish and the fluidity of the combat mechanics of this game, it's truly revolutionary for its time. The beautifully designed combat system with the compact, intimate plot and the incredible voice acting make this game an absolute treasure to play and I look forward to coming back to this game in a few years time to relive this experience again!\n\n[b] Bonus: [/b]\n\n[b] Boss Recycling: -3 [/b]\n\nEven though it pains me to do this, I feel like it wouldn't be fair to take some points off for some major bosses either being recycled or just straight up showing up again without changing much. This game is seriously close to lacking some real boss versatility, but it's saved by the grandeur and impact of it's best bosses.\n\n[b] TOTAL: 74/100 [/b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best game I've played. It was very hard for me, being my first souls-like ever. I had to take pages of notes on all the bosses, watch videos of others doing the fights, and memorize the enemy combos and different attacks and how I needed to react to it. You should go into each fight being okay with dying, and view each attempt as a learning experience. It will test your patience, skill, and ability to be strategic and plan how you'll approach the fight, and it's great to watch yourself improve as you keep practicing. By now I've got 100%, I've done all the gauntlets and am on New Game +4, and beating it after struggling is very satisfying.\n\n If you're stuck on a boss, go to bed and let your brain rest and encode what you learned about that boss today, then try again the next day. You will probably realize you did learn a lot by sleeping on it, and will be performing much better. This isn't really a game you can play when you're tired, hungry, sleep deprived, or in any sub-optimal state like that, you need to be rested, be very alert, have good reaction times, etc. One of the most important things in order to do well in these boss fights is to remain calm and not panic. The more calm and composed you are, the easier it is to deflect properly and react in the best way to each attack.\n\nThe art style and graphics are amazing, and you frequently come across beautiful views of mountain ranges, giant cliffs, and vividly colored trees and leaves. While the combat is clearly the star of this game and what it's known for, the story is also good, and I've grown to appreciate the story more on repeated game cycles, now that I'm comfortable with the fights.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had 100% this game on Xbox with Demon Bell on the entire time. Now on pc I play on and off randomly. This game is great, it is very hard to get used to but once you do, it provides a gaming high that no other game will give. For a long time after I beat the game I couldn't fully enjoy any other game for the sole reason that it is not Sekiro. I never beat the Shura gauntlet, but the other two were great.\r\n\r\nMy problems I have is that NG+ doesn't offer much. DS2 did NG+ best in terms of Fromsoftware and I wish they'd do that again. Also, this game never got an expansion, we got gauntlets and Sakura Dance, that's all. I understand that Sekiro was being made just so players had something before Elden Ring. GOTY should've been a wake up call to give this game some more content. But, it is what it is. I love this games combat nonetheless.\r\n\r\nDo I reccomend this to others? If you're bored of the Souls-Like fomula and want a challanging yet rewarding game to play, Sekiro is it without a doubt. Beware, Sekiro withdrawl is a thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best combat systems ever with beautiful graphics\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game that I have ever played. Miyazaki personally came to my house and kicked me in the nuts every time I died to a giant, shit-slinging gorilla.  Beat it six times. Masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One word for this game - Masterpiece ✨\n\nThe story is good but isn't the main selling point here, it's the gameplay it provides. It's easy to learn but hard to master, just parry with perfect timing and boom...enemy is down for the deathblow, you don't even need to attack, just parry. The fights feel very cinematic specially with those satisfying perfect sword parry sound.\n\nThe game might feel unfair at first (I rage quitted myself on the first mini boss which was optional) but once you get a hang of mechanics, the game starts getting interesting. You will die 8352 times to a boss just before inally defeat him , you will understand that all the previous attempts were just preparing you for the real battle.\n\nSo just don't hesitate to loose, because as you all know...\"HESITATION IS DEFEAT!\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed Sekiro. The combat is intense, the world is beautiful, and every victory feels earned. Great game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have never at the same time been so engrossed yet so infuriated at a single game before in my life 😂. If you are looking for a challenge this game will definitely test you to your limit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "“10/10 – Teaches patience, discipline, and how to scream internally without moving your face.”",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great rhythm game. Only game I have that I bothered getting all the achievements for. \n\nI will say however, the intro to the game is ROUGH for a first timer. \n\nSPOILERS:\n[spoiler] The Ogre fight at the start is not a good first mandatory boss, I really don't know what they were thinking. Same with Blazing Bull, I would argue that he isn't a good boss period. Even Hirata estate is a PITA with the Juzou fight. Once you beat bull and the game opens up, that's when it gets amazing. Genichiro might be one of if not my favorite boss in any game.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly Activision should have put all their effort and support for Souls like games as this. Sekrio is not only good its one of the best souls like experiences ever made. Not only is the story, gameplay and music score top notch but the game as a whole feels like an endless experience. It's also one of the few souls like experiences that never required DLC because the base content is perfect for what the genre is trying to achieve. \n\nWill never get near perfect souls like adventure games like this anymore and I wish we lived in that era again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Combat is addicting once it clicks but itll kick your ass before that. Still improving at this game after a few years and its just so good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "died for 3 hours straight on the chained ogre i thought he was a boss turns out he is a mini boss i just suck the only way i beat him is because i listened to the angry birds i will survive 10/10 game would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Sekiro: Shadows Die Twice is a masterpiece with beautiful and awesome aesthetic, challenging and rewarding combat system, and difficult but fair bosses. Its gameplay is a defining characteristic for FromSoftware and a peak of their achievements, particularly in mastering the active offense/defense gameplay loop, which I note is unique compared to other Souls games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game with a lot of options and hard bosses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is hard its normal because its souls like but for me this is number 2 of the best souls likes \r\n{my opinion]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steep learning curve, but amazing skill progression once you understand the basic mechanics. Your mileage may vary, but the game gives you enough tools to maneuver past and excel at the game despite how \"difficult\" people claim it to be. \n\nDon't just tap tap tap, use your head too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro is a really difficult game, but if you push through you'll find one of the best combat systems ever created, one of the best parry systems and an actual good story behind it. This is, in my opinion, the best game From software has ever put out, it's almost perfect. It's small, has very few flaws, it's compact, and it does what it needs to do perfectly. \n\nThe enemies are difficult, engaging, awesome and their AI is quite good as well. The story, unlike in other From Software games, is clear, and unsurprisingly enough, it's awesome. This goes for all the people that claim the obscurity in the other games somehow makes them better... No it doesn't.\n\nThere's not much more I can say about it, if you're looking for a really solid 9/10 game that will drive you nuts trying to beat a boss but at the same time bring you tons of enjoyment upon completion, this is the one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the drifting silence between heaven and earth,\nwhere cherry blossoms fall like quiet memories of battles long forgotten,\nI came upon Sekiro: Shadows Die Twice.\nI was but a wandering soul then — a blade without purpose,\na warrior without a master,\na heartbeat lost in the storm of life.\n\nYet this game…\nthis path,\nthis trial of steel and spirit,\ntook me by the hand as though it were an ancient mentor\nwaiting centuries for my arrival.\n\nFrom the first clash of swords, I felt it:\nthe tremor of destiny awakening inside my chest.\nThe rhythm of combat became a poem,\neach deflection a syllable,\neach strike a verse carved into the wind.\nDefeat was not humiliation;\nit was a sacred teaching.\nVictory was not pride;\nit was a whisper from the ancestors.\n\nAs I walked through Ashina’s dying valleys —\nmist curling around my feet like forgotten prayers —\nI felt my own burdens grow lighter.\nFor in every boss, I faced not an enemy,\nbut a shadow of myself.\nFear. Doubt. Impatience.\nI struck them down one by one\nuntil all that remained was a steady heart\nand an unwavering blade.\n\nSekiro did not simply change my days.\nIt reshaped my spirit.\nIt reminded me that even the fallen may rise again,\nthat even a lone wolf wandering through ruins\ncan rekindle a fire strong enough\nto challenge the gods themselves.\n\nSome say a game cannot heal.\nBut I say this:\na story can save a man,\na challenge can sharpen him,\nand a journey —\na true journey of blood, will, and rebirth —\ncan reach into the chambers of a tired heart\nand awaken a warrior long thought dead.\n\nI believe anyone who steps into Sekiro with honesty\nwill leave it transformed.\nPerhaps not lifted from all darkness…\nbut armed with courage to face it.\nFor this game teaches the greatest lesson of all:\n\nA blade may break, but a spirit tempered in hardship\nbecomes unbreakable.\n\nTo those who seek glory,\nto those who seek meaning,\nto those who are lost:\nWalk this path.\nAccept its pain.\nAccept its beauty.\nRise again and again\nuntil you stand taller than the mountain peaks of Ashina.\n\n10/10 — A masterpiece worthy of poets, warriors, and wandering souls alike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kılıç saplama animasyonları haaarika. Özellikle kılıçları parrylediğimiz kısımlar çok tatmin edici. Fakat iade etmek zorunda kaldım. Neden? bilgisayarım 1440x900 olmasına karşın, monitörde oluşan siyah şeritlerin çözümünü bulamadım. Birde, Ps4 gamepad in de ara sıra sıkıntılar çıkıyordu. Oyun zevkimin yarısı düşüyor. Bu oyun indirimlerde 30 doları görüyor ve birazcık fazla olduğunu düşünüyorum. Fakat yine de mükemmel bir deneyim olacak. Yani ben bile tam olarak bu durumları sevememişken ve souls oyunları sevmemişken, bu oyun çook iyi gözüküyor. Şuanda bile 9/10 u hak eder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game starts out as one of the most challenging I have played; but once you have become accustomed to the blocking system it starts to click in a way that other Fromsoft games don't.  It is a truly beautiful game that can be VERY challenging, but if you can stick with it, it IS that challenge that makes it so fun, well that and the huge monkey.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, do not hesitate to buy it during a promotion! Hesitation to buy this game during a 50% discount is a waste of money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games. very challenging, but extremely rewarding when you get passed a boss thats hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend. The controls are representative of perfect simplicity and fluidity. It is on par with if not better than Elden Ring in my book.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Si busca un verdadero reto, este es tu juego, historia interesante, buen sistema de juego y dificultad alta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, easily within my top 10 favs of all time now\n\nWas my first (real) 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played before on my console but never completed, so was cool to come back and 100% the game here on my pc :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already completed it on xbox once (100%)\n Sekiro has one of the best combat systems not only in fromsoft titles but in the whole gaming space. Great story, great combat, great visuals, but dont forget it its also one of the hardest souls games and its more of a soulslite then a soulslike. If you are unsure if the game is for you and your not from germany, try to beat the free steam game Kanagi usagi first to see if you can get used to the combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Parry parry , die, come back, parry parry die. Git GUD. Ninja tool, grappling hook, Gourd Seed Mommy. Need I say more? Buy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. You can't go wrong when you choose this game but you CAN go wrong in the game enemies make a mess from you any time. Not only bosses but minibosses feels like a nightmare sometimes. But if you beat them somehow it's the best feeling in the world. 9.5/10 only bad thing is there's no Sekiro 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a fu**king badass game. The start was a bit painful, almost broke my controller. But the end fight was badass, and I got good, learned all the mechanics, very easy to master once you've learnt it. Also, Isshin is the best boss fromsoftware has ever created.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(MY FIRST SOULS GAME) Just finished my first ending, planning to do all other ones as well. Here is my complete review:\r\nThe game is pretty good, as much as people say, unlike other souls-like games where you grind your character, in Sekiro you really just need to learn a few mechanics, master them and then apply on complex fights. Gameplay wise, it is the one of the if not the best games I have ever played, just too good, dont know what to say. It is hard for sure, but I do believe it is either exaggerated or I was just good lol. I do not want to give any tips as you should play and learn yourself what to do that would be way more fun, but definitely look for Sekiro Guru guides on some troublesome bosses/mini bosses. This is a fast paced souls like and because of that some people dont even count Sekiro as a soulslike because you can potentially get the shortest ending in 20-25 hours in your first playthrough. So if you like games where you grind more, spend more time have fun just by playing the game, then you may look for other soulslike games, while in Sekiro you can still grind, as I said before, grinding is not really so necessary, all you have to do is learn and master mechanics of the game and then you can 0 hit the hardest bosses. It is a game where you really dance with the enemy in sword fights. Overall, one of the best games I've ever played, so I recommend it if you like sword fighting games, where you actually focus on fights and bosses rather than pure level and grinding based games. \r\n\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying (CAMERA ANGLE IS THE BIGGEST ENEMY, EVEN IF IT IS NOT A BUG.) \r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10 (The game might not have best graphics, story, audio. But gameplay is really off the charts, I might be glazing it, but that is the truth. The game is definitely 10/10, IF it appeals to you)\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I have brought across all platforms and still enjoy this game start game after game. Wish they come up with a 2 already. Anyway great game! love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favorites. It has a very arcade feeling to its gameplay loop, so you're in for a plug and play kind of experience. You won't have to worry about complex storylines, just deflect and parry your way through purification ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best combat systems that is fun, engaging and rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "110% deserved game of the year. This souls like has no parallel when it comes to sword combat.\n The dopamine hits hard when you get so good you don't even get hit, not to mention the sound of the perfect parry when you get it down.\n The bosses in this game are also a genuine challenge!! Unlike most Fromsoft games, this is one of the most challenging to get the hang of.\n You may ask why, and the answer is simple, build crafting in this game is toned down significantly compared to other souls/souls like games which means.. you have to get good to beat the game, especially if you don't use parry assist AKA Kuros charm. \nAlso, this game is a very rewarding experience, every boss from the start feels like an obstacle first time around, so it feels good to finally beat them after grinding and getting to know their unique move sets.\nAll in all this game is easily a 10/10 due to the amazing mechanics, the spectacle of the boss fights and the gorgeous map design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite soulslike. I don't care much about mythological sengoku japan aesthetic but combat is so fun with clear animations instead of flashy effects. I love parrying over and over. It isn't as replayable as other soulslikes  but the hours spent are very fun... except for headless enemies  and the demon of hatred i just skipped them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the mechanic parry,its totally awesome game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played a bit love it loaded in fought chained ogre for two hours so far hardest thing love the parry system its a perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a game which forces you to . get better\r\nand says ez nooob.\r\nlmao very annoying not for everyone i mean i like souls game but this ismdown in my list \r\ncuz im so bad :( prob gonna grind to get better <3 then at my job interview ill show this so they know my hands good lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1st \"soulsbourne\", \"soulslike\" game ever. Really fun and cool, great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent, satisfying stealth and combat. Beautiful environments. One of FromSoft's masterpieces. \r\nThough the combat will take some getting used to at first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and satisfying. The deflect mechanic wasn't as hard to learn as I had initial thought it would be. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came to Sekiro as a mid Dark Souls/Elden Ring player. I put this game off for a long time because of the infamous difficulty and punishing combat system.\r\nAfter putting 192 hours in, I am now pretty skilled, and I don't think I've ever played a game with a combat system this satisfying. The feeling of improving your own skill rather than heavy RPG character building elements is also very unique for a game of this kind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how fromsoft did it, but they turned the souls-formula into a rhythm game. And now it is one of my favorite games. I've gone back and played it multiple times on various consoles and enjoy it more and more with every playthrough. It is very unique from the rest of the fromsoft titles and feels incredibly polished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best combat systems I was ever able to enjoy.\nMore fun than Elden Ring and all other Soulslikes imho.\nParry & Mikiri > Dodge & pretend parry\nPlus you fight actual enemies instead of weird incest abominations here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unlike other souls game its not just dodge and wait for opening.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro has some very minor flaws but it is the best game i have ever played. Locations, skills, epic bosses and most of all, the best combat system i have ever experienced in a video game. I just beat ishin and man did it feel amazing to finally end the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frustration dude Frustration. This game helps you die slowly from inside and it let you cry at night alone with rage of hurting your setup or pass off to bad dreams.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gives me the best gaming experience of action fights . It is very engaging and thought me one thing that never give up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really hard. Probably the most difficult Soulslike by FromSoftware. It is, however, probably the most rewarding one as well. I highly recommend it. Take it slow though. Don't be in a rush to understand how the game works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first souls like, I don't recommend for your first souls like. I genuinely spent the first 6 hours on the chained ogre. How ever its still fun and in my eyes its money well spent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, I just wish there was a sequel that had more proper sword fights in it instead of fighting stupid shit like Headless Ape twice like why would you do that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It will test you as a gamer and as an individual in all the right ways. It is so effin fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very hard, but very cinematic. For me its the best Soulslike game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game play is phenomenal, looks are beyond what is expected of a game this size. Overall 10/10!! Great job FromSoftware",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 amazing game. It's a difficult game, but the story, gameplay, atmosphere, and settings make this game stand alone with it's quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best combat system ever made, great atmosphere, art direction and characters too.\nHighly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first FromSoftware game, beat this game in 24hous with my son. hes 13 and he has done most of the part. It is good memory in my life. Highly recommend this game even no Ultrawide support tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful setting and more fun than Dark Souls. Glad that they have a tutorial in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I suck at this game so after two years I had to get my best friend to beat the final boss for me because im trash at the game. Its an amazing game tho cant lie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing all souls games but Demon Souls, i would say that this game may take the cake, even with Elden Ring taking the world by storm. This game is just like climbing up a mountain, getting ready to jump but some random citizen sees you and saves your life. Like you are drowning and a lifegaurd saves you, this game is comparable to the day i was born. This game cured any and all disease ive had, should fromsoft release a second sekiro game? Yes. I wouldnt see why not, this game is the perfect souls game, you cant spam, you cant hold block, but you have to incorporate every mechanic that is brought upon you. This is the peak of souls game, I love Miyazaki, if there was a second Sekiro, or a game that follows the same principles of mechanic that this game does, i would explode, with the amount of joy that Miyazaki brings to me. I love you Miyazaki, please make Sekiro 2, thank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only fromsoft game I enjoy. It actually feels like a game made for you to have fun instead of a boring open world with retarded boss fights where you have to dodge roll a billion times to win. You have parries,counters and finishers and your character actually feels powerful when you learn the mechanics of the games combat. I wish fromsoft added more gore and dismemberment in their games to make the combat feel more visceral. As it stands it's a great shinobi/samurai souls-like game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game while it was on sale, enjoyed every bit of it, got perfect game today, and I must admit it was immense fun and it is an undroppable game, I am still going to continue playing, can't have enough of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best combat system I ever played in a game. The game would be better than elden ring if there were more bosses and if they were more interesting. Sword Saint Isshin way better than any boss from elden ring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, i hop on it sometimes when i am stressed to dance with the swords and kill evil people :))))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game broke me so hard it did a full 180 to being my favorite game. If you like games like DDR and are a complete weeb, then it's an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro is honestly one of the best gaming experiences I have ever had. It’s a true “get good” kind of game but in the best possible way. Nothing is handed to you, nothing is easy, and that’s exactly why it’s so incredible.\nEvery boss made me rage, every mini-boss humbled me, and every new area felt like some fresh form of punishment designed personally for me. But the moment you finally learn the patterns, tighten your parries, and land that finishing blow? Pure dopamine!!!\n\nThe combat is sharp, fast, and brutally honest. If you mess up, it's on you. If you succeed, it’s because you earned it. That’s the magic of this game, it makes you better not just in skill but in patience and mindset. \n\nThe world is stunning, the soundtrack is perfect, and every encounter feels handcrafted to push you just past your limit. It’s challenging, it’s unforgiving, but it’s also insanely rewarding. Once you get that “I understand it now” moment you will feel unstoppable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very fun and challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro hits hard and feels great to play. The combat is fast, simple to grasp, and tough to master. Boss fights are fair and satisfying. The world looks good and stays focused. Definitely one of the best action games out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elden Ring is the only Souls game I've played, but this one is much more my pace. While the world and build diversity of Elden Ring is great, in Sekiro the combat is far better and encourages skill expression, with a perfect mix of attacks, abilities, blocks, parries, dodging, jumping, stealth, and item usage. The story is also delivered in a more digestible manner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "look this game has an amazing story and the best combat to exist but to REMIND you this is the hardest souls like game PERIOD. you will struggle, cry, and get pissed the f off. You need to be a serious gamer to even have a chance good luck you will need it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro has the best and most satisfying combast system in the game world for now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Words cant describe how good it feels to play this game. Honestly a real FromSoft masterpiece and I love the complete 180 and innovation to the SoulsLike genre. 100% was not much of a problem and similar to the souls series, it requires at least three playthroughs and probably a guide to finish it but its genuinely so worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely my favourite game of all time now. If you enjoy thoroughly well-made games, to the point where they're pieces of art, you'll love Sekiro. The important thing to remember is that this game isn't about instant gratification, but learning valuable lessons from the bosses you fight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game, nothing else to say just play it if you never tried it. \r\n There is a strategy for any enemy or boss. Playing smart is rewarding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a GOTY for a reason.\nStory is beautiful.\nCharacters are amazing.\nCombat is so refined nothing in the world comes close. \n\ni love this game with a passion and it is more than a 10/10. This is THE best ninja game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very difficult, but super enjoyable once you get the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will change you.  Like taking a huge shit after spending a few days in a desert.  Its hard, but for some reason it feels good for reasons you won't easily explain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever made.  It takes practice and dedication but it rewards you for it.  Hesitation is defeat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for the challenge in combat. Doesn't have a rich story, and the scenery doesn't change that much. Dark Soul's, each area felt completely different from the other. Dark Soul's 1 is still the masterpiece to me. This is a cool game though for sure. Interested in Elden Ring next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games i have played in my life... by far the best purchase on steam. Only real gamers will put effort to get all achievements on this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro isn’t just a great game—it’s a triumph of design, storytelling, and craftsmanship. FromSoftware took the soul of their signature difficulty and forged it into something faster, tighter, and more exhilarating than anything they’d made before. The result? A game that doesn’t just challenge you—it transforms you.\r\n\r\nFrom the moment you pick up the sword, Sekiro becomes a dance. Every clash, every deflection, every perfectly timed parry feels like a spark of lightning in your hands. Unlike other action games, Sekiro doesn’t let you hide behind shields or overpowered builds. It demands mastery, discipline, and patience. And when you finally get it, the game opens up in the most rewarding way possible. Few gaming moments compare to breaking an enemy’s posture and landing that final, devastating deathblow—it’s pure satisfaction.\r\n\r\nThe world of Ashina is equally stunning. From misty temple forests to burning castles and mythical mountains, every area feels alive and purposeful. The vertical movement, grappling hook traversal, and stealth options give the world a sense of depth that makes exploration genuinely thrilling. You don’t just walk from place to place—you swoop, climb, stalk, and strike.\r\n\r\nSekiro’s story, though quieter than most, hits with surprising emotional weight. Wolf’s journey is simple on the surface—save your young lord—but the bonds, betrayals, and moral choices woven into the narrative give every moment gravity. It’s a tale about loyalty, honor, and the weight of legacy, told with elegance and restraint.\r\n\r\nBosses are where Sekiro truly becomes legendary. Each one is a test of everything you’ve learned: Genichiro tightening your fundamentals, the Guardian Ape shocking you with unexpected chaos, Isshin pushing you to your absolute limits. They’re not just fights—they’re iconic encounters that stay with you long after the credits roll.\r\n\r\nSekiro is not an easy game, but it is a fair one. It respects the player. It teaches without words. And when you finally overcome the impossible, it rewards you with a sense of triumph few games can match.\r\n\r\nIt’s not just one of FromSoftware’s best—it’s one of the greatest action games ever made. A masterpiece of precision, passion, and unforgettable moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very smooth and enjoyable combat, bosses are challenging, beautiful world, beautiful voice acting (for Japanese, didn't try English), thumbs up to the guts, 100% recommending this.\nEdit: fuck this game\nedit 2: game is great, but it kinda sucks too because it feels like farming is lot harder than other games because you get ridiculously less XP and gains from level up aren't really game changing, also bosses sometimes seem like are designed to be pain in the ass, not challenging but simply pain in the ass, sometimes bosses just spam spam spam spam and you get to hit once maybe, damage isn't there either, like you can't outscale your opponent that much because you don't get bonus damage from level ups so in the end it just seems like you're forced to fight whoever's in front of you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game with an incredibly fluid combat system that makes every encounter satisfying... once you stop pressing shift to try and roll away and learn how to parry attacks that is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute cinema... even tho it says I only have 8.7 hrs rn here I actually have like 70 hrs cuz of Pirate version of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game!!!!!! I hate Every bosses and I hate every character with a torch or a bell in their hand. Good job!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible combat, many tools that you can use to have multiple play styles, it’s the best from software game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OOOOKAAAAMI! 🐺\r\n\r\nSkill issue game. Best videogame I have ever played with the most satisfying audio feedback and swordplay I have ever played in my life. You need to GIT GUD or you can't beat this game. Simple.\r\n\r\n\r\nWORK OF ART.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished the game yesterday night. I've been wanting to play this game since the release but my potato laptop wont support and after almost 6 years i got to play this. so i have nevery played any souls like games before and this game can be really difficult as learning curve was indeed steep but once you have mastered the parry the combat is so satisfying. you''ll loose a LOT and you have to keep this in mind before you start this or else you are gonna rage a lot. the best parts of this game are the bosses and the combat and I will recommend this if you have patience to study the enemy patterns. thororughly enjoyed it and just statred a new game +. only buy this on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is NOT for weenies. And I am a stupid loser, and an unlovable weenie freak. I'll never beat this game and as a man this hurts my \"gamer\" soul.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "tf is wrong with this games resolution? tried fixing it through nvidia app, graphicsconfig, unplugging display port and plugging it back in, which actually got me farther than anything else, atleast i could see more than 1/4 of the screen. but then i try to adjust in game graphics settings to match my resolution and it doesn't save, try to start a game and its stuttery as hell to the point of being unplayable. How is this game 6 years old and cant fucking run? refund",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game so far but I have issues with launching the game a lot of the times. For example, if I connect my controller AFTER launching the game, the game will be screen-locked and I'd be forced to restart my PC because I can't tab out or even close the game. Sometimes, the only thing I can do is Alt+F4 and restart the game when this bug occurs.\n\nOftentimes, the game will get stuck on a black screen and I'd get a message prompt saying that the application isn't responding which also forces me to restart my PC in order to play. Another bug is sometimes when I'm in game, I can't tab out from the screen or even use any keyboard buttons such as Print Screen to take screenshots.\n\nWhile I am enjoying the game and find myself constantly thinking about wanting to play it on the weekends, I can't recommend it in its current state unless you're okay with possibly being forced to put up with all these bugs.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Too repetitive, both in terms of gameplay and scenery.\n\nAnd in comparison to DS1, DS2, DS3, Bloodborne, and Elden Ring, there are no particularly exceptional OSTs. On the contrary, I found the music that plays during each battle or mini-boss fight quite annoying compared to the calm or sad ambient music of Dark Souls and others.\n\nThe different locations are too similar, making it difficult to be interested in exploring them.\nI also find that the grapple and overly rapid movements make exploration less interesting.\n\nThe style is also sometimes a little too colorful and flashy.\n\nEven though the FromSoftware/Dark Souls style is very prominent, certain elements gave me the impression of an Activision triple-A game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game launches with a myriad of graphics issues. Have attempted multiple different settings and recommended fixes just to be able to play the game with zero success.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts off great but the jank of platforming and hitching during combat throws me off and after having to use a guide to even see where I had to go next and STILL getting lost I got fed up with this game. Would kill giant snake again tho 6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is ok, story is good but the dissonance at what you can and cannot do or physically handle is lame. I've beaten the game before but I'm still annoyed at the fact that a grasshopper can stagger you while you can parry attacks from giant monsters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "(bad)\n- poorly implemented stealth but you're heavily rewarded for it. It's bad in the sense it's not responsive and incentivizes standing still for I kid you not 30-60 seconds waiting for enemies to de-alert\n- Bad group fighting\n- Just terrible camera controls for PC. No options for target lock on. No excuses for not being able to unbind the mouse movement. Can't even mod it to work. Horrid\n\n\n(minor gripes)\n- Requires mod ran every time for borderless window, fixing the camera snapping, and looting (minor gripes)\n- Dragonrot tears being finite pisses me off \n\n\nI will continue playing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the least fun I've ever had playing a video game. Maybe it gets better after a while, but I don't care to know either way",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is a solid  game with awesome graphics as you would expect from FromSoft. However, it is a console game they overlaid PC keyboard play ability on too. I'm a PC Gamer and don't have a game console. The game's sword parry, deflection, and dodge mechanics require being far too good with heavy penalties for dying and very little resources for healing. You may have to plan on restarting with a new game several times unless you are a natural speedster. Also, if you die, you have to do the entire area over. You don't get to pick where your save points are.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good parts: i commend them for releasing a game that isn't a soulsborne. All enemies are new which surprised me and i don't expect originality coming from fromsoft. The game does feel good to play when it all works, and it looks like there is a cool idea beneath the bad stuff.\r\n\r\nBad stuff: 60 fps locked in current year. If a mod can easily bypass this, then this can be added by devs. For me this is enough of a dealbreaker on its own. The option menu is abysmal, and although performance is not as atrocious as Elden Ring, it's unacceptable for a game that looks as this one does.\r\n\r\nPosture system is a neat idea but in reality it doesn't. Your own posture barely matters, most enemies can't punish a posture break and it takes less than 2 seconds to recover by just holding block. On bosses it matters but not as much as damage. You can kill a boss by depleting the posture, but for posture to not deplete fast, you need to deal damage first. So it ends up feeling like posture damage doesn't matter for a good chunk of the fight, and then damage doesn't matter. I get the idea but it's badly executed.\r\n\r\nFarming is waaaay too encouraged. If you have a ton of experience you are encouraged to farm till your next level or you risk too much if you die. Gold pouches seem like a system that only feels bad. You don't feel smart for paying the 10% tax to save your gold, losing it feels bad, using the pouches feels bad. It's not like gold is super necessary, it's just there to make you feel bad about dying. More than a soulslike. XP tree is bloated with things just to encourage farming. Shinobi tool upgrades require a ton of materials that are rare drops on specific mobs. There are literally consumables to help you farm. Why not like, remove this entirely from the game? It adds nothing and makes everything feel worse. You even have to farm your revives, so you'll be attempting a boss, you don't have your 2/3 revives, you need to go out, kill some trash to farm your revives, to go back to the boss and lose the xp and gold you gathered while farming.\r\n\r\nWhich gets us to the next point. The trial and error is replaced by a easier game where you are punished a lot for failing. Consumables are super op, tools are op, revives are op, you get too much healing. You can pretty much bulldoze your way through the game as intended; or you can try to learn bosses, try to defeat them cleanly and meanwhile feel that the game is angry at the way you want to enjoy playing it. At least dragon rot was partially removed from the game, holy shit, what a dumb mechanic, it's like these people forget all the mistakes they already made, insane that it didn't get completely removed.\r\n\r\nQuests and story as incomprehensible as ever, but if you like following a guide to get the endings power to you. Exploration is a bit messed up with places getting up to 3 different states and loot shifting around, but that's not a biggy.\r\n\r\nBosses are pretty good for the most part, really low amount of bullshit, even if you are trying to properly learn them. Barring a couple of bosses that go against the main design of the game and are just tanks you have to hit 300 times and you are discouraged from parrying. It's like they have a dumb ideas for bosses quota and they need to hit it.\r\n\r\nSo yeah, i know these games gather the most undesirable people whose only form of self validation is being able to beat a kinda hard game and they can't have a different opinion pop up on the steam reviews. So kindly, fuck off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Usually challenging games make it fun to develop the skills needed to play it. Fromsoft games seem to take the opposite approach: make the player miserable until they can rise above the challenge, and punish the player for needing to learn. Sekiro is no different. I haven't encountered a boss in a couple of hours because I'm stuck exploring this vast area with lots of dangerous enemies and no checkpoints. Sneak past them? Sure, maybe a couple. But when I need to enter a cavern guarded by 5 enemies, or when the way forward is guarded by monks with spears that do half my health bar with one hit, it's just not fun. This game doesn't make me want to get better at it, it makes me want to quit. The realization that dragonrot also punishes you for dying by denying you the ability to do side quests? Yeah, I'm done with this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm going to go against the grain here - In my opinion, this is the worst game from FromSoft. The need to mod the game so I can play at more than 60 fps on PC is ridiculous. The inability to customize your character, adjust your build, and take a little break from pressing parry 200 times every fight and for example doge, is exhausting. I love the Souls genre, but this just didn't hit the spot for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For people who are fans of very hard games, this might be it for you. But be warned I've played Silksong and Dark Souls and liked them just fine.\r\n\r\nFor me there's just too many frustrating issues with this game.\r\n\r\n___GAMEPLAY____\r\n\r\nFirst off, there's very little choice in how you engage with the combat or the world. It's one of the most linear games I've played in a long while. \r\n\r\nHow the game GENERALLY work is as follows, you, the player, will enter an area, where there's a set number of enemies, you can't really attack multiple enemies at once, since they'll just gang up on you immediately, so 1-on-1 is definitely preferred, occasionally you can deal a couple of the weaker enemies at the same time, but generally you definitely want to sneak around and stealth kill.\r\n\r\nThe stealth is half baked and feels on rails, sometimes enemies can spot you a mile away and run ALL the way to you, other times you can shank a friend of theirs 5 meters to their right and they'd be none the wiser. It really depends on if you stealth kill the enemies in the correct sequence. This can be a very lengthy process and you're gonna do this A LOT in each area.\r\n\r\nThe combat is too much waiting and either parry/jump/dodge (except dodge is super nerfed in this game) depending on the attack animation. You have very little agency in controlling the battles you are almost only reacting and never acting, it's like one long randomized QTE you have to endure. This is to the point where the miniboss battles I did endure to beat was not enjoyable or fun but just a chore. \r\n\r\nMiniboss? you ask, why yes, there's two kinds of hard enemies, afaik, minibosses and then regular bosses, the regular bosses will give you a small boost to your attack stat (btw, there's no allocation of rpg stats in this game, so forget about \"builds\") now minibosses are probably gonna take up most of your time, they're basically very difficult enemies with a series of attack patterns that you need to learn 100% or else you'll just die. Mostly you need to learn to deflect when the correct animation plays (which is the vast, VAST majority of combat) to the point it feels like you're playing a rhythm game.\r\n\r\nNow a lot of the combat is supposed to be about reading the animation and reacting accordingly, but do you know what's constantly blocking the camera from clearly seeing the enemy that you're up close to? that's right the player character itself. Then there's the camera who will spazz out when you're in tight corners. and sometimes just not lock on to the enemy RIGHT NEXT to you, and in an easier game I could forgive that, totally, but not when the punishment for death is as high as it is. \r\n\r\nWhenever you die, and you will die, a lot, you lose half your money and a lump portion of xp, which can't be retrieved, it's just gone. Then there's the dragonrot where if you die enough times, which you will, npcs will stop helping you, so you have to spend extra money to fix it in order to progress a story line.\r\n\r\n____STORY AND LORE____\r\n\r\nThen there's the story and lore, I do think there's something interesting about this world and how so many of it's inhabitants are obsessed with immortality, especially the undead monks, were really cool.\r\n\r\nBut I don't care about the main character and his lord (a twelve year old boy with magic resurrection blood), really none of the characters are of any interest to me, except maybe the Carver and the undead training dummy, they're kindda funny. \r\n\r\n____Overall____\r\nAnd that's really the issues I have overall with the game, I'm not interested in getting better in a game, that I have so little stake in. I don't care about the characters or what's gonna happen next to them, the world itself is kindda cool, but not enough to warrant the ungodly amount of hours I'd have to invest in order to \"git gud\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steep learning curve. Permanent penalties that keep stacking throughout the playthrough the more you die. You can't just reload from the last save or checkpoint and try again without consequences.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lacks native support for the 21:9 and controller recognition issue. To get the gamepad properly recognized, I had to unplug my keyboard before launching the game. Unacceptable....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Dark Souls and Elden Ring, but I just can't get into the rhythm and style of this game.  Kind of my fault since it's technically an action game and not an RPG, but I assumed it would be at least somewhat similar to a souls game, and to me, it isn't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this game is SO much fun. Among the most fun games I've ever played. The mechanical experience is damn near unmatched by any video game. But that's it. It's *just* fun, & lacks merit in other departments. Since finishing this game over a year ago, I have not thought about it at all. But, if unlike me, you're looking for a purely mechanical experience, it's absolutely worth playing. \n\nNegative review because it isn't for me. Not a bad game by any means.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hard to recommend this.\r\n\r\nE.g.\r\n- The game is designed in a way to make it very difficult to learn. You have to get good at parrying, and weirdly it offers you very little opportunity to really do that. \r\n- Far too much BS, and far too many situations encouraging cheese.\r\n- OP consumables that trivialise fights, but extremely rare to find so tough shit if you didn't kill the boss the time you used snap seeds.\r\n- Punishes the dying and learning cycle with dragonrot mechanic.\r\n\r\nI did get to a point where I enjoyed the game, but FromSoft really did make it as difficult as they could to get to that point. I'd recommend Lies of P or Khazan over it any day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "john sekiro keeps dashing straight into damage instead of back or left or right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't Buy: \r\n- If you're casual \r\n- If you have a life and a family you must support \r\n- If you contribute to society in general \r\n\r\nUnfortunately, after DS1's difficulty craze, it seems FromSoft's primary goal has been to shit out absolute stinkers. Anyone who has skid marks and sits in their gaming chair all day will tell you to git gud, that it's a skill issue, as if we all aren't aware that they achieve nothing but sinking thousands of hours into a game that rewards their lack of employment. And don't raise your pitchforks, because I'm one of em. \r\n\r\nSekiro is another title that has been plagued. It's manageable for a while - through all the perilous deflects, the prosthetic arms, and the filter mini-bosses. It's immersive, it does stealth mostly right, and the exploration is peak. But at some point along the line, Sekiro becomes less of a fun learning curve and more of an annoyance; with repetitive enemies and bosses that have some bullshit gimmick, a tracking windup, ridiculous attack speeds & aggro ranges, or homing projectiles. And that's what makes it another load of waste born from the FromSoft sewage pipe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Okay a lot of you might not think this is a big deal. Which it might not be. But for me it is a huge deal. This game is a console game. If i was playing on console i would probably enjoy this game. But as it stands. The help tips are in console command. Which i am playing keyboard and mouse. Having to stop ever 5 seconds to look up what the keyboard commands are is driving me crazy. The game seems okay graphics are alright. But key mapping is crazy. I will probably pick this up on my console but i will never pick this up for PC unless they fix the game's help tips for the keyboard commands.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat system is neat. Its enjoyable for a bit but gets really repetitive and drawn out on some encounters.\n\nA lot of bosses have really cheap tricks that they throw at you that feels like it breaks the flow of the combat and I don't find the cheapness fair or interesting. Most of the bosses and mini bosses can kill you in just one or two hits, which makes learning them a painful chore, but of course you need to get about 50 in so that their posture bar doesn't deplete so fast in order to kill them. \n\nPlayer dropoff is almost 50% by the first major boss. For the rest, a lot of players resort to cheese tactics to beat a lot of the encounters, which I think goes against the intent of the game. I get being tough, but I find this game doesn't always play by its own rules. \n\nDespite picking it up a few separate times to give it a fresh approach, each time I find I just hate it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Damn this is cheaper than Where Winds Meet. Is Prob the goat of stealing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so fucking ass bro, the dodge system doesnt work on any timing the parrys do nothing and the bosses are so boring its insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this piece of shit, controller support for this game is worse than OG dark souls. \nDiscussion is full of people trying to figure how to get controllers to work and nothing works, \n0/10, haven't seen this poor support in ages",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly overrated.\n\nAlmost no build freedom.\nNo armor.\nNo weapons to switch.\n90% of pickup items are consumables you’ll never use.\n80% of Sekiro’s prosthetic tools and arts are situational.\nMany bosses completely ignore certain tool effects.\nOnly a handful of arts (Mikiri, Ichimonji, Whirlwind Slash, etc.) feel meaningfully impactful.\n\nRigid, repetitive, emotionally exhausting, far more stressful than fun.\nMediocre at best.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah its a decent game but not worth the money it costs... I would only say buy if on sale, the mechanics can be so clunky sometimes and the bosses are just flat out wayyyyyy stronger than the character like its so bs. I am usually very good at souls like games but I just cant with this game I feel like my characters power is = to a toddler. Another point is that when u die ( which happens a lot) you usually lose like half ur stuff which sucks and theres not nearly enough checkpoints. A very tedious game like this need manual checkpointing. Many things could be better but oh well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ما اعجبني اللعبه سواء من ناحية انك تتخبه او ان يكون بالك طويل تسوي مليون باري وايذا انسحبت كل الباري الي سويته تروح على الفاضي او ان في مليون واحد مع البوس او انك تتخبه وتغدر وان نورمل اتاك نوم واني استثقل اللعب نص ساعة يعني اللعبه ما اعجبتني\n\nتبا للمجتمع لعبتكم خايسه",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Refunded, stuck on 60FPS, plays like a ps2 game. SCRAP!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overrated filled with annoying back and forth parrying, clanking and a stupid guard break system...not a Soulslike",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very fun very satisfying can't figure out how to combat roll or whatever you need to beat the chained ogre so we'll see if i play any more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have had more fun dueling the Razor in Slay The Princess than any of the bosses in this wanna-be-tough-guy game.\n\nI will still get to Sword Saint just so the fanboys can't scream \"gIT GuD!!!1!1!!!!\" at me for not liking the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ragequit when the monkey threw shit at me for the upteenth time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too difficult to fight the bosses,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yeah i think fromsoft missed the mark on this one. its just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Miyazaki can eat my banana for dinner.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no asylum demon 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gaurdian ape threw shit at me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i sleep type game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tbh this worst game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Save yourself some headache. Fuck this shit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit map design",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "60 fps gap no shi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuckin cow",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i died more than twice",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful ux",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "|",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To preface this negative review, I no longer have as much free time as I did. I'm about average when it comes to soulslike, I highly enjoy Nioh games, probably my favourite soulslike.\r\n\r\nI got this game as nearly everyone says this is the best game From Software made next to Bloodborne, and went as far as the Ashina Castle rooftops, got killed by the kamikaze guy once and I didn't mind that. What I do however mind about this game, is that every time I feel like I'm starting to have the tiniest bit of fun, the game just shits on it and throws some BS my way. You want to stealth kill, well here's this ranged enemy you couldn't have seen having perfect view of your stealth kill and shooting you in the back, calling in everyone on you. Alternatively shoots a mofo cannon at you. Said cannon somehow going through the mountain. Supposed to dodge the grab attacks by side stepping? Nope, get grabbed. Google it out, oh, jump will dodge it. Nope, still get grabbed. Solution? Just restart until the enemy stops spamming the grab moves. Brilliant.\r\n\r\nIn the past soulslikes there would've been ways to deal with enemies, reliable ones, not just pray you get good RNG on their moves. In the past I would've also just grit my teeth, got through it somehow and that would be it. Nowadays however I value my free time quite a bit more than before, and as such I am not willing to waste any more of my time on being annoyed, angry, and what not.\r\n\r\nSkill issue on my part? Very likely, but that's not the problem here. Problem is I can't even adjust the game to my skill level. I am forced to deal with this BS whether I like it or not, and I'm simply tired of games that do not respect someone's time in such a way. I loved the OG Dark Souls for the fact it was always fair. It pretty much always felt like I died entirely due to my stupidity, not because the game tried to screw me over in every way imaginable. This is something entirely missing from Sekiro. I don't even feel satisfaction when I get through this BS in Sekiro. Doesn't help the fact that the controls have this weird lag to them, something I feel in From Software games ever since Dark Souls 2.\r\n\r\nSo if someone is looking for an overall experience more akin to the OG Dark Souls, this ain't it chief. If someone is looking for a lot of stuff to get annoyed at, you couldn't have found a better pick. Well, maybe outside of PvP lobbies in some games.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is NOT for weenies. And I am a stupid loser, and an unlovable weenie freak. I'll never beat this game and as a man this hurts my \"gamer\" soul.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Sekiro is a great game that suffers from the syndrome known as being apart of the Soulsborne Legacy. That is to say, everything that Sekiro does right feels like an evolution of the Darksouls formula, but fails to let go of aspects that makes it miserable. The game play is excellent- when you already know exactly what to do. The map is well designed - when you know exactly where to go. The game is fun to play - after you've already mastered it. If that sounds nice too you, get it, but I can't recommend a game like that in good faith.\n\nPros (which there are a lot of)\n- Fast and Interesting evolution of Souls-Borne combat\n- Excellent Boss-gated Leveling system\n- Amazing atmosphere \n- Interesting Bosses\n\nCons\n- Weird tacked on Souls-mechanics that detract from the Experience (Abhorrent camera, Weird hitboxes, Souls-esk Stumbling and Uncharacteristic clumsiness, occasionally inconsistent rules)\n- Lack of proper tutorialization/introduction to mechanics (Lightning attacks, Shielded Enemies, Archaic actions required for certain areas of progression.)\n- Very forgettable story with mediocre characters\n- Beginner unfriendly, not encouraged to experiment (Very low heath at game start, Potential to be soft-locked out of using an XP mechanic due to death mechanic, Items made to ease difficulty implemented frustratingly poorly.)\n\nI'd say this game is a time sink, where if you spend the time, you WILL enjoy it, but after 40-some hours, I know for me this is not something I'd recommend to others, nor is something I'd complete without a guide in hand, cheesing every boss I had the mispleasure of facing for the first time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tf is wrong with this games resolution? tried fixing it through nvidia app, graphicsconfig, unplugging display port and plugging it back in, which actually got me farther than anything else, atleast i could see more than 1/4 of the screen. but then i try to adjust in game graphics settings to match my resolution and it doesn't save, try to start a game and its stuttery as hell to the point of being unplayable. How is this game 6 years old and cant fucking run? refund",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sekiro is just not for me. I've tried to play it and have put almost 10 hours into the game and am not even close to halfway through. The game is vastly different to all other souls games and that's okay with me. The style of game play this game forces is just not engaging for me. Don't go into it expecting a souls game like I did. In the past I would put in time struggling with a boss or powerful enemy and would learn something each time and come away victorious. With this game I could do things the correct way and still feel like I've learned nothing. Say I suck you're probably right, but this one is just not for me. Unfortunate, because I have loved almost everything else Fromsoftware has ever done. You guys might love it and to be honest I hope you do. I just don't.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Let's get one thing out of the way first: [b]This game isn't a souls-like[/b], it's its own thing that borrows *some* aspects of FromSoft's other games. There's no co-op, no \"builds\", and your only variety in \"weapons\" comes from the different prosthetics you can unlock, which can serve offensive, defensive, or utility purposes. If you come into this expecting a souls-like, you're likely going to be just as disappointed as I was.\n\nThis game focuses on a very narrow set of skills, and it expects you refine them to a fairly high degree of mastery. You'll be performing more or less the same sets of moves for a majority of the game's run time, barring a few skills thrown in here and there for spice, and bosses don't generally do anything crazy that breaks the \"rules\" you learn fairly early on (bear in mind, at time of writing I still haven't seen the last three non-optional bosses of the normal route). Every boss very much has an \"intended\" way of being fought, although with sufficient skill and/or practice you can work other strategies as well. If that sounds appealing to you, ignore the red thumbs down and give it a try.\n\nEach enemy very much has their own unique rhythm to them, and even the strongest opponents eventually becomes a matter of going through motions like clockwork, meaning the fights will play out more or less the same, depending on movepool rng. Personally, I just found that this meant that once I \"mastered\" a certain enemy, combat in that area became incredibly boring. This is eased somewhat by using stealth to avoid or eliminate enemies outside of combat, but many stronger enemies are purposefully placed in ways that make them difficult to stealth kill. This also becomes a problem with the many (mostly optional) mini-bosses you'll encounter across the maps, almost all of which are recycled at least once. Simply put: if the combat doesn't \"click\" with you, it's going to get repetitive and tedious very quickly.\n\nMoving on to the areas themselves, I personally found them much less visually interesting than the usual FromSoft fare. There are some lovely views in the more mountainous areas, but nothing that really awed me or made me sit and stare for a while. The layout of the areas also feels much more obviously video game-y, especially with the way the grappling hook points are almost always lined up to perfectly direct you towards you current objective. The levels are much more open and vertical than other pre-Elden Ring FromSoft games, but it's marred by the subpar platforming. Disappointed as I am in this game, I'll not say one ill word about Sekiro's combat mechanics. It functions entirely as intended and has a good weight to it. The platforming though? Atrocious. Wolf's jumps are incredibly float and just feel bad. The \"green\" zone for grappling hooks also feels oddly inconsistent, especially for the ones that slingshot you instead of bringing you to a new platform, since it's possible to be on the \"wrong side\" of it without any way of knowing. Ultimately, though, if you're just going in to the game for combat alone, these are minor annoyances.\n\nFinally, I'll touch on the bosses. The bosses are the part of this game that confuse me the most. Clearly, the main draw for this title is the combat, and the combat in this game works best when you're having an uninterrupted 1v1, so bosses should be where it shines the most, right? Yes and no. There are some bosses that definitely demonstrate a more intricate and compelling dance of combat, like Owl, Corrupted Monk, and Lady Butterfly, but there are others like Guardian Ape that suddenly turn away from the strengths of the combat. And you have to fight him twice, unless you do Corrupted Monk first. Moreover, some bosses (but moreso the mini-bosses) tend to have gimmicks that are countered by consumables. These range from just being convenient time-savers (using snap seeds to dispells Lady Butterflies illusions immediately) to significantly altering the difficulty of the fight (using divine confetti and the purple gourd against any Headless miniboss). Often times, these bosses appear before those consumables are easily accessible, which means its possible to fail to kill the boss in the first few tries and then be left at a disadvantagous in subsequent attempts. BUT, I will say that most of the unique interactions are either completely spelled out for you, or are at least obvious if you take the time to read what your consumables actually do.\n\nI'll probably still finish the game, out of stubbornness if nothing else, but I definitely feel underwhelmed after all the massive hype I constantly hear about the game, so I'll leave that as the lesson for this review: regardless of if you agree with me or not or end up liking the game or not, don't just immediately buy into a game because it's well regarded and well liked. Do you research, try to dig into what people are actually saying, and make sure it's money well spent.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Great game so far but I have issues with launching the game a lot of the times. For example, if I connect my controller AFTER launching the game, the game will be screen-locked and I'd be forced to restart my PC because I can't tab out or even close the game. Sometimes, the only thing I can do is Alt+F4 and restart the game when this bug occurs.\n\nOftentimes, the game will get stuck on a black screen and I'd get a message prompt saying that the application isn't responding which also forces me to restart my PC in order to play. Another bug is sometimes when I'm in game, I can't tab out from the screen or even use any keyboard buttons such as Print Screen to take screenshots.\n\nWhile I am enjoying the game and find myself constantly thinking about wanting to play it on the weekends, I can't recommend it in its current state unless you're okay with possibly being forced to put up with all these bugs.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Not every FromSoftware game is the same and this one isn't for me.\n\nThe biggest problem by far is how the fundamental idea of combat based engagement doesn't align well with the mechanics of the world.\n Example A: 1v1 combat and stealth are the primary forms of engagement. Yet the environment makes it so most major 1v1 fights are accompanied by multiple enemies or the environments themselves are designed to only hinder the player, such as with General Kuranosuke Matsumoto and his four rifle men or Lone Shadow Swordsmen and a space so narrow my camera becomes the biggest threat. \n  Because of this, setting the stage for a 1v1 fight is a chore. Meanwhile stealth becomes an afterthought used to avoid combat or cheese 1 deathblow out of a mini-boss (which these opponents seriously do not need 2 of).  \n\nExample B: The tools and skills of which can be unlocked through exploration and killing mobs result in a lot of tools that have little to no pay out, specifically against bosses. This is because bosses tend to have the standard FromSoftware -High Mobility -One Hit Kills -Insane HP -Variable Moves, but now in addition to those they also gain -Insane Poise. This means you have to do a full boss fights worth of HP damage before any poise damage connects (which is how you deal deathblows), so moves like Mikiri Counter have zero effect while Tools like Loaded Spear do little to no damage. Which means Sekiro is more of an Intrinsic skill game and less of an Extrinsic skill game. Sen (money), Skills and Items are the only things a player can farm on mobs, and these will gain no favor over the battles that need to be fought. The only way to gain real Extrinsic power is by already having beat the enemies you originally needed the power for.  Bosses give strength (damage) and Mini-bosses give Beads which become more HP. \n\nSo you have the usual FromSoftware cycle of live-die-repeat, except Hidetaka Miyazaki thought it would be really cute if the more you die the harder the game gets. Thanks to Dragon Aids, every time you die it gives way for NPC's to get sick. This causes any quests with an NPC to close, and it also causes Unseen Aid to lower. In Sekiro you can't recollect your dropped 'souls' on death, but you have a % chance to lose nothing on death with Unseen Aid, which is percentage based on current NPC's. The reasoning behind this Dragon Aid's spread is explained a bit in game but it doesn't make any sense why it would spread only to friendly NPC's but not any of the other endless enemies you engage with in the world. It's a very spiteful form of Aids I guess and an even shittier mechanic.\n\nUltimately, it feels like FromSoftware had an IDEA for a more technical based combat system in one of their worlds. Separate and far more linear than the mixed-pot form of their other games. However the cohesion between the standard FromSoftware world and the new combat system just isn't there.\n\nAlso, fuck Snake Eyes Shirafuji.  Infinite musket shots? wtf",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too repetitive, both in terms of gameplay and scenery.\n\nAnd in comparison to DS1, DS2, DS3, Bloodborne, and Elden Ring, there are no particularly exceptional OSTs. On the contrary, I found the music that plays during each battle or mini-boss fight quite annoying compared to the calm or sad ambient music of Dark Souls and others.\n\nThe different locations are too similar, making it difficult to be interested in exploring them.\nI also find that the grapple and overly rapid movements make exploration less interesting.\n\nThe style is also sometimes a little too colorful and flashy.\n\nEven though the FromSoftware/Dark Souls style is very prominent, certain elements gave me the impression of an Activision triple-A game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game launches with a myriad of graphics issues. Have attempted multiple different settings and recommended fixes just to be able to play the game with zero success.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Starts off great but the jank of platforming and hitching during combat throws me off and after having to use a guide to even see where I had to go next and STILL getting lost I got fed up with this game. Would kill giant snake again tho 6/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is ok, story is good but the dissonance at what you can and cannot do or physically handle is lame. I've beaten the game before but I'm still annoyed at the fact that a grasshopper can stagger you while you can parry attacks from giant monsters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "(bad)\n- poorly implemented stealth but you're heavily rewarded for it. It's bad in the sense it's not responsive and incentivizes standing still for I kid you not 30-60 seconds waiting for enemies to de-alert\n- Bad group fighting\n- Just terrible camera controls for PC. No options for target lock on. No excuses for not being able to unbind the mouse movement. Can't even mod it to work. Horrid\n\n\n(minor gripes)\n- Requires mod ran every time for borderless window, fixing the camera snapping, and looting (minor gripes)\n- Dragonrot tears being finite pisses me off \n\n\nI will continue playing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the least fun I've ever had playing a video game. Maybe it gets better after a while, but I don't care to know either way",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is a solid  game with awesome graphics as you would expect from FromSoft. However, it is a console game they overlaid PC keyboard play ability on too. I'm a PC Gamer and don't have a game console. The game's sword parry, deflection, and dodge mechanics require being far too good with heavy penalties for dying and very little resources for healing. You may have to plan on restarting with a new game several times unless you are a natural speedster. Also, if you die, you have to do the entire area over. You don't get to pick where your save points are.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good parts: i commend them for releasing a game that isn't a soulsborne. All enemies are new which surprised me and i don't expect originality coming from fromsoft. The game does feel good to play when it all works, and it looks like there is a cool idea beneath the bad stuff.\r\n\r\nBad stuff: 60 fps locked in current year. If a mod can easily bypass this, then this can be added by devs. For me this is enough of a dealbreaker on its own. The option menu is abysmal, and although performance is not as atrocious as Elden Ring, it's unacceptable for a game that looks as this one does.\r\n\r\nPosture system is a neat idea but in reality it doesn't. Your own posture barely matters, most enemies can't punish a posture break and it takes less than 2 seconds to recover by just holding block. On bosses it matters but not as much as damage. You can kill a boss by depleting the posture, but for posture to not deplete fast, you need to deal damage first. So it ends up feeling like posture damage doesn't matter for a good chunk of the fight, and then damage doesn't matter. I get the idea but it's badly executed.\r\n\r\nFarming is waaaay too encouraged. If you have a ton of experience you are encouraged to farm till your next level or you risk too much if you die. Gold pouches seem like a system that only feels bad. You don't feel smart for paying the 10% tax to save your gold, losing it feels bad, using the pouches feels bad. It's not like gold is super necessary, it's just there to make you feel bad about dying. More than a soulslike. XP tree is bloated with things just to encourage farming. Shinobi tool upgrades require a ton of materials that are rare drops on specific mobs. There are literally consumables to help you farm. Why not like, remove this entirely from the game? It adds nothing and makes everything feel worse. You even have to farm your revives, so you'll be attempting a boss, you don't have your 2/3 revives, you need to go out, kill some trash to farm your revives, to go back to the boss and lose the xp and gold you gathered while farming.\r\n\r\nWhich gets us to the next point. The trial and error is replaced by a easier game where you are punished a lot for failing. Consumables are super op, tools are op, revives are op, you get too much healing. You can pretty much bulldoze your way through the game as intended; or you can try to learn bosses, try to defeat them cleanly and meanwhile feel that the game is angry at the way you want to enjoy playing it. At least dragon rot was partially removed from the game, holy shit, what a dumb mechanic, it's like these people forget all the mistakes they already made, insane that it didn't get completely removed.\r\n\r\nQuests and story as incomprehensible as ever, but if you like following a guide to get the endings power to you. Exploration is a bit messed up with places getting up to 3 different states and loot shifting around, but that's not a biggy.\r\n\r\nBosses are pretty good for the most part, really low amount of bullshit, even if you are trying to properly learn them. Barring a couple of bosses that go against the main design of the game and are just tanks you have to hit 300 times and you are discouraged from parrying. It's like they have a dumb ideas for bosses quota and they need to hit it.\r\n\r\nSo yeah, i know these games gather the most undesirable people whose only form of self validation is being able to beat a kinda hard game and they can't have a different opinion pop up on the steam reviews. So kindly, fuck off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Usually challenging games make it fun to develop the skills needed to play it. Fromsoft games seem to take the opposite approach: make the player miserable until they can rise above the challenge, and punish the player for needing to learn. Sekiro is no different. I haven't encountered a boss in a couple of hours because I'm stuck exploring this vast area with lots of dangerous enemies and no checkpoints. Sneak past them? Sure, maybe a couple. But when I need to enter a cavern guarded by 5 enemies, or when the way forward is guarded by monks with spears that do half my health bar with one hit, it's just not fun. This game doesn't make me want to get better at it, it makes me want to quit. The realization that dragonrot also punishes you for dying by denying you the ability to do side quests? Yeah, I'm done with this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm going to go against the grain here - In my opinion, this is the worst game from FromSoft. The need to mod the game so I can play at more than 60 fps on PC is ridiculous. The inability to customize your character, adjust your build, and take a little break from pressing parry 200 times every fight and for example doge, is exhausting. I love the Souls genre, but this just didn't hit the spot for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For people who are fans of very hard games, this might be it for you. But be warned I've played Silksong and Dark Souls and liked them just fine.\r\n\r\nFor me there's just too many frustrating issues with this game.\r\n\r\n___GAMEPLAY____\r\n\r\nFirst off, there's very little choice in how you engage with the combat or the world. It's one of the most linear games I've played in a long while. \r\n\r\nHow the game GENERALLY work is as follows, you, the player, will enter an area, where there's a set number of enemies, you can't really attack multiple enemies at once, since they'll just gang up on you immediately, so 1-on-1 is definitely preferred, occasionally you can deal a couple of the weaker enemies at the same time, but generally you definitely want to sneak around and stealth kill.\r\n\r\nThe stealth is half baked and feels on rails, sometimes enemies can spot you a mile away and run ALL the way to you, other times you can shank a friend of theirs 5 meters to their right and they'd be none the wiser. It really depends on if you stealth kill the enemies in the correct sequence. This can be a very lengthy process and you're gonna do this A LOT in each area.\r\n\r\nThe combat is too much waiting and either parry/jump/dodge (except dodge is super nerfed in this game) depending on the attack animation. You have very little agency in controlling the battles you are almost only reacting and never acting, it's like one long randomized QTE you have to endure. This is to the point where the miniboss battles I did endure to beat was not enjoyable or fun but just a chore. \r\n\r\nMiniboss? you ask, why yes, there's two kinds of hard enemies, afaik, minibosses and then regular bosses, the regular bosses will give you a small boost to your attack stat (btw, there's no allocation of rpg stats in this game, so forget about \"builds\") now minibosses are probably gonna take up most of your time, they're basically very difficult enemies with a series of attack patterns that you need to learn 100% or else you'll just die. Mostly you need to learn to deflect when the correct animation plays (which is the vast, VAST majority of combat) to the point it feels like you're playing a rhythm game.\r\n\r\nNow a lot of the combat is supposed to be about reading the animation and reacting accordingly, but do you know what's constantly blocking the camera from clearly seeing the enemy that you're up close to? that's right the player character itself. Then there's the camera who will spazz out when you're in tight corners. and sometimes just not lock on to the enemy RIGHT NEXT to you, and in an easier game I could forgive that, totally, but not when the punishment for death is as high as it is. \r\n\r\nWhenever you die, and you will die, a lot, you lose half your money and a lump portion of xp, which can't be retrieved, it's just gone. Then there's the dragonrot where if you die enough times, which you will, npcs will stop helping you, so you have to spend extra money to fix it in order to progress a story line.\r\n\r\n____STORY AND LORE____\r\n\r\nThen there's the story and lore, I do think there's something interesting about this world and how so many of it's inhabitants are obsessed with immortality, especially the undead monks, were really cool.\r\n\r\nBut I don't care about the main character and his lord (a twelve year old boy with magic resurrection blood), really none of the characters are of any interest to me, except maybe the Carver and the undead training dummy, they're kindda funny. \r\n\r\n____Overall____\r\nAnd that's really the issues I have overall with the game, I'm not interested in getting better in a game, that I have so little stake in. I don't care about the characters or what's gonna happen next to them, the world itself is kindda cool, but not enough to warrant the ungodly amount of hours I'd have to invest in order to \"git gud\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steep learning curve. Permanent penalties that keep stacking throughout the playthrough the more you die. You can't just reload from the last save or checkpoint and try again without consequences.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lacks native support for the 21:9 and controller recognition issue. To get the gamepad properly recognized, I had to unplug my keyboard before launching the game. Unacceptable....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Dark Souls and Elden Ring, but I just can't get into the rhythm and style of this game.  Kind of my fault since it's technically an action game and not an RPG, but I assumed it would be at least somewhat similar to a souls game, and to me, it isn't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this game is SO much fun. Among the most fun games I've ever played. The mechanical experience is damn near unmatched by any video game. But that's it. It's *just* fun, & lacks merit in other departments. Since finishing this game over a year ago, I have not thought about it at all. But, if unlike me, you're looking for a purely mechanical experience, it's absolutely worth playing. \n\nNegative review because it isn't for me. Not a bad game by any means.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hard to recommend this.\r\n\r\nE.g.\r\n- The game is designed in a way to make it very difficult to learn. You have to get good at parrying, and weirdly it offers you very little opportunity to really do that. \r\n- Far too much BS, and far too many situations encouraging cheese.\r\n- OP consumables that trivialise fights, but extremely rare to find so tough shit if you didn't kill the boss the time you used snap seeds.\r\n- Punishes the dying and learning cycle with dragonrot mechanic.\r\n\r\nI did get to a point where I enjoyed the game, but FromSoft really did make it as difficult as they could to get to that point. I'd recommend Lies of P or Khazan over it any day.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "john sekiro keeps dashing straight into damage instead of back or left or right.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't Buy: \r\n- If you're casual \r\n- If you have a life and a family you must support \r\n- If you contribute to society in general \r\n\r\nUnfortunately, after DS1's difficulty craze, it seems FromSoft's primary goal has been to shit out absolute stinkers. Anyone who has skid marks and sits in their gaming chair all day will tell you to git gud, that it's a skill issue, as if we all aren't aware that they achieve nothing but sinking thousands of hours into a game that rewards their lack of employment. And don't raise your pitchforks, because I'm one of em. \r\n\r\nSekiro is another title that has been plagued. It's manageable for a while - through all the perilous deflects, the prosthetic arms, and the filter mini-bosses. It's immersive, it does stealth mostly right, and the exploration is peak. But at some point along the line, Sekiro becomes less of a fun learning curve and more of an annoyance; with repetitive enemies and bosses that have some bullshit gimmick, a tracking windup, ridiculous attack speeds & aggro ranges, or homing projectiles. And that's what makes it another load of waste born from the FromSoft sewage pipe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Okay a lot of you might not think this is a big deal. Which it might not be. But for me it is a huge deal. This game is a console game. If i was playing on console i would probably enjoy this game. But as it stands. The help tips are in console command. Which i am playing keyboard and mouse. Having to stop ever 5 seconds to look up what the keyboard commands are is driving me crazy. The game seems okay graphics are alright. But key mapping is crazy. I will probably pick this up on my console but i will never pick this up for PC unless they fix the game's help tips for the keyboard commands.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat system is neat. Its enjoyable for a bit but gets really repetitive and drawn out on some encounters.\n\nA lot of bosses have really cheap tricks that they throw at you that feels like it breaks the flow of the combat and I don't find the cheapness fair or interesting. Most of the bosses and mini bosses can kill you in just one or two hits, which makes learning them a painful chore, but of course you need to get about 50 in so that their posture bar doesn't deplete so fast in order to kill them. \n\nPlayer dropoff is almost 50% by the first major boss. For the rest, a lot of players resort to cheese tactics to beat a lot of the encounters, which I think goes against the intent of the game. I get being tough, but I find this game doesn't always play by its own rules. \n\nDespite picking it up a few separate times to give it a fresh approach, each time I find I just hate it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Damn this is cheaper than Where Winds Meet. Is Prob the goat of stealing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so fucking ass bro, the dodge system doesnt work on any timing the parrys do nothing and the bosses are so boring its insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this piece of shit, controller support for this game is worse than OG dark souls. \nDiscussion is full of people trying to figure how to get controllers to work and nothing works, \n0/10, haven't seen this poor support in ages",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly overrated.\n\nAlmost no build freedom.\nNo armor.\nNo weapons to switch.\n90% of pickup items are consumables you’ll never use.\n80% of Sekiro’s prosthetic tools and arts are situational.\nMany bosses completely ignore certain tool effects.\nOnly a handful of arts (Mikiri, Ichimonji, Whirlwind Slash, etc.) feel meaningfully impactful.\n\nRigid, repetitive, emotionally exhausting, far more stressful than fun.\nMediocre at best.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah its a decent game but not worth the money it costs... I would only say buy if on sale, the mechanics can be so clunky sometimes and the bosses are just flat out wayyyyyy stronger than the character like its so bs. I am usually very good at souls like games but I just cant with this game I feel like my characters power is = to a toddler. Another point is that when u die ( which happens a lot) you usually lose like half ur stuff which sucks and theres not nearly enough checkpoints. A very tedious game like this need manual checkpointing. Many things could be better but oh well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ما اعجبني اللعبه سواء من ناحية انك تتخبه او ان يكون بالك طويل تسوي مليون باري وايذا انسحبت كل الباري الي سويته تروح على الفاضي او ان في مليون واحد مع البوس او انك تتخبه وتغدر وان نورمل اتاك نوم واني استثقل اللعب نص ساعة يعني اللعبه ما اعجبتني\n\nتبا للمجتمع لعبتكم خايسه",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Refunded, stuck on 60FPS, plays like a ps2 game. SCRAP!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overrated filled with annoying back and forth parrying, clanking and a stupid guard break system...not a Soulslike",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very fun very satisfying can't figure out how to combat roll or whatever you need to beat the chained ogre so we'll see if i play any more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have had more fun dueling the Razor in Slay The Princess than any of the bosses in this wanna-be-tough-guy game.\n\nI will still get to Sword Saint just so the fanboys can't scream \"gIT GuD!!!1!1!!!!\" at me for not liking the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ragequit when the monkey threw shit at me for the upteenth time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too difficult to fight the bosses,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yeah i think fromsoft missed the mark on this one. its just not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Miyazaki can eat my banana for dinner.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no asylum demon 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gaurdian ape threw shit at me",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}