{
  "positive": [
    {
      "review": "10/10 I'm terrified but I can't stop playing. This game is way too real. Every sound in the jungle makes me jump, and whenever i hear tribes nearby, my hearts start racing😭. It's scary, stressful, and super realistic. Easily one of the best survival games out there.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "If you like unnecessarily difficult and complicated stuff for some reason...",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Great game! Mechanics can be rough around the edges. But, man is it fun! There is a lot of depth to it, its hard at first but it feels very satisfying when you figure something new out. Must play!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Pros\r\n  - Creative building process\r\n  - Immersive jungle environment that is fun to explore\r\n  - Beautiful landscape, nice graphic and animations\r\n  - Jump scares and good haunting illusions when low on sanity\r\n  \r\nCons:\r\n  - Not very challenging once you get a hang of it\r\n  - Still some glitches when building\r\n  - Exhaustive grinding to get resources (when trying to build big)\r\n  - Storymode: Female character is annoying with constant bickering\r\n  - Hunting is a bit clunky (Birds sit in air, crocodile with stretched necks, natives act weirdly in combat)\r\n  \r\nWishes for Green Hell 2:\r\n  - Exploration islands with canoe/raft\r\n  - Faster movement by using lianas\r\n  - More custom animations when building/cooking\r\n  - Multi-ingredient cooking\r\n  - More diverse sound samples when character reacts to something (becomes monotone)\r\n  - Ability to sit on furniture/near campfire and reflect on things\r\n  - Make environment more diverse (rain forest with mountain top/vulcano etc)\r\n  - Better mechanics when hunting",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The jank of this game is kind of annoying, but the story honestly makes up for all of it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After using this game as the reference point to which I compare all realistic survival games for the past ten or so years, I guess I really should write a review on it.\n\nThis is THE realistic wilderness survival game. If Primtive Technology had a game, it would be this. If Bear Grylls made a game, he would make this one. There are other games that perhaps more granular systems like Dwarf Fortress or Unreal World, but those games are both spreadsheet simulators and primitive people didn't have spreadsheets. All they had was their own willingness to get stuff done. If all of that resonates with you, this is the game for you. If you understand that there are sounds in the jungle that you MUST recognize, and they sound a lot like the other sounds, this is the game for you. If you understand that being bit by a snake while you're alone in the woods an hour's walk from camp means simply that you die, this is the game for you. Crank the diffulty up to King of the Jungle (Green Hell feels a bit like ball torture and is probably developer's very hard difficulty but cranked to a level they dont enjoy) and get ready to eat some spiders because cannibals chased you out of your shit shack and they came from the direction where you store your weapons. Watch, listen, learn, Crack your coconuts, collect your rainwater, observe how other humans survive the environment and copy it and barely survive another day. Dont leave the fire at night, don't wander too far from the known trail, and if you hear other humans in the trees, don't assume they're your friends.\n\nI dont even have a good way to review this game because it's the basis of comparison to which I use to measure good survival games. This is it. All of the fat is removed, except the essential dietary ones from your brazil and pine nuts. I cant even think of things that would make it objectively better and my only suggestions would be things I would just like, such as a pet monkey. The person who made this game was passionate about both videogame development and amazon wilderness survival, and that is the only way this game could possibly exist.\n\nI'm going to be honest in that I dont even really know or remember what the story is about. Some boring guy and his girlfriend gave everyone aids and now theyre about as sorry as Oppenheimer was or something. Your guy is a botanist but you have to rub every single plant you encounter directly in your eyeball to figure out what it does you cant just rub it on soft skin or take a little taste. Eat that fistful of berries. If anyone cares theyre a dork. Throw all that stuff in the trash and just go be alone in the jungle. There is something very unique about there being a near endless list of chores to be done with each one not really changing your life, but simply allowing you more time to think, that gets you down on the level of your ancestors and puts almost all of society into perspective. You can trace almost all things back down the line to that experience of being alone in the woods and fighting for every crumb you eat. The car exists because walking from where the bananas are to where the pigs are takes too much of your sitting down time and it's really that simple.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Starving, out of energy, infected, backpack overflowing with useless trash I thought was important. Peak gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I started played through this game from the very begging on the second hardest difficulty level and so glad that I did. It's incredibly difficult but very rewarding. \n\nThe included prequel is strangely different but very familiar as you play through the same maps, but they're setup differently. Some aspects are confusing and a little tedious for progression but again I found it rewarding.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Arrived in jungle- set up shelter- forgot about food- went hunting- caught lizard- got diddled by locals- ate locals- died of infection on my leg. 10/10 would recommend, just stay away from the locals, they like your booty hole",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still playing it with friends and enjoying every moment in it even though there are some bugs in coop modes, but overall one of the best games in survival that you can play with either with friends or alone. it can be hard in the beginning since you dont know how to keep your sanity up and keep everything under control but you can search it in guides and other stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Though but Super Fun\n\nYou really get a taste of what surviving in a rainforest might be like, from gathering resources to treating random injuries and dealing with whatever the jungle throws at you.\n\nIf you enjoy challenging survival games with a highly realistic atmosphere, this one is absolutely worth it. \n\nThe struggle is real, but so is the satisfaction. \n\np.s. The only thing I hope gets better is the co-op system — playing with friends can lag a bit sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games you could ever play.\nIt dose not hold your hand.\nYou will die,,, something is going to kill you. lol\nLove the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addictive game. Super challenging and fun to try to make things work without dying!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game, but please pay for my therapy and a new laptop because of how much this game made me rage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "okay im giving this an 8/10 BUT I AM BEING GENEROUS WHEN I AM USUALLY AN UNSCRUPULOUS MAN LOL. Right, story mode was great to play and the difficulty levels were well considered, HOWEVER, the storyline is poorly narrated with plenty of misandry bias and weak liberal grovelling(but there is reason for this SPOILER). TBH the main character Dr. Higgings may as well have used his 'Ugly American' character 'Mark Lilly' because that guy was a liberal pussy which is the feeling you get from him in this game lol. Now, as far as crafting and survival goes, this game was great. Sadly, for someone whom has traversed the jungle a few times Dr. Higgings really is a weak and pathetic character, he can jump off a 5ft log no problem but do it on a 3ft drop elsewhere and you got damage which is often unrealistic ESPECIALLY CONSIDERING WHAT HAPPENS AT END OF TUTORIAL lol. Another issue is his overall lack of ability, its insane that he cant jump up onto a 2ft ledge, step over a 1ft high log or climb a small boulder or rockwall so this game fails on that account as anyone in reasonable health could, also there is a jump BACK default so attempting to jump forward when you have a 3inch rock lip in front of you generally results in you falling backward AND PICKING UP A STUPID INJURY. Build options are sound but also a little limited- you have access to metal machete and axe but cant make them, even though you have a slightly overindulgent 3-step process to cast metal. Plenty of resources NOT available such as seaweed which can be both poisonous and medicinal depending on type, and we have plants that have uses in real life but not in-game, being able to craft a helm to match armour would be nice too. Now, the character appears to have a resilience counter so as long as you avoid injury and keep your food and drink intake topped up, he will last longer BUT that goes out the window once you scrape your leg on a short drop or get attacked by a respawning scorpion(this happens often all around the game with snakes and spiders), you will find the character needing rest after only being awake for 4hours. the survival free roam is great but again the building options felt limited as there were only a few options when building treehouses or on a lake- theres also the matter of food spoiling seconds after picking it up off a rack, the game still has bugs and issues such as your animals disappearing from the pen NEVER TO RETURN lol, 1 factor that frustrated me as a survivalist whom used to do this sort of thing- sap from trees not harvestable as sealant or food or resource(yes there is wax in the game but its use is exclusive), and the ability to build a boat or even a cart should be available but ultimately as long as youre NOT a real life survivalist you wont be asking too many questions about resources so you should enjoy it, for those of us whom know the comfort of a tree at night in a foreign place, we cant be too hard on the devs for not including all the bases and angles as they cover enough to keep you going- Sorry no making jelly from worms and fruits but theres plenty of leeches WHICH WE SHOULD BE ABLE TO USE TO TREAT WOUNDS BUT CANT lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm still reeling from my experience in the Amazon rainforest with Green Hell 😍👍🏽. This game had me hooked from the get-go, and I spent hours upon hours surviving, crafting, and exploring the unforgiving jungle. The immersion is on point, folks! The graphics, sound design, and gameplay all come together to create an intense, realistic experience that'll keep you on the edge of your seat.\n\nI loved the attention to detail and the depth of the survival mechanics. From managing my hunger and thirst to building shelter and crafting tools, every decision felt crucial to staying alive. The game's ability to simulate the harsh environment and the psychological effects of isolation is impressive. I felt genuinely scared and anxious at times, especially when dealing with predators or navigating treacherous terrain 🙈🏽.\n\nThe story's a bit predictable, but hey, that's a minor complaint. The real draw is the Green Hell experience itself – the thrill of exploring the unknown, discovering new plants and animals, and slowly uncovering the secrets of the jungle. I've put in over 530 hours, and I'm still finding new things and facing new challenges 🤯.\n\nIf you're into survival games or just want to test your mettle in the wilderness, Green Hell is an absolute must-play. Get ready to sweat, cry, and maybe even learn a thing or two about the Amazon 🤣👍. 9.5/10 from me, would highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a phenomenal gem of a game this is! Very well done survival mechanics, as well as resource gathering and base building. The story line is good and keeps you adventuring deeper and deeper. The environment looks amazing, with the day to night shifts in lighting. This is a must buy for those into survival games, and IMO is one of the best ones I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fabulous. I am loving it, this game is really realistic anfd fun for surviving in jungle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can not speak on the story mode of Green Hell since I only play survival. I would recommend playing the story to get the basic mechanics down but I don't feel it is necessary IMO. 70+  hours on the game and am still learning how to use certain weapons and still discovering new places!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great graphics, nice story, and a building style that makes you think. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game while on sale for A$10. As a growing interest in survival games. I hoped to maybe get 50 - 60 hours out of it... Well at 265 hours in and no sign of stopping, I can confidently say that Green Hell is one of the best games for the price there is. \nYou get 3 game modes. 2 story driven modes including the main story that will draw you in as you discover and uncover what is actually going on. A prequel story that explains the lead up to the main story. And a build-your-own survival mode. \nThe mechaics are great and the realism and immersion is amazing. In your part of the Amazon there are no guns, no explosives... You have to survive with what you can craft from the environment and its inhabitants. You face off against nature, natives and jungle full of animals and critters that see you either a threat... Or food! It is very easy to get lost in the pursuit of resources or the on the hunt for food to stay alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "crazy game, pretty hard survival, good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. really well made for what it is, slight bugs but nothing crazy. there's a learning curve but that's what makes it so fun and challenging. might buy for a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good and working nicely, but not my type of the games.\r\nyou have to fucose on your status all the time even in easy mode still draining so fast which make the game hard and unfun for me. I bought the game in sale time with 13 AED only worth it but with full price i don't recommended the game at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely would recommend for realistic survival genre lovers. The lore is very well written despite being quite short.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun until you learn everything then it gets repetetive but still an ok game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game IF you buy it on a good sale.\r\nIt feels like its trying to be the forest, but it's less successful. There are some unique and fun elements though that makes it special, but I wish they leaned more into that.\r\nI have to say though. What was up with that storyline. Played both endings and didn't like either. Finished the whole game in 17h so feels much smaller than the forest/sons of the forest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hikaye anlatımı ve hayatta kalma mekanikleri başta biraz zorlasada güzeldi akan ilerleyen hikayesi yanında güzel bir atmosferi var. Oynayacak bir arkadaşınız varsa da daha da keyifli bir hal alıyor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Green Hell isn’t just a survival game it’s a psychological, brutal, and immersive jungle experience. Every decision matters, every mistake can kill, and every moment feels terrifyingly real. Absolutely unforgettable.\n\nI played it a lot with my friend, and we enjoyed every second. The jungle environment, the survival mechanics, and the story make it feel incredibly alive.\n\nI truly love the experience — it’s challenging, immersive, and endlessly rewarding. 11/10.\n\n:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brutal survival game, but it's EXTREMELY fun to play. Definitely lives up to its name.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Intuitively not fun.  Uselessly laborious and hard to navigate. Flawed and badly designed and in dire need of a major update that will never come.\n\nThis game's concept is awesome.  The Forest and Sons of the Forest did it the right way.  This game? Not so much.  When you die in multiplay, you lose half your stuff, and if you died on a cliff, half your stuff, the unimportant part (axes, spears, machets, they all disappear) are there but out of bound, ready for you to fall back to death again.  IF, you can find it again.  It takes forever to find some things to build an axe or whatever you need to build, or craft to heal multiple wounds that require different ingredients to fix. Sometimes for no reason, it gets infected right away and you lose your leaf bandage, or bandages and have to craft 10 more, but the plants are hard to find. \n\nYou build a shelter but your pack is at 50 out of 50lbs? Don't grab a palm tree leaf to bring it back to your shelter under construction, you're encombered and will have to slowly, painfully crawl back to it.  Leafs and logs and long sticks shouldn't count toward weight.  Unless you give the option to drop your 50lbs bag so your weight goes to 0 and you can be allowed to carry a palm tree leaf without being encumbered, but please don't do that.  It's just a game, relax.\n\nIt takes too long to build shelters or any structure to be able to save. \n\nYou build an axe and cut 2 trees? It's broken already, you need to craft another one.  You drop something because you're holding it and you need it later? It will most likely disappear. You're jumping on a rock? You might bump off of it and fall down for whatever reason.  You're tired? You can't jump, not even a little.  You see a jaguar? You're dead. You swing your axe at a tree, you might hit it once or twice and magically you can't hit it anymore to fall it.  You fight an enemy? It might hit you every single time in melee and you can't get one hit in because they jump back and yes, even if they jump back against a rock and you literally stab them through the body and through the rock but no damage is done.  \n\nThis game was designed to be painful and I get it, but it should have been designed to be fun as well.  It's an inherently good concept but it's 50% done and abandonned.  It's irritating and frustrating to play, the map is pretty small and everything is very redundant.  It sold more than The Forest and Sons Of the Forest because it was on console because compared to them, this game misses the mark quite a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need to be able to pick up items off the ground while carrying, e.g. holding a long stick but still being able to pick up stones or sticks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i started crying of the end of game thank you creators for amazing experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, very real, hard to play at times but i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game albeit, not overly graphical is fun to play and even more so to understand and move past troubling encounters and learn from your mistakes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but NGL,  a BIG ass banner for a diiferent game on green hells store page just disgusts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is totally worth it paying it full price. Its really hard to figure out (at least for me) some really basic stuff, or where to get certain type of items (cause its more rewarding if you dont google!). Took me a couple hours to even know i could get mud!\nSurvival is so intense, i got stuck hours playing just to try to settle in, before some random bite or attack got me at a really challenging situation all over again. \nI encourage you to try to survive, even if it takes your whole stack of hardworking crafts you've gather and saved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "long stick + rope.... and 2 feather+small stick.. merember this.. u can play normal mode... ezy..  and hook to this game for a year..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine Sons of the Forest meets Soulmask well you get it, great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a superb game once you learned the ropes in it. It may be overwhelming in the beginnings especially if you never played such game before. It has two campaigns in it, the Spirit of Amazonia DLC and the original campaign, both well written, both well designed. The DLC is even better and bigger. The graphics are top notch, the details are magnificent and the gameplay is very good. The craft part require patience, a learning curve and time but it is rewarding in long run. I recommend this game for everyone. You won't regret it a bit ! On the downside, some quests, how to put pieces together are not explained sufficient, you are more guessing. I think they should work a little bit in this department.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a pretty awesome game. There are some issues with getting it to load sometimes but when it does, itss great. The building and crafting can be tedious at times but feels rewarding. The learning curve feels steep at first but once you get it down its not too difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard game at the start but the story and gameplay is very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid 7.5/10, not the best, but honorable experience.\n\nGreat survival game with ability to disable spiders/snakes and actually adjust the whole difficulty of the game, so if you want tryhard survival or peaceful building game, you can make both happen easily. Really good game, if anyone likes survival games, you should play this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game. Some of the dialogue and writing leaves a bit to be desired, but the gameplay is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Green Hell was an incredibly fun and immersive experience from start to finish. The survival mechanics felt realistic, making every moment in the jungle exciting and intense. I loved the challenge of gathering resources, building shelters, and trying to stay alive while facing wild animals and harsh conditions. The graphics and sounds really pulled me into the atmosphere it felt like I was actually stranded in the Amazon rainforest. Overall, it was one of the most enjoyable survival games I’ve ever played, and I would absolutely play it again without hesitation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOOOOOOOO I CAN PET THE ANIMAAAAAAAAAALSSSS\r\n\r\nOn a more serious note, this version is so, so, so, so much better than the nintendo version. Even on my potato computer, it runs smoother, more construction options, more detail. better control once you get used to it... good stuff! and it goes on sale pretty often. which is great! love this game, and love turning it into a farming sim when that definitely wasn't the intention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completed the game first time,and that was in CO-OP mode,3 of us \"complete\" noobs in this game,on the medium difficulty,there was alot dying,respawning etc.The game have some weird bugs with animals dissapearing,after save-load they respawn.Overall great story,there's like 2 or 3 different endings in game i think,recommended game to get and learn it!It was on huge discount when we bought it. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very difficult but still a good game with lots to do and co-op works great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verdict: A brutal, immersive survival sim that rewards patience, punishes arrogance, and begs for a better building system.\nPros:\n- Atmosphere: The Amazon jungle is stunning, hostile, and alive. Every sound matters. Every step counts.\n- Survival Mechanics: Deep and punishing. You’ll learn to check for leeches, balance macros, and treat wounds—or die trying.\n- Mental Health System: A unique twist that adds psychological tension to the survival loop.\n- Co-op: Best played with friends. Communication and coordination elevate the experience.\nCons:\n- Building System: Severely limited. No fences, no elevation tools, no real base creativity unless you mod it.\n- Wildlife AI: Big cats teleport through walls. Predators feel more like scripted events than dynamic threats.\n- Tribal AI: Inconsistent. Sometimes terrifying, sometimes laughably passive.\n- Navigation: No map markers in co-op unless you all sleep together. Immersive, but clunky in practice.\nFinal Thoughts:\nGreen Hell nails the survival grind but stumbles on long-term sandbox satisfaction. If you’re into realism, micromanagement, and jungle immersion, it’s worth the struggle. Just don’t expect the building freedom of The Forest or the polish of Sons of the Forest. This is a game that teaches through pain—and that’s part of the charm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game for the open world survival but the story behind the game is very nice if you decide to follow the game as intended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I hated this game because I didn't know how to play. I expected it to be like any other survival game. I died over and over and over and over. Well one day I decided to go to the wiki and learn how wounds work, how the macros worked. I played and got better, now I run anywhere on the map carrying a pot or a clay bowl with me, making bone broth, creating makeshift shelters as I'm roaming with my bow on the hardest difficulty. This has got to be one of the best survival games I have ever played. I love how the building works how its modular. Playing with other people really heightens the game too, you need to create a community in order to survive. Someone focuses food, someone focuses tool production like metal. It creates a really cool community. The discord is great too, people are always so willing to teach and play with you. I really hope they make a new game but do more building in the style of Sons of the Forest. That would be killer, especially if they did the same sort of wound system and fever. I love having to actually survive and manage your food needs. It takes the old survival sense of, \"focus one food and eat it\" away and forces you to diversify. The fighting is intense, being able to throw anything in your hand in order to survive is amazing. Especially early game on Spirits of Amazonia when you got about 10 tribes men coming at you with bows and spears. The traps, animal husbandry, farming, having to harvest clay to make pots and containers. Everything feels like you really are stuck in a primitive landscape. I cannot praise this game high enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend. While I originally thought I was in for some jungle survival and base building, the \"Momento-esque\" story that proceeded to unfold caught me off guard. Awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎮Gameplay:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Fantastic.\n\n\n📖Story:\n☐ It Doesn't Have One.\n☐ Horrible.\n☐ Bad.\n☑ Average.\n☐ Good.\n☐ Fantastic.\n\n\n⛺Graphics:\n☐ Potato.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Beautiful.\n☐ Masterpiece.\n\n\n🎵Music/Sound:\n☐ Horrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Amazing.\n\n\n🐞Bugs:\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☑ Few Bugs.\n☐ Nothing.\n\n\n💸Price:\n☑ Full Price.\n☐ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☐ Free.\n\n\n📝Final:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☐ Good.\n☑ Great.\n☐ Fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got lost in the jungle, killed a hostile native. Got bit by a snake on the way down to the river and got mauled by a huge yellow cat.\n\n10/10, Green Hell hurt my pride again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game but only 3h played bc the person who told me to buy it to play with him (my bf) doesn't want to play it. Funny in multiplayer, no experience alone.\nPeace out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend hunted locals, ate them, got crazy and drowned himself. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the detail that is put into this game on how you have to survie, build, and the tribs are interesting how the can read your moves and dodge you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Green Hell[/b] is the kind of game that gently takes your hand, then snaps your wrist, steals your backpack, and leaves you arguing with a jaguar at 2 AM.\n\nI’ve never been bullied by a forest this hard in my life, and somehow I loved every minute of it.\nOne second you're collecting bananas, the next you're slapping leeches off your leg while hallucinating and trying not to die of [b]17 different problems at the same time[/b].\n\nThis game throws so many [b]leeches[/b] and [b]worms[/b] into your body that you start feeling [b]itchy[/b] in real life.\nI scratched my leg so much I think Steam owes me a health warning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very hard mechanics and progression but if you get into it its realky fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only play the story to find more tools for my building and it is fun as GREEN HELL!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very challenging at the beginning but much easier after you stock up bandages and grow banana tree",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me a long while to play this because I didn’t want to play on my own. I watched Fisk play it and it showed me that I was making it scarier to play in my mind then it is. I really like this game and wish I had not taken so long to check it out. Hope they add more as they plan to. I would like to see more animals and to see some of the plants that aren’t used for much become more useful. Great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game for hardcore survival absolutely loving playing this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Map’s confusing as shit sometimes, but it’s a vibe with the squad and got a solid story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Immersive survival with a good story that unfolds the further you explore. Engaging environment, lots of crafting, great dialogue acting and I like having a walkie-talkie, I love slowly revealing the lore of the land. I especially love having a map that requires you to work out your co-ordinates - no hand holding there! Makes the journey feel rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good Game very Realistic and fun with Friends to Play👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, but it can be very confusing and make no sence at times",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] 8/10 [/h1]\n[h2] [i] The Best Amazon Travel Guide [/i] [/h2]\n\nGreen Hell is a punishingly hardcore survival game that has evolved significantly since its initial release.\n\nIf you are new to the genre, proceed with extreme caution, this game pulls no punches. Veterans, however, will find a deep and satisfying challenge.\n\nThe core mechanics are fantastic, centered around intense micromanagement of your body and the constant dangers of the Amazon rainforest. The system of different complications (wounds, parasites, infections, and sanity) creates an incredibly dynamic and stressful experience. While some interactions can stretch realism (like being able to break large rocks with bare hands), the overall immersion is powerful.\n\nThe initial learning curve is brutal but rewarding. The tutorial only offers the bare minimum, forcing you to learn the majority of the complex systems on your own (or with the help of a wiki). I personally started to \"get the hang of it\" around the five-hour mark.\n\nMy only major criticism is that the enemy tribesmen AI can sometimes feel a bit simplistic.\n\nVerdict: If you are seeking a genuinely challenging, deeply intricate, and highly immersive survival experience, Green Hell is absolutely worth the suffering.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great survival game very hard :) and challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really liked the game especially the way it forces you to be adventurous",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a crafting addict, and an RPG nut, I'm hooked.\r\nThe challenge is extreme at even second level of difficulty.\r\nThis is worth my while, so hopefully yours as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realistic fun survival game good for multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the perfect survival game. i have played other survival games before but this is the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly recommend to play as a CO-OP rather than Solo needs more patience according to me 😅",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game for someone who likes to play nice games only.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy survival games with a particular theme to make them entertaining, this is the game for you. The tropics weather in the middle of nothing but green brings a new element to survival gaming at a whole; sanity bars, checking for wounds, and going into the world without knowing anything about the terrain or what is edible or not is a really enticing experience. Absolutely reccomend for those who like Sons of the Forest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very challenging and fun survival game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is challenging but fun! It takes a lot to survive the jungle. I found the mystery of the game very intriguing and it kept me going forward. I definitely had to get some help on the wiki page for this game for advice. But I recommend, and I would probably play it again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its digusting to see our worms coming out of the legs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sick game, amazing experience. I used to think i could survive a jungle, now i realize i can´t.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you liked the the Forest its quite similar, but id say more brutal.\r\n\r\nDefinitely recommend it, but be warned its for those who love realism, its pretty hardcore just to try and survive, like real life almost everything can kill you, and your on a constant struggle of healing yourself, which is a bit convuluted at times, especially when your on limited supplies of whats needed for bandages,  \r\n\r\nA few modes to play which keeps things interesting too, and the main playthrough has a good storyline, if somewhat predictable.  \r\n\r\nFor those that want to expeirnce the game without the hassle of the survival elemnts there are options for that, but I ended up using WE MOD/WAND.  as the first day of the game sees you hunted by something that can oftren attack you before you even find a plant for bandages.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This very game is funny it because funny is like i so it 8/10 much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game tons of fun. I love survival games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good sadly not being updated anymore hard game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun, can be really difficult at first.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very Good Game. Wish we would have a canoe or something that would be nice for swampy areas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hardest survival game I've ever played.\r\nVERY worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard for solo - more fun with friends .\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good\r\nand has a really good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a must have for every Survival Game fan on Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's stupid hard but the fun kind of hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Murphy's Law was a game, and this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice immersion in the jungle! Worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\r\nwolde get eaten by evrything again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game i have played in a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super good story. RIP mommy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "liked the freeplay option of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, worth every penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST STORY GAME EVER PLAYED :( sad fucking endings",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This gives me The Forest vibes but it's much harder and more grounded in reality. This is one of those games that I wish there was a middleground option. I like the entire game so far and don't mind how hard it is except for one aspect of it. For the life of me after 6 hours of playing and wandering every inch of jungle I could reach without a grapple, I couldn't find a single bandage. I looked it up, they only spawn in 3 places in the map and I couldn't actually find those locations online. This might not seem so bad on the surface, unless u consider what that really means. This effectively means that even the smallest cut as far as I can tell will eventually kill you if not bandaged. There's no chance for it to heal on it's own seemingly. Anyways the games great other than the fact that bandages are basically a legendary item. This could be easily alleviated by putting a few closer to spawn or just making them random.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Could have been a great game and would have invested more time but this game's items drop on death and you have to look so hard to find items that may or may not be there killed it for me entirely. The fact that the game differs from others where you drop a pack or toolbelt was a bad move and not offering it the custom game section where I can have the difficulty but not worry about that is the game breaking error I have with this game. Something so simple, yet completely makes it a no go. In my opinion, I can not recommend this game with such lack of player consideration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, the game is nice and definitely worth playing with friends, but it has a lot of bugs in multiplayer. It starts right from the loading screen, where the game freezes, connects you, and sometimes you die instantly, or you can’t open the map/clock. I tried giving it a second chance after a 5–6 month break, but it seems like not much has been fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this on sale for $9 or so, and played through the main story, which took me about 9 hours to finish, so I consider that a good value for dollar. I would not recommend paying full price for what it is.\n\nThe content in the main story isn't that long, but I ended up having to replay large chunks of it due to death. Mostly due to random jaguar attacks that seem unavoidable, and are difficult to recover from. This game really doesn't hold your hand and you are up against an extremely hostile jungle, so death happens a lot. I found the survival aspect to be a bit too frustrating, so I doubt I'll play much survival mode. \n\nThe jungle environment is quite cool and it's easy to get lost if you're not closely watching your map and compass.  Danger of all kinds lurk everywhere so caution is constantly required. The inventory and crafting systems are unique, and I enjoyed them well enough, but the capacity of the backpack is a little laughable. A couple small leaves take up a huge portion of a backpack compartment. I think bigger allowable stacks of things in inventory would be a realistic and good improvement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was getting lag when my friend's trying to join me, I quit the game to reload and come back to host just to see that I have lost all my saved progress.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very very glitchy, on multiplayer it bugs all the time, most of the items dissapear. You can't build properly cuz it is not allowing you to build on most of the surfaces. I DO NOT RECCOMEND!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10 hours of gameplay, I can indeed say that it is hell. It’s fun, very challenging, and satisfying at the same time. However, I had to lower my rating because there are things that feel really disappointing. For example, you can’t increase your carry weight. It’s capped at 50, and you can’t expand it with pouches, quivers, stick bags, etc., because they don’t exist. You can only build storage in your base, like chests, arrow containers, stick containers, and others. You can’t bring extra storage while exploring, which sucks because the game is super realistic, yet it doesn’t let you make a stick bag or anything that expands your carry weight.\r\n\r\nYou also have to balance nutrients like protein, carbs, and fats, but the meat in the game weighs a ton and takes up a lot of inventory space. Just harvesting a capybara already slows me down, and it becomes tedious.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It´s an extremely hard and tedious game, where you have to do everything manually. Not only that, but even playing on the easiest setting is still extremely annoying, where a single bite of everything will kill you.  ''It's realistic hurh durh'', yes so realistic that it stops being fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมเหี้ยไรยิ่งเล่นยิ่งเครียด กุตายเพื่อนเครียด เพื่อนตายกุเครียด เเม่งวนอยู่อย่าง คนเผ่าก็มาไม่หยุด ควบคุมยากชิบหาย ไม่คุ้มเงินไอเหี้ย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mouse sensitivity hell,  people figured out how to make an fps long ago but these developers are kind of slow in that regard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The weird visual halo that follows you on the ground around the character is incredibly jarring to see keeps pulling me out of the game. Game is ridiculously grainy visually and I couldn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "要真实又没有真实到底，10度的斜坡不能做床使我失去了最后的兴趣。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Total waste of time. Typical “survival” game with rapidly depleting heath/hunger/thirst and the most sparse spawning of useful resources.\nIf you like a walking sim where you can’t interact with most things in the environment aside from anything highlighted with a white border then this is the game for you.\nCrafting’s annoyingly tedius and barely makes sense. Do yourself a favour and get sons of the forest instead.\nThis sux ass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i think the concept of the game is cool but the actual mechanics itself are choppy. there are so many steps to everything that it makes it hard to actually enjoy playing the game for me personally.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played, nothing to do and confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fun game, cool idea and all, but graphic wise (for a 2019 game), and all it's lacking heavily, the game is always on hardcore difficulty seems like, you start at 50% on everything, leaving spawn area u might come across tribals, or a tiger and die, gathering resources is insane due to constant food managing and water too, don't forget that a tiger spawns next to your base for no fucking reason, causing you to die most cases, and go back to spawn :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is like a copy paste game but made by stupid developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is poorly balanced, garbage.\n\"Die is the first step to greatness\" WHAT A STUPID GARBAGE IDIOTIC ABSURD IDEA. ok try IRL if its true, can you revive?. Fuking idiots...\nWaste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was too realistic so I couldn't even survive 5 minutes yo\n\n6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3 hours...  i really want to like the game.\r\nControls are clumsy and interaction is frustrating.  Another survival game with multiple useful items all around you. But, game design doesn't give you access to them.\r\n\r\nTutorial is a tedious linear story that takes too long.  Would rather have a table of contents access to select which parts of the game you want to know how to do.  \r\n\r\nOverall.  I don't have the patience for this gameplay.  doesn't stand out enough to stick with this over something else later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tries too hard to be difficult and it ends up being purely annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game runs poorly even on a good PC, the gameplay feels clunky, and the interface is messy. It didn’t meet my expectations.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty frustrating. Would say there is definitely better more enjoyable survival games out there. Also that centipede was just cruel. Now any time I pick up a leaf I panic for a second.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the temu version of The Forest",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A bad experience all round.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard should uninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MID",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great concept, but extremely frustrating and poorly balanced\n\nAfter playing over 20 hours of the story mode, I can confidently say that Green Hell is more frustrating than enjoyable and not in a challenging or rewarding way, but in a tedious and exhausting one.\n\nThe game constantly punishes you for small mistakes: you die easily, lose all your items, and then have to recraft weapons and tools from scratch, sometimes without even remembering the recipes. Items break quickly, and there's no intuitive system to rebuild or recover them. This creates a repetitive and annoying gameplay loop that doesnt feel satisfying just punishing.\n\nInstead of focusing on building a base or progressing the story, you're constantly forced to micromanage tiny survival details like worms, infections, parasites, dirt, food rot, dehydration, fatigue... it never ends. The disease system is overly aggressive and not fun. It completely overshadows the actual narrative experience.\n\nWorse, the story mode doesn’t guide you well at all. Objectives are vague, the jungle looks the same everywhere, and you 're left wandering aimlessly without direction. The GPS map doesnt help much, and many times I found myself stuck just trying to figure out where to go next.\n\nCombat is minimal and pointless. The enemies (tribesmen) barely appear and have no real gameplay presence or meaning, making crafting better weapons and armor feel completely unnecessary. Even in Survival mode, there’s no real threat besides diseases no enemy raids, no dynamic danger. So why bother building a base?\n\nFinally, the difficulty settings are badly designed. You either play on full hardcore survival mode where you're constantly dying from invisible issues, or you turn everything off and the game becomes meaningless. There 's no middle ground for players who want a balanced survival story experience.\n\nGreen Hell has an interesting story and beautiful world, but its buried under frustrating mechanics and a poorly balanced survival system. The game desperately needs better difficulty sliders, smarter crafting, and meaningful enemy interaction. As it is, it feels more like a chore than a game.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "This gives me The Forest vibes but it's much harder and more grounded in reality. This is one of those games that I wish there was a middleground option. I like the entire game so far and don't mind how hard it is except for one aspect of it. For the life of me after 6 hours of playing and wandering every inch of jungle I could reach without a grapple, I couldn't find a single bandage. I looked it up, they only spawn in 3 places in the map and I couldn't actually find those locations online. This might not seem so bad on the surface, unless u consider what that really means. This effectively means that even the smallest cut as far as I can tell will eventually kill you if not bandaged. There's no chance for it to heal on it's own seemingly. Anyways the games great other than the fact that bandages are basically a legendary item. This could be easily alleviated by putting a few closer to spawn or just making them random.\n\nAfter beating the story, I can say that it was really solid. Use a guide if you wanna finish the story though, it's nigh impossible to figure out on your own. Also use a guide in general for this game, because there's a lot of stuff you need to know to survive the first few days that may take you a long time to figure out,",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Not very good game, zero action, has a public.., The Forest waay is better.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just badly implemented. \nUnfortunate, because the premises are good, but many things are just a no no. \n\nThe TLDR is that the is zero room for error and  even if you do everything right you will just die many times and there is nothing you can do to avoid that. Every little problem just cascade in a whole lotta issues that end up with you dying... \n\nYou get catapulted in the forest with almost no explanations on how and what things mean and you immediately need to know and have everything. \n- You didn't know that you need to find coconuts immediately as soon as you start the game? Welp too bad, you're dead so start again.\n- You spent precious resources to build a workbench thinking it was useful and now you don't have for something important? You're dead.\n- You didn't know the are stingrays in specific spots? You're dead.\n- You're exploring and find a jaguar? You're dead.\n- Get an infection? Read how to cure it in the notebook (if you have even discover it) while you are rapidly dying.\n- You're trying to cure it a now the fire has worn out and now you can't cook food nor boil water and you're dead.\n- You're dying and you need to start a fire? Too bad, you cant as you don't have enough stamina (since you're dying) so you can just sit and watch your sorryas die. \n- You need to find some carbs or fat to eat and it's night? Take the torch. Oh no, it's raining so no luck there and you can be certain that this will eventually lead to your death somehow. And all this while playing Normal.\n\nYou're always one issue away from dying and having to restart the game all over again. This is not fun, this is not Elden Ring where you need to study the pattern on how to beat the game while dying so many times. I agree that it should be difficult, but we should be able to afford making (at least some) mistakes and fixing them without dying. Otherwise the gameplay is just a ''Ouch, well too bad, guess I'll die now and next time I hope it won't happen again'' instead of ''Ok we have this problem now, let's see if I can find a way to fix it''",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Green Hell is a good game. Creepy Jar does nothing but promote their new crap what ever shit game on here and their discord. It is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 month ago i  can played with my friend and one day i cant play with friend anymore why it happened please tell me i wanna play this game. i cant play for 4 months now how can i fix it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "English:\nGreen Hell is a beautifully detailed survival game, but I cannot recommend it due to severe motion sickness. I have played hundreds of games, 99% of which are first-person, and I very rarely have this problem. For some reason, playing this game for more than two hours consistently makes me feel sick, which doesn't happen with other survival titles I've played. As good as the game is, the motion sickness it induces is a deal-breaker for me, and since this is such a rare issue for me, I have to assume it's related to the game itself.\n\nTürkçe:\nGreen Hell çok ayrıntılı ve güzel bir hayatta kalma oyunu olmasına rağmen, sebep olduğu şiddetli hareket tutması yüzünden maalesef önermiyorum. Yüzlerce oyun oynadım ve bu oyunların %99'unda böyle bir sorun yaşamadım. Nedenini bilmiyorum ama Green Hell'de 2 saatin üzerinde oynadığımda istisnasız hareket tutması yaşıyorum ki bu durumu diğer hayatta kalma oyunlarında hiç tecrübe etmemiştim. Oyun ne kadar kaliteli olursa olsun, çok nadiren bu sorundan etkilenen biri olarak bunu yaşamamın oyundan kaynaklı olduğunu düşünüyorum. Bu yüzden benim için oynanabilir olmaktan çıkıyor.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I had some issues with the jaguars, so I turned predators off. Then the game offers no challenge apart from nutritions and snakes. \r\nAlso if you wanna fight jaguar, do it distantly, headshot is the best. Hardcore survival is an excuse for cheap.\r\n\r\nBut even if predators are present, it's a walking simulator with poor and emotionally forced story.\r\nI was honestly thinking that after the Lambda location, I find her in a village full of tribsmen, and idk realise some big truth, but I was just dissapointed. There in nothing. The map is empty. Just forest and walking.\r\nNot a spoiler. I just saved you some time. \r\nIf anyone even reads this:) you can thank me later.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was very funny when i impulsively picked up a Poison Dart frog that passed at my feet, realised what i had done instantly & shortly after died to poison.\n\nThat said, this was about the highlight of the game, the rest of my experience was torture.\nFULL DISCLOSURE: I did NOT understand how to treat worms, but i wrongly assumed they would go away over time, & all 4 of my limbs contracted worms, keeping my character's Sanity stuck at 0 for about 2 hours. The constant screaming voices absolutely dragged my mood through the floor.\n\nThe tutorial is awful: It gives you the absolute minimum, how to pickup items, how to craft a campfire, how to eat, how to check yourself for wounds & treat injuries.\n\nWhat it DOES NOT teach you, is how to treat ANY of the diseases. Which you will get MANY of, mostly fatal.\n\n-The only way to know what edibles are lethal is trial & error, there isn't even a general guideline to go by so you can at least make a decent guess at what's safe.\n\nMushrooms: IRL there isn't a single rational person that would eat a wild mushroom if they didn't know what it was. In this game, almost all of them are safe, 1 of them is early game essential for curing parasites.\n\nThe health system is a major flop. If you suffer an injury, you need to check ALL of your limbs before you even know which are injured, like wtf, at LEAST show an icon on the limb selection showing if there's an injury, like the armor icon.\n\nThe same goes with leeches, you'll only know you have them when the first time discovery tooltip pops up, OR if your character is supposed to be fine, yet the magnifying glass icon is in the bottom left to indicate a limb wound.\n\nBandages:\nIn the 3 hrs i played the game, i did not find a SINGLE FUCKING bush that can be used for bandages.\nI get it, this is a brutal survival game, & i deserve to be punished for reckless behaviour, but why is the most ESSENTIAL health resource so hard to find AND looks like any other bush in a jungle, but with small yellow flowers...\n\nThe notebook:\nProbably the most important thing you have, it holds your crafting recipes, fauna/flora notes, medical notes, basically everything you've learned in that save file.\nYet, it's extremely forgettable outside of crafting. Which i think is the reason itself. 99% of the time i open the book, it's for crafting. If i want to learn what an item does, i can see the info in the backpack when i hover over the item.\n\nIt was only about 2:30 hrs into my run when i remembered the notebook told you about the treatment options, which i then saw i could use the 2 bone needles i had to get rid of 2/4 of my worms...But because i had no bandages i got wound infection soon after & died in my sleep.\n\nNow for the crafting: Only change i would really ask for is a quicklist of potential crafts from the items currently on the crafting table so that i don't need to drop everything, open the book, find the recipe, then try again.\n\nBuilding: Annoying, Often you cannot build because the game decides the perfectly good looking terrain is not suitable, but the dense vegetation just a few metres over is perfectly fine.\n\nEdit: after having a good chunk more time, the game has gotten a great deal easier, i'm basically at the stage where i won't die to anything other than my own stupidity, the game is mostly brutal exclusively to newbies. Once you have a decent grasp on the mechanics & start rolling the ball, it's pretty easy.\n\nCombat: Dodging sideways is pointless, enemy attack hitboxes are MUCH wider than they should be. Headshots with thrown spears or arrows are always lethal, ALWAYS. Headshots in melee don't feel like they do anything.\n\nCrafting Material Comparisons: Using different materials for the same item probably has different effects, like durability & damage, but there's no clear indicator how much of a difference it makes, if at all.\n\nPlayer Character Voicelines: Story Dialogue is fine, everywhere else, the MC sounds extremely angry. Drilling a fire for 0.1 seconds/ a tool breaking, always elicits shouts of extreme frustration. Combat Voices are actually calmer.\n\nFake sounds: The game has a lot of fake sounds, Leaves rustling, monkey sounds(Monkeys are NOT in the game), other animals. Basically, it's trying to keep you on edge, which it does, but it isn't earned, it's like a sudden jumpscare in a horror game, they're not scary, they're surprising & cheap. It would be better if the rustling leaves was because of harmless creatures passing by.\n\nItem spawning: I get that you need respawning items, i should not be seeing sticks & rocks actually poof into existence meters away from me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cant say I enjoyed the game... I tried it its too complex and not in a fun way. too many steps to build a simple fire and it came off as tedious. I enjoy most Survival games, but the menus and interface is clunky and the steps to achieve even the simplest of tasks is not enjoyable. I'm going to go play a different game, and leave this one alone, To the Devs, I think your heart and soul is in the right place , but Dang, make the game fun. not a chore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Possibly a great game if you're interested in a relentless, challenging survival genre. I appreciate what went into this game and it looks good, but NGL...it burned me out after 6 hours. Too much stress and grind. I don't understand, if you're trying to escape the jungle, why you'd take time to level up and build a fortress and learn metallurgy. I got my $7 worth from this game, but I don't recommend it, because there are dozens of mid and late game features shown in the videos that you'll probably never get to because of the frustrating dying simulator that precedes them. Here's a synopsis of the game: touch water, get worm. Poke worm with fish bone (hope you caught a fish before that). Unable to find medicinal herbs or \"bandage\" plants for the wound? You die that day. I literally wandered for 2 real-world hours looking for the bandage plant, reloading 15 times. If that sounds fun...by all means play on. Hundreds of palm trees, but one-in-50 has a coconut? Nah, this is an aggravating game with too many forced choke points and I couldn't enjoy it, sorry.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "consantly crashes pc, genuinely unplayable. pc exceeds min specs x10 fold",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "got attacked by a jaguar without a hitbox, attacked by a caiman that apparently has a reach of 2meters so yeah it can kill you from afar, sled tumbles over and can't be picked up so had to make a new one. this game kinda wack but addictive. wish allat gets fixed",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What a pile of shit.  Absolute tedium simulator for people thinking playing a survival game makes them Bear Grylls IRL.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Could have been a great game and would have invested more time but this game's items drop on death and you have to look so hard to find items that may or may not be there killed it for me entirely. The fact that the game differs from others where you drop a pack or toolbelt was a bad move and not offering it the custom game section where I can have the difficulty but not worry about that is the game breaking error I have with this game. Something so simple, yet completely makes it a no go. In my opinion, I can not recommend this game with such lack of player consideration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, the game is nice and definitely worth playing with friends, but it has a lot of bugs in multiplayer. It starts right from the loading screen, where the game freezes, connects you, and sometimes you die instantly, or you can’t open the map/clock. I tried giving it a second chance after a 5–6 month break, but it seems like not much has been fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this on sale for $9 or so, and played through the main story, which took me about 9 hours to finish, so I consider that a good value for dollar. I would not recommend paying full price for what it is.\n\nThe content in the main story isn't that long, but I ended up having to replay large chunks of it due to death. Mostly due to random jaguar attacks that seem unavoidable, and are difficult to recover from. This game really doesn't hold your hand and you are up against an extremely hostile jungle, so death happens a lot. I found the survival aspect to be a bit too frustrating, so I doubt I'll play much survival mode. \n\nThe jungle environment is quite cool and it's easy to get lost if you're not closely watching your map and compass.  Danger of all kinds lurk everywhere so caution is constantly required. The inventory and crafting systems are unique, and I enjoyed them well enough, but the capacity of the backpack is a little laughable. A couple small leaves take up a huge portion of a backpack compartment. I think bigger allowable stacks of things in inventory would be a realistic and good improvement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was getting lag when my friend's trying to join me, I quit the game to reload and come back to host just to see that I have lost all my saved progress.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very very glitchy, on multiplayer it bugs all the time, most of the items dissapear. You can't build properly cuz it is not allowing you to build on most of the surfaces. I DO NOT RECCOMEND!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10 hours of gameplay, I can indeed say that it is hell. It’s fun, very challenging, and satisfying at the same time. However, I had to lower my rating because there are things that feel really disappointing. For example, you can’t increase your carry weight. It’s capped at 50, and you can’t expand it with pouches, quivers, stick bags, etc., because they don’t exist. You can only build storage in your base, like chests, arrow containers, stick containers, and others. You can’t bring extra storage while exploring, which sucks because the game is super realistic, yet it doesn’t let you make a stick bag or anything that expands your carry weight.\r\n\r\nYou also have to balance nutrients like protein, carbs, and fats, but the meat in the game weighs a ton and takes up a lot of inventory space. Just harvesting a capybara already slows me down, and it becomes tedious.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It´s an extremely hard and tedious game, where you have to do everything manually. Not only that, but even playing on the easiest setting is still extremely annoying, where a single bite of everything will kill you.  ''It's realistic hurh durh'', yes so realistic that it stops being fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมเหี้ยไรยิ่งเล่นยิ่งเครียด กุตายเพื่อนเครียด เพื่อนตายกุเครียด เเม่งวนอยู่อย่าง คนเผ่าก็มาไม่หยุด ควบคุมยากชิบหาย ไม่คุ้มเงินไอเหี้ย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mouse sensitivity hell,  people figured out how to make an fps long ago but these developers are kind of slow in that regard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The weird visual halo that follows you on the ground around the character is incredibly jarring to see keeps pulling me out of the game. Game is ridiculously grainy visually and I couldn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "要真实又没有真实到底，10度的斜坡不能做床使我失去了最后的兴趣。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think the concept of the game is cool but the actual mechanics itself are choppy. there are so many steps to everything that it makes it hard to actually enjoy playing the game for me personally.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played, nothing to do and confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fun game, cool idea and all, but graphic wise (for a 2019 game), and all it's lacking heavily, the game is always on hardcore difficulty seems like, you start at 50% on everything, leaving spawn area u might come across tribals, or a tiger and die, gathering resources is insane due to constant food managing and water too, don't forget that a tiger spawns next to your base for no fucking reason, causing you to die most cases, and go back to spawn :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is like a copy paste game but made by stupid developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bought this game, tried to join a friend, friend was invisible but we were in the same game, no fix, game sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is poorly balanced, garbage.\n\"Die is the first step to greatness\" WHAT A STUPID GARBAGE IDIOTIC ABSURD IDEA. ok try IRL if its true, can you revive?. Fuking idiots...\nWaste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "9 hour into the campaign all of us, 4 friends, got soft locked. We spawn in a stuck position and cannot move. No way to progress.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Where am i going? why no map? no compass? how do i know where objective is? While hand holding is annoying, it takes you a little ways then abandons  you. You will constantly die from poison, injury, and enemies of all types. Probably fun if you have a friend that plays and can show you around, but as a solo, it is unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was too realistic so I couldn't even survive 5 minutes yo\n\n6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3 hours...  i really want to like the game.\r\nControls are clumsy and interaction is frustrating.  Another survival game with multiple useful items all around you. But, game design doesn't give you access to them.\r\n\r\nTutorial is a tedious linear story that takes too long.  Would rather have a table of contents access to select which parts of the game you want to know how to do.  \r\n\r\nOverall.  I don't have the patience for this gameplay.  doesn't stand out enough to stick with this over something else later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tries too hard to be difficult and it ends up being purely annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game runs poorly even on a good PC, the gameplay feels clunky, and the interface is messy. It didn’t meet my expectations.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty frustrating. Would say there is definitely better more enjoyable survival games out there. Also that centipede was just cruel. Now any time I pick up a leaf I panic for a second.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the temu version of The Forest",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A bad experience all round.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard should uninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MID",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great concept, but extremely frustrating and poorly balanced\n\nAfter playing over 20 hours of the story mode, I can confidently say that Green Hell is more frustrating than enjoyable and not in a challenging or rewarding way, but in a tedious and exhausting one.\n\nThe game constantly punishes you for small mistakes: you die easily, lose all your items, and then have to recraft weapons and tools from scratch, sometimes without even remembering the recipes. Items break quickly, and there's no intuitive system to rebuild or recover them. This creates a repetitive and annoying gameplay loop that doesnt feel satisfying just punishing.\n\nInstead of focusing on building a base or progressing the story, you're constantly forced to micromanage tiny survival details like worms, infections, parasites, dirt, food rot, dehydration, fatigue... it never ends. The disease system is overly aggressive and not fun. It completely overshadows the actual narrative experience.\n\nWorse, the story mode doesn’t guide you well at all. Objectives are vague, the jungle looks the same everywhere, and you 're left wandering aimlessly without direction. The GPS map doesnt help much, and many times I found myself stuck just trying to figure out where to go next.\n\nCombat is minimal and pointless. The enemies (tribesmen) barely appear and have no real gameplay presence or meaning, making crafting better weapons and armor feel completely unnecessary. Even in Survival mode, there’s no real threat besides diseases no enemy raids, no dynamic danger. So why bother building a base?\n\nFinally, the difficulty settings are badly designed. You either play on full hardcore survival mode where you're constantly dying from invisible issues, or you turn everything off and the game becomes meaningless. There 's no middle ground for players who want a balanced survival story experience.\n\nGreen Hell has an interesting story and beautiful world, but its buried under frustrating mechanics and a poorly balanced survival system. The game desperately needs better difficulty sliders, smarter crafting, and meaningful enemy interaction. As it is, it feels more like a chore than a game.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "This gives me The Forest vibes but it's much harder and more grounded in reality. This is one of those games that I wish there was a middleground option. I like the entire game so far and don't mind how hard it is except for one aspect of it. For the life of me after 6 hours of playing and wandering every inch of jungle I could reach without a grapple, I couldn't find a single bandage. I looked it up, they only spawn in 3 places in the map and I couldn't actually find those locations online. This might not seem so bad on the surface, unless u consider what that really means. This effectively means that even the smallest cut as far as I can tell will eventually kill you if not bandaged. There's no chance for it to heal on it's own seemingly. Anyways the games great other than the fact that bandages are basically a legendary item. This could be easily alleviated by putting a few closer to spawn or just making them random.\n\nAfter beating the story, I can say that it was really solid. Use a guide if you wanna finish the story though, it's nigh impossible to figure out on your own. Also use a guide in general for this game, because there's a lot of stuff you need to know to survive the first few days that may take you a long time to figure out,",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Not very good game, zero action, has a public.., The Forest waay is better.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just badly implemented. \nUnfortunate, because the premises are good, but many things are just a no no. \n\nThe TLDR is that the is zero room for error and  even if you do everything right you will just die many times and there is nothing you can do to avoid that. Every little problem just cascade in a whole lotta issues that end up with you dying... \n\nYou get catapulted in the forest with almost no explanations on how and what things mean and you immediately need to know and have everything. \n- You didn't know that you need to find coconuts immediately as soon as you start the game? Welp too bad, you're dead so start again.\n- You spent precious resources to build a workbench thinking it was useful and now you don't have for something important? You're dead.\n- You didn't know the are stingrays in specific spots? You're dead.\n- You're exploring and find a jaguar? You're dead.\n- Get an infection? Read how to cure it in the notebook (if you have even discover it) while you are rapidly dying.\n- You're trying to cure it a now the fire has worn out and now you can't cook food nor boil water and you're dead.\n- You're dying and you need to start a fire? Too bad, you cant as you don't have enough stamina (since you're dying) so you can just sit and watch your sorryas die. \n- You need to find some carbs or fat to eat and it's night? Take the torch. Oh no, it's raining so no luck there and you can be certain that this will eventually lead to your death somehow. And all this while playing Normal.\n\nYou're always one issue away from dying and having to restart the game all over again. This is not fun, this is not Elden Ring where you need to study the pattern on how to beat the game while dying so many times. I agree that it should be difficult, but we should be able to afford making (at least some) mistakes and fixing them without dying. Otherwise the gameplay is just a ''Ouch, well too bad, guess I'll die now and next time I hope it won't happen again'' instead of ''Ok we have this problem now, let's see if I can find a way to fix it''",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Green Hell is a good game. Creepy Jar does nothing but promote their new crap what ever shit game on here and their discord. It is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 month ago i  can played with my friend and one day i cant play with friend anymore why it happened please tell me i wanna play this game. i cant play for 4 months now how can i fix it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "English:\nGreen Hell is a beautifully detailed survival game, but I cannot recommend it due to severe motion sickness. I have played hundreds of games, 99% of which are first-person, and I very rarely have this problem. For some reason, playing this game for more than two hours consistently makes me feel sick, which doesn't happen with other survival titles I've played. As good as the game is, the motion sickness it induces is a deal-breaker for me, and since this is such a rare issue for me, I have to assume it's related to the game itself.\n\nTürkçe:\nGreen Hell çok ayrıntılı ve güzel bir hayatta kalma oyunu olmasına rağmen, sebep olduğu şiddetli hareket tutması yüzünden maalesef önermiyorum. Yüzlerce oyun oynadım ve bu oyunların %99'unda böyle bir sorun yaşamadım. Nedenini bilmiyorum ama Green Hell'de 2 saatin üzerinde oynadığımda istisnasız hareket tutması yaşıyorum ki bu durumu diğer hayatta kalma oyunlarında hiç tecrübe etmemiştim. Oyun ne kadar kaliteli olursa olsun, çok nadiren bu sorundan etkilenen biri olarak bunu yaşamamın oyundan kaynaklı olduğunu düşünüyorum. Bu yüzden benim için oynanabilir olmaktan çıkıyor.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I had some issues with the jaguars, so I turned predators off. Then the game offers no challenge apart from nutritions and snakes. \r\nAlso if you wanna fight jaguar, do it distantly, headshot is the best. Hardcore survival is an excuse for cheap.\r\n\r\nBut even if predators are present, it's a walking simulator with poor and emotionally forced story.\r\nI was honestly thinking that after the Lambda location, I find her in a village full of tribsmen, and idk realise some big truth, but I was just dissapointed. There in nothing. The map is empty. Just forest and walking.\r\nNot a spoiler. I just saved you some time. \r\nIf anyone even reads this:) you can thank me later.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was very funny when i impulsively picked up a Poison Dart frog that passed at my feet, realised what i had done instantly & shortly after died to poison.\n\nThat said, this was about the highlight of the game, the rest of my experience was torture.\nFULL DISCLOSURE: I did NOT understand how to treat worms, but i wrongly assumed they would go away over time, & all 4 of my limbs contracted worms, keeping my character's Sanity stuck at 0 for about 2 hours. The constant screaming voices absolutely dragged my mood through the floor.\n\nThe tutorial is awful: It gives you the absolute minimum, how to pickup items, how to craft a campfire, how to eat, how to check yourself for wounds & treat injuries.\n\nWhat it DOES NOT teach you, is how to treat ANY of the diseases. Which you will get MANY of, mostly fatal.\n\n-The only way to know what edibles are lethal is trial & error, there isn't even a general guideline to go by so you can at least make a decent guess at what's safe.\n\nMushrooms: IRL there isn't a single rational person that would eat a wild mushroom if they didn't know what it was. In this game, almost all of them are safe, 1 of them is early game essential for curing parasites.\n\nThe health system is a major flop. If you suffer an injury, you need to check ALL of your limbs before you even know which are injured, like wtf, at LEAST show an icon on the limb selection showing if there's an injury, like the armor icon.\n\nThe same goes with leeches, you'll only know you have them when the first time discovery tooltip pops up, OR if your character is supposed to be fine, yet the magnifying glass icon is in the bottom left to indicate a limb wound.\n\nBandages:\nIn the 3 hrs i played the game, i did not find a SINGLE FUCKING bush that can be used for bandages.\nI get it, this is a brutal survival game, & i deserve to be punished for reckless behaviour, but why is the most ESSENTIAL health resource so hard to find AND looks like any other bush in a jungle, but with small yellow flowers...\n\nThe notebook:\nProbably the most important thing you have, it holds your crafting recipes, fauna/flora notes, medical notes, basically everything you've learned in that save file.\nYet, it's extremely forgettable outside of crafting. Which i think is the reason itself. 99% of the time i open the book, it's for crafting. If i want to learn what an item does, i can see the info in the backpack when i hover over the item.\n\nIt was only about 2:30 hrs into my run when i remembered the notebook told you about the treatment options, which i then saw i could use the 2 bone needles i had to get rid of 2/4 of my worms...But because i had no bandages i got wound infection soon after & died in my sleep.\n\nNow for the crafting: Only change i would really ask for is a quicklist of potential crafts from the items currently on the crafting table so that i don't need to drop everything, open the book, find the recipe, then try again.\n\nBuilding: Annoying, Often you cannot build because the game decides the perfectly good looking terrain is not suitable, but the dense vegetation just a few metres over is perfectly fine.\n\nEdit: after having a good chunk more time, the game has gotten a great deal easier, i'm basically at the stage where i won't die to anything other than my own stupidity, the game is mostly brutal exclusively to newbies. Once you have a decent grasp on the mechanics & start rolling the ball, it's pretty easy.\n\nCombat: Dodging sideways is pointless, enemy attack hitboxes are MUCH wider than they should be. Headshots with thrown spears or arrows are always lethal, ALWAYS. Headshots in melee don't feel like they do anything.\n\nCrafting Material Comparisons: Using different materials for the same item probably has different effects, like durability & damage, but there's no clear indicator how much of a difference it makes, if at all.\n\nPlayer Character Voicelines: Story Dialogue is fine, everywhere else, the MC sounds extremely angry. Drilling a fire for 0.1 seconds/ a tool breaking, always elicits shouts of extreme frustration. Combat Voices are actually calmer.\n\nFake sounds: The game has a lot of fake sounds, Leaves rustling, monkey sounds(Monkeys are NOT in the game), other animals. Basically, it's trying to keep you on edge, which it does, but it isn't earned, it's like a sudden jumpscare in a horror game, they're not scary, they're surprising & cheap. It would be better if the rustling leaves was because of harmless creatures passing by.\n\nItem spawning: I get that you need respawning items, i should not be seeing sticks & rocks actually poof into existence meters away from me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cant say I enjoyed the game... I tried it its too complex and not in a fun way. too many steps to build a simple fire and it came off as tedious. I enjoy most Survival games, but the menus and interface is clunky and the steps to achieve even the simplest of tasks is not enjoyable. I'm going to go play a different game, and leave this one alone, To the Devs, I think your heart and soul is in the right place , but Dang, make the game fun. not a chore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Possibly a great game if you're interested in a relentless, challenging survival genre. I appreciate what went into this game and it looks good, but NGL...it burned me out after 6 hours. Too much stress and grind. I don't understand, if you're trying to escape the jungle, why you'd take time to level up and build a fortress and learn metallurgy. I got my $7 worth from this game, but I don't recommend it, because there are dozens of mid and late game features shown in the videos that you'll probably never get to because of the frustrating dying simulator that precedes them. Here's a synopsis of the game: touch water, get worm. Poke worm with fish bone (hope you caught a fish before that). Unable to find medicinal herbs or \"bandage\" plants for the wound? You die that day. I literally wandered for 2 real-world hours looking for the bandage plant, reloading 15 times. If that sounds fun...by all means play on. Hundreds of palm trees, but one-in-50 has a coconut? Nah, this is an aggravating game with too many forced choke points and I couldn't enjoy it, sorry.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "consantly crashes pc, genuinely unplayable. pc exceeds min specs x10 fold",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "got attacked by a jaguar without a hitbox, attacked by a caiman that apparently has a reach of 2meters so yeah it can kill you from afar, sled tumbles over and can't be picked up so had to make a new one. this game kinda wack but addictive. wish allat gets fixed",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What a pile of shit.  Absolute tedium simulator for people thinking playing a survival game makes them Bear Grylls IRL.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Could have been a great game and would have invested more time but this game's items drop on death and you have to look so hard to find items that may or may not be there killed it for me entirely. The fact that the game differs from others where you drop a pack or toolbelt was a bad move and not offering it the custom game section where I can have the difficulty but not worry about that is the game breaking error I have with this game. Something so simple, yet completely makes it a no go. In my opinion, I can not recommend this game with such lack of player consideration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, the game is nice and definitely worth playing with friends, but it has a lot of bugs in multiplayer. It starts right from the loading screen, where the game freezes, connects you, and sometimes you die instantly, or you can’t open the map/clock. I tried giving it a second chance after a 5–6 month break, but it seems like not much has been fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this on sale for $9 or so, and played through the main story, which took me about 9 hours to finish, so I consider that a good value for dollar. I would not recommend paying full price for what it is.\n\nThe content in the main story isn't that long, but I ended up having to replay large chunks of it due to death. Mostly due to random jaguar attacks that seem unavoidable, and are difficult to recover from. This game really doesn't hold your hand and you are up against an extremely hostile jungle, so death happens a lot. I found the survival aspect to be a bit too frustrating, so I doubt I'll play much survival mode. \n\nThe jungle environment is quite cool and it's easy to get lost if you're not closely watching your map and compass.  Danger of all kinds lurk everywhere so caution is constantly required. The inventory and crafting systems are unique, and I enjoyed them well enough, but the capacity of the backpack is a little laughable. A couple small leaves take up a huge portion of a backpack compartment. I think bigger allowable stacks of things in inventory would be a realistic and good improvement.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was getting lag when my friend's trying to join me, I quit the game to reload and come back to host just to see that I have lost all my saved progress.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very very glitchy, on multiplayer it bugs all the time, most of the items dissapear. You can't build properly cuz it is not allowing you to build on most of the surfaces. I DO NOT RECCOMEND!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 10 hours of gameplay, I can indeed say that it is hell. It’s fun, very challenging, and satisfying at the same time. However, I had to lower my rating because there are things that feel really disappointing. For example, you can’t increase your carry weight. It’s capped at 50, and you can’t expand it with pouches, quivers, stick bags, etc., because they don’t exist. You can only build storage in your base, like chests, arrow containers, stick containers, and others. You can’t bring extra storage while exploring, which sucks because the game is super realistic, yet it doesn’t let you make a stick bag or anything that expands your carry weight.\r\n\r\nYou also have to balance nutrients like protein, carbs, and fats, but the meat in the game weighs a ton and takes up a lot of inventory space. Just harvesting a capybara already slows me down, and it becomes tedious.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It´s an extremely hard and tedious game, where you have to do everything manually. Not only that, but even playing on the easiest setting is still extremely annoying, where a single bite of everything will kill you.  ''It's realistic hurh durh'', yes so realistic that it stops being fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมเหี้ยไรยิ่งเล่นยิ่งเครียด กุตายเพื่อนเครียด เพื่อนตายกุเครียด เเม่งวนอยู่อย่าง คนเผ่าก็มาไม่หยุด ควบคุมยากชิบหาย ไม่คุ้มเงินไอเหี้ย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mouse sensitivity hell,  people figured out how to make an fps long ago but these developers are kind of slow in that regard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The weird visual halo that follows you on the ground around the character is incredibly jarring to see keeps pulling me out of the game. Game is ridiculously grainy visually and I couldn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "要真实又没有真实到底，10度的斜坡不能做床使我失去了最后的兴趣。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think the concept of the game is cool but the actual mechanics itself are choppy. there are so many steps to everything that it makes it hard to actually enjoy playing the game for me personally.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played, nothing to do and confusing",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}