{
  "positive": [
    {
      "review": "Evey ball i kill i cry because i hate hurting others but I need to imporve my aim I'm acutally sad i hate killing nd hurting others",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "gud game if u want arthritis and depression.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "If you want to improve your mechanics, this is the best/quickest way to do it, but it's only supplemental. You still have to play whatever game you main to really reap the benefits.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "As a disabled gamer with no hands. This game helps me train my pee pee to aim and shoot targets effectively.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "После этой штуки я перестал играть тренировочные карты в КС, потому что это точно лучше влияет на меткость, чем всё, во что я до этого играл. Кроме того, это позволяет переводить мозг в разные ритмы и синхронизировать с телом, что способствует лучшему выполнению задач связанных с этими ритмами. Есть недокументированные возможности этого тренажёра, которые даже сам его создатель возможно не знает. Но спасибо ему. Это потрясающая штука.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, best aim trainer on the market, personally want more customization, ie miss sounds, etc. also! nvidia reflex flash indicator is broken in current update",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game is good if you want to progress within your desired game and actually achieve something,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game made me addicted to it instead of my main game, i will click those circles like a maniac 10/10 would reccommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alot more fun than expected and aim improves rapidly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very useful tool for practicing especific tasks that you are needing in others games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "click on the circle but it's not osu.\n\nHigh quality aim trainer, cool community, worth the low cost 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "much better than aimlabs for aim training, it has very specific scenarios and a lot of those who are specialized in the aim training community provide resources like playlists here; worth the 10 bucks if you ask me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually a great way to improve aim if you train regularly tons of different scenarios and playlists worth every penny i spent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just give it time and effort, you will improve. Factor having fun as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u retarded and transformer, good game for u",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I started playing, I thought it was for aim training. After a long time, I realized it actually trains your understanding that not everyone is equally good at aiming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, as an aim-training noob I kind of prefer the free 3DAT, but I do see where Kovaak has so much more potential! If you intend to get heavily in to aim training you may as well just buy Kovaaks. 3DAT is simple, but it does match you with a few randos in your own rank and that makes you feel good when starting out, but it also runs slow on my computer so I'm now using Kovaaks more now and I do like it a lot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great a great tool for improving aim mechanics on a deeper level allowing users to improve pretty much any aspect of aim through the community maps, great for warming up for games and improving ones hand eye coordination. 10 - 20 mins before you play or log off with a set routine will work wonders, aim can be trained don't let people fool you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like aim labs but better, its very adicting once you start playing it often trying to get higher scores and doing benchmarks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great and really helpful and easy to navigate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good zero bloat straight to the point awsome settings buy this for aim nothing else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super easy to get in and make playlists, worth the price tag over the free alternatives that cram ads into the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kovaak's Aim Trainer is a simple, effective tool for improving aim with lots of drills and progress tracking, though it can feel repetitive at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was amazing but after the latest updates that  I think are unnecessary it started crashing and getting errors downloading (scenarious). Other that that it's amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why do I drop from 600fps to 15fps multiple times in one sitting? It runs and crashes worse than most full videogames. That said, everything else about kovaaks is pretty great, especially the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth the purchase. Would recommend even if you don't play fps games, just to improve your mouse control.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you first start to get better at aiming in other games. you'll keep coming back because it ends up being fun to grind and beat scores in kovaaks... I recommend checking out the voltaic benchmarks and also working on the viscose benchmarks especially, those are really really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for every player who wants to improve in almost every shooter game out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great aimtrainer. super customizable, great map variety, colors and visual clarity is somehow better than most other aimtrainers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "coming from console this is a HUGE upgrade from aimlab, i recently started getting into keyboard and mouse aim training because i wanted to get better and get scenes i always struggled with and so far i have reached 1 mammoth and 3 penguins on viscose easier benchmarks (just still starting out and i had more fun doing these than actually gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great. great way to warm up for games like fortnite, valorant, and many more. overall a AMAZING aim trainer. downside it does cost money but is worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to be really bad in fps but now i'm decent, prefer it over aimlabs due to the straight-forwardness of the ui, i just click twice and i'm in my playlist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great aimtrainer i prefer it a bit more than aimlabs simply because of its wider range of curated tasks, much more customization and overall smooth experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kovaaks is an excellent aim trainer for Apex Valorant, and CS2. Kovaaks helped me a lot in aiming, and it almost guarantees you good aim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays BF6 Beta.\r\n\r\nBought to get better at BF6.\r\n\r\nBought BF6. Can't play BF6. Considers if should try to enable secure boot and risk PC explosion...\r\n\r\nRefund BF6.\r\n\r\nGuess I'll just play Kovaak instead...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "someone pls help my mouse does not align with my  screen on kovaaks and when i click window the screen gets to big i need help fast pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOLY, i have played this for 4 days, and got 60% headshot rate, cheating accusations, 12kd, get this ASAP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy to think that 66,4% of users that own KovaaK's never launched it once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good if u can already aim but feel like spending 10 bucks on improving on how to learn to make settings from a youtube tutorial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as gay as aimlabs.\r\n\r\n(Aimlabs has tons of dumb bullcrap and stutters.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this has really help my aim get better and i would really recommend this if you are trying to get better aim and control over your mouse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the dots. THE DOTS.\nthey never stop. red, blue, floating in the endless yet so finite void. I awake and they're there. I close my eyes and THEY'RE. STILL. THERE. I didn’t want this. I never wanted this. I just wanted to get better at Valorant.\nBut now, the dots want ME to get better.\n\nclick. click. click. CLICK. CLICK.\n\nIf i miss one they whisper. If I miss two they scream. I don't know where my family went. I've barely eaten and dehydrated. ONLY THE DOTS MATTER.\nI hear the tings and pops in my sleep. \"They whisper good job.\" NO IT WASN’T. I CAN DO BETTER. THE DOT DESERVES BETTER.\n\nsometimes they move.\nsometimes I move.\nsometimes I AM THE DOT.\n\nIf I stop playing, they’ll come out of the screen.\nI saw one in my mirror this morning.\nIt looked back at me.\n\n10/10 aim trainer.\nplease help.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Improved my aim in fort. I sometimes have this issue where clicks don't register, but I'm just gonna blame it on my 7 year old mouse and move on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great trainer and my N° 1 tool to pass time while I watch a stream or some other media. It has helped me aim better and I still suck but thats on me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's very interesting, because u can improve a lot ur aim it's very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm addicted to tracking a 2 pixel black sphere moving smoothly but illusive in nature for 6 hours a day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "helpful for getting better aim  aslong as u dont grind useless tasks like gridshot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shoutout rileycs for inspiring me to lock in on aim trainers\n\nyou will absolutely see progress and better aim when you use kovaaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 20 hours of aim training my skin has become much smoother and my voice is much softer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "New Aim Tracking Trainer is kinda coolest thing in the entire polygon. Give it a try))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your serious about improving your aim and are willing to accept the challenge and put in the time and effort this is the aim trainer for yo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if ur wonder wether or not to get this because aimlabs is free 1000% get this. So much more optimized and easy to use compared to aimlabs. So much more scenario types and more benchmarks use kovaaks. I have seen so much fps improvement since downloading",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sensitivity feels really fucked up buts its pretty aight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still can't aim in game, but it makes me feel like I can before the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for getting better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5 hours in its pretty fun I pirated the game before this but thought it would be worth buying :steamhappy:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really worth the price for the amount of content you can play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than aimlabs just found it hard to find/create a good playlist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to develop carpal tunnel",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "aim immidiately improved ngl, \r\nreccomend some background music most the time though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "click dots gud =  click heads gud in game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great at helping you aim better! Maybe JJ will yell at me less now!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kovaaks made me start estrogen so I can get smoother skin for less mousepad friction :/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Made me realize how bad my aim is.. 100% worth will recommend to anyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You will be better than the average player with only 10 hours of practice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best if you want to practice  your fps aim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its got pretty much anything you need. Kovaak's > Aimlabs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving to play Kovaak when I want to disconnect from everything I do as part of my routine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought it to get better at Valorant. Still Bronze.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than any game ever made GOTY of the humanity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lowkey allows me to jerk my chicken while watching my chicken jerk 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you enjoy aiming, this is the program for you, very good, very pretty, please use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really helps if you stay consistent with it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you think you're team is the reason you're elo stuck. [spoiler] You should grind more Kovaak's [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great aim trainer. Lots of options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "click circles, tap heads",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MUST CLICK DOTS! time and consistency is all you need to reach new heights :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeaahh you know you click the circles, but uhh, sometimes you like - click AND hold on a circle that's ALSO moving.\n\nSo yeah.\n\nThanks for reading my review guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best aim trainer, 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first aim trainer i tried forgot aboat it maybe i will re try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great to help build steady hand placement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glorious King MattyOW plays this. As will I!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, could be more aesthetic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Esta mrd me da mas calor que cualquier mujer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing training, only 5 hours in an can tell there's a difference",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "turned me from balls enjoyer to bean lover",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean it's called the best aim trainer for a reason right?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perfect for grinding when you miss her",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grinding to get 500+ hours on kovaaks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "clickin on balls is fun man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you're worthless without this if you actually want to improve your aim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after clicking dost for 17 hours straight I went insane",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ten dollars for the best aiming is def a good deal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes my toe feel uncomfortable but give you good aim",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "KovaaK's is the best aim trainer on the market.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazingly easy to train form aim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good if u wanna get ur aim a lot better aint gon lie",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is by far the greatest game ever made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Click circles mmmffgghh.....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nothing to do in the game other than aim",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Archaic piece of shit. in order to select object a you need to be hovering over object b, which is crazy for a aim program. in order to delete local scenarious you need to go in the game pathway. loads of the scenarious look like they were made by 7 year old's in their kindergarden drawing competition in the span of 30 seconds. overall a money steal, the only reason this shit is popular is because there is very little competition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same bulls**t as Aimlabs, only the later is free..\n\nand the UI s*cks hard",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "most boring tac shooter i ever played it doesnt even let you wasd sometime ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy garbage and somehow still the only good option",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy, there is tons of other aim trainers id recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review (or update your review) for a game you've nominated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game killed my grandma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game only ppl who like feet grind this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cringe virgin game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE KOVAAKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why did I pay $10 for this game when Aimlabs is free. They make the community make all the content and ask for donations? Wtf lol.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "“How do I get my money back?”\nThis UI is so unnecessarily complicated — everything feels buried under five layers of menus. Finding basic tasks takes 5000 years. It’s way over-designed and honestly just feels… fruity for no reason. Aimlabs is so much simpler and gets you into training fast. I shouldn’t need a full expedition just to start a routine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the target practice available, but my game stutters randomly without performance issues, having tested different visual settings without change to the issue. I'm really liking the game so far aside from this problem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering/frame drops every 5 seconds or so. This is the only game that has this, never had issues like this even on the most heavy games, yet an aim trainer in which I get 600 fps constantly stutters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it keeps fucking freezing when i press play or local playlists it just keeps doing this and its not my pc because everything else works fine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archaic piece of shit. in order to select object a you need to be hovering over object b, which is crazy for a aim program. in order to delete local scenarious you need to go in the game pathway. loads of the scenarious look like they were made by 7 year old's in their kindergarden drawing competition in the span of 30 seconds. overall a money steal, the only reason this shit is popular is because there is very little competition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most boring tac shooter i ever played it doesnt even let you wasd sometime ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy garbage and somehow still the only good option",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy, there is tons of other aim trainers id recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review (or update your review) for a game you've nominated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game killed my grandma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game only ppl who like feet grind this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cringe virgin game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE KOVAAKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why did I pay $10 for this game when Aimlabs is free. They make the community make all the content and ask for donations? Wtf lol.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "“How do I get my money back?”\nThis UI is so unnecessarily complicated — everything feels buried under five layers of menus. Finding basic tasks takes 5000 years. It’s way over-designed and honestly just feels… fruity for no reason. Aimlabs is so much simpler and gets you into training fast. I shouldn’t need a full expedition just to start a routine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the target practice available, but my game stutters randomly without performance issues, having tested different visual settings without change to the issue. I'm really liking the game so far aside from this problem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering/frame drops every 5 seconds or so. This is the only game that has this, never had issues like this even on the most heavy games, yet an aim trainer in which I get 600 fps constantly stutters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it keeps fucking freezing when i press play or local playlists it just keeps doing this and its not my pc because everything else works fine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archaic piece of shit. in order to select object a you need to be hovering over object b, which is crazy for a aim program. in order to delete local scenarious you need to go in the game pathway. loads of the scenarious look like they were made by 7 year old's in their kindergarden drawing competition in the span of 30 seconds. overall a money steal, the only reason this shit is popular is because there is very little competition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most boring tac shooter i ever played it doesnt even let you wasd sometime ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy garbage and somehow still the only good option",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy, there is tons of other aim trainers id recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review (or update your review) for a game you've nominated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game killed my grandma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game only ppl who like feet grind this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cringe virgin game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE KOVAAKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why did I pay $10 for this game when Aimlabs is free. They make the community make all the content and ask for donations? Wtf lol.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "“How do I get my money back?”\nThis UI is so unnecessarily complicated — everything feels buried under five layers of menus. Finding basic tasks takes 5000 years. It’s way over-designed and honestly just feels… fruity for no reason. Aimlabs is so much simpler and gets you into training fast. I shouldn’t need a full expedition just to start a routine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the target practice available, but my game stutters randomly without performance issues, having tested different visual settings without change to the issue. I'm really liking the game so far aside from this problem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering/frame drops every 5 seconds or so. This is the only game that has this, never had issues like this even on the most heavy games, yet an aim trainer in which I get 600 fps constantly stutters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it keeps fucking freezing when i press play or local playlists it just keeps doing this and its not my pc because everything else works fine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archaic piece of shit. in order to select object a you need to be hovering over object b, which is crazy for a aim program. in order to delete local scenarious you need to go in the game pathway. loads of the scenarious look like they were made by 7 year old's in their kindergarden drawing competition in the span of 30 seconds. overall a money steal, the only reason this shit is popular is because there is very little competition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most boring tac shooter i ever played it doesnt even let you wasd sometime ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy garbage and somehow still the only good option",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy, there is tons of other aim trainers id recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review (or update your review) for a game you've nominated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game killed my grandma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game only ppl who like feet grind this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cringe virgin game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE KOVAAKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why did I pay $10 for this game when Aimlabs is free. They make the community make all the content and ask for donations? Wtf lol.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "“How do I get my money back?”\nThis UI is so unnecessarily complicated — everything feels buried under five layers of menus. Finding basic tasks takes 5000 years. It’s way over-designed and honestly just feels… fruity for no reason. Aimlabs is so much simpler and gets you into training fast. I shouldn’t need a full expedition just to start a routine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the target practice available, but my game stutters randomly without performance issues, having tested different visual settings without change to the issue. I'm really liking the game so far aside from this problem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stuttering/frame drops every 5 seconds or so. This is the only game that has this, never had issues like this even on the most heavy games, yet an aim trainer in which I get 600 fps constantly stutters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it keeps fucking freezing when i press play or local playlists it just keeps doing this and its not my pc because everything else works fine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archaic piece of shit. in order to select object a you need to be hovering over object b, which is crazy for a aim program. in order to delete local scenarious you need to go in the game pathway. loads of the scenarious look like they were made by 7 year old's in their kindergarden drawing competition in the span of 30 seconds. overall a money steal, the only reason this shit is popular is because there is very little competition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most boring tac shooter i ever played it doesnt even let you wasd sometime ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy garbage and somehow still the only good option",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super buggy, there is tons of other aim trainers id recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Review (or update your review) for a game you've nominated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game killed my grandma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game only ppl who like feet grind this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cringe virgin game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE KOVAAKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}