{
  "positive": [
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☑ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "The game is close to perfect. In my opinion, a more structured gearing progression and more engaging events would do wonders. Also, a more engaging open-world gameplay. Maybe the capability to form small 4-man warbands without the umbrella of the \"House\" and can layout your groups perma base but also being up for grabs by anyone",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good game, but after some time it gets repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although I played 45 hours at the time of the review, I probably put in twice as much as I played from when this game started (back in 2019 when it was under a different company and launcher and I guess it didn't record the time i spent playing it on Steam and then after had to turn away from the game due to busy life). Love this game. I came back after a long period and it felt just as I had left it (besides all the changes and updates it has had 😅)\r\nAs a solo player, I do find it fun hopping on solo and just doing a few matches. I do find it fun dragging my troops around trying to get the best set up to charge and take on the opponents. The different weapons classes are just as fun to mess around with as well. \r\n\r\nAt least gotta throw in a couple cons; gotta watch out for stuns when battling opponents as certain weapon classes know how to chain stun (or keep you down long enough for their buddies or troops to crowd you and curb stomp you down) and that you gotta at least have a couple decent power units. I know they now provide the mace units which are a nice starter units that help carry you against some tougher opponents, which helps a small bit 😅. \r\n\r\nI know i prob missed a few more cons or pros but overall personally, I like this game and recommend give it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played since the Lionheart Season, if I am thinking of the name correctly, or the season with the cannon units. Coming back into this new season, I actually am very impressed with the game. A lot of good QoL. I have seen a much more diverse meta, or at least units that don't have to be meta but are still strong. Old favorite units coming back into the spotlight, queues seem to pop more frequently, which if there are bots, they have made them pretty decent at not being blatantly obvious as they were before.\n\nWhile the game is definitely going in a better direction, I do worry about the next hurdle of mastery power creep. If they only do barracks based units and not really do it for any seasonal units. I could see this being a good thing, but they can easily get back into the same problem of a meta being defined by a very small amount of units, like when you had 30 units of axe raiders on the field at one time.\n\nHopefully the game continues in this direction. There is no other quite like this, and everything that is even remotely similar to it really isn't that great, especially in comparison.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a niche game, for sure, but while most smaller or newer MMORPGs go offline or die within a few years, CB is still active. Four other MMOs I played died in the time since this was made and had fewer wars than I'm seeing now. You're not getting WoW, but if you're not looking for WoW, this is a fine pick.\n\nYou can pay for the best units faster, but earning a few good units free as a newbie is not remotely difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is crazy fun. Just don't try the open world feature its way to confusing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good. if you want to start new. easier to start at the start of a new season where everyone is playing blue units. fun game especially when you get the hang of it. House wars can be iffy, have to mesh with the other players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Fun & easy to get into. Ofcourse people are going to cry about literally every free game that has transactions and all the other normal complaints you see on any other f2p pvp game. Wish people could just play games to have fun, and not play games just to complain. Community in game is also about 50/50. less of the normal toxicity, and more of half the player base crying about stuff like people actually using their mics and other dumb crap thats intended to be used since it is a game involving team work. I swear pvp games are just karen lobbies now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and support respawns really quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun, but it is pretty pay to win, but there are plenty of awards and whatnot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun. Hard to learn some of the mechanics of crafting and fiefs and stuff, but I love battling in siege battles and stuff. Pretty cool game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a hidden gem in my eyes yes there are pay 2 win elements in the form of faster progression but the sheer amount of content available for FREE is awesome, the servers do scream at peak times just be warned if you're on the fence try it definitly worth a chance ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра Conqueror's Blade - это захватывающая MMO-стратегия, в которой вы командуете средневековыми войсками в масштабных осадах и битвах. Геймплей уникален благодаря сочетанию управления собственным героем и отрядами, стратегически размещаемыми на поле боя. Возможность выбирать между разными эпохами и юнитами добавляет глубины и разнообразия.\n\nСистема развития персонажа и снаряжения предоставляет массу возможностей для кастомизации и улучшения своего военачальника. Экономическая составляющая, включающая сбор ресурсов и торговлю, важна для усиления вашей армии. Особенно впечатляют масштабные войны за территории между домами, где тысячи игроков сражаются за власть над провинциями.\n\nОднако, игра может быть требовательна к новичкам из-за обилия механик и необходимости долго осваиваться. Донат, хоть и не обязателен, может значительно ускорить прогресс. Несмотря на это, Conqueror's Blade предлагает неповторимый опыт средневековых сражений и завоеваний, который стоит попробовать любителям стратегических игр.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE THIS GAME KIND OF GRINDY AND IF U SPEND MONEY ON IT BE CAREFULL HOW U SPEND IT BECAUSE THERE IS NO SECOND CONFROMATION BUTTON BUT I LOVE THIS GAME GOOD SEAGE GAME",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game it was fun when i played it but its not my type. so play this if u like medival games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Como mo jugador nuevo hay que dedicarle tiempo para disfrutarlo pero es bueno",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want a good game like Tiger Knight it was fun to play around with the troops/abilities/commands\r\nI don't feel this is it.\r\nTell me WHERE TO FIND GOOD GAME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty straightforward gameplay with a quest based system for gaining exp and gear but kinda bland in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite game ever made.  Nothing like it at all.  1500 plus lvl and over 1000 hours on the previous version.  Massive competitive territory war battles were the best thing ever.  They sometimes ruin the unit balance with seasonal nuclear op units and certain unit upgrades but right now its actually not bad.  At it's peak there were lots of options and everything had a counter.   Theyve probably added too many units with too many mechanics and it can be a bit unbalanced but seems to be improved recently.  Most of the good players that understood how territory war works have gone and its all CBL players now that think everything is a 1v1 death match.  CBL is fine but territory wars  are different and were the best thing ive ever experienced in gaming.  You can still find some decent content but its not as good.  Siege mode match ques used to be a blast but everyone just farms xp now and isnt really trying to win anymore.  They should go back to giving more rewards for winning and nerf losing.  Still playable game but not what it was.  Nothing out there like CB.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best military combat control game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very underated game. I am colonizer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More than 400 hours played. Was alot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game connection is not good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun better then for honor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good Just have a good pc to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty fun once",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Charriot is so goated lmao",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game, i hate this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "start is easy, after a while gets hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, free game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mighty fine game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rich in combat content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very niice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Newest season is peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the scheme and it runs very well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love protecting the city",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games bugged",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FIX LAG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "charge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "N/A",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "b",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☑ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I tried this game, just by myself, on a whim, and was pleasantly surprised with it. I have thoroughly enjoyed playing this game so far.\nFrom artillery, to a plethora of quasi-historical units, to how you build your character, there are a lot of options for ways to play. Some may be more optimal than others, and that shifts with the seasons as well as which specific match type, but you do have the options. The battles are fun, and get better the more you learn about how to properly use your units, as well as how to best attack with the skills of whatever weapon you are using, learning the most effective implementations of the different artillery options, and start devising strategies. CB also gives you access to past seasons, so you can unlock previous units and other prizes. And that is accessible to any player, even if they haven't spent any money. Which is kind of cool, because you can go back and choose from the many options to unlock the \"best\" units, or ones you find interesting, or think would be fun.\n         After a long time playing solo, I even found a cool house to join, and have been there for a few in-game \"seasons\" now, which makes the game even more fun, as I can even participate in Territory Wars. And in the process, I have made some friends from around the world.\n\nI will also say, don't pay attention to the people who whine and cry it is \"p2w\", these people are what we call bad players. They haven't grasped how to properly level and use units, or how to properly implement their weapon of choice, or haven't clued into the meta of the season, or all the above. Probably most of the whiners are the people getting C's and D's and dragging whatever team they are on down. Some people just aren't good at some games, and instead of trying to improve, moving to a different game, or just learning to just have some fun with something, they instead want to blame something for their shortcomings.\n     I will admit, the game is overly-monetized. Too many pop-ups about monetized items, and too many things that require the premium currency. And yes, many items are overpriced. BUT the thing is, you don't NEED any of them. I got to over level 180 before I even decided to spend any money on this game, only because I WANTED to, because I've been having fun. I still don't spend much, usually only getting the battle pass for a season. And I usually place in the top-half of the scoreboard. The things that premium currency is for are cosmetics (attire), increasing storage (supply dump, barracks etc), progressing faster, crafting materials and of course the standard battle pass/subscription stuff you see in pretty much every live service game now. A lot of what can be bought can also just be earned. There are no units or other major \"game-changers\" available for premium currency. \nWhile yes, someone can pay their way through unlocking and leveling units, it doesn't give any more advantage than if someone has played a long time, or is very good at battle, or if someone is good at grinding And arguably paying through progressing leaves one at a disadvantage as they haven't spent time using their units  and learning how to play them. It just always sucks to be new to a game, but arguably the premium stuff can help someone new catch up quicker, if they choose.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game is Awesome. Its hard yes but thats only if you party with people not of your level. a lot of houses will try to get you to party with them to learn the game and i have to say when your lvl 50 goping against lvl 1000 players its just not fun so stick with people your level. if you want to know how to check press Shift key and left click their name in the chat window and it will display their lvl. it doesnt always work so try a few times it will save you a lot of frustration. The game gives plenty of rewards and XP boosts to new players and characters and even gives a good starting Unit that can be rather OP below lvl 150 and can even still be used as a back up Unit late game. It can be repetative so i would suggest trying out the weapons as you get Free Reset's on your stats and Unit XP below lvl 100. Dont use any XP boosters while under Premium as i found the boosters dont stack and you will waste XP boosters early game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "its a good game with some flaws the most unnecesary thing in the game is special power moves that can wipe a hole unit apart like hello? i joined this game to order troops around not being kille by dark medieval magic power up",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is close to perfect. In my opinion, a more structured gearing progression and more engaging events would do wonders. Also, a more engaging open-world gameplay. Maybe the capability to form small 4-man warbands without the umbrella of the \"House\" and can layout your groups perma base but also being up for grabs by anyone",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun game, especially those who wants to control a battalion, fight first hand and strategize your unit position/attack. It is one of the best games i ever played.\r\n\r\ndownside is, LOTS OF CHINESE on Asia server. rather play with Vietnam, Thailand or Philippines specific players.\r\n\r\n+excessive pricing on shops, WORST one ever.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A really fun game to play to pass the time with lots of things to achieve and work on. While this isn't a special feature, it really doesn't detract from the truly enjoyable gameplay experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Happy i stumbled on this game. It got harder as i played and leveling up but i really enjoy it",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Was actually better than I thought, really good game! Bring more updates?! Maybe a Cultural Update? Maps Updates? A story???",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Conqueror’s Blade is a massive real-time strategy game that really leans into huge battles and historical warfare. Leading thousands of troops through sieges, commanding Spartan warriors, samurai, or medieval knights, and smashing walls with trebuchets is genuinely thrilling and cinematic. The maps are gorgeous and varied, with deserts, bamboo forts, and cliffside battlegrounds that make every fight feel alive.\nThat said, the game can be overwhelming at first. Managing dozens of units with different abilities while keeping track of the battlefield takes practice, and some maps feel repetitive after a while. PvP can be brutal if your team isn’t coordinated, and microtransactions for faster progress or new troops are noticeable.\nStill, if you enjoy massive historical battles, tactical depth, and the occasional chaos of thousands of units clashing at once, Conqueror’s Blade delivers an experience you won’t forget. It’s rewarding, challenging, and visually impressive—just don’t expect it to hold your hand.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Closest game you'll find that resembles Kingdom Under fire 1 (and 2). As you've seen with my hours I've played this game from the beginning 6 years ago and its came a long way with updates, new units, maps and I think if you're an army nerd who likes to micro manage this game is for you. I LOVE THIS GAME...but of course...\r\n\r\n it has its cons and quite a few.\r\n\r\nSemi-decent a.i, resetting unit balance every 3 months (due to new releases and seasons) so unless you're up to date with new units or last seasons recently released units, you're cooked pasted lvl 60.\r\nLeveling balancing issues\r\nNo Storyline whatsoever\r\nPublisher is a bit sketchy with ownership and contract being renewed in 2024 so anything could happen to this game between now and whenever\r\nThere seems to be an Eastern, Southern Hemisphere favoritism, I haven't figured out exactly why because the publishers are very vague outside of discord on any explanations. What I mean is Eastern gets a lot of voiceovers in game from the announcer to specific units having call outs(chants, shouts, etc.), in American version I haven't seen this introduced in-game, I've only noticed because of Youtube reviews on the game, Southern gets skins and other commodities that aren't available in the game for Americans either. Haven't figured out why.\r\nOnly one character is able to hold all XP, earnings, no share function has been introduced to the game  so your character is unique but creating a new toon is next to impossible after you get the hang of the game due to the grind and season limits\r\n\r\n\r\nWith that being typed, none of this effects gameplay if you can ignore these issues. If you can't, I understand . But at least try the game, its free. The game isn't super popular as it should be because their advertising team doesn't really exist outside of Twitch and non-translated videos on youtube. Future warning to newcomers also, the game tricks you into thinking you're a bada$$ if you're familiar with basic computer keybinds up til level 60 then it completely shifts the aggressive meter up about 1000%, but the grind is worth it once you master it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really sweet game still in it's prime worth the small amount of time it asks of you weekly as a f2p and literally never have to pay anything to be competative and have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome mix of hack and slash, rpg, rts. Massively underrated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although I played 45 hours at the time of the review, I probably put in twice as much as I played from when this game started (back in 2019 when it was under a different company and launcher and I guess it didn't record the time i spent playing it on Steam and then after had to turn away from the game due to busy life). Love this game. I came back after a long period and it felt just as I had left it (besides all the changes and updates it has had 😅)\r\nAs a solo player, I do find it fun hopping on solo and just doing a few matches. I do find it fun dragging my troops around trying to get the best set up to charge and take on the opponents. The different weapons classes are just as fun to mess around with as well. \r\n\r\nAt least gotta throw in a couple cons; gotta watch out for stuns when battling opponents as certain weapon classes know how to chain stun (or keep you down long enough for their buddies or troops to crowd you and curb stomp you down) and that you gotta at least have a couple decent power units. I know they now provide the mace units which are a nice starter units that help carry you against some tougher opponents, which helps a small bit 😅. \r\n\r\nI know i prob missed a few more cons or pros but overall personally, I like this game and recommend give it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played since the Lionheart Season, if I am thinking of the name correctly, or the season with the cannon units. Coming back into this new season, I actually am very impressed with the game. A lot of good QoL. I have seen a much more diverse meta, or at least units that don't have to be meta but are still strong. Old favorite units coming back into the spotlight, queues seem to pop more frequently, which if there are bots, they have made them pretty decent at not being blatantly obvious as they were before.\n\nWhile the game is definitely going in a better direction, I do worry about the next hurdle of mastery power creep. If they only do barracks based units and not really do it for any seasonal units. I could see this being a good thing, but they can easily get back into the same problem of a meta being defined by a very small amount of units, like when you had 30 units of axe raiders on the field at one time.\n\nHopefully the game continues in this direction. There is no other quite like this, and everything that is even remotely similar to it really isn't that great, especially in comparison.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a niche game, for sure, but while most smaller or newer MMORPGs go offline or die within a few years, CB is still active. Four other MMOs I played died in the time since this was made and had fewer wars than I'm seeing now. You're not getting WoW, but if you're not looking for WoW, this is a fine pick.\n\nYou can pay for the best units faster, but earning a few good units free as a newbie is not remotely difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is crazy fun. Just don't try the open world feature its way to confusing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good. if you want to start new. easier to start at the start of a new season where everyone is playing blue units. fun game especially when you get the hang of it. House wars can be iffy, have to mesh with the other players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Fun & easy to get into. Ofcourse people are going to cry about literally every free game that has transactions and all the other normal complaints you see on any other f2p pvp game. Wish people could just play games to have fun, and not play games just to complain. Community in game is also about 50/50. less of the normal toxicity, and more of half the player base crying about stuff like people actually using their mics and other dumb crap thats intended to be used since it is a game involving team work. I swear pvp games are just karen lobbies now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and support respawns really quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun, but it is pretty pay to win, but there are plenty of awards and whatnot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TLDR: Game is extremely lopsided in terms of balance towards new stuff, community is either extremely chill or toddlers throwing tantrums. Devs are pathetic excuses for game developers, refuse to fix basic bugs, refuse to texture polish outfits that cost $60 or even the basic model character, great game-play loop, however it gets worse the higher level you are because you get more of those toddler players who just play the overpowered stuff, like 6-8 of the same overpowered unit is common in higher level lobbies.\n\n\nVery obvious class im-balance to sell battle-passes. They purposely make the current class in the season be extremely overpowered to sell battle-passes, like for instance right now its spear and shield, class has 2 cleanses and can easily permanently stagger classes, meaning damage is unnecassary on them causing them to go full tank and be un-killable demons, plus they have basically the cleanse dash plus an absurd jump attack, meanwhile short bow has a pivot for their escape tool unless you sacrafice a lot of damage for a inconsistent crappy back dash. Game is also way to reliant on stat checking, if you queue with players higher level than you, it is very common to just get 1-2 tapped, muskets or dual blades will one shot you, 2 shot if armor is only decent if you are light armor, and you will not even scratch them, this is most noteable and obvious in ranked which is just the top elitists playground that for some reason has no matchmaking because its not nearly popular enough.\n\n\nWeird Ranged gameplay\n Its very odd in this game as it seems to be skewed more towards rng, rather than accuracy, specifically with the shortbow, it is essentially impossible to head-shot a moving target or sometimes still targets, because the arrow only shoots within the large reticle not at its epicenter. This is however not the case with special ability attacks. Long Bow is similar however it can be managed much more effectively.\n\n    Lack of easily accessible experimentation for optimal performance:\n The game also relies heavily on personal trial and error to learn the ins and outs of the game which is bad because you have to spend resources that can be very difficult or annoying to acquire to learn this, for instance their is no way to definitively tell if penetration or damage is better unless you play a class that uses good heavy armor for an extended period of time, this is of course very challenging and frustrating because you have to spend difficult to gain resources to build the armor and weapons needed for this and of course waste time and ruin your personal experience playing a class you don't care for.\nAdd on top the 4 day refresh on the respeccing for this, it can be quite cumbersome to complete. \n\n    The game lacks an overall respect for the player seen through these bizarre and at a surface level benign little things that become bigger deals the longer you play.\nThis is also seen through the almost astonishing lack of polish in the game, where their is an extremely visible parting of skin textures on the neck of the character where a massive line wraps around the neck splitting two different skin shades, most people use helmets due to this. Not to mention the unbelievably poorly made unit skins, where its just one texture that is  extremely pixelated and hardly 3d, basically imagine an ms paint made armor texture. Every character also uses the same exact same voicelines likely recorded 8 years ago but some underpaid voice actor, to which their are very few lines to begin wtih, you also can't mute these lines or the whole game goes silent, again noting a lack of detail control.\n\n\nGAMEPLAY\nIt has a fun game-play loop if you don't mind some of the few super scuffed mechanics, and over-clutterd ui on the main menu with constant un-ending notifications the game has. Solid simple combat mechanics which is amazing and definitely best part of the game. Haven't really delved into the weird mmo aspect of the game yet, (Seems a little hollow though tbh).\nThe game has that almost old type of feel to a game where it just lets you figure stuff out by yourself, regardless if you waste resources or not, which is kind of nice i guess, kinda sucks a little but I don't really care that much tbh, i wouldn't read a wiki or a blog anyways even if it was available in the games menus. It has many skill tree's throughout the game in units, personal character stats, weapons etc, quite a bit to be sure though, however it kind of drip feeds these skill trees onto you, really only needing to utilize each one every 50 levels.\n The game is very you get what you see, quite intuitive in that aspect, meaning slashing damage is literally the damage you do from any slashing motion, piercing is stabbing etc. It doesn't try to over-complicate with stupid verbage or anything which is nice.\n     Main mode: Siege; so siege is basically the only pvp game-mode because for some reason field battles are just a awkward siege, field battles are like a little sandbox where you fight in the middle, and that seems to be it. Where as siege has the epic aspect of trebuchets, siege weapons, siege towers etc. Seems to be made well, much better than blood of steel which is basically this game if it was copy pasted removed %70 of the game. One thing though i don't care for is how you can create like new characters but you have to level them up all the way again, I get why its a thing but also seems very time wasting for no reason. They also seem to lock the starting outfits to one per character which is dumb? Like I literally cannot get the other cool starting outfits without starting a new character.\n\nGames definitely worth trying because its free, pretty epic game all in all, absolutely awful overpriced digital trash as cosmetics tho. It looks like the cosmetics were made in ms paint with how low the texture quality is on the armors. \n\n\nCOSMETICS\n\nThe armors themselves are in a weird bizarre middle ground of being unrealistic but also functionally very ugly. $40 for a weird boxy almost baggy armor set that just looks incredibly poorly made.\nIronically this game gives you an option for choosing one of the best cosmetics in the game right away for free for 30 days, the first 5 it offers are easily the best and it doesn't even tell you only one is able to be chosen.\nIt also just implies you know which is also a theme in this game, their is a lot of things just changing and happening with it never telling you why, the game just ceasing your ability to reset skills or change your skill tree without spending premium currency is rather abrupt.\n\n The game also likes to flex and show off armor sets that are just simply not attainable at all, because they were only available in past seasons, doesn't make sense to show an armor that is unattainable in the cosmetics menu. Also don't know how to acquire the other starting armors, I hope i don't have to start a new character because that seems incredibly dumb. I figured out to acquire the starting cosmetics and its through a absolutely massive pool of cosmetics for just about everything including unit skins, weapon skins, and a large pool of very poor quality looking pieces of cosmetics, so the chances of getting something decent or desired, through this method is likely 1/250, the currency is given for free, but at a rate of like 10 per month.\n\nCommunity: The community is actually suprisingly chill considering they seem to be on the older side, my guilds average age is like 27 plus. with many members being near their 40's. However this doesn't change the fact that some are very deeply egotisical or narcisistic, only playing poleaxe or spear and shield in duels, smurfing on other accounts with Nobachi sword which is the noob stomp weapon, however their are \"interesting\" interactions in chat because it is extremely difficult to type in chat due to %30 of basically all words be banned, the phrase \"Bro is a silly goose\" is considered inappropriate for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my komputor is shitty and i dont have any friends playing the game but still ended up playing a bunch back in the day back when the game was also on my.games especially so id say epic indeed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combat interactions and plenty of units to have fun with!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game. But make it where each team can only have 1 chariot at a time. People are spamming 4-6 chariots at the same time. Game is unplayable, make all range do more damage if your not going to limit how many can be on the map at a time. I would not recommend this game to anyone, its not nooby friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun. Hard to learn some of the mechanics of crafting and fiefs and stuff, but I love battling in siege battles and stuff. Pretty cool game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing and deserves more recognition. not perfect by any means but I find myself back time and time again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my top two games. Dig it! a wee bit bloody but done in a OK manner. And you dont have to be rich to progress..... but it helps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game with unit control\r\nranges from gunpowder to just some bashing and all in all very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. RPG with army building. Unlock and level up units that you can control. Siege battles. Territory wars. Smooth gameplay. Super fun I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, confusing, stab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay Experience Score:\n9/25\nPresentation & Immersion Score:\n12/25\nDesign & Technical Aspects Score:\n14/25\nFinal Considerations Score:\n16/25\nTotal Score:\n51/100\n\n\n\nConqueror's Blade is an ambitious game with a fantastic core idea. However, its fun, large-scale siege battles are weighed down by a punishing grind and a monetization model that can feel predatory. It's a game worth trying for the experience of its chaotic battles, but be prepared for frustration and a slow, long road to progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, but after some time it gets repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a hidden gem in my eyes yes there are pay 2 win elements in the form of faster progression but the sheer amount of content available for FREE is awesome, the servers do scream at peak times just be warned if you're on the fence try it definitly worth a chance ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FPS tactical strategy game in medival times. It's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conqueror's Blade is genuinely fun. The battles are frantic, the breadth of units is awesome, and the variety of game modes and diverse places to progress mean that Conqueror's Blade is a great game to play for both casual and dedicated players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly engaging blend of strategy and action! Commanding units in large-scale battles is thrilling, and the progression system keeps you invested. While it has its grind, the core gameplay is genuinely fun and rewarding. Give game a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game surprised me on how much I love it.  It is a nice mix of being able to just get on and play and be a sweat.  Can be a little grindy but you can get valuable units that you will use throughout your play through early on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I do recommend this game, I do so with a few caveats:\n1.  Be prepared to be utterly frustrated at times due to lag and desync issues.  For example, expect enough of a delay between when you hit someone with a CC / stunning attack and when that stun takes effect that they will be able to roll away not once but twice and bring up their block before it takes effect.  Not every time, mind you, but often enough to be frustrating because where you should have been able to secure a kill, the lag/desync has allowed your opponent to move far enough away that no follow-up attack is even possible, and he's likely now in a position where if you try to dive him to secure the kill, his allies will mob you.\n2.  Every season is fundamentally the same.  The devs introduce 3 new units, all of which are completely over-powered compared to comparable existing units (there are a few exceptions to this, but in general it's true).\n3. There is little to no balance between heroes.  The devs will periodically buff or nerf different hero classes, but this is not generally done to improve balance.  It always seems to just change which hero classes are \"favored\" in the game.  If your prefered class isn't one of the ones currently being \"favored\", expect to just get completely dominated by the ones that are.\n4.  Point #3 also applies to a large degree to units.\n5.  It's a TEAM game.  While you can play solo and have fun, you'd be well-served to learn to pay attention to what everyone else is doing and run your hero and units in ways that work with your allies...And sitting back with archers is NOT working with your allies (99% of the time, anyway).  Even if you play well (given your hero and unit selection) whether you win or lose a battle largely depends on how well your team works together.  If they don't, more often than not, you lose.\n\nAll that said, the game has a fantastic concept and *can* be fun to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Игра Conqueror's Blade - это захватывающая MMO-стратегия, в которой вы командуете средневековыми войсками в масштабных осадах и битвах. Геймплей уникален благодаря сочетанию управления собственным героем и отрядами, стратегически размещаемыми на поле боя. Возможность выбирать между разными эпохами и юнитами добавляет глубины и разнообразия.\n\nСистема развития персонажа и снаряжения предоставляет массу возможностей для кастомизации и улучшения своего военачальника. Экономическая составляющая, включающая сбор ресурсов и торговлю, важна для усиления вашей армии. Особенно впечатляют масштабные войны за территории между домами, где тысячи игроков сражаются за власть над провинциями.\n\nОднако, игра может быть требовательна к новичкам из-за обилия механик и необходимости долго осваиваться. Донат, хоть и не обязателен, может значительно ускорить прогресс. Несмотря на это, Conqueror's Blade предлагает неповторимый опыт средневековых сражений и завоеваний, который стоит попробовать любителям стратегических игр.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE THIS GAME KIND OF GRINDY AND IF U SPEND MONEY ON IT BE CAREFULL HOW U SPEND IT BECAUSE THERE IS NO SECOND CONFROMATION BUTTON BUT I LOVE THIS GAME GOOD SEAGE GAME",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game it was fun when i played it but its not my type. so play this if u like medival games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Como mo jugador nuevo hay que dedicarle tiempo para disfrutarlo pero es bueno",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want a good game like Tiger Knight it was fun to play around with the troops/abilities/commands\r\nI don't feel this is it.\r\nTell me WHERE TO FIND GOOD GAME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty straightforward gameplay with a quest based system for gaining exp and gear but kinda bland in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favorite game ever made.  Nothing like it at all.  1500 plus lvl and over 1000 hours on the previous version.  Massive competitive territory war battles were the best thing ever.  They sometimes ruin the unit balance with seasonal nuclear op units and certain unit upgrades but right now its actually not bad.  At it's peak there were lots of options and everything had a counter.   Theyve probably added too many units with too many mechanics and it can be a bit unbalanced but seems to be improved recently.  Most of the good players that understood how territory war works have gone and its all CBL players now that think everything is a 1v1 death match.  CBL is fine but territory wars  are different and were the best thing ive ever experienced in gaming.  You can still find some decent content but its not as good.  Siege mode match ques used to be a blast but everyone just farms xp now and isnt really trying to win anymore.  They should go back to giving more rewards for winning and nerf losing.  Still playable game but not what it was.  Nothing out there like CB.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Game is full of cheaters iv'e run into the same one's consistently. They dont care there are cheaters regardless of what they say because iv'e ran into the same people that were reported by a bunch of people a few days before in my game the next day. They always say the match was to complex and no actions were taken against the player. This game would be a 10/10 if the devs and mods weren't blowing off cheaters.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I am a player for 3000 hours on this game. Customer support is very unhelpful. Do not recommend spending time on this game due to new banning system. VIetnamese and chinese players trashtalk all they want when i retaliated i got banned. GG",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've played this for a long time, the 288 hrs on here isn't reflective of my playtime during the time of Mygames (Myscams).  As nice/unique as CB is, it has a major balance issue every new season because the developer just can't help themselves by introducing unique new mechanic that straight up \"1-up\" the previous season to the point that it can or would just brick all balance in the game rendering most previous units to the point of being unusable.\n\nAdditionally, for both new players and returning players you are always behind no matter what because old, and I mean really OLD seasons of units are not accessible which require you to fork over cash for probably useless units or to complete tedious challenges to unlock said units.  Additional all previous battle passes are not available to you the player, so in term of rewards you are permanently punished/behind because you didn't play the game since the day it launched and kept playing every single day since then.  Basically the moment to you playing and weeks or months down the line decide to come back to this game, it just feel like it is nickle/diming you to spend money because it is built on literally nothing, but FOMO (Fear of Missing Out).  It is not noob friendly, nor returner friendly, it does the opposite it makes you want to not play the game which is part of why it's playerbase just keep on shrinking and the developer are clearly struggling, but none of these issues has been addressed despite numerous feedback over the years.\n\nIs the game fun/unique?  Yes, you really won't find a game like this really anywhere, but moment you drop it, you basically cannot return without expecting to drop at least a hundo to feel like you can play, and a hundo can be spent on other things.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Nope, not worth it. Just trust me and find another game. Bannerlord is probably what you are looking for. If you do download this game, Good Luck......",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 130 hour in this game, the only concept I can get from this game is that \"Your free to play fully upgrade arrows won't piece through enemy pay to win armor\". What a greedy game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would not recommend this game for anyone to play simply due to it being \"pay to win\". The community is also super toxic as well! Customer support on this game is also pretty terrible and is in a big mess in terms of moderation. \n\nIdk what happened but apparently I was banned for pvp matching making for two hours also. I was playing ranked yesterday a lot so I guess something happened then. The little icon that popped up is that \"I've been too passive in battle\" which is not really helpful in telling me if I did something. I guess the only thing that happened from what im thinking is when i trebbed an enemy stalwarts and this dumb teammate just full sprinted with his valks into it. \n\nOr I guess it could be the fact that I play longbow, but I do constant damage to range and heros and my units due alot of damage as well. I usually end up having 3-5 hero kills and 100 + units kills. \n\nEither way I would not recommend this game for the three reasons above, better off going to play a game like Chilvery or Darksouls. Atleast those are more fun than having to wait 2 hours just to be able to play this game....\n\nAlso would like to add that this game also sucks because now you cant complete all achievements in the game as well as there being a whole bunch of NPC in each fief that does nothing at all...\nAlso they will never add anything new to the game besides the event around holidays and also a whole bunch of attire events which is pretty much a money grab. They also still haven't added 1 unit to the unit tree so its just a blank spot for the past 6 years...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "heavly pay to win, not fun for casual you not getting anywhere ,worst pay to win game ever than mobile,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Filled with cheaters and even if you report them you get a in game message saying they have reviewed them and they are not cheating instantly meaning that they obviously didn't check or care. Honestly though even if it wasn't so bad that 90% of your matches have a cheater unless you have been playing this game since it came out or want to spend thousands of dollars for cash grab catchup mechanics there is no way to compete with the whales. Its gotten so bad at this point that even the whales cheat because they know there is little chance they get banned. If you look the positive reviews are all botted as well with almost all under 100 hours and many under 10 and everyone over that having negative reviews.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game the only reason i downloaded it was to play with a friends but now i have to grind the game to lvl 21 to play with friends? that's very not nice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow... The game could be so cool... I did voice-acting for you guys... we worked together and you are pretty chill.. but honestly...\n\nStay away from the game... really...\n\nyou cant tell me that this game is over 7 years old.. and you still cant manage to host EU servers.. \n\nits pure cancer to play against huy huy chinese people with 0 ping while having 300 Ping ... cant do shit by yourself... cant block cant hit cant do anything.\n\nbut thank god you can spam my whole screen with Buy options.. get this get that ... glory to the CCCP myass fr... \n\nif you want money work for it and fix your game its insane...\n\nToo many things on screen.. you dont know what to click and in the beginning you are forced to do shit u dont want to... click this click that .. no explanation but spam to do stuff u cant even click trough yourself and read...\n\nafter the intro is done ... you are forced to do missions even if you dont care and just want to see the fcking interface .....\n\nthe audacity you have to ask for money and put out DLC etc... but having such low standard in player experience and interface is absolute cinema...\n\n\nGet servers.. .Upgrade them... \n\nClean your whole system and then maybe more people would play....\n\nOr just disappear from steam cuz steam is not chinese and has standards.... you come to a global place but all you know is to focus on your chinese playerbase... \n\n\nBRO YOU CANT BE SERIOUS FOR SO LONG HERE AND STILL MESS UP EVERYTHING.....\n\n\nIMAGINE PUTTING IN EFFORT AND TIME AND MONEY TO HAVE A BAD PRODUCT....\n\nmaybe feed your employees or something idk...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of cheaters teleporting, No stamina at level 47",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having tons of fun with the game\r\nNew update, can't move in matches.\r\nEverything is glitched.\r\nTowns work just fine.\r\nI paid for extra stuff in the game so I could enjoy it during the meager few hours a week I have off and now this game, like that money, was a waste of my time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the fact that this game keeps on forcing me to do PVP when I don't want to do PVP in this horrible game. The combat system is trash. I don't want to do PVP in this game, but it keeps forcing it onto you and I don't like it. It's boring. It sucks. I got bored of the game. It's boring. Like, seriously boring. This game is trash, and I don't like the fact that it keeps forcing me to do things that I don't want to do.  I don't want to do PVP, and it keeps on making you do that.\n\nI find this game very F*** annoying. Like, I don't like this game at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay to win game. \nVery bad servers. \nYou will always face issues when you log in. \nI do not recommend it.\n\nThey should leave making games to the Japaneses and westerners.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would not recommend this game, their is zero team work in battle. When you do try to communicate to your team mate they either go off and do their own thing or, they will flat out ignore vital position and let the enemy take the control point's. If your hoping for some grand siege, It won't happen. Also don't believe the picture they Lie!. If your hoping for a grand conquest it's not going to happen!.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Always a lost connection problem, while this does not exist in other games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just goofy as hell , wish the main character you are using was like Dynasty warriors MORE MOVEMENT",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a mess. Movement is stuttering enemy heroes seem to be desynced. Combat, the main point of this game feels unresponsive and stiff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of toxic people, no teamwork, getting queued with bots 24/7, tons of grind to level up units, dead game in the most part of the day(hard to find matches , and when you do you get bots), sometimes you get same map 3-4 times in a row even if there are maybe 50 in the game...Rip",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game's tutorial drags on forever and treats the player like a lobotomite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I came back to play the game, but it just feels bad to play, its not fun, what happened to the game i loved",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its just like most games. Pay money = OP units. \r\nThey currently provide new players the best rewards and gifts as they start. Leaving veterans without any proper rewards for even playing anymore. The daily reward for a veteran player, is 10 unit scraps. Which do nothing but offer a chance to unlock a tech tree unit. Once you have all the units, you still get the same reward. If you want anything you have to buy it. If you want to stay somewhat useful at all. You have to spend more than a mobile city builder. hundreds of dollars to get the seasonal units. While also offering new Weapons, that cost money. There isnt anything offered to veteran players. They rather you stop playing your 1500 hour account, start a new one, and spend all over again. This is their tactic. Playing pass level 300, you are matched against players at ALL levels above 300. meaning even the dudes that have level 2000, and are maxed in all tech trees, and units research. You stand no chance in battles. The end game is T-Wars. again to stay in the meta look at spending hundreds monthly just to be able to help your clan. Even then, the rewards for fighting in t-wars are trash. The reward system, matchmaking, and overall return to the players is TERRIBLE. Players play because there is not another game like it, and even with all the terrible gotcha spend here to get a chance. Spend here to get a chance. SPEND SPEND SPEND. Thats all the devs car for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maps got worse.\r\nforced event into seige mode that had no seige qualities but instead was a boss escort mission.\r\nhero balancing is back on track again. but units now dont follow instruction. had vassal longbow not retreat when told. stand in formation when told or regrouping when told.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Are there still a lot of cheaters on this game? do developers do something about that or not yet?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun Game.\nBut with Heavy pay to win incentives.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay good, matchmaking shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's the biggest piece of dog s.h.i.t",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Play the Meta units or don't play at all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "janky control",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crappy money grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not ammmmm sigma",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "much more pay to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "holy 5 fps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What could be an incredible game ruined by exceeding greedy owner/developers that repeatedly push extremely broken and overpowered paid units at high prices. \n\nI don't mean a mild advantage either, but units that will wipe out dozens or hundreds of soldiers in seconds. Pay $50+ for it now or grind like 90 days for it, but then they usually try to finally balance them somehow around day 85 acting like it was just accidentally overtuned, then release the new OP unit.\n\nYou will likely have a lot of fun until level 50-60 or so when you're put into the general population and are no longer playing with other low level and new players. Then you will just be fodder until you get frustrated and quit or spend several hundred dollars to be competitive. \n\nHopefully the company will get a change in leadership soon or the game will be bought out. This should be one of the most popular games around and instead has a minuscule player base.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "I am a player for 3000 hours on this game. Customer support is very unhelpful. Do not recommend spending time on this game due to new banning system. VIetnamese and chinese players trashtalk all they want when i retaliated i got banned. GG",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "I dont know who tought teh chariot is a good unit but its takes the fun out of the game. Seeing 2-3 chariots just running around the map and killing everything unable to kill it. Wheres the fun in that ?",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "They hide very well the p2w, Artillery is just OP and you need it in order to kill some shield units( since guns can't pierce shields for some meme reason), and destroy a lot of enemy units without risking your own units plus the p2w artillery cannot be crafted by any means, and curiously is the best one in the game, the game runs well and plays well but once you find out how lame the p2w is in this game, it will be too late.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Game is full of cheaters iv'e run into the same one's consistently. They dont care there are cheaters regardless of what they say because iv'e ran into the same people that were reported by a bunch of people a few days before in my game the next day. They always say the match was to complex and no actions were taken against the player. This game would be a 10/10 if the devs and mods weren't blowing off cheaters.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "The game balancing is horrible, cash grabbing battle pass & OP seasonal units, causing severe unbalanced gameplay.\r\n\r\nNew players WILL STRUGGLE due to supper hard leveling up & mission system for units\r\n\r\nTLDR: every update is just OP units with flashy Attires",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Dev tip: do not force your player into an unskippable tutorial upon first time setup.\nFollow-up tip: do not lock game options (audio, resolution, controls) away when in the tutorial. Who would do this??\nFollow-up-follow-up tip: don't force the player to play their first battle right after the tutorial when they are trying to fix their monitor issues.\n\nI ran out of patience with this game before I got to play it due to windowed and resolution issues.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "This game has turned into a paradise for CN hackers — short bow, aimbot, you name it. Reporting them does nothing because the devs don’t seem to care about who’s cheating. But the moment you say something against them, boom — one-week ban. Keep it up, the game’s on life support already; the player count’s dropping fast.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "I've played this for a long time, the 288 hrs on here isn't reflective of my playtime during the time of Mygames (Myscams).  As nice/unique as CB is, it has a major balance issue every new season because the developer just can't help themselves by introducing unique new mechanic that straight up \"1-up\" the previous season to the point that it can or would just brick all balance in the game rendering most previous units to the point of being unusable.\n\nAdditionally, for both new players and returning players you are always behind no matter what because old, and I mean really OLD seasons of units are not accessible which require you to fork over cash for probably useless units or to complete tedious challenges to unlock said units.  Additional all previous battle passes are not available to you the player, so in term of rewards you are permanently punished/behind because you didn't play the game since the day it launched and kept playing every single day since then.  Basically the moment to you playing and weeks or months down the line decide to come back to this game, it just feel like it is nickle/diming you to spend money because it is built on literally nothing, but FOMO (Fear of Missing Out).  It is not noob friendly, nor returner friendly, it does the opposite it makes you want to not play the game which is part of why it's playerbase just keep on shrinking and the developer are clearly struggling, but none of these issues has been addressed despite numerous feedback over the years.\n\nIs the game fun/unique?  Yes, you really won't find a game like this really anywhere, but moment you drop it, you basically cannot return without expecting to drop at least a hundo to feel like you can play, and a hundo can be spent on other things.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "too many bots, especially at high level game play... paying dosnt help either, ive spent thousands and still que with bots that plays with poor unit control.  ive been playing since season 1, wont multiple seasons, top 100 grand champion.  i have every unit everything maxed out 30m+ bronze, millions of silver, it dosnt matter when you have the best units or doctrines, bots will ruin this game for you.  they play like a new player with no unit control and their units melt.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "- Pay to win\n- Cheaters\n- No balance (You will play with 1 level versus players with 1000+ levels and more)\n- Bad connection (NA / EU / SEA/ Asia) don't matter\n- Bugs (Have even T pose)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "heavly pay to win, not fun for casual you not getting anywhere ,worst pay to win game ever than mobile,",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nope, not worth it. Just trust me and find another game. Bannerlord is probably what you are looking for. If you do download this game, Good Luck......",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 130 hour in this game, the only concept I can get from this game is that \"Your free to play fully upgrade arrows won't piece through enemy pay to win armor\". What a greedy game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've played this game for  years but since the Cheriot unit came in I kinda wanna uninstall it. Hope they take it out or change its capabilities. its destroy the game play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is unplayable with frequent disconnections and bad matchmaking even at early level , mainly pay to win game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game was once balanced and fun now that they have chariots GG. game is ruined",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would not recommend this game for anyone to play simply due to it being \"pay to win\". The community is also super toxic as well! Customer support on this game is also pretty terrible and is in a big mess in terms of moderation. \n\nIdk what happened but apparently I was banned for pvp matching making for two hours also. I was playing ranked yesterday a lot so I guess something happened then. The little icon that popped up is that \"I've been too passive in battle\" which is not really helpful in telling me if I did something. I guess the only thing that happened from what im thinking is when i trebbed an enemy stalwarts and this dumb teammate just full sprinted with his valks into it. \n\nOr I guess it could be the fact that I play longbow, but I do constant damage to range and heros and my units due alot of damage as well. I usually end up having 3-5 hero kills and 100 + units kills. \n\nEither way I would not recommend this game for the three reasons above, better off going to play a game like Chilvery or Darksouls. Atleast those are more fun than having to wait 2 hours just to be able to play this game....\n\nAlso would like to add that this game also sucks because now you cant complete all achievements in the game as well as there being a whole bunch of NPC in each fief that does nothing at all...\nAlso they will never add anything new to the game besides the event around holidays and also a whole bunch of attire events which is pretty much a money grab. They also still haven't added 1 unit to the unit tree so its just a blank spot for the past 6 years...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "if you play long enough the game always groups you with the worst players in all battles with matchmaking involving randoms and puts new players with the best players against you. There is no balance in the game in terms of matchmaking or team balancing it is always wildly lopsided. Don't spend money until you get good matches later on in the game after about 4 gold units. If they don't reward gameplay, then close the purse strings. If you don't hurt them in the wallet, they don't listen. Also forget about support, you're better off talking to a wall.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This season they made a new unit (the dreaded chariot) that totally ruined the game. The win is almost always decided by which team has more chariots. It just makes the game unplayable. At this point you can't even call it a strategy game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decided to try this again after a couple of years.\nAccount gone, none of the servers have anything.\nTried to data transfer after a bunch of googling about what happened.\n\"No data needs to be transferred\"\nScrew this game in it's entirety.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont even bother it has garbage balance insane power creep and a terrible engine that lets units just walk through a shield wall. the most BS infuriating things in the game is the player spartan shield and spear weapon\r\nthat simply can eject an entire formation out of a grid zone and into low earth orbit and can never ever under any conditions be stunned for any reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bannerlord, but you're the hero, and there's more unit variety. Don't be fooled by it being free, I'm over level 1700, and most units aren't available for me. Every season, you'll suffer because of some stupid new unit, so you can think of it like a pay-to-progress game, like mobile games. And yes, the devs update every two months just to make money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't like the fact that this game keeps on forcing me to do PVP when I don't want to do PVP in this horrible game. The combat system is trash. I don't want to do PVP in this game, but it keeps forcing it onto you and I don't like it. It's boring. It sucks. I got bored of the game. It's boring. Like, seriously boring. This game is trash, and I don't like the fact that it keeps forcing me to do things that I don't want to do.  I don't want to do PVP, and it keeps on making you do that.\n\nI find this game very F*** annoying. Like, I don't like this game at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve been playing Conqueror’s Blade since release (including the Templar Commander Collector’s Edition), and it honestly hurts to say how far the game has drifted from its original concept.\nBalance is in a rough state – call it a skill issue if you want, but the problem goes well beyond individual performance. The overall direction has shifted heavily toward fantasy-style appearances, skins, units, and even unit skill designs, which feels disconnected from what Conqueror’s Blade used to stand for.\n\nDespite having several years of premium left (from the compensation for the unreleased war elephant), I doubt I’ll continue playing. Since the Silla season, the balancing and the overall matchmaking – especially full-team matchmaking – have made the experience increasingly strange and exhausting rather than enjoyable.\n\nIt’s sad to see a game with so much potential lose its identity like this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cant be bothered to put sound change settings at start of game , have to get my ears blasted through the whole tutorial",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game has become incredibly irritating since you can use Imperial Chariots. The Spartans are super-boosted. The game is unbalanced. The combat has become unattractive. It's a shame to start playing this game, but it's also a shame for those who played it so long and are now leaving.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A disgusting game with no balance, with a disgusting attitude from the developers! With a bunch of cheaters! Who puts a positive review is clearly bots.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the chariot is too op needs rework asap excluding this its a real rice game worth a try",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game is probably good but YOU CANT OPEN THE FUCKING OPTIONS TO LOWER THE FUCKING VOLUME...because the game forces you to do this stupid tutorial and then a dumb Fight against AI...that is so dumb, closing the game doesnt even skip the tutorial it just picks up where you left.\n\n0/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game's good, it's fun until THE FUCKING CHARIOTS COME HOLY SHIT\n\nWHO THOUGHT IT WAS A GOOD IDEA TO PUT THOSE IN THE GAME WTF\n\nI CANT EVEN RECOMMEND IT TO ANYONE I KNOW BECAUSE THEY'LL EXPERIENCE THAT TOO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has become incredibly irritating since you can use Imperial Chariots. \nThe Spartans are super-boosted.\nThe game is unbalanced. The combat has become unattractive. It's a shame to start playing this game, but it's also a shame for those who played it so long and are now leaving.\nOn top of that random crashes, bugs, unused irritating mechanics, fck up runes.\nRunes makes more dmg when you die than when you fight for 10 minutes with your weak ass weapon.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is dying extremely fast since chariots were added, introducing them to the game was a huge mistake. The game was fun once but now its an absolute ♥︎♥︎♥︎♥︎. You are better off playing sth else cuz the developers clearly dont give a ♥︎♥︎♥︎♥︎ about players keeping this dying game somewhat alive.\n\nDELETE F1 CHARIOTS ALREADY YOU GREEDY CHUNGUSES, IM NOT HERE TO PLAY FORZA",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is completly broken at the moment due to Chariots. Do yourself a favor, find something else then Concerors Blade.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The chariot is ruining the game. its an atomic weapon running over all players without any way to stop it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game,toxic players,dont download this,dont waste your money on add ons or dlcs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you are considering downloading this game, do not.\n\nIt is blatantly P2W and intentionally unbalanced to drive micro transactions. The devs ignore player feedback compulsively, and every time they have said they are going to start listening they immediately disappear for months while implementing the opposite of what players want.\n\nSave yourself the pain and avoid this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game has great potential but its full of cheaters that cannot be reported like the company allows these cheaters, they really need to put some work into balance and for a war game with a lot of politics in it, they really dislike you talking about politics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game the only reason i downloaded it was to play with a friends but now i have to grind the game to lvl 21 to play with friends? that's very not nice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow... The game could be so cool... I did voice-acting for you guys... we worked together and you are pretty chill.. but honestly...\n\nStay away from the game... really...\n\nyou cant tell me that this game is over 7 years old.. and you still cant manage to host EU servers.. \n\nits pure cancer to play against huy huy chinese people with 0 ping while having 300 Ping ... cant do shit by yourself... cant block cant hit cant do anything.\n\nbut thank god you can spam my whole screen with Buy options.. get this get that ... glory to the CCCP myass fr... \n\nif you want money work for it and fix your game its insane...\n\nToo many things on screen.. you dont know what to click and in the beginning you are forced to do shit u dont want to... click this click that .. no explanation but spam to do stuff u cant even click trough yourself and read...\n\nafter the intro is done ... you are forced to do missions even if you dont care and just want to see the fcking interface .....\n\nthe audacity you have to ask for money and put out DLC etc... but having such low standard in player experience and interface is absolute cinema...\n\n\nGet servers.. .Upgrade them... \n\nClean your whole system and then maybe more people would play....\n\nOr just disappear from steam cuz steam is not chinese and has standards.... you come to a global place but all you know is to focus on your chinese playerbase... \n\n\nBRO YOU CANT BE SERIOUS FOR SO LONG HERE AND STILL MESS UP EVERYTHING.....\n\n\nIMAGINE PUTTING IN EFFORT AND TIME AND MONEY TO HAVE A BAD PRODUCT....\n\nmaybe feed your employees or something idk...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of cheaters teleporting, No stamina at level 47",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having tons of fun with the game\r\nNew update, can't move in matches.\r\nEverything is glitched.\r\nTowns work just fine.\r\nI paid for extra stuff in the game so I could enjoy it during the meager few hours a week I have off and now this game, like that money, was a waste of my time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has so much potential...but...it seems like it was designed by people who have no idea what game design is and how to balance anything. There is always a unit that is SO OP that it can wipe out an entire army solo. There is no attempt to truly balance these units until 3-4 years after the fact, which usually the answer is just release another new OP unit. The game focuses so heavily on PvP that you should never play if you don't like getting 1-shotted, ganked, and experiencing 30 second lag times. The optimization is terrible. In addition, cheating is rampant, and despite their claims of crackdowns, I still see invincible players who can dart across the entire map in a second with infinite use skills and units that are likewise. Using the terrible siege weapons and yet these people can 1-shot hit anything on the map on their first try. But the response for reporting is \"PvP is complex, so we aren't going to address this.\" Paywall weapons are always the most powerful and seem to bypass abilities that \"remove stun, knockdown, etc.\" still peventing you from doing anything so you can just sit in perma-stun and die. Cuz you know, being perma-stunned always makes for an entertaining experience. \n\nRight now, spartans are so broken, you can surround 1 set with 5 other gold tier units designed for shieldbreaking and they will still win without losing a single soldier. \n\nDevs have foolishly decided that merging a PvP and PvE mode into a single mode was a good idea, and now no one plays it. You can sit in queue for 20+ minutes and never get a match. There is only 1 PvP mode and 1 PvE mode that can somewhat be played. I say somewhat, because the PvP mode is something like a 15v15 which even on gigabit ethernet gives me 30+ second lag almost every time. And guess what? EVERY unlock in the game requires you play this mode and perform well...so yeah, absolute disaster of a setup for the game of what otherwise could have been a lot of fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was thinking about playing but locking out of settings in a unskippable tutorial is not the way.. absolutely regarded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They removed unlimited PvE progression (Expeditions) without introducing an alternative. Bandit Raids gave the highest rewards but are limited to only 5 times a week. As a casual player who gets frustrated in PvP, I can no longer enjoy the game on my own terms.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game overall, sadly game is full of afk players in everyfight running around like bots and not helping during objective fighting! \r\n\r\nIf the devs can somehow, i dont know maybe (BANN) these players for once so that they dont just stand afk for the entire from when they login untill login out for the day maybe this game would be a solid 8/10 game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super grindy but overall fun. Pay to win. Chariots are unkiable but kill everything. Game very unbalanced, do not give them any money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they using AI for Bans so nothing is banned, or there is 3 days ban at most. Every PVP including Ranked have AFK bots and they let them in game. PVP is broken completely",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game balance. Cav units are overpowered. Poor game experience. Once you reach a high-level, playing this game feels like suffering. Some units are extremely overpowered and literally and I meant literally wipe your unit out in a second.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved playing the game as a kid it started getting bad, then worse over time so I dropped it for six years only to come back to the game and find out a majority of the things I owned and some I even spent my own money on gone and the balance systems not fixed i'm gonna go back to bannerlord.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it can be a fun game BUT cav can fucking ruin a match real quick EVEN if you have anti cav",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun to play. But I hate their money trap. They make new season units OP in the season. Then, nerve them to be trash so you have to keep buying new season units.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it WAS a good game until the developers Greed took over and made it all pay to win. you try to play pvp battle but it is not pvp it is player bots you will face of that is programmed to destroy you. After the latest update the game took a turn from good to bad...guess developers just want to cream the last cent out of the players before this game finds its way to the casket",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm around level 4700, i have played non-stop since Sengoku season (orochi). I'll write no for the recomandation, because that game got so much potentiel and is quite unique. I understand the point of having meta unit, and a good thing is that it changes sometimes, but we are always getting the same patern in the end. Both range unit and cav unit are OP (chariot was Broken that season, but at least we had unit to counter it unlike sparta on its season) the really problem is that we get poleaxe unit, who are good at their season, and then they get nerf a lot just because player complain when their broken cav get destroyed.... The real problem is that dev doesn't play their own game, so they \"take advice\" sometimes, and they're mostly not that good. so, well most of the cav aren't killed by poleaxe unit, just range doing the stuff or just a simple hero with a very balanced class (obviously not ^^) to stop them all. It the end, it could be fix by actually listen to the good persons in the comunity, it has unique gameplay and features, it's friendly to new players (codes, RNG obviously, and other stuff) but it would be even better if they do some stuff for the one playing the game without stopping could be codes, bonus of any kind, because otherwise, everyone will stop playing for a month just to come back for the codes and rewards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "รถม้าโคตรโกงไอ้สัส เจอปุ๊ปกูหมดสนุกเลย ควย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game's gameplay mechanics and setting are one of a kind and I love those parts, but the game is just too frustrating to enjoy. Every few months they release a new season with new units or a weapon or both, and unfortunately you can either grind through a battlepass to unlock them or just pay money for the brand new units. In order to incentivize players to try to get the new units, which will lead to many more players spending money, these newly released units are ALWAYS broken and unbalanced. This leads to inevitable frustration and annoyance, or to you buying the OP weapon and just mowing down opposing players to the point where it becomes boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Filled with cheaters and even if you report them you get a in game message saying they have reviewed them and they are not cheating instantly meaning that they obviously didn't check or care. Honestly though even if it wasn't so bad that 90% of your matches have a cheater unless you have been playing this game since it came out or want to spend thousands of dollars for cash grab catchup mechanics there is no way to compete with the whales. Its gotten so bad at this point that even the whales cheat because they know there is little chance they get banned. If you look the positive reviews are all botted as well with almost all under 100 hours and many under 10 and everyone over that having negative reviews.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Had to play against AI and fight against the horrible menu design for an hour just to immediately get stomped by players with insanely better gear.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pay to win game. \nVery bad servers. \nYou will always face issues when you log in. \nI do not recommend it.\n\nThey should leave making games to the Japaneses and westerners.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "trash cant fix the graphics cuz they keep forcing me to my next objective instead of letting me do my own thing 30 fking minutes assholes and i still am not allowed to do my own fking things so i can fix my graphics settings? trash get off my system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Always a lost connection problem, while this does not exist in other games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just goofy as hell , wish the main character you are using was like Dynasty warriors MORE MOVEMENT",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a mess. Movement is stuttering enemy heroes seem to be desynced. Combat, the main point of this game feels unresponsive and stiff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of toxic people, no teamwork, getting queued with bots 24/7, tons of grind to level up units, dead game in the most part of the day(hard to find matches , and when you do you get bots), sometimes you get same map 3-4 times in a row even if there are maybe 50 in the game...Rip",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game's tutorial drags on forever and treats the player like a lobotomite.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}