{
  "positive": [
    {
      "review": "Pretty damn good, though there are some pretty tedious errors in the story and environment.\r\nWith this games much smaller map, there are less species, which makes sense- until you realize majority of biomes are lucky to even have 4 total animals. and some where theres a mere two only. Which is quite a let down, however a handful of the species introduced in this game are some of my absolute favourites across either game.\r\n\r\nAs for the story, it starts out kind of fine, and for the most part goes over well, but the ending is, while heartwarming, illogical. I will not go into spoilers, but that is a strong let down in my eyes. However I will note that apart from those holes, the characters (especially alan) are very fun, which is better than out paper figure in the original.\r\n\r\nWhile it is not superior to the original subnautica, it is still pretty good, despite it's issues. I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "No, it's not as good as its predecessor. That does not keep it from being an all around solid game with loads to explore, build and have fun with.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I love Subnautica, the original is probably one of my all time favorite videogames, so please read this review with the understanding that I may be somewhat biased. Short review, I liked this and think its worth a playthrough. A slightly more nuanced take is that while enjoyable, there's a *lot* of minor issues that stacked up to making this game feel like it struggled and in many places failed to live up to its full potential. I'll name those that aren't spoilers first, and then dive into those after.\n\nFirst off, the game has some issues with polish. There's a lot of design decisions that feel ill thought out or only partially implemented, and there are enough bugs and problems where its not an incidental problem. The first is that its incredibly easy to get stuck without a way to recover in areas that are accessible but clearly weren't intended to be. For instance, I used the snowfox to explore some of the wider glaciers and wound up stuck on the roof of outpost zero. There's a small pocket there where you can't go back up but can't go down off the roof because there's invisible walls on every side. There's also a lot of item spawning issues. I had over a dozen instances where ore or scan-ables were visible or were picked up by my scanning room, but were inside of a wall, or embedded in the ground, or nestled in rocks. In all those situations, they were irretrievable. This was especially true for the above-water ore veins, where I found the ones in the edges weren't able to be grabbed basically every time. I also had issues with the sea creature movement and behavior, which I'll detail more in the spoiler section.  Finally, I found it frustrating that some of the hab features would be non-scannable in some locations but would be in others, without any clear reason why. Again, I'll detail more below.\n\nSpoilers\n\n[spoiler] Ok, going into more detail on the things I talked about. First, there feels like a significant amount of the planned content was cut. There are sections of hab in some of the bases, and areas behind the closed doors in the mining bases that are filled with loot but are totally inaccessible. Why model interiors and place the loot if you're just going to leave them closed off? Is it really that much more work to open them up to the player? The progression in this game also felt a lot less meaningful than in the original game. For the most part the only reason you should acquire anything more difficult than a basic survival setup is to create single-use story items, and for some there's not even that. (The spy-pengling reeks of cut content for instance). Why leave nickel in the game if you only need five ore total ever to get depth upgrades for the truck and the prawn? There's also some frustrating ore clusters near the end of the crystal zone where you need the mk2 depth upgrade for the prawn to reach and mine them, but once you have that upgrade you don't need the kyanite anymore. Why put an item in a place where you only reach it once its no longer useful? Speaking of the crystal biome, the leviathans down there are some of the worst parts of either of the games. Despite being one of the largest leviathans in the game, they're placed in an area so small they really struggle to navigate it. They constantly get stuck on corners or in tight bends. They also have a much larger grab hitbox than you'd think, regularly grabbing my  prawn from behind their head or from several meters away. Given that, I found that it was easier to just wait for them to inevitably get stuck and punch them to death with the prawn suit.  It turned what should have been the final late-game danger in the game into a frustrating chore. On that note, basically none of the dangerous creatures are as dangerous or aggressive as in the original game. Most will ignore you unless you get within a handful of meters of them, and basically all of them will run if they bump your vehicle or take a single knife strike. Below Zero will not challenge you like the original game did, flat out. Finally, there's a few places where base pieces feel like they should have been scannable, but weren't for some reason. For instance, in the omega base, the wall planters and ivy wall pieces aren't scannable, so you have to wait until you finish working with Marguerite to get those pieces for some reason. [/spoiler]\n\nWith the stuff that I didn't like out of the way, there's a lot that I did enjoy greatly. First off, the additions to the basebuilding were excellent. I loved building my hab in the first game, and getting more cosmetic and flavor recipes in the sequel was a lot of fun. Building a base that was beautiful and functional was and remained my biggest time sink in both games. I also really liked the new creatures designs and presence. They continued to nail the beautiful and dangerous vibe. The inclusion of oxygen plants and the circle fish were also good inclusions, that gameified and expanded your ability to dive for extended periods. Finally, I really liked Robin as the MC. She brought a lot more to the game than Ryley did as a silent protagonist. Along with the inclusion of [spoiler] Al-an and bringing back Marguerite (the GOAT) [/spoiler] The game felt a lot less lonely than the original, in a really pleasant way. \n\nThis is already getting too long, but ultimately its worth a play, especially if you're a fan of the original, but its less polished and you shouldn't expect an experience of the same quality. 6.5/10",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "this game is something else. It seems fun but once you get into the main parts of it. This game sucks major balls. The reasoning behind it is behind that is because you the player are slower than anything that attacks you. the seatruck or sealgide is insanely slow not even comparing them to the first game. If you see a levithan while playing you are so fucked. This games alright tho",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "crash land for the second time, swim for the second time, look for sea glide fragments for the second time, craft for the second time, investigate for the second time, get scared for the second time, fix things for the second time, build habitat for the second time, make sea truck for the first time?, discover precursor artifacts for the second time, meet precursor for the first time?, hear your own voice for the first time? be a women for the first time? (or second if you're already a women) love the game for the second time, be sad that you finished the game for the first time, be happy that it happened during your lifetime for the second time, wait for another subnautica for the third time? get married for the first time? buy a house for the first time?  have family for the first time? be happy for the third time. die for the first time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not as good as OG game but I still enjoyed every hour. \r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ PC Requirements }---\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Expensive machine\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☑ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average (+/-35h for main story)\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ x / 10 }---\r\n☐ 1 ☐ 6\r\n☐ 2 ☐ 7\r\n☐ 3 ☑ 8\r\n☐ 4 ☐ 9\r\n☐ 5 ☐ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Although there is more voice acting and missing the fact that you are alone on an alien world, where you feel like you are alone, and that there are no signs that people have been there recently, I would most definitely recommend this game to other players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In Subnautica 1 the story leaned very heavily on the \"show, don't tell\" approach while letting you explore and survive. In Below Zero however, the protagonist is given a personality, voice lines, and even another living human being to interact with. While this did somewhat help give the player more direction with what to do and where to go, it made the game feel less like you're exploring an alien planet and more like a safari tour. I'd still recommend this game but it definitely isn't as memorable as Subnautica 1.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Subnautica: Below Zero was more of what I wanted after playing the original. Unlike some of the other reviews, I enjoyed the voice acting and the PDAs, which made the story feel more engaging. The base building was great even for someone who usually skips decorating in survival crafting, I found myself making living areas just for fun. The art direction surpassed the original game, with vibrant colors that made the plant feel more alien. My only issue was with the Seatruck, I liked the concept and what it did for the most part, but it was a rigid stick when it should have been more like a jointed train car.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game. exploration is fun, but it can be challenging. \r\nThe terror I felt when Going into certain ereas is like something I could never expect. If you are someone looking for a thrill to play. This is a great choice.\r\n\r\n10/10 recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, the first game is better for multiple reasons, but this game is still pretty good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Below Zero is a good game. It's not as good as the original Subnautica, but it's good in it's own right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many people disliked this game, I personally didn't. It's definitely different, pushing more on the mysterious and magical side of Subnautica. It felt more like a beautiful painting then a dark treasure to uncover. Still, I recommend playing this if you liked Subnautica. Really excited for Subnautica 2 :) ! 8/10, OXYGEN.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked this game and the hero.  The only problem I had was I couldn't type out titles for the storage lockers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of people are down on this game and, sure, it doesn't quite hold up as well as the original, but it's a damn good ride all the same. Not quite as great as one of the greatest is still damn good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is as interesting as Subnautica 1's, and the gameplay is still good too. My only gripe is with the early progression. It took me several hours to find diamonds so I could craft the next depth module, and I didn't have a base until 10 hours in. The smaller, more condensed map is actually nice since that means less time spent travelling places and collecting things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why it gets so much hate; it's definitely worse than the original but still a pretty fun game. Great to play if you just want more Subnautica",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finally beat the game after nearly 70 hours. It was a ton of fun and I'm glad I was able to play it after years of it sitting idle in my library.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as the first one with some odd parts but still a pretty good and fun game, mainly the story that’s a little odd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has potential if the team put more into the game, but overall really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Subnautica Below Zero is a solid follow up to the first game, the frozen biomes give it a fresh atmosphere, and while the world is smaller and the story more compact, it still captures that feeling of slowly uncovering an alien world piece by piece. It’s a cool, enjoyable return to Planet 4546B.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Subnautica: Below Zero — Dive Into an Icy Alien Adventure\n\nSubnautica: Below Zero takes players back to the depths of the alien ocean, exploring an uncharted region of the same planet from the first game. Exploration, survival, and discovery are at the core of the experience, inviting players to dive into a vibrant underwater world filled with strange creatures, hidden biomes, and captivating secrets.\n\nThe game excels in exploration and survival mechanics. Building bases, crafting tools, and managing oxygen while navigating freezing waters creates constant tension and excitement. Every dive brings new creatures, resources, and mysteries, making the world feel alive and rewarding curiosity.\n\nProgression is satisfying and immersive. Unlocking new vehicles, gadgets, and habitat modules feels meaningful, giving a sense of accomplishment as you uncover the story behind the alien planet. The balance of challenge and exploration ensures each playthrough is engaging, with optional objectives encouraging creativity and experimentation.\n\nVisually, Below Zero is stunning. From icy caverns to glowing alien flora, the game’s environments are vibrant and detailed, with fluid underwater physics and beautiful atmospheric effects. The sound design and music enhance the tension and wonder, making every dive memorable.\n\n[h3]Final Verdict:[/h3]\nSubnautica: Below Zero is an immersive, visually striking survival adventure. Combining engaging exploration, clever survival mechanics, and a captivating story, it’s a must-play for fans of open-world underwater adventures.\n\n“A chilling, beautiful, and endlessly fascinating underwater journey that rewards curiosity and careful planning.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐☆☆ 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game starts off kina slow but picks up quick; good so far and the new equipment is really nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Colorful, immersive and really fun to play. 10/10 Recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really immerses you into another world, you get to relax and see beautiful graphics, but experience the thrill of building your way to survival. There are creepy creatures in the depths as well, get ready for the occasional jump scare. It also makes you use your mind, you don't get a map so you learn to remember the depth of the water youre in, the distance from your beacon, and the compass direction. A little strategy goes a long way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good! original was better, but this is still on my top 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good i love it so much its just there is so cool fish an i wood like the icedragon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alien go brrrrr \n\nokay but seriously, i love this game mostly for al-an but it has it's flaws. i love the progression and survival of the game a lot. the story is great but also falls so flat in some areas. my main gripe is that the reason you go to the planet you don't even have to do to complete the game! [spoiler] the reason you go to 4546B is to find stuff out about your sister but you only have to do al-an stuff and none of al-an's stuff leads you to her. the game doesn't block you from leaving the planet when you haven't figured out how or why sam died. sam feels like an afterthought in a game that starts off with her being the main thread. it would be so simple just to add robin saying something alone the lines of 'no i can't leave yet until i know what happened to my sister' if you try to leave without completing her story. [/spoiler] \n\nbut al-an is such a loveable character to me, we do not get enough time with him. i kept thinking 'man i wish he would comment on this' but everything he does comment on is interesting. i want to learn more about him, i want to learn about his species more. i just want more. he's great and the reason i've replayed this game so much. \n\nthe game is 100% worth a shot if you loved the first game, but be prepared for a more story focused game and far smaller map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "0this game is nice like the first game it's really cool but i'm pretty mad they didn't add the seamoth in the game or the cyclops but the seatruck works fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, got stuck in a loop for like 30 minutes of repairing my sea truck and driving like 50 meters forwards over and over because i was lost in the red crystal caverns but other than that i had a great time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game in my opinion, I do prefer the first game more I think but this one is still pretty good. Like I said in my review of Subnautica, it's not directly a horror game, if you fear the unknown it will give you some scares but it doesn't have gore or anything. This game has more lore about the Subnautica universe, answering some questions we get from the first game.\n\nYour able to mod in multiplayer if you want to play with friend but I haven't done a playthrough of multiplayer yet so I don't know how buggy it is or how hard it is to set up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rapaz… eu achei que já tinha passado sufoco no Subnautica normal. Aí fui jogar o Below Zero e descobri que dá pra congelar, levar susto, passar fome e ainda ser humilhado por um pinguim alienígena. Tudo isso em 5 minutos de gameplay.\n\nVocê chega no planeta e já pensa:\n“Beleza, agora eu morro de hipotermia antes do Leviatã me comer.”\n\nAí começa a farra:\n– Vou pegar recurso → começa nevasca nível “SP em julho”.\n– Vou usar meu veículo novinho → Leviatã pega e fala “hmm lanche”.\n\nE os pinguins, meu amigo…\nEles têm cara de fofinho, mas se chegar perto eles gritam igual criança no supermercado que viu um brinquedo de 200 conto. E você corre, porque sabe que se fosse no Brasil já estavam roubando seu bolsa família.\n\nO jogo inteiro é um grande “ai meu Deus, socorro” misturado com “caraca que lugar lindo” e no final você fica lá feliz, traumatizado e com 3 veículos quebrados porque decidiu explorar “só mais um pouquinho”.\n\nResumo BR:\nJogo top.\nTe assusta, te humilha, te congela, mas te diverte.\n10/10 — Melhor terapia que já fiz e ainda sai mais barato que gás de cozinha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved subnotica and heard bad things about sub zero, even that i still wanted to try. i had some good and some bad\n\nBad\n- i gave up after 30 minutes because i couldent find the plant needed to make batterys\n- i had maybe 5 minutes of quite\n\nGood\n- amazing looks\n- very cool mecanics\n- a lot more to expearience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I support the main developers(from the top brass down to the smallest roles) and hope they receive the benefits/incentives they were promised, and that the parties guilty of greedy practices tainting a game franchise so loved by the gaming community get what is coming to them. Pay out the money Krafton, corporate suits destroy a great product once again.\r\n\r\nOnto my review, I can see why Below Zero received negative responses from players. A lot of the game has been scaled down, in spite of the fact that they added a bunch of content in the game. Sure there are new things here and there, but what bothers me is how almost all the fauna in the previous game still exists in Below Zero but can no longer be cultivated or interacted with. The map has been significantly shrunk in scale, the Fauna in the game (Leviathans in particular) do not feel as intriguing as the previous game, the map feels a lot less interesting as well.\r\n\r\nThe progression feels a lot more open but also less interesting in general. In the previous game there is a vague order in which you unlock the blueprints that allows you to organically explore more of the game. In Below Zero blueprints feel more clustered together, which is explained as the planet having been recently inhabited,  but this comes at the cost of not having to explore much to acquire the necessary things to reach endgame. The music does not feel as notable or fitting compared to the previous game either.\r\n\r\nThat said I would still recommend Below Zero if you simply want more Subnautica. There are still some interesting ideas explored here and base building is still fun. Hopefully this is not the end of the franchise and the developers can explore and develop the ideas they could not fully realize in the past 2 games. Most of all I hope they are compensated and treated with the respect and dignity they deserve, Lord knows the industry doesn't care about them nearly enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game, though part of the horror/thalassophobia of Subnautica was lost by the goofy behavior of some agressive fish. Really fun though !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game:\nStand alone spin off from the original Subnautica. Answers some questions about the original and has a great story and ending. I's very much like the original and maintains many of its best features. Introduces more land interaction and a different primary sea vehicle that acts as a self contained modular base.\nReview:\n8/10. If you played Subnautica, you know what to expect, and it didn't disappoint. There are some great new features, and the good features from the original were brought back. I experienced no bugs or crashes during the entire gameplay, and finished it within 17 hours, while taking my time. Will play again and take my time even more. What would have given it a 10/10 for me, is more \"living\" NPCs and a longer story and gameplay. But as it stands for a base building, water world, survival game, this is the best one out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found myself in a frozen kingdom and somehow built a home. Logged in without any expectations but the game just pulls you inside. It is a great game and you should play it once at least I believe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked it. Still had much of the same feel as the first game, even if the map is noticeably smaller. The surface stuff was so-so, some good, but trying to navigate a whiteout with only beacons just sucked.\r\n\r\nLIke the first game, I felt a little adrift at times - until I happened across the right PDA or Databox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while not as good as the first subnautica, i would still consider playing this game, maybe while on sale. the environment is just as if not more immersive as the first, but the story (for me at least) feels a bit pointless. considering the first game left off on a conclusive note. if you don't mind a slightly pointless story, i would highly recommend this game. but some of the environment, visually looks stunning. and the creatures slot perfectly into the ecosystem (sorry if i'm rambling too much)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "U dont need to play the first game to fully understand this one. Other than the PDA with an indian accent, this game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent story decent gameplay but the horror is another level\r\ncrafting is not much improving from the first title,\r\nnew vehicle is good , you dont have to drive a big submarine from the first one,\r\n\r\nScore solid 7/10 and pls make lgbtvqq++ more LESS for the next title",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as the first part, probably even half of it, but still decent. One thing that helped with the experience is the multiplayer mod though, so props to that as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imo, the better of the 2 games, there is way more things to do as well as a whole optional storyline and it just feels good to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is not as good as the first Subnautica, I'll admit. This one dials down the horror a lot and it feels a lot more silly and nonsensical at times. But if you regard it as it's own game rather than comparing it to Subnautica, it holds up really well. The creature design continues to be awe inspiring and thoughtful, and the environments are beautiful and fun to explore. And despite the horror element being dialed down, there are still points at which you will be stressed out trying to swim away from whatever new monster has just found you. Altogether it's a solid game, and I would recommend it to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with beautiful views. Not as large as the original Subnautica but a lot more story focused and added quite a bit to the lore. Overall it was very fun and the creators deserve all the support they get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing gameplay but i hate one thing where the heck is the cyclops",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game that expands upon the pre existing story of subnautica,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well done. Doesn't deserve some of the hate it gets. It is in many ways like the original, but so many improvements have been made and such intricate story has been crafted that it is 100% worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, not as good as Subnautica but it's also insanely good played it multiple times and was still scared on every playthrough 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely inferior to the OG subnautica, but also has its own charm in a way. Had fun while playing it.\n\nI hate some of the biomes though, holy\n\nI also really miss the cyclops.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The hate that this game is / was getting is 100% unvalid. This game is in my opinion at least as good as the original. (ALSO JUKEBOX IS AMAZING!!!) generally the quality of life changes and graphical improvements are really nice aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very beautiful game. Lovable graphics and story. Can recommend as much as the original one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Subnautica: Below Zero is a beautiful and atmospheric underwater adventure that builds on the strengths of the original Subnautica while adding a more narrative-driven experience. The Arctic biome feels fresh, with new creatures, biomes, and environmental hazards that keep exploration exciting. The world is smaller than the first game, but more detailed, and the improved base-building and vehicle options make progression satisfying.\r\n\r\nThe story is more prominent this time, offering clearer objectives, though some players may find it less mysterious than the original. Performance is generally solid, though occasional bugs still appear. Overall, Below Zero delivers a compelling mix of survival, exploration, and discovery—perfect for fans of the series or anyone who enjoys immersive worlds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An enjoyable game, explore underwater like a real diver, on a frozen planet, where monsters lurk in the depths, and you find ways to survive by making new gear from the materials you find, to building your own underwater base to return to. Would recommend on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked this game but i just could not finish it at all the missions seem to be all over the place i like a set story and this just did not have it there you never get told what mission your doing and its kinda just guess places to go and hope a mission pops up for you 6/10 would recommend playing the first subnautica before this i look forward to see what SUBNAUTICA 2 brings next year especially with it being multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! So good, it leaves one wanting so much more...a whole lot more. Wish it would evolve from a one and done model to a more expansive level of game play. Game is done after 30-40 hours when I could play in this type of environment for 2,000 + hours with a much expanded map. Game mechanics is very good, story is thin, with most of it being a readable PDF you collect as you progress in game. (I had 158 of unread pages at the end).\r\n\r\nWould I play it again? - HECK YA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one that just barely gets a recommendation from me, I still believe instead of a standalone game this should have been a DLC, I will say, It's not that bad though. Most of the issues I have from this game are from the fact of how good it's predecessor was. All I'll say, the map feels small and cramped, the seatruck feels AWFUL to drive and the story/voice acting is... strange... not even bad... just strange. Still, Its a fun experience, if you like the original you'll like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story can be not be best at times, seeming incomplete at times. Although the game play and exploration is simular to the original Subnautica. Don't expect to have as good experience as Subnautica, but still a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While it's not the OG Subnautica, it's still a lot of fun. The world is super detailed and still pretty wide making your time fun. It feels odd there's \"optional\" stuff in the game, like 2/3 craftable vehicles aren't needed in this game, while in the OG Subnautica it felt like they were essential to the game play. I also had a couple pieces of my Seatruck go missing, which wasn't great. Otherwise the gameplay was great, the world beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun DLC for the original game, if you liked the first one and want a little more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same as their first game, it's too easy to not find certain things and play the game \"out of order,\" where well into the game i'm discovering advanced parts accidentally and missing items that would have helped me earlier. Still, it's just as immersive and I binged my way through this game and really enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good expansion just hard to find the last 2 body parts, being short on time I just watched someone else complete the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game overall it is mis judged for being bad for not being a worthy sequel to the first game but those expectations are set way to high its a good game worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely wonderful. I was initially disappointed with the Seatruck in my first play-through, but grew to love it by the time I'd collected all of it's upgrades and possible modules. \r\n\r\nI simply can't get enough exploration in; of the underground landscapes, various plants and wildlife, and most of all, intelligent alien life. The mystery and story of the Architects are a lovely balance of ethereal and sci-fi.\r\n\r\nMy only grievance with the game is the same with the original: resource management is often cumbersome and time consuming the further you progress into the game. \r\n\r\nTLDR; Subnautica is the pinnacle of the underwater survival genre. Below Zero delivers just as the original did. The true sequel is highly anticipated.\r\n\r\nItem sorting and management shortcuts are in desperate need, and expected (by me) to be in Sub 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think that this game doesn't quite live up to the original, but i don't think it's a bad game at all. I like it for very different reasons than i liked the original Subnautica.\r\n\r\nFor one, if you're interested in the horror elements of Subnautica more than the survival ones, this game will be dissapointing to you. I found it significantly less scary. In fact, though the original game scares me so much that i can barely play it, this game i am very comfortable with, which should tell you a lot about the change in scary factor. The map it much smaller and much more densely populated. It's much more colorful and full of flora and doesn't quite have the same empty, desolate feel as the first game. This looks much better, yes, but it also makes the game WAY less scary. \r\n\r\nThe Leviathans in this game are much less scary than in the first game, as well, and some of them are not very well liked by the community. I think the designs are really cool, but they aren't very scary. \"Really cool but not scary\" pretty much sums up my feelings about this game in general.\r\n\r\nNow, as a SURVIVAL game, i think this game is fantastic! It's very fun and has some serious quality of life changes from the original, which was pretty grindy in my opinion. This game is VERY fun as a survival game. Though it's a bit lacking in vehicles compared to the first game- the seatruck replaces both the seamoth AND the cyclops from the first game- it's not a very big map so a huge submarine would feel a little out of place. The game is very well balanced, but has a lot less to explore and does a lot less with scale. Nothing this game has to offer is quite as epic as the first, somehow, despite being very important to the franchise's lore.\r\n\r\nNow, about the story. This game's story is pretty divisive. For one, instead of a voiceless protagonist, your player character, robin, basically never stops talking, and it takes away from the experience in some cases because it removes your immersion. It's important that she talks because a lot of the game's story revolves around her relationship with another person who she frequently speaks with- and i do love their banter, but it takes away from the lonely and scary immersion of the original quite a bit. Also, some of the lines and pretty cheesy and corporate- the kind of stuff you'd probably see in any AAA survival game with a talking protagonist. Not the best dialogue, honestly. \r\n\r\nThis game does have a surprising amount of LGBTQ representation, if that matters at all to you. Throughout the game's audio logs and optional story content there are several canonically gay characters in the story, which is pretty cool- it's treated very casually and is nice representation, rather than feeling pandering or out of place. The characters also have a lot of personality compared to the first, which i find interesting. \r\n\r\nOverall, this game is a downgrade from the original in a lot of ways but i wouldn't say it's bad at all. Subnautica was lightning in a bottle and i don't know if any other game the studio makes will ever capture the feeling of the original, and i don't think it's fair to really expect that, particularly now that a lot of the original Dev team is being replaced by Krafton's management team. As a long time fan of the series, it's deeply disappointing to see how the developers of this game have been treated by their own studio.  I wish the developers the best in their lawsuit and court case.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was absolutely stunning, and the plot-line was SO worthy of its predecessor. I looove Robin, and the other surprise characters we meet here. This map may be smaller than Subnautica's, but it's rich, extremely interesting to explore, and gorgeous. I absolutely adored every moment of this game, and I wish we would get even more of the aftermath. Truly I highly, highly recommend this game, ESPECIALLY for anyone who was even a little bit interested in the Architects in the first game. The additional lore we got in this one for them was PHENOMENAL. I was absolutely losing my mind over all of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Scroll to the bottom for a TLDR)\n\nI love the first game. It is by far my favorite game I have ever played. \n\n   I did not enjoy this one even remotely as much on my first play through. I do not like how Robin's character (the player) is written at all. No real scientist would act like such a child when talking to a different intelligent alien race. It didn't stop at Allen, she acts like a child for most of her interactions with other characters or when finding out new information. If I was Allen and Robin was the first human I met and only reference I had, I'd get the other Architects to exterminate all of human kind. I liked all of the other characters. Which is a shame because Robin is kind of an ass to them. So whats the fix for this if you just want an experience like the first game?\n   Simply go into settings and turn the voices volume to 0% and turn the subtitles off. It improved my gaming experience by 70%. I have been able to replay it without cringing. Sure it can be a bit odd seeing the crazy gestures without any context, but it's fun to make up your own lines. That being said, I would like to say that all of the voice actors including Robin's did a great job with the scripts that they were given. They have great talent. It was only a writing failure that messed up the story. Which there is context as to why everything was all messed up. \n\n\nTLDR:\nTurn voice volume to 0% to play a game almost like the first Subnautica.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me personally... I liked it just as much as the original if not more than. Lots of people complain about it not being as big or some such nonsense. The story from the first one is better, in that there is less of a story which seems to serve it better. \n\nLike, okay, got it. You want a gigantic barren area with 15 reaper leviathans you can't explore or another gigantic barren area with a bunch of reaper leviathans you can't explore. Unless you want to kill all of them so you can explore those giant barren areas. whoop dee doo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a beautiful game that allows the player to follow multiple interesting story lines while also exploring and building in the world. 10/10 would recommend :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not quite as good as the original but still has that same charm that makes it an amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[7/10] Distinguished. Fun game with a pretty good story, maybe not quite as strong as the original. Some nice features added in Below Zero such as the Sea Truck. I'm glad that it replaced the Cyclops which was too large and not fun to drive in the original game. I still don't enjoy the Prawn Suit, I continued to avoid using it in this game. I also didn't love the land based game play, I appreciate them being added to mix it up a bit, but I think all the white areas were difficult to navigate and the Snow Fox was a bit fiddly to use. The underwater sections and the base building continue to be very enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe not like the mythical subnautica, but it sure has some peak environmental designs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as bad as some youtube reviewers say. Most objectives are easier to find, unlike the original Subnautica.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"With you, I am ready to face whatever awaits\"\n\nI really enjoyed every second of it. but it's by far not as scary as the first game.\n\nLooking forward for Subnautica 2 - i hope it's getting released after all it is going through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the best games to play for both underwater exploration and on the ground exploration. I love this game but needs improvements like adding a accurate map for the player and this game is one of the best. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shocked at how good this game was. Held off because it just didnt look like it could give what the first game did, but it delivered. highly recommend if you're on the fence about it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you already finished the first game and want more this is it but i do think that they could have done more with the ice worms but overall it was way better than i thought at first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was very enjoyable and i good upgrade from the first game. i liked that it was a less scary and i was able to complete this game whereas the first one i got too scared to complete it without cheat codes.  this game was super fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game i can't wait for them to add space aspects like building a space station for mining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game i loved playing it, it was amazing Although i never saw the other Architects, Although Amazing game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice and neat game! Good story, deep game play and nice graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely short game, needed a guide to get the last things, but very satisfying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game felt way shorter than the OG Subnautica but it was still an interesting exploration game; you will quickly come to realize just how much smaller it is when you start and I didn't particularly care for the alien dude and the ending jesus christ that was dumb. But it's still very much a fun survival exploration game so I'd recommend it especially if you can get a discount on it. I will not be buying Subnautica 2 however don't support their new project the company has changed managment and fired the OG developers so it's  a souless corporate husk but this and the OG are fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an ok game. Not something to compare to the first Subnautica game but it has an average story line, which is a bit difficult to discover and follow through. Some biomes are beautiful while some are just very confusing and time consuming. Overall, it's like Subnautica's cheaper version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play Subnautica first, and if you like it, you'll be ready to dive right into this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haters REALLY hate this game for some reason. But it's good. \nIf Sub 1 is 10/10, then BZ is 8/10. Treat it like a DLC and not a separate game, and you'll like it more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has thalassophobia, I found it absolutely terrifyingly beautiful. Great gameplay, great soundtrack, some cute and some dangerous creatures, some really annoying dialogues by the protagonist and a really cool jukebox addition makes the game entertaining and memorable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT game, very underrated and overhated. Very good sequel to the original subnautica.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is worth playing this game for experiencing diverse and beautiful underwater world and that is all. The plot is naive, empty and almost non existent. I wish the game would lead you more during exploration. It is also worth mentioning that i finished game without main upgrades like ultra oxygen tank and I haven't even used the seatruck modules or snowfox at all. The main reason is that i couldn't find blueprints for them and sadly there wasn't any reason to try harder beacause prawn suit was enough to complete any task or collect all resources.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the base building.\nLove the music player.\nGreat progression and exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I look at Subnautica, I would like to review this game badly. \n\nBut since I want to remain objective, I don't do that. \nThe game concept is just very good, as with the predecessor, the scenery, the soundtrack and the thalassophobia horror aspect. Base building and management to a really interesting story, really very good. \n\nNow we get to the problem - it's the year 2025, so you have to push through a stupid DEI agenda. An Indian-speaking assistant computer who accompanies you through the entire game, which is extremely difficult to understand on the one hand, a female protagonist with sometimes unnecessary sayings and fragrant dialogues on the other. Characters that make you think: wtf? \n\nOf course, inclusion is a good thing, but like other good titles, bring it in such a way that it is not a disturbing and, above all, forced aspect of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good episode of Subnautica Below Zero, 21 hours have passed, I liked it, I'm waiting for Subnautica 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you love open world survival then this game is a must play as well as all the subnautica games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not as good as the first but good and simple",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Addition to the original - Worth playing for sure if you've enjoyed the first one. Keeps the Subnautica vibe alive and after finishing the first one, I'm happy Below Zero could deliver a solid \"sequel.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and amazing effort put in it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best survival game in existence!!!! best ever created i would die for this game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!try it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun ... swimming is super smooooooooooth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5 years late review. Well, what can I say? Just another masterpiece from Unknown Worlds.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fabilous game and has a good storyline",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "What the f*ck\n\n\nI am divided if I should even recommend this game or not. There is a lot to unpack. \nFirst of all this game is much shorter than the predecessor. I mean like 2,5 times shorter (I have playtime of BZ 22h, while on first one 55h~). From this reason alone I highly recommend buying it on sale. \nWith this said I will start from nice things - like the biomes and creature design. Stunning, I love it. I absolutely adore Sea Monkeys, crystal caverns, whale leviathans, penguins etc. However, this game is not even remotely scary. First game creeped you out. Here? Not really. Maybe a tiny bit of tension while exploring shipwreck for the first time. However if you want to play just new biomes and maybe experience the arctic subnautica - it's really enjoyable.\nThe thing is... It's the only thing it's good at? Lore is dead. Gameplay is kinda dead. It's short. Achievements are even easier than in the first one, they are not enjoyable, but they guide you what you should do in game. Game is not creepy. It's pretty tho.\nThe main plotline of sister is stupid as heck. You don't even notice and it's already done. You help the architect... And you learn literally NOTHING NEW about ANYTHING. You will probably end up more confused than understand... anything? Unless they totally change the planet for subnautica 2, I believe it's gonne be hard to write a proper lore for new game with this??? as a baseline.\nI was thinking if the problem with our protagonist is about her talking so much and I think that maybe? I feel like it's more about what she is talking about rather then how much. Also the setting does not work - first part of Subnautica immersed you in the world not only because Riley was not talking - he was a lone survivor. You felt his situation, you were exploring, scared and confused. In Subnautica Below Zero however, our main character is literally here on her own accord. What's the point then? She is not lost and we don't even get any new knowledge about the world by interacting with architect. It just doesn't work. \nALSO why does she have to talk this much amount of bullsh*t about hope, humanity and this pseudophilosophical sh*t? It turned out really shallow. She also says stuff like \"I need to get to my droppod\". Yeah, I know. You don't have to annouce every move of yours. This character turned out really unrealistic and as a pretty stupid one.\nI hate the change of pda voice. I can't explain it but it just got on my nerves so badly.\nFirst part of Subnautica suffered in the exploration of the ground. And this one suffered too. I kinda regret it, because the idea itself is good - I enjoyed finding and exploring some islands - creatures on the ground too. However walking was wonky. Snowfox is awful at best - both me and my boyfriend preferred to move in prawn. \nNice of them to unlock earlier ion power cells, however everything was handed to you on a plate. All of extremely end game resources of Subnautica where available from the start in Below Zero. You end up not using anything what you scan. I didn't even unlock dock's for my seatruck because you literally don't need them. My bf didn't even get the high capacity tank XD.\nWhile my base (while I really enjoy base building) in Subnautica was enormous, my base is Below Zero was small. Pretty, but simple and small. Why? Because you literally don't even need it in this game.  However there was more customisation available which was really nice, I hope in the future games there could be even more. \nI also wish the biodiversity would be even better. I think it was a good direction, but especially on the island it was visible how little creatures there are (literally 3 and a skyray lmao). \nEnding was crazily bad and made me laugh my ass off. It wasn't even funny, it was so stupid I just couldn't stop laughing.\nI also believe it was much more enjoyable for me, because of playing it with my boyfriend. But for a solo run I don't think it's nearly as captivating as the first one.\n\nTL DR: It's pretty. It's not a good continuation. May be enjoyable if you haven't played first part, but then it would be spoiling the first part while not even doing it in a worth of it way. If you just want more swimming in pretty places and to interact with creatures - go for it (on sale). However if you want a good continuation and a better game than the first one... You can just skip it. I think I wouldn't tho, but just because of need of experiencing stuff on my own.\n\n\n[spoiler]Also in the end... Did she want to f*ck the architect? That was a crazy way to end the game. \"I will go with you! I will continue my sis's legacy! You will find family!\" That was really strange. I know the intent wasn't for that but I wouldn't be surprised if we get hibrid kids in some part.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Subnautica was such a good game with such good developers that interacted with their community, actively seeking guidance and feedback and trying to make a good game for them. They were striving to make something to be proud of. This game used to be something to be proud of. \nThe creators have now dedicated themselves to being \"AI first\". This means that not only are they firing their staff, they're using stolen assets that ai is being trained on to cut corners and make SLOP instead of games. \nYou saved a couple of bucks but you lost the trust the community had in you. I hope you lose as much money as possible when the AI bubble pops.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Still no vr support? Whats up with that?\nA lot more land than the first game. \nIts fine. I would recommend playing the first one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Comared to Subnautica, this game feels boring, to me.\nIt is way less atmospheric - and even worse, I cannot get warm with it.\nI just keep scanning and diving, without any excitement.\n\nSorry, but I want to give an honest review.\nI hope Subnautica 2 will be more exciting, again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a DLC that's overwhelmingly unfaithful to the original game in many ways. It's only redeeming quality is the production quality on alien designs, fauna and flora. That specific visual matches the original and is wonderful.\n\nThe same cannot be said for everything else. There's considerably less explorable biomes, discoverable aliens. We lost the silent protagonist in favor of a diversity appeal that simply does not belong in any video game, and especially not as a follow up to the world-acclaimed silent protagonist experience that is the original Subnautica game.\n\nIt baffles me, this is so ridicule, so absolutely insane, it's a catastrophe. I'd put my hand to the fire that actual devs in the studio where forced into a toxic positivity environement as to never ever point out the self-sabotage, less they'd lose their jobs after the wonderfully successful first game.\n\nIt is a miracle we got a voice slider in the options, and something tells me it is no accident either. If my guess is right, whoever built that voice slider, Bravo, thank you. But even then, it wasn't enough. There's simply too much elements missing from the first game to meet anyone's expectations, and too many unbelivable garbage added instead.\n\nI played below zero a few years ago and could simply not bring myself to finish it past collecting 2 alien part schematics and meeting the Strong Woman Character. I could only bring myself to play this again after enough time, after years without it, enough to forget the vivid regrets I had from my first experience, and I actually almost instantly abandonned immediately again straight into uninstall right back as the intro cinematic barely ended until I opened the options menu and found the way to mute the voices. Because immersion is king.\n\nThe story, main character, voice logs, all come from an obtuse \"corporate are bad\" and \"toxic work environement and  coworkers\" spiel that could have instead been about exploring an alien world, who knows. There is so much wasted effort in this meaningless crap, it is nauseating.\n\nI play subnautica because I want to feel small as a grain of sand beneath the waves of an alien world, instead, this game lets you play as a diversity monologue that praises itself and wants you to ... well, that's about it, pretty much.\n\nThe amount of content the game offers is an adequate DLC, minus the characters. It is not enough content for a standalone game. It is not worth your money. It could have been a story of how there's frozen caraar left to expunge, it could have been a vastly simpler scenario without alterra meddling and without the terrible surface exploration, in favor of more time underwater, more time socializing with one single character: the robotic voice of your PDA, or perhaps an alien that needs help.\n\nThe production time on the surface level could have been spent on lonely, actual sub-nautica experiences below the surface of the water, which is what absolutely every single player was expecting. It truly hurts my heart that such a profound self-sabotage happened to one of my most favorite games ever.\n\nThe trailers and publisher's bonus loss to scam the devs and other various contexts of the next game are all known and shared amongst enthousiasts and I for one cannot bring myself to be hyped for it whatsoever. It already features that same Modern Audience look again. Dozens of thousands of players are uniformly begging to bring back the silent protagonist. I simply cannot care, cannot pay a single further cent of my money on what already looks like more of the same political The Message-driven self-sabotage, and neither should you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The deeper you go the more unfinished it feels. There are big areas with a lot of nothing, and many places are a pain to navigate when every plant you run into is like a brick wall. The plot was re-used from many other basic storylines with the details changed and seemed to only be developed as a wild goose chase.  A certain NPC makes a big entrance and then their story cuts short and they just sit around for the rest of the game. Also, I had no use for several vehicles I ended up crafting and got by with the basics just fine. I loved the first Subnautica, this one was a miss for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "das game wird schnell langweilig und auch das erkunden fühlt sich komisch und ziemlich viel schlechter als im ersten game an ich kann nur empfehlen bei subnautica beim kauf das below zero weglassen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slow swim speeds, anoying diolog, small map, less creatures, incomplete pda with conflicting disctriptions. The story is bland and uninteresting with characters who make no sense. This game is nowhere the same level as the origional subnautica and I would genuinly say you should just play the first one over this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Was surprisingly disappointing[/h1]\n[i]If you loved the first game this one… might be one to avoid…[/i]\n[h3]Took 50 hours to 100% the story and all acheivements - At least 25 of that was building a pointlessly big base.[/h3] \n\nI want to recommend this game so bad, but it was honestly just too big of a hot mess.\n\n[b]The Pros:[/b] \n-\tThe snow themed biome was neat. I personal love games with snow in them (however… See Cons*)\n-\tLots of cute animals and fish.\n-\tOffered the wonderful build system we experienced in the first Subnautica (albeit did not bring any new builds into the game for the most part).\n-\tFemale protagonist (Would prefer character customization options but hey, it’s a start).\n\n[b]The Cons:[/b] \n-\tGame design in terms of mission continuity and map layouts was just atrocious. Ever biome is basically a maze with tons of dead ends, obstacles, haze, fog, snow, darkness -just miserable to navigate.\n-\tStory was deeply lacking. Whilst they tried to pad the story with “Heart” it ultimately came up feeling extremely pointless.\n-\tOMG an NPC we can interact with!!…. For like the first 10 min of the game… cool. But yay… [spoiler] vegetables from the garden... [/spoiler] Zzz\n-\tThe Seatruck – [i] Dear Devs, yall know that a truck can pull heavy sh*t and move faster than 1km an hour… riiiiight? [/i] (Was so excited to learn about the modular system until I realized it turns the Seatruck into a SeaSloMoWhereTheFkDidIParkMySeamoth!) \n-\tVisibility – touched on this above but visibility felt horrid in this game. Why am I squinting AF trying to not swim or run into walls constantly. Why am I getting lost constantly just because I can’t see where I am going. Why is there so much snow on land I can’t even see! I’m Canadian, I get that enough during January and February FFS!\n-\tGathering – Can’t quite put my finger on this one but gathering just felt unsatisfying in Below Zero. In the first game it was exciting to locate a new resource. Might have been the cramped map or the frikken grind for Lead but I actually started getting annoyed having to look for resources. \n-\tMap was just too damn cramped. Too many tunnels. Felt like they designed the map based upon a bowl of spaghetti dumped upside down. \n\nRating: Below Zero out of Five Stars\n\nPS: Why are yall trailers the nicest cutscenes the game has? Would love to see more cutscenes actually in-game once yall have taken my money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not a bad game by any means, but compared to the first game it's violently lackluster. The first game set such an incredibly high standard,and this just felt so meh. I'd say overall it's still worth a play for the story as long as you get the game on a decent sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh, just not as good as sub 1. its a ok game, story just is kinda mid, i did enjoy AL-AN and wanted to know what happen at the end, but her sister part of the story and the main character is annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts OK but gets worse as the story moves on. The exploration of vast ocean from original Subnautica is mostly missing, the map is small and most things are hidden in complicated caves. Even when you have a waypoint, some places take ages to find because you have to navigate caves and the shortest way is never the correct one.\nThen it gets even worse with land areas. That is where i stopped playing. The land is a maze of corridors which are even worse than underwater caves because you can't swim up and down. In addition to that, you freeze if you are not in a vehicle. I honestly lost track of what am I supposed to do and find on the land and combining that with getting lost constantly, the game stopped being fun alltogether.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, Subnautica was a fun play and pretty good game. IT has a few glitches and all but mostly plays well, is entertaining, has AMAZING replay and music, cool designs for the fish and leviathans, and draws you in.\r\n\r\nBelow Zero has none of that.\r\n\r\n1: Glitches. The game ending glitches. Get out of the sea truck? freeze. Get in the sea truck? freeze. Get out of the base? freeze. SMGDH you'd THINK this wouldn't be an issue. You'd be wrong.\r\n\r\n2: Entertainment. Hm. Well, you CAN enjoy it. Kinda. And Kinda is not good enough after Subnautica. THIS should have been AT LEAST just as good, but unfortunately it's \"No, you can't have Subnautica, we have that at home\". Below Zero fails at everything the OG succeeds at. No wonder. NO wow factor. No real scares or trepidation. Just a boring mess of a slog. \r\n\r\n3: Replay. I've only played the 34 hours at time of this review cause I get so dang BORED I have to quit and forget where I was and have to rebegin, OR I have to reset cause of all the FREEZES. FML man this game craps out WAY too often.\r\n\r\n4: Music. The music here is crap. OG Subnautica had an amazing soundtrack and used ultrasonic frequencies in certain areas to PHYSICALLY CREEP YOU OUT. Below Zero just bores. \r\n\r\n5: Cool Designs? No. You want neat leviathans? Best I can do is 4 jawed dorks that all look the same and sound too similar, or annoying bs like TOO MANY CRYPTOSUCKS and brute sharks. Dude. Seriously. And sea monkeys that make you go thru this fmv bs that will get you eaten after they take something that could be vital to your life OR just crap. \r\n\r\n6: Drawing you in: No. No, all it does is drive you away. I get it: we all have different ideas. But dude. Seriously. Keep the sjw bs out of games. This is supposed to be a fantasy. It is already annoying to be harped on for eating meat and hearing your sissy characters whinge about fish in the first game, but this one? You literally did the cartman meme during your character designs. \r\n\r\n7: WTF why is it that all the stuff for endgame builds can be acquired in 2 hours, but you need a GD walkthru to find a Base Builder tool? TERRIBLE balance. The first game was SO AMAZING with this! And then there's BZ. Playing this is like watching the Globetrotters beat a middle school team. \r\n\r\nAll in all, CAN you have fun? Sure. Is this game for everyone? No. Not at all. Is it even CLOSE to Subnautica? Hell no. This is Subnautica from Wish.Com. It is sad. \r\n\r\nOne can only hope S2 is better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I found this game really boring compared to the original. Any cool \"science\" that was in the first game is gone. Voicelines are cringe. Not as scary as first game. Biomes are repetitive. Story is lackluster. My friend liked it enough to 100% it though, so some people like it. But not for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm a big fan of the original Subnautica. Below Zero improves upon some of its gameplay elements, but falls woefully short in other areas. The main problem is the awful story and cringy characters. It feels like a typical 2020's project needlessly virtue signaling its woke political views. For example: all black girls are brilliant stoic badasses and all white men are goofy sissy boys. Is that something you enjoy in fantasy fiction? If so, you'll love this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Below Zero might as well be a fan-made mod. And if it were, I’d probably cut it some slack. \n\nFirst, it’s much too small. Within a few hours you will be familiar with all the edges of the map (spoilers: it ends in disappointment).\nBut fine, it’s a tighter experience with much the same charm, right? Well, not really. The writing is worse, the tone is completely different, and the gameplay involves way too much land exploration and underwater spelunking. The frosty coat of paint and the new vehicles are cool in concept, but mostly just replace the better ones. Regarding the time on land, this game wasn’t built for it. But then again, shouldn’t that have been obvious?\n\nI loved getting lost in Subnautica, and never truly felt like I had mapped it all out. I was fully immersed, stranded in an endless ocean, and always terrified. In Below Zero, I desperately went searching for that one cave I hadn’t yet seen, only to realize it’s the same as the one I had.\n\nIn case you’re looking at my playtime and thinking I got my money’s worth, here’s a quick rundown:  \n\nI played this years ago, spent most of my time building a base, then stopped and thought: “what is this base even for? What larger goals will I contemplate inside this newly earned sanctum?” I couldn’t find an answer, and so I left my unfinished base and stopped playing. \n\nFast forward to today. I decided to get further, start a new base, and had the much the same experience. If it weren’t for the game inexplicably failing to autosave after my last few hours of playtime, I probably would have kept going. But in hindsight I’m glad I had enough reason to stop.\n\nIf you want more Subnautica, and you likely do, this aint it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even taking it away from the comparison to its predecessor, this just isnt nearly as good as it could have been. Its riddled with bugs and MULTIPLE TIMES whilst playing I had to RESEARCH OTHER GLITCHES TO DO to get BACK IN BOUNDS! especially with the on land sections.\n\nRemoving it from that, yeah its alright. The story is... for sure something, and its really upsetting that to get the ending you don't even follow the story that the game tries to hook you with, its an optional side quest and the actual answer to your questions is *painfully* unsatisfying.\n\nWhen the original Subnautica was a brilliant, thrilling thing, with a rich world and story that felt not like a game but like an experience, and Below Zero is none of that. I *really* hope Subnautica 2 can capture even a fraction of what made the original game so great, because this just doesn't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edit: The devs removed the option to play the legacy version of Subnautica, switching the review to negative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is ass. its a rip off, of the original subnautica and absolutely boring. You can tell it was rushed as a money grabber. its not even worth the $10 I paid on sale for this.\n\nAlso lots of woke messaging with feminism and race and sexuality in the lore/story. Pretty cringe and gay. 0/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the original is great, this is an embarrassing and boring sequel. i hate it, and i cant bring myself to bring it. i beat the original three times, and I HATE THIS ONE! and YOU! no i like you probably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game i got eaten by a giant shark and then threw my mouse at my infant child out of anger and got divorced by my wife and then had to kill her",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's complete fucking SHIT compared to the first one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Could have been great if they didnt leave you to find everything without help",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly where do I begin! The story at the beginning of it's development with even the old ending leak it was looking like a much better game, there were reason to be at places, there was a connection with the people around you, Sam actually mattered, there was a complot going on, and just much more to the story!\r\n\r\nWhat we got at the end, just feels empty, and then you also start to pick up things that it really lacked, like the scale of the whole thing, the thrill the first one gave and more. It's a real shame to see. \r\nI was excited for the upcoming 2, but with the recent news of the studio firing 3 important people for it, and then the whole AI situation, I am unsure if I ever could support it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing in so many ways.  The original was an all time great, this failed to build on that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Won't even bother pirating the next game.\n\nYou just had to ruin a good thing KRAFTON.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "like if subnautica was even worse. krafton ai first and greedy as fuck. L purchase",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its bad because it doesn't have the stasis rifle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unfinished piece of dlc, don't play it if u aren't a fan of Subnautica",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This should have been a 10€ DLC, not released on it's own as a 30€ game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is now an \"AI First\" review",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy downgrade",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compared to the original, this game is dog water. \n\nSmaller map, lame vehicles, less features (such as VR support), poorly designed enemy behavior, lame story, and the main character is insufferable. Plus, they got rid of the cyclops to replace it with an awkward and slow underwater bus. One of the most memorable experiences i had with the original was completing the cyclops and putting out fires when I face the first leviathan. The best part of the original was how it made you FEEL when you plunged deeper into the abyss for the first time to test a new piece of equipment. The FEELING where the visuals and music compounded the unique and exciting experience of exploring a terrorizing deep seascape. All of the mentioned shortcomings, including the bland music cues add up to a stale and forgettable experience. Didn't bother finishing this one.",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "There's a lot bad with this one. First I'd like to say that I gave this game a shot multiple times, I've 100% it twice and both times were mind numbingly boring. I absolutely love the first game, enough to make me speedrun it from time to time. So I was absolutely excited when they announced a second game. I've never been so disappointed in my life before. In Subnautica Below Standard, they offer more bad then actual good in terms of both gameplay and story. Which really felt like a step back for the series' direction considering how amazing the first game was. First. I'll talk about the good segments. The atmosphere, plants and scenery were all very good, all were very polished and you can see care went into into this part specifically. Now that we're done with all the good parts in this game and the only saving grace, lets talk about the bad parts of this game, and boy is there a lot.\n\nFirst, the map. The map in this game feels so much more smaller and enclosed (because it is) when compared to the first game. Instead of having that really amazing feeling of getting lost and actually enjoy traveling like in the first game, you get a very watered down variant of it. Areas are a lot more small, less dangerous, and not as engaging as the first game. All the areas that were abandoned are all pretty small as well so you don't get that same feeling of trying to figure out what happened to the people that were there before. Traveling from place to place feels more like a chore then anything, there's zero danger in the waters and the violent fish are nothing more then a mere inconvenience to get through. Finally you're left with the surface segments. God they're so boring and the only slightly \"exciting\" thing is the huge worm that follows you. The actual places you can visit on the surface are also pretty lackluster. They offer really nothing other then a few key items and like a few novelties to decorate your base with. The worm is stupid easy to avoid, he does minimal damage so its not even a threat, and even if he was you cant even kill the dude. With the first game if you wanted a leviathan dead you could knife it to death or use a prawn suit, which was actually a really fun challenge to do. In Below Standard, you cant even hurt the worms because... well you're never really given a reason other then \"they have thick shells\" (which if you think about it, the prawn's drill can mine freaking diamonds, why the hell wouldn't it be able to drill the shell of a giant gummy worm.) \n\nSecond, how the actual gameplay was implemented feels like if the devs taking a test 120 minute test with only 5 minutes left, did absolute zero work and didn't know the answers. So they copied the dude 4 seats ahead of them because they needed to write something down really quickly. Firstly all the materials you find in this game are either stupid easy to get, or really annoying to get. Which yeah you may think that's just normal game design but they made all the commonly used materials annoying to find, and the endgame stuff stupid easy to get. The first game at least had a way to get a lot of copper and quarts pretty easily, while in this one i had to go to 2 biomes over just to get a small handful. Hell even titanium wasn't this annoying to get in the first game. Now lets talk about the vehicles. The new vehicles in this game are often worse to use then just going out by yourself. The seatruck is a mix of the seamoth and the cyclop in the first game. I loved those two vehicles a lot but they somehow managed to get only the annoying things from those two, and put them into a single vehicle that's supposed to be your main source of transportation. The seatruck is pretty annoying to control, all of its segments are for specific uses so you cant even make it semi custom like in the cyclops.  Its also stupid slow too and often feels slower then using a seaglide just to get around. The other vehicle I used so rarely that I cant even remember it's name but its the hover bike that's in the screenshots. First, about that bike is that its stupid slow. So slow you cant even use it for the main thing it's designed to do, which is outrun and dodge the unkillable worms. When I played, I often had my bike get destroyed whenever the worm would poke its head out, roughly 20 meters away from me, which would kick me off of it instead of letting me outrun it. There is an upgrade from what I remember to make it *kinda* faster but that can be solved with what I mainly did, which was just using the prawn suit. They kept the prawnsuit in the game which meant you now have a proper way to travel both in the water, and on land. Which makes both the seatruck and bike totally useless. Sure you can get the other ones before the prawn suit but like, you'll never use them ever again after you get the prawn. At least with the cyclops you could bring it to the active lava zone without needing a prawnsuit to do anything down there. Oh also the prawnsuit is faster then both the seatruck and the bike, meaning its completely useless to use either in any situation, other then the prawn being too tall for some cave systems. \n\nThird, is probably one of the most important parts of any game, The story. My god is it such a HUGE step down from the first game. The story is you basically purposefully crash on an island to find your sister (who you already know is probably dead) to go find out what happened. Then you met a predecessor who invades your mind in the most obvious and uninteresting way. You then have to build the predecessor a body so then you can get him out of your head, so then you can finish the story. Which yeah that's can be a totally fine story, but how they execute it is awful. Firstly, Robin, the girl you play as is the most annoying character ever made. She whines and complains about every little thing, while boasting about how she's a survival expert and acts like the classic know it all. All her interactions with other characters just made me hate Robin more and more instead of wanted to see what her story was about. Not only that but she has pretty much zero character development. Second how they handled the infection was absolutely terrible. In the first game its really well polished with how they handle everything with it. In this one they kinda just make you combine a plant and if i remember correctly some salt and it cures the infection. So you're telling me that an infection that almost wiped out an entire plant could have been cured with some freaking fruits? Common fruits at that, that grew not even 100 meters away from the damn thing? Seriously, either they hired new writers who ruined the IP like with the halo show, or the devs were high on deepshrooms. The story regarding her sister was so bad I can even remember what it was about. I just remember she was dating someone and Altra didn't like the sister for whatever reason. I could be wrong with this part specifically so take that with a grain of salt, the story was hard to stay awake in. Finally you have the interactions with that old lady, they were the only decent thing in the story. Mainly since she had a cool dog but that was the only cool thing about her.  Honestly I don't really like saying this but Robin felt like a complete \"Mary Sue\", everything she does it feels like the devs were trying to make her one up the past MC. She feels like if the Forespoken devs were quickly asked to make a main character, and all that they had was a napkin. After making the draft they didn't like it so then they threw it away, then Unknown Worlds picked it up and used it for Robin character design. Robin's so god awful I cant tell if shes better or worse then the Forespoken MC.\n\nThis review is too long as I hit the text limit, don't waste your time or money. The music is somehow worse in this one, then compared to the first game which was amazing (I used to listen to it daily).\n\nTLDR: The first game was better because the MC didn't talk in that one.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "What the f*ck\n\n\nI am divided if I should even recommend this game or not. There is a lot to unpack. \nFirst of all this game is much shorter than the predecessor. I mean like 2,5 times shorter (I have playtime of BZ 22h, while on first one 55h~). From this reason alone I highly recommend buying it on sale. \nWith this said I will start from nice things - like the biomes and creature design. Stunning, I love it. I absolutely adore Sea Monkeys, crystal caverns, whale leviathans, penguins etc. However, this game is not even remotely scary. First game creeped you out. Here? Not really. Maybe a tiny bit of tension while exploring shipwreck for the first time. However if you want to play just new biomes and maybe experience the arctic subnautica - it's really enjoyable.\nThe thing is... It's the only thing it's good at? Lore is dead. Gameplay is kinda dead. It's short. Achievements are even easier than in the first one, they are not enjoyable, but they guide you what you should do in game. Game is not creepy. It's pretty tho.\nThe main plotline of sister is stupid as heck. You don't even notice and it's already done. You help the architect... And you learn literally NOTHING NEW about ANYTHING. You will probably end up more confused than understand... anything? Unless they totally change the planet for subnautica 2, I believe it's gonne be hard to write a proper lore for new game with this??? as a baseline.\nI was thinking if the problem with our protagonist is about her talking so much and I think that maybe? I feel like it's more about what she is talking about rather then how much. Also the setting does not work - first part of Subnautica immersed you in the world not only because Riley was not talking - he was a lone survivor. You felt his situation, you were exploring, scared and confused. In Subnautica Below Zero however, our main character is literally here on her own accord. What's the point then? She is not lost and we don't even get any new knowledge about the world by interacting with architect. It just doesn't work. \nALSO why does she have to talk this much amount of bullsh*t about hope, humanity and this pseudophilosophical sh*t? It turned out really shallow. She also says stuff like \"I need to get to my droppod\". Yeah, I know. You don't have to annouce every move of yours. This character turned out really unrealistic and as a pretty stupid one.\nI hate the change of pda voice. I can't explain it but it just got on my nerves so badly.\nFirst part of Subnautica suffered in the exploration of the ground. And this one suffered too. I kinda regret it, because the idea itself is good - I enjoyed finding and exploring some islands - creatures on the ground too. However walking was wonky. Snowfox is awful at best - both me and my boyfriend preferred to move in prawn. \nNice of them to unlock earlier ion power cells, however everything was handed to you on a plate. All of extremely end game resources of Subnautica where available from the start in Below Zero. You end up not using anything what you scan. I didn't even unlock dock's for my seatruck because you literally don't need them. My bf didn't even get the high capacity tank XD.\nWhile my base (while I really enjoy base building) in Subnautica was enormous, my base is Below Zero was small. Pretty, but simple and small. Why? Because you literally don't even need it in this game.  However there was more customisation available which was really nice, I hope in the future games there could be even more. \nI also wish the biodiversity would be even better. I think it was a good direction, but especially on the island it was visible how little creatures there are (literally 3 and a skyray lmao). \nEnding was crazily bad and made me laugh my ass off. It wasn't even funny, it was so stupid I just couldn't stop laughing.\nI also believe it was much more enjoyable for me, because of playing it with my boyfriend. But for a solo run I don't think it's nearly as captivating as the first one.\n\nTL DR: It's pretty. It's not a good continuation. May be enjoyable if you haven't played first part, but then it would be spoiling the first part while not even doing it in a worth of it way. If you just want more swimming in pretty places and to interact with creatures - go for it (on sale). However if you want a good continuation and a better game than the first one... You can just skip it. I think I wouldn't tho, but just because of need of experiencing stuff on my own.\n\n\n[spoiler]Also in the end... Did she want to f*ck the architect? That was a crazy way to end the game. \"I will go with you! I will continue my sis's legacy! You will find family!\" That was really strange. I know the intent wasn't for that but I wouldn't be surprised if we get hibrid kids in some part.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "You can't make a Subnautica sequel and focus on land instead of water.\r\nIt's called Subnautica beacause of the water. \r\nThe Shadow Leviathan could have been much better.\r\nI really liked the original Subnautica and even waited for this game but it doesn't feel like 4546b.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Subnautica was such a good game with such good developers that interacted with their community, actively seeking guidance and feedback and trying to make a good game for them. They were striving to make something to be proud of. This game used to be something to be proud of. \nThe creators have now dedicated themselves to being \"AI first\". This means that not only are they firing their staff, they're using stolen assets that ai is being trained on to cut corners and make SLOP instead of games. \nYou saved a couple of bucks but you lost the trust the community had in you. I hope you lose as much money as possible when the AI bubble pops.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Still no vr support? Whats up with that?\nA lot more land than the first game. \nIts fine. I would recommend playing the first one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a standalone game, Below Zero is incredible. Great graphics, great performance, great music, and great gameplay- really, an amazing game... as a standalone. Because Below Zero just doesn't live up to Subnautica. The story isn't compelling (or even interesting, to be honest)- there is no real character development, no grand twist that engages the player- the free feel of exploring a vast ocean world is gone, and linear gameplay replaces it.\n\nIs the game good? Yes. But it just doesn't live up to what it promised. And for that reason, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's good by virtue of being a Subnautica game, but fails in every other regard. Completely abandons the environmental storytelling that made the first game stand out. Really, I just didn't care for the reddit alien. Play the original twice instead lol",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wish there was a \"mixed\" review option, but this game isn't great. It's about a 6/10. My main gripe is the level design, it just doesn't work. This game opted for a more enclosed space experience with small biomes and deep winding caves, but they aren't nearly as fun or memorable as the expansive, desolate biomes of the first game. I think the various biomes are visually stunning, but they aren't mechanically a good match for this game. Subnautica was always fun because of the fear of the unknown, being forced to push your comfort zones to get new resources, but this game just feels very same-y. Unfortunate, because it really does a lot of stuff right too! The base building is a direct upgrade from the first game, especially the seatruck dock! LOVE that thing!\r\nOverall, I sort of enjoyed the game, but I cannot recommend someone to buy it. If you do, wait for it to be on sale for $10 or so, then I'd say it's worth a shot. It's a game I would probably not come back to.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything good about the core gameplay loop of Below Zero is either as good in OG Subnautica, or better.\n\nThe only reason I bothered to go back and finish the game (after walking away from it with disappointment over a year ago) was just how close I was to finishing up the storyline (that and the last three achievements bugged me juuuust enough). It sure as HELL isn't worth the £26 ($35 at current exchange rates) that it's currently listed at!\n\nIf you want it, wait for it to come up on a 75% off sale... or go play OG Subnautica and check out the modding community for that one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Comared to Subnautica, this game feels boring, to me.\nIt is way less atmospheric - and even worse, I cannot get warm with it.\nI just keep scanning and diving, without any excitement.\n\nSorry, but I want to give an honest review.\nI hope Subnautica 2 will be more exciting, again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a DLC that's overwhelmingly unfaithful to the original game in many ways. It's only redeeming quality is the production quality on alien designs, fauna and flora. That specific visual matches the original and is wonderful.\n\nThe same cannot be said for everything else. There's considerably less explorable biomes, discoverable aliens. We lost the silent protagonist in favor of a diversity appeal that simply does not belong in any video game, and especially not as a follow up to the world-acclaimed silent protagonist experience that is the original Subnautica game.\n\nIt baffles me, this is so ridicule, so absolutely insane, it's a catastrophe. I'd put my hand to the fire that actual devs in the studio where forced into a toxic positivity environement as to never ever point out the self-sabotage, less they'd lose their jobs after the wonderfully successful first game.\n\nIt is a miracle we got a voice slider in the options, and something tells me it is no accident either. If my guess is right, whoever built that voice slider, Bravo, thank you. But even then, it wasn't enough. There's simply too much elements missing from the first game to meet anyone's expectations, and too many unbelivable garbage added instead.\n\nI played below zero a few years ago and could simply not bring myself to finish it past collecting 2 alien part schematics and meeting the Strong Woman Character. I could only bring myself to play this again after enough time, after years without it, enough to forget the vivid regrets I had from my first experience, and I actually almost instantly abandonned immediately again straight into uninstall right back as the intro cinematic barely ended until I opened the options menu and found the way to mute the voices. Because immersion is king.\n\nThe story, main character, voice logs, all come from an obtuse \"corporate are bad\" and \"toxic work environement and  coworkers\" spiel that could have instead been about exploring an alien world, who knows. There is so much wasted effort in this meaningless crap, it is nauseating.\n\nI play subnautica because I want to feel small as a grain of sand beneath the waves of an alien world, instead, this game lets you play as a diversity monologue that praises itself and wants you to ... well, that's about it, pretty much.\n\nThe amount of content the game offers is an adequate DLC, minus the characters. It is not enough content for a standalone game. It is not worth your money. It could have been a story of how there's frozen caraar left to expunge, it could have been a vastly simpler scenario without alterra meddling and without the terrible surface exploration, in favor of more time underwater, more time socializing with one single character: the robotic voice of your PDA, or perhaps an alien that needs help.\n\nThe production time on the surface level could have been spent on lonely, actual sub-nautica experiences below the surface of the water, which is what absolutely every single player was expecting. It truly hurts my heart that such a profound self-sabotage happened to one of my most favorite games ever.\n\nThe trailers and publisher's bonus loss to scam the devs and other various contexts of the next game are all known and shared amongst enthousiasts and I for one cannot bring myself to be hyped for it whatsoever. It already features that same Modern Audience look again. Dozens of thousands of players are uniformly begging to bring back the silent protagonist. I simply cannot care, cannot pay a single further cent of my money on what already looks like more of the same political The Message-driven self-sabotage, and neither should you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Feels like Copy and Paste of the Original, i loved Subnautica and ive Platinumed it on Ps5 but SBZ feels like the same game with no changes at all and considering what the majority says in terms of map size and variety i think it might be better waiting for Subnautica 2.\n\nI dont get the same feeling of being lost and wanting to know more about the World as i did in the first game, just the routine scanning everything and crafting gadgets",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As someone who loved the original Subnautica, I went into Below Zero with high hopes, but came away pretty disappointed.\r\n\r\nThe magic of the first game just isn’t here. The map feels claustrophobic and way too small, with tight spaces that suck the fun out of exploration. There’s no real sense of wonder or fear like there was in the original’s vast, mysterious ocean.\r\n\r\nThe Seatruck, which replaces both the Seamoth and Cyclops, somehow manages to be worse than both. It's slow, clunky, and awkward to use, especially in cramped biomes. Instead of feeling like a cool modular system, it just becomes a hassle and its faster to just take the seaglide.\r\n\r\nBiomes in general are bland and forgettable. They all sort of blur together, mostly icy caves and shallow zones without much identity. The thrill of discovering strange new environments just isn’t there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The voiced protagonist is cringe and annoying, the silent avatar from the first is so much more immersive. If you are a die hard fan get it, but its not even close to as good as the original. It feels more like an asset flip with some story thrown in.\nIt should have been a DLC, wait for a sale. if you bother at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "loved the original, there was a lot of momentum built up for an amazing follow up, instead of naming it BZ they may as well of  just called it BS. Just a awful game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The deeper you go the more unfinished it feels. There are big areas with a lot of nothing, and many places are a pain to navigate when every plant you run into is like a brick wall. The plot was re-used from many other basic storylines with the details changed and seemed to only be developed as a wild goose chase.  A certain NPC makes a big entrance and then their story cuts short and they just sit around for the rest of the game. Also, I had no use for several vehicles I ended up crafting and got by with the basics just fine. I loved the first Subnautica, this one was a miss for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A significant downgrade of its predecessor, for every good thing it does, it does 4 worse, removing crucial gameplay and design elements. The atmosphere is lacking, the dialogue and story is horrible, the AI is worse than the intelligence of a rock, several parts feel like AI slop even if it was made by hand. On top of that, the level design is boring and inconsistent, with several elements added to pad out game time. Just play the first one instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a lot to say, but this games like, 6 years old and I don't feel anyone would really read it, or anything I've said hasn't already been said before.\r\n\r\nMy Perspective is from playing it Blind on Hardcore, so I probably missed some stuff, though I got all the achievements. \r\n\r\nUltimately, Mid/10, The first game was way better.\r\n\r\nThey tried a lot of neat things, but I constantly just felt the game break immersion from janky AI, bad level design and poor choices for the system they built. \r\n\r\nShockingly, surface gameplay for a waterbased game don't play out that well.\r\nPutting giant fish in narrow cave systems gets them stuck on walls a lot.\r\nGiving the player infinte, low cost ways to break any tension makes the threat that laviathans should pose basically obsolete and ruins a lot of the tension the game is going for. \r\netc, etc, etc. \r\n\r\nWas fine, but tbh, I'd rather have just replayed subnautica after finishing this. \r\nFingers crossed Subnautica 2 is better. :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved the first subnautica, but the second one just seemed short, the map small, and the main reason why it takes longer to pass is because it feels like a maze with not that great of directions. The storyline was not as interesting as the first game, although for a very quick play, this is an ok game to try.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was a average game. Mediocre and pretty meh, I feel like my money would have been better spent if I bought a box of warhammer. Kreigers in my case. Anyway it was fun I just fell like way too much human effort was wasted on a quite meh game but whatever not like anyone cares about this review and people have already reviewed it better than I have so I wont bother. Also I played with a pda voice mod because the indian pda voice was probably added because of the same person that thought the squidshark was a leviathan not a just big fish. I miss my seamoth :( but the new prawn was refreshing and in some aspects below zero made me play subnautica differntly. For example not relying on vehicles and carrying spare o2 thank instead, I just wish the swimm speed was faster by default.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, this falls far from the mark Subnautica left on the community. This, while a more streamlined and modern take, I would rather hold fast and true to the classic Subnautica experience that was developed and pioneered alongside the golden age of lets plays and indie gaming. It should have been an expansion of 1 adding the cut content and ideas not realized by the original team.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "das game wird schnell langweilig und auch das erkunden fühlt sich komisch und ziemlich viel schlechter als im ersten game an ich kann nur empfehlen bei subnautica beim kauf das below zero weglassen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slow swim speeds, anoying diolog, small map, less creatures, incomplete pda with conflicting disctriptions. The story is bland and uninteresting with characters who make no sense. This game is nowhere the same level as the origional subnautica and I would genuinly say you should just play the first one over this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Was surprisingly disappointing[/h1]\n[i]If you loved the first game this one… might be one to avoid…[/i]\n[h3]Took 50 hours to 100% the story and all acheivements - At least 25 of that was building a pointlessly big base.[/h3] \n\nI want to recommend this game so bad, but it was honestly just too big of a hot mess.\n\n[b]The Pros:[/b] \n-\tThe snow themed biome was neat. I personal love games with snow in them (however… See Cons*)\n-\tLots of cute animals and fish.\n-\tOffered the wonderful build system we experienced in the first Subnautica (albeit did not bring any new builds into the game for the most part).\n-\tFemale protagonist (Would prefer character customization options but hey, it’s a start).\n\n[b]The Cons:[/b] \n-\tGame design in terms of mission continuity and map layouts was just atrocious. Ever biome is basically a maze with tons of dead ends, obstacles, haze, fog, snow, darkness -just miserable to navigate.\n-\tStory was deeply lacking. Whilst they tried to pad the story with “Heart” it ultimately came up feeling extremely pointless.\n-\tOMG an NPC we can interact with!!…. For like the first 10 min of the game… cool. But yay… [spoiler] vegetables from the garden... [/spoiler] Zzz\n-\tThe Seatruck – [i] Dear Devs, yall know that a truck can pull heavy sh*t and move faster than 1km an hour… riiiiight? [/i] (Was so excited to learn about the modular system until I realized it turns the Seatruck into a SeaSloMoWhereTheFkDidIParkMySeamoth!) \n-\tVisibility – touched on this above but visibility felt horrid in this game. Why am I squinting AF trying to not swim or run into walls constantly. Why am I getting lost constantly just because I can’t see where I am going. Why is there so much snow on land I can’t even see! I’m Canadian, I get that enough during January and February FFS!\n-\tGathering – Can’t quite put my finger on this one but gathering just felt unsatisfying in Below Zero. In the first game it was exciting to locate a new resource. Might have been the cramped map or the frikken grind for Lead but I actually started getting annoyed having to look for resources. \n-\tMap was just too damn cramped. Too many tunnels. Felt like they designed the map based upon a bowl of spaghetti dumped upside down. \n\nRating: Below Zero out of Five Stars\n\nPS: Why are yall trailers the nicest cutscenes the game has? Would love to see more cutscenes actually in-game once yall have taken my money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not a bad game by any means, but compared to the first game it's violently lackluster. The first game set such an incredibly high standard,and this just felt so meh. I'd say overall it's still worth a play for the story as long as you get the game on a decent sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh, just not as good as sub 1. its a ok game, story just is kinda mid, i did enjoy AL-AN and wanted to know what happen at the end, but her sister part of the story and the main character is annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts OK but gets worse as the story moves on. The exploration of vast ocean from original Subnautica is mostly missing, the map is small and most things are hidden in complicated caves. Even when you have a waypoint, some places take ages to find because you have to navigate caves and the shortest way is never the correct one.\nThen it gets even worse with land areas. That is where i stopped playing. The land is a maze of corridors which are even worse than underwater caves because you can't swim up and down. In addition to that, you freeze if you are not in a vehicle. I honestly lost track of what am I supposed to do and find on the land and combining that with getting lost constantly, the game stopped being fun alltogether.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I found this game really boring compared to the original. Any cool \"science\" that was in the first game is gone. Voicelines are cringe. Not as scary as first game. Biomes are repetitive. Story is lackluster. My friend liked it enough to 100% it though, so some people like it. But not for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm a big fan of the original Subnautica. Below Zero improves upon some of its gameplay elements, but falls woefully short in other areas. The main problem is the awful story and cringy characters. It feels like a typical 2020's project needlessly virtue signaling its woke political views. For example: all black girls are brilliant stoic badasses and all white men are goofy sissy boys. Is that something you enjoy in fantasy fiction? If so, you'll love this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Below Zero might as well be a fan-made mod. And if it were, I’d probably cut it some slack. \n\nFirst, it’s much too small. Within a few hours you will be familiar with all the edges of the map (spoilers: it ends in disappointment).\nBut fine, it’s a tighter experience with much the same charm, right? Well, not really. The writing is worse, the tone is completely different, and the gameplay involves way too much land exploration and underwater spelunking. The frosty coat of paint and the new vehicles are cool in concept, but mostly just replace the better ones. Regarding the time on land, this game wasn’t built for it. But then again, shouldn’t that have been obvious?\n\nI loved getting lost in Subnautica, and never truly felt like I had mapped it all out. I was fully immersed, stranded in an endless ocean, and always terrified. In Below Zero, I desperately went searching for that one cave I hadn’t yet seen, only to realize it’s the same as the one I had.\n\nIn case you’re looking at my playtime and thinking I got my money’s worth, here’s a quick rundown:  \n\nI played this years ago, spent most of my time building a base, then stopped and thought: “what is this base even for? What larger goals will I contemplate inside this newly earned sanctum?” I couldn’t find an answer, and so I left my unfinished base and stopped playing. \n\nFast forward to today. I decided to get further, start a new base, and had the much the same experience. If it weren’t for the game inexplicably failing to autosave after my last few hours of playtime, I probably would have kept going. But in hindsight I’m glad I had enough reason to stop.\n\nIf you want more Subnautica, and you likely do, this aint it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even taking it away from the comparison to its predecessor, this just isnt nearly as good as it could have been. Its riddled with bugs and MULTIPLE TIMES whilst playing I had to RESEARCH OTHER GLITCHES TO DO to get BACK IN BOUNDS! especially with the on land sections.\n\nRemoving it from that, yeah its alright. The story is... for sure something, and its really upsetting that to get the ending you don't even follow the story that the game tries to hook you with, its an optional side quest and the actual answer to your questions is *painfully* unsatisfying.\n\nWhen the original Subnautica was a brilliant, thrilling thing, with a rich world and story that felt not like a game but like an experience, and Below Zero is none of that. I *really* hope Subnautica 2 can capture even a fraction of what made the original game so great, because this just doesn't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edit: The devs removed the option to play the legacy version of Subnautica, switching the review to negative.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is ass. its a rip off, of the original subnautica and absolutely boring. You can tell it was rushed as a money grabber. its not even worth the $10 I paid on sale for this.\n\nAlso lots of woke messaging with feminism and race and sexuality in the lore/story. Pretty cringe and gay. 0/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the original is great, this is an embarrassing and boring sequel. i hate it, and i cant bring myself to bring it. i beat the original three times, and I HATE THIS ONE! and YOU! no i like you probably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass game i got eaten by a giant shark and then threw my mouse at my infant child out of anger and got divorced by my wife and then had to kill her",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's complete fucking SHIT compared to the first one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Could have been great if they didnt leave you to find everything without help",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly where do I begin! The story at the beginning of it's development with even the old ending leak it was looking like a much better game, there were reason to be at places, there was a connection with the people around you, Sam actually mattered, there was a complot going on, and just much more to the story!\r\n\r\nWhat we got at the end, just feels empty, and then you also start to pick up things that it really lacked, like the scale of the whole thing, the thrill the first one gave and more. It's a real shame to see. \r\nI was excited for the upcoming 2, but with the recent news of the studio firing 3 important people for it, and then the whole AI situation, I am unsure if I ever could support it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing in so many ways.  The original was an all time great, this failed to build on that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Won't even bother pirating the next game.\n\nYou just had to ruin a good thing KRAFTON.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "like if subnautica was even worse. krafton ai first and greedy as fuck. L purchase",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its bad because it doesn't have the stasis rifle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unfinished piece of dlc, don't play it if u aren't a fan of Subnautica",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This should have been a 10€ DLC, not released on it's own as a 30€ game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is now an \"AI First\" review",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy downgrade",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compared to the original, this game is dog water. \n\nSmaller map, lame vehicles, less features (such as VR support), poorly designed enemy behavior, lame story, and the main character is insufferable. Plus, they got rid of the cyclops to replace it with an awkward and slow underwater bus. One of the most memorable experiences i had with the original was completing the cyclops and putting out fires when I face the first leviathan. The best part of the original was how it made you FEEL when you plunged deeper into the abyss for the first time to test a new piece of equipment. The FEELING where the visuals and music compounded the unique and exciting experience of exploring a terrorizing deep seascape. All of the mentioned shortcomings, including the bland music cues add up to a stale and forgettable experience. Didn't bother finishing this one.",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "There's a lot bad with this one. First I'd like to say that I gave this game a shot multiple times, I've 100% it twice and both times were mind numbingly boring. I absolutely love the first game, enough to make me speedrun it from time to time. So I was absolutely excited when they announced a second game. I've never been so disappointed in my life before. In Subnautica Below Standard, they offer more bad then actual good in terms of both gameplay and story. Which really felt like a step back for the series' direction considering how amazing the first game was. First. I'll talk about the good segments. The atmosphere, plants and scenery were all very good, all were very polished and you can see care went into into this part specifically. Now that we're done with all the good parts in this game and the only saving grace, lets talk about the bad parts of this game, and boy is there a lot.\n\nFirst, the map. The map in this game feels so much more smaller and enclosed (because it is) when compared to the first game. Instead of having that really amazing feeling of getting lost and actually enjoy traveling like in the first game, you get a very watered down variant of it. Areas are a lot more small, less dangerous, and not as engaging as the first game. All the areas that were abandoned are all pretty small as well so you don't get that same feeling of trying to figure out what happened to the people that were there before. Traveling from place to place feels more like a chore then anything, there's zero danger in the waters and the violent fish are nothing more then a mere inconvenience to get through. Finally you're left with the surface segments. God they're so boring and the only slightly \"exciting\" thing is the huge worm that follows you. The actual places you can visit on the surface are also pretty lackluster. They offer really nothing other then a few key items and like a few novelties to decorate your base with. The worm is stupid easy to avoid, he does minimal damage so its not even a threat, and even if he was you cant even kill the dude. With the first game if you wanted a leviathan dead you could knife it to death or use a prawn suit, which was actually a really fun challenge to do. In Below Standard, you cant even hurt the worms because... well you're never really given a reason other then \"they have thick shells\" (which if you think about it, the prawn's drill can mine freaking diamonds, why the hell wouldn't it be able to drill the shell of a giant gummy worm.) \n\nSecond, how the actual gameplay was implemented feels like if the devs taking a test 120 minute test with only 5 minutes left, did absolute zero work and didn't know the answers. So they copied the dude 4 seats ahead of them because they needed to write something down really quickly. Firstly all the materials you find in this game are either stupid easy to get, or really annoying to get. Which yeah you may think that's just normal game design but they made all the commonly used materials annoying to find, and the endgame stuff stupid easy to get. The first game at least had a way to get a lot of copper and quarts pretty easily, while in this one i had to go to 2 biomes over just to get a small handful. Hell even titanium wasn't this annoying to get in the first game. Now lets talk about the vehicles. The new vehicles in this game are often worse to use then just going out by yourself. The seatruck is a mix of the seamoth and the cyclop in the first game. I loved those two vehicles a lot but they somehow managed to get only the annoying things from those two, and put them into a single vehicle that's supposed to be your main source of transportation. The seatruck is pretty annoying to control, all of its segments are for specific uses so you cant even make it semi custom like in the cyclops.  Its also stupid slow too and often feels slower then using a seaglide just to get around. The other vehicle I used so rarely that I cant even remember it's name but its the hover bike that's in the screenshots. First, about that bike is that its stupid slow. So slow you cant even use it for the main thing it's designed to do, which is outrun and dodge the unkillable worms. When I played, I often had my bike get destroyed whenever the worm would poke its head out, roughly 20 meters away from me, which would kick me off of it instead of letting me outrun it. There is an upgrade from what I remember to make it *kinda* faster but that can be solved with what I mainly did, which was just using the prawn suit. They kept the prawnsuit in the game which meant you now have a proper way to travel both in the water, and on land. Which makes both the seatruck and bike totally useless. Sure you can get the other ones before the prawn suit but like, you'll never use them ever again after you get the prawn. At least with the cyclops you could bring it to the active lava zone without needing a prawnsuit to do anything down there. Oh also the prawnsuit is faster then both the seatruck and the bike, meaning its completely useless to use either in any situation, other then the prawn being too tall for some cave systems. \n\nThird, is probably one of the most important parts of any game, The story. My god is it such a HUGE step down from the first game. The story is you basically purposefully crash on an island to find your sister (who you already know is probably dead) to go find out what happened. Then you met a predecessor who invades your mind in the most obvious and uninteresting way. You then have to build the predecessor a body so then you can get him out of your head, so then you can finish the story. Which yeah that's can be a totally fine story, but how they execute it is awful. Firstly, Robin, the girl you play as is the most annoying character ever made. She whines and complains about every little thing, while boasting about how she's a survival expert and acts like the classic know it all. All her interactions with other characters just made me hate Robin more and more instead of wanted to see what her story was about. Not only that but she has pretty much zero character development. Second how they handled the infection was absolutely terrible. In the first game its really well polished with how they handle everything with it. In this one they kinda just make you combine a plant and if i remember correctly some salt and it cures the infection. So you're telling me that an infection that almost wiped out an entire plant could have been cured with some freaking fruits? Common fruits at that, that grew not even 100 meters away from the damn thing? Seriously, either they hired new writers who ruined the IP like with the halo show, or the devs were high on deepshrooms. The story regarding her sister was so bad I can even remember what it was about. I just remember she was dating someone and Altra didn't like the sister for whatever reason. I could be wrong with this part specifically so take that with a grain of salt, the story was hard to stay awake in. Finally you have the interactions with that old lady, they were the only decent thing in the story. Mainly since she had a cool dog but that was the only cool thing about her.  Honestly I don't really like saying this but Robin felt like a complete \"Mary Sue\", everything she does it feels like the devs were trying to make her one up the past MC. She feels like if the Forespoken devs were quickly asked to make a main character, and all that they had was a napkin. After making the draft they didn't like it so then they threw it away, then Unknown Worlds picked it up and used it for Robin character design. Robin's so god awful I cant tell if shes better or worse then the Forespoken MC.\n\nThis review is too long as I hit the text limit, don't waste your time or money. The music is somehow worse in this one, then compared to the first game which was amazing (I used to listen to it daily).\n\nTLDR: The first game was better because the MC didn't talk in that one.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "What the f*ck\n\n\nI am divided if I should even recommend this game or not. There is a lot to unpack. \nFirst of all this game is much shorter than the predecessor. I mean like 2,5 times shorter (I have playtime of BZ 22h, while on first one 55h~). From this reason alone I highly recommend buying it on sale. \nWith this said I will start from nice things - like the biomes and creature design. Stunning, I love it. I absolutely adore Sea Monkeys, crystal caverns, whale leviathans, penguins etc. However, this game is not even remotely scary. First game creeped you out. Here? Not really. Maybe a tiny bit of tension while exploring shipwreck for the first time. However if you want to play just new biomes and maybe experience the arctic subnautica - it's really enjoyable.\nThe thing is... It's the only thing it's good at? Lore is dead. Gameplay is kinda dead. It's short. Achievements are even easier than in the first one, they are not enjoyable, but they guide you what you should do in game. Game is not creepy. It's pretty tho.\nThe main plotline of sister is stupid as heck. You don't even notice and it's already done. You help the architect... And you learn literally NOTHING NEW about ANYTHING. You will probably end up more confused than understand... anything? Unless they totally change the planet for subnautica 2, I believe it's gonne be hard to write a proper lore for new game with this??? as a baseline.\nI was thinking if the problem with our protagonist is about her talking so much and I think that maybe? I feel like it's more about what she is talking about rather then how much. Also the setting does not work - first part of Subnautica immersed you in the world not only because Riley was not talking - he was a lone survivor. You felt his situation, you were exploring, scared and confused. In Subnautica Below Zero however, our main character is literally here on her own accord. What's the point then? She is not lost and we don't even get any new knowledge about the world by interacting with architect. It just doesn't work. \nALSO why does she have to talk this much amount of bullsh*t about hope, humanity and this pseudophilosophical sh*t? It turned out really shallow. She also says stuff like \"I need to get to my droppod\". Yeah, I know. You don't have to annouce every move of yours. This character turned out really unrealistic and as a pretty stupid one.\nI hate the change of pda voice. I can't explain it but it just got on my nerves so badly.\nFirst part of Subnautica suffered in the exploration of the ground. And this one suffered too. I kinda regret it, because the idea itself is good - I enjoyed finding and exploring some islands - creatures on the ground too. However walking was wonky. Snowfox is awful at best - both me and my boyfriend preferred to move in prawn. \nNice of them to unlock earlier ion power cells, however everything was handed to you on a plate. All of extremely end game resources of Subnautica where available from the start in Below Zero. You end up not using anything what you scan. I didn't even unlock dock's for my seatruck because you literally don't need them. My bf didn't even get the high capacity tank XD.\nWhile my base (while I really enjoy base building) in Subnautica was enormous, my base is Below Zero was small. Pretty, but simple and small. Why? Because you literally don't even need it in this game.  However there was more customisation available which was really nice, I hope in the future games there could be even more. \nI also wish the biodiversity would be even better. I think it was a good direction, but especially on the island it was visible how little creatures there are (literally 3 and a skyray lmao). \nEnding was crazily bad and made me laugh my ass off. It wasn't even funny, it was so stupid I just couldn't stop laughing.\nI also believe it was much more enjoyable for me, because of playing it with my boyfriend. But for a solo run I don't think it's nearly as captivating as the first one.\n\nTL DR: It's pretty. It's not a good continuation. May be enjoyable if you haven't played first part, but then it would be spoiling the first part while not even doing it in a worth of it way. If you just want more swimming in pretty places and to interact with creatures - go for it (on sale). However if you want a good continuation and a better game than the first one... You can just skip it. I think I wouldn't tho, but just because of need of experiencing stuff on my own.\n\n\n[spoiler]Also in the end... Did she want to f*ck the architect? That was a crazy way to end the game. \"I will go with you! I will continue my sis's legacy! You will find family!\" That was really strange. I know the intent wasn't for that but I wouldn't be surprised if we get hibrid kids in some part.[/spoiler]",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "You can't make a Subnautica sequel and focus on land instead of water.\r\nIt's called Subnautica beacause of the water. \r\nThe Shadow Leviathan could have been much better.\r\nI really liked the original Subnautica and even waited for this game but it doesn't feel like 4546b.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Subnautica was such a good game with such good developers that interacted with their community, actively seeking guidance and feedback and trying to make a good game for them. They were striving to make something to be proud of. This game used to be something to be proud of. \nThe creators have now dedicated themselves to being \"AI first\". This means that not only are they firing their staff, they're using stolen assets that ai is being trained on to cut corners and make SLOP instead of games. \nYou saved a couple of bucks but you lost the trust the community had in you. I hope you lose as much money as possible when the AI bubble pops.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Still no vr support? Whats up with that?\nA lot more land than the first game. \nIts fine. I would recommend playing the first one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a standalone game, Below Zero is incredible. Great graphics, great performance, great music, and great gameplay- really, an amazing game... as a standalone. Because Below Zero just doesn't live up to Subnautica. The story isn't compelling (or even interesting, to be honest)- there is no real character development, no grand twist that engages the player- the free feel of exploring a vast ocean world is gone, and linear gameplay replaces it.\n\nIs the game good? Yes. But it just doesn't live up to what it promised. And for that reason, I cannot recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's good by virtue of being a Subnautica game, but fails in every other regard. Completely abandons the environmental storytelling that made the first game stand out. Really, I just didn't care for the reddit alien. Play the original twice instead lol",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wish there was a \"mixed\" review option, but this game isn't great. It's about a 6/10. My main gripe is the level design, it just doesn't work. This game opted for a more enclosed space experience with small biomes and deep winding caves, but they aren't nearly as fun or memorable as the expansive, desolate biomes of the first game. I think the various biomes are visually stunning, but they aren't mechanically a good match for this game. Subnautica was always fun because of the fear of the unknown, being forced to push your comfort zones to get new resources, but this game just feels very same-y. Unfortunate, because it really does a lot of stuff right too! The base building is a direct upgrade from the first game, especially the seatruck dock! LOVE that thing!\r\nOverall, I sort of enjoyed the game, but I cannot recommend someone to buy it. If you do, wait for it to be on sale for $10 or so, then I'd say it's worth a shot. It's a game I would probably not come back to.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything good about the core gameplay loop of Below Zero is either as good in OG Subnautica, or better.\n\nThe only reason I bothered to go back and finish the game (after walking away from it with disappointment over a year ago) was just how close I was to finishing up the storyline (that and the last three achievements bugged me juuuust enough). It sure as HELL isn't worth the £26 ($35 at current exchange rates) that it's currently listed at!\n\nIf you want it, wait for it to come up on a 75% off sale... or go play OG Subnautica and check out the modding community for that one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Comared to Subnautica, this game feels boring, to me.\nIt is way less atmospheric - and even worse, I cannot get warm with it.\nI just keep scanning and diving, without any excitement.\n\nSorry, but I want to give an honest review.\nI hope Subnautica 2 will be more exciting, again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a DLC that's overwhelmingly unfaithful to the original game in many ways. It's only redeeming quality is the production quality on alien designs, fauna and flora. That specific visual matches the original and is wonderful.\n\nThe same cannot be said for everything else. There's considerably less explorable biomes, discoverable aliens. We lost the silent protagonist in favor of a diversity appeal that simply does not belong in any video game, and especially not as a follow up to the world-acclaimed silent protagonist experience that is the original Subnautica game.\n\nIt baffles me, this is so ridicule, so absolutely insane, it's a catastrophe. I'd put my hand to the fire that actual devs in the studio where forced into a toxic positivity environement as to never ever point out the self-sabotage, less they'd lose their jobs after the wonderfully successful first game.\n\nIt is a miracle we got a voice slider in the options, and something tells me it is no accident either. If my guess is right, whoever built that voice slider, Bravo, thank you. But even then, it wasn't enough. There's simply too much elements missing from the first game to meet anyone's expectations, and too many unbelivable garbage added instead.\n\nI played below zero a few years ago and could simply not bring myself to finish it past collecting 2 alien part schematics and meeting the Strong Woman Character. I could only bring myself to play this again after enough time, after years without it, enough to forget the vivid regrets I had from my first experience, and I actually almost instantly abandonned immediately again straight into uninstall right back as the intro cinematic barely ended until I opened the options menu and found the way to mute the voices. Because immersion is king.\n\nThe story, main character, voice logs, all come from an obtuse \"corporate are bad\" and \"toxic work environement and  coworkers\" spiel that could have instead been about exploring an alien world, who knows. There is so much wasted effort in this meaningless crap, it is nauseating.\n\nI play subnautica because I want to feel small as a grain of sand beneath the waves of an alien world, instead, this game lets you play as a diversity monologue that praises itself and wants you to ... well, that's about it, pretty much.\n\nThe amount of content the game offers is an adequate DLC, minus the characters. It is not enough content for a standalone game. It is not worth your money. It could have been a story of how there's frozen caraar left to expunge, it could have been a vastly simpler scenario without alterra meddling and without the terrible surface exploration, in favor of more time underwater, more time socializing with one single character: the robotic voice of your PDA, or perhaps an alien that needs help.\n\nThe production time on the surface level could have been spent on lonely, actual sub-nautica experiences below the surface of the water, which is what absolutely every single player was expecting. It truly hurts my heart that such a profound self-sabotage happened to one of my most favorite games ever.\n\nThe trailers and publisher's bonus loss to scam the devs and other various contexts of the next game are all known and shared amongst enthousiasts and I for one cannot bring myself to be hyped for it whatsoever. It already features that same Modern Audience look again. Dozens of thousands of players are uniformly begging to bring back the silent protagonist. I simply cannot care, cannot pay a single further cent of my money on what already looks like more of the same political The Message-driven self-sabotage, and neither should you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Feels like Copy and Paste of the Original, i loved Subnautica and ive Platinumed it on Ps5 but SBZ feels like the same game with no changes at all and considering what the majority says in terms of map size and variety i think it might be better waiting for Subnautica 2.\n\nI dont get the same feeling of being lost and wanting to know more about the World as i did in the first game, just the routine scanning everything and crafting gadgets",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As someone who loved the original Subnautica, I went into Below Zero with high hopes, but came away pretty disappointed.\r\n\r\nThe magic of the first game just isn’t here. The map feels claustrophobic and way too small, with tight spaces that suck the fun out of exploration. There’s no real sense of wonder or fear like there was in the original’s vast, mysterious ocean.\r\n\r\nThe Seatruck, which replaces both the Seamoth and Cyclops, somehow manages to be worse than both. It's slow, clunky, and awkward to use, especially in cramped biomes. Instead of feeling like a cool modular system, it just becomes a hassle and its faster to just take the seaglide.\r\n\r\nBiomes in general are bland and forgettable. They all sort of blur together, mostly icy caves and shallow zones without much identity. The thrill of discovering strange new environments just isn’t there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The voiced protagonist is cringe and annoying, the silent avatar from the first is so much more immersive. If you are a die hard fan get it, but its not even close to as good as the original. It feels more like an asset flip with some story thrown in.\nIt should have been a DLC, wait for a sale. if you bother at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "loved the original, there was a lot of momentum built up for an amazing follow up, instead of naming it BZ they may as well of  just called it BS. Just a awful game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The deeper you go the more unfinished it feels. There are big areas with a lot of nothing, and many places are a pain to navigate when every plant you run into is like a brick wall. The plot was re-used from many other basic storylines with the details changed and seemed to only be developed as a wild goose chase.  A certain NPC makes a big entrance and then their story cuts short and they just sit around for the rest of the game. Also, I had no use for several vehicles I ended up crafting and got by with the basics just fine. I loved the first Subnautica, this one was a miss for me.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}