{
  "positive": [
    {
      "review": "EVE Online is probably the deepest and most complex game you'll ever play. Very broadly speaking you might enjoy this game if you enjoy any of the following genres:\n\n[list]\n[*]Economy/business/trade games (X4, Offworld Trading Company, Runescape)\n[*]Factory/logistics games (Factorio, Transport Fever, Anno)\n[*]Truck/cargo simulators (Euro Truck Simulator, Star Trucker)\n[*]Space combat/piracy (Elite: Dangerous, Star Citizen)\n[*]Space mining (Elite: Dangerous)\n[*]Empire building/politics (Stellaris, sort of)\n[*]Dystopian space capitalism in general\n[/list]\n\nYes, the game really is this broad. And while it may be a cliché at this point, the only way to really know if EVE is your kind of game is to try it yourself. So if you’re willing to dive on in, let me provide you with some information to make sure you have the best experience.\n\n[h3]Unlimited Free Trial[/h3]\nEVE Online is free-to-play for as much as you want, and will let you try out more than enough activities to see what takes your fancy. The entire map is accessible to you, as well as a very generous selection of spaceships. Take your time, EVE is best enjoyed as a marathon, rather than a sprint.\n\n[h3]Do the Tutorial. No really.[/h3]\nEVE has earned its reputation as one of the hardest games to get to grips with, and there are many different game mechanics to learn. The tutorial will help you understand the core mechanics of the game and gives you some money and new ships along the way. After the introductory tutorial you’ll be given the chance to work for several career agents who’s missions will teach you more about specific activities in the game. Do them all. It will give you some starter capital and valuable information. As the final exam, consider doing The Blood-Stained Stars Epic Arc to wrap up your introduction to New Eden.\n\n[h3]Ask For Help[/h3]\nDid I mention EVE is bloody complicated? You [i]will[/i] have questions. As a new players you will automatically join the Rookie Help channel where you can ask anything you want and get (mostly) useful answers. EVE has a very newbie friendly community, we want to see you succeed, and will do anything in our power to help you out.\n\n[h3]Join a Corporation[/h3]\nEVE is, at its core, a social game. Everything you do interacts with other players in one way or another. Corporations are EVE’s guilds or clans, and joining one is a great way to find friends to fly with. Personally I would recommend all new players join up with EVE University. They are the oldest and best accredited new player corporation in the game and also maintain the game’s unofficial wiki. It is a good place to learn the game and ask questions.\n\n[h3]Hit me up![/h3]\nIf this review has been helpful to you and you’re looking for more help to find your way, feel free to contact me either on Steam or in-game. I’m always happy to help eager newbies find their way in this amazingly unique game.\n\nFly safe!",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Eve online is a fascinating experience. The best way I can describe it is it's kind of like a microcosm of the modern internet experience even though it's ostensibly a game. You deal with the best and worst of it. \n\nYou can forge some real friendships or you could just be a lurker quietly doing their own thing as everything burns in the distance. \nSometimes those friends stab you in the back.\nEvery once in a while, something big happens that might capture your attention and then you'll go back to doing your own thing. \nThere's a market and you can sometimes make some money with it but chances are most of it run by large corporations full of wealth beyond your comprehension that makes more money per second than some people have made their entire lives.\nOutside of the market, the jobs people ask you to do generally pay shit for the amount of work, time and risk you're expected to do. \nSometimes you find a neat little thing that captures your attention and you do that for a bit until you go do the next thing.\nThere's sometimes scammers and they make fake websites to trick you into giving them money. \nThere's sometimes people who try to steal your profile info and sell that for money. \nThere's sometimes huge things that look really big and sound exciting to use but nobody actually cares about it anymore and cost an exorbitant amount of resources to make. \nSometimes people are causing massive destructive sequences that burns through an insane amount of other stuff that people made. \nSometimes people name themselves and their stuff using anime references. \nThere's large organizations that everyone is born into that own massive amounts of territory and seem very large and scary but in reality don't do very much except start conflict between themselves that the regular person rarely finds themselves involved with unless they get actively involved. \nThe game has a player run council full of people that I didn't vote for talking about things that are mostly completely detached to me just trying to do my own thing unless you care about it then you have extremely strong opinions about it. \nSometimes the inside of the place you're visiting gets hacked and gets digitally defaced. \nAnd sometimes the memes people share are actually funny.\n\nAll I can say is there are very few games that are like this one and I'm never sure if I actually enjoy being here but I'm still playing it anyways.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Honestly, it's one of the best games that has ever been made.  Insanely complex, and insanely rewarding.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The learning curve is massive, but worth the grind. Not really sure why people complain about the \"community\" as the community is up to you to decide. It is very easy to find a group (Corp) to play with like minded people. Not to mention many if not most have some sort of new recruit learn the ropes kind of thing. Give it a shot and leave the cesspool of Jita local.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "You'll either have the best time of your life, or the worst time of your life. Or both, probably. First one, then the other. Then repeat. \n\nIt's the single game I have most consistently played for over 15 years. You'll get out of it what you put into it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old game, good gaming company. great soundtrack, love it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Great game, very challenging, but there's always something to do. I would really like to see more character personalization and get a nice cockpit view of the ships. I should also just love this game for what it is, instead of hating it for what it isn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and challenging.... much better with freinds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best MMO's around but not as it once was in its glory years around 2009 to 2013... Its very expencive now days and hard to enjoy pvping when only free account users are taking junk cheap ships because they don't have the skills for something decent and expencive.\n\nBut yeah still was the best game I have ever played even though its a shadow of its former greatness!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bud design game, with a lot to learn, i would say it's a cssino game, dont bait, needs money and pation (a lot),i've spent hours to learn it and understand it, loosing ship  it's not and the best cause u have to buy it game with the ingame money u have (whih not and the easiest, especially higher ships) and alot more negatives, so NO from me.\n\nand yes, it's addictive, be carefull",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love mining in space games. I wish there was more to do miining wise as it's the economic backbone of a corp. I love the stories in EVE online and wish there was more storyline content. Imagine picking a faction and have a mining questchain and worthwhile rewards. I find it the same old mining missions. Gets boring. It's a good game, just open up the RP side with more story immersion. And make the corps play along those lines. Sure you could have rogue corps/pirates but the story is what makes eve I say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended! (Played 200+ hours, from hauler to high-sec heists)\n\nEVE Online devours time like a black hole—its player-driven sandbox turns pixels into empires, where market manipulations spark wars and solo scams rewrite fortunes. The addictiveness grips: One \"quick login\" spirals into fleet ops, corp betrayals, and null-sec sieges that blur days into dawn. Infinite depth in skills, ships, and sovereignty means your legend never ends.\n\nA universe of endless possibility—once you're in, escape velocity is a myth.\n\n10/10 – The MMO that hijacks your life, gloriously.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall very good. Sometimes sends you to fight a group of battleships in your frigate. Certain death. No rating or warning as to how severe the enemies will be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complicated, ruthless, and fascinating. It’s less a game and more a second life — in space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing EVE since 2007 and took a few breaks along the way. Here is my fair and honest review in a chronological order.\r\n\r\nAs I said, I started in 2007 with some IRL friends, we all moved further apart because of work and this game was such a great way for us to connect and have fun online. We were super noobs and didn't know what to do so we created our own Corp and learned by making very expensive mistakes but we got better and it got way more fun once we joined an alliance and moved into Null Sec (0.0 security player owned space).  Unfortunately some of these friends of mine stopped playing and I continued playing with people I met online. It was still great and I learned so much more from them but already I felt like it wasn't as fun anymore.\r\nTLDR: It's very fun playing this game among friends\r\n\r\nI stopped playing around 2009 but came back in 2011 after reading a news article about a big shake up in Null Sec. Only 1/4 of the players I had met online were still playing together, the rest were still active but scattered to other Corp/Alliance. There had been some backstabbing, theft and paranoia had increased significantly. I had to go through an interview and provide my API to prove that I wasn't a spy. The game had changed so much more than I thought at first. I like that the game allows such player betrayal and interaction but it's the players themselves, the greed got too far and killed the fun of this game, it was no longer a game, it was for many players, their whole life's focus. The paranoia had led to some players running 12+ accounts and soloing their own corporation due to not being able to trust anyone\r\nTLDR: Very paranoid community due to in-game mechanics that allow theft and betrayal.\r\n\r\nI continued playing from 2011 to 2014 but much more casually than during my first experience in 2007-2009 with IRL friends.\r\n\r\nAfter quitting in 2014, I did a few brief comebacks in 2018, 2022 and now in 2025.  The average EVE Player owns 3 or 4 accounts so keep that in mind when you see something around 35,000 online. Many players own more than 10 accounts.\r\n\r\nThe new Alpha clone is a good idea to bring new players into the game, it lets you reach 5 mil SP. If you're brand new and want to give it a try, The social aspect is still the most important part of this game, regardless of the paranoia.  In the end, even though the game has lost it's fun for me, I still think it's an incredible game, don't play it solo, you will get so bored. Join a Player Corp, get on Voice and get ready for a steep learning curve but if you're into Sci-Fi and space ships, you'll definitely enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. so much things to do and learn...but you need to much time to learn new skill`s",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Eve Online is a point and click sandbox MMO. The Eve universe is huge and you can fly to strange new worlds, meet interesting people from all over planet Earth and destroy their space ships. The game is very deep and caters to a myriad of play styles. Eve is a 'play to win' game, but you can also make a lot of space money through piracy and other behaviors you probably won't talk about IRL. If that sounds fun and you have a couple 1000 hours a year and some spare cash, Eve is for you. \no7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for doing random stuff while my other games are on maintance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the greatest game you can involve yourself in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best player-driven game you will ever play.\n\nEVE Online sets the benchmark for player interaction in MMOs. The active development team listens to the player base and uses that feedback to make the game better.\n\nIn times where most new MMOs feel like they will just shut down in a year, making all your progress pointless, EVE is the exception. This game, one server, one universe, has been going for over 20 years with many more years to come. That unmatched legacy is what makes its universe so much more compelling—it's a real world where you can truly build your own story and legacy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the most comprehensive games from my experience, you just need to be patient with it, but there is a lot of fun to be had especially in fleets with friends and comms! Best free to play game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game for Microsoft Excel lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EVE Online is an amazing sandbox with huge battles, a real player-driven economy, and endless freedom. The learning curve is steep and the UI can be overwhelming at first, but once it clicks, the game becomes incredibly rewarding. Not beginner-friendly, but absolutely worth diving into if you like complex MMOs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have approaching 6,000 hours in EVE over about 14 years now, and I could go on forever about how much I love this game\r\n\r\nThe best advice I can give for this game is join a corp, get involved, get out of your comfort zone, and remember that the best ship is friendship.\r\n\r\nYes it's a hard game at times, yes it's incredibly unforgiving, no EVE isn't dying (And hasn't been for 20 years), the game has never been better. \r\n\r\nuniverse.eveonline.com/lore is your friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played by decades-long playing psychopaths and scammers, but also some normal and friendly people.\r\nForced PvP and no rules for scams bring out the worst from many people, but also brings out those who are trying to help.\r\n\r\nThere are various ways to play this game, depending on your energy and activeness, from full casual solo or small team high sec flailing to do some missions to participate in large corps , alliances, or factional warfare - all is a different game, just like moving from subcapitals to capitals feels sometimes like a different game.\r\nOverall, this is an mmo from the age where World of Warcraft had pvp servers and world pvp, except here you are losing your stuff, not just some durability.\r\nNormally that would also mean that people are reluctant to shoot you, but there are guys sitting over trillions of isk, and they are just laughing if they lose billions, and credit card warriors ganking one ship with five to ten accounts - that multiboxing is the bane of the game, as it doesn't really force you to team up with people, just team up with your credit card, if you want to do something that needs a fleet, which decreases player interaction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gave it a fair try and found it to be a very time consuming game that requires a lot of dedication. Personally, I did not find it rewarding or engaging. Could be a recommend if you love and live for Space MMORPGs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All Right noobs and shits listen up. Ur corp boss is watching so dont use any words etc etc. Kidding as always. TLDR\r\n+ Awesome community, never found before. I was playing WoW and i will  never feel same before. If you got Social Anxciety or hows that fk called, this game is for your +10 points\r\n+ Mining in this game is fk awesome. Earning Skills and ISK by watching @grubby on YT? GO AHEAD\r\n+ Exploration, word only used in this game maybe, i dont care, never had option to play as fc colombus in any game so die/enjoy 10/10\r\n+ WELL PVE is hardcup..... i cant eat that shit. I just preffer moon boyz eating rockz all the day wich is fc necessary for eco.\r\n+ U will realize that 14 years spent on World of Warcraft i mean any version Classic/Anni or retail, you will regret u time spent in blizzard ecosystem CUZ your time is not wasted in EVE\r\n- TIME TIME TIME, skill training and ISK earning are tyied together so you will not get ahead. OFC You can spent money but player comm is mostly of old wooly mammoths who started playing in 2008.\r\n- Again SP, you will get alot of free SP, i mean really tons of that. Kinda called catch up BUT \r\n+-+-+-+ YOU WILL NEVER LOOSE YOU TIME AGAIN (RUNESCAPE). \r\n\r\n------------------------------\r\n\r\nI am hard wow player but this game got my eyes open. Fly Safe O7 guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a game I would recommend everyone try because it might just be what you're looking for. There's so many activities you can do, you could do something new every day and still not have done all the things in a year. It's one of if not the only true sandbox mmo experience you'll ever get to enjoy. So get it while it lasts, you never know when it'll be gone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its been out for 20+ years for a reason, there is just nothing like it on the market. Its not for every one but its free to try out and plenty of video's going over it so give it a try.\r\n\r\nIt is a true sandbox where you can try to do what ever you want, just know that the skill system is time gated so \"catching up\" with the very old accounts is not something you should expect. Focusing on 1 or 2 area's will help get you there, but dont expect to be a master of all things.\r\n\r\nThere is some pay to \"win\" but its a social MMO, it balances out well since most of the folks who try that route are just feeding losses into failed PvP. \r\n\r\nFine people, fly together, have fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing for over 22 years and still love the game.  Game still offers lots of different content for different play styles.  It has a large learning curve so don't expect to understand the whole game in a few days of playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, even after all these years. Still is a bit of a spreadsheet game though. Definitely more fun with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still one of the greatest games of all times. Loving the Catalyst expansion and all the improvements made to the new player experience that even help returning players get back into the game. Controls aren't always intuitive and haven't been updated much in the last 20+ years. I can forgive that since much of the game that I loved 20 years ago has remained the same instead of being massively flipped onto its head and ruined like some other titles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game has been improved soo much since it first launched, alot of guidance and activities to get you started!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This will be honest review of an Alpha player.\r\n \r\nI've tried getting into the game 2-3 times thru out the years and always liked it, but my friends always dragged me to something else. Playing MMOs for more than 20 years.\r\n\r\nHowever, I've been playing EVE (Everything vs Everything) actively the last month and having a blast.\r\n\r\n*I'm an Alpha - I have access to so many stuff that I still don't see the need of Omega anytime soon.\r\n*I'm explorer - I fly Heron (small and fast ship), exploring and hacking sites without any gunnery.\r\n*I've met people everywhere doing everything. \r\n*There are schemes, tactics, backstabbing, politics, invasions, wars, crime, gambling and so on...\r\n\r\n\r\nThe space is vast, systems have different Suns and Moons, pirates are waiting in an ambush.\r\nIt's a hardcore game and I love it.\r\nWhen they destroy your ship - it's gone for good. \r\n\r\nThere are many ships. MANY!\r\nVery different from each other with complementary of its own playstyle, like:\r\n\r\nSharpshooter - long range rocket launcher \r\nBrawler - close combat with high speed turrets\r\nDJ - you can use all the different colored lasers\r\nBomber - create a labyrinths of mines and bombs\r\nTackler - hold them in place with nets, prevent them from warping\r\nVampire - drink their power, leave them useless\r\nMedic - provide support by giving shield to frontlines \r\n\r\nand many more. THOSE roles are made up by me, not actual in game terms.\r\n\r\nEconomy is player driven, tons of helping people, tons of content for new bros.\r\nEverything YOU buy is either crafted or gathered by another player. Each ship you fly, someone made it in their hangar. \r\nEverything YOU find can be sold, salvaged, used in some way. \r\n\r\nAnd this is from a guy with less than month flying around my yellow duck Heron, playing few hours a day.\r\n\r\no7   Good luck and fly safe, but remember - YOU ARE NEVER ALONE IN EVE!   o7",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eve online is one of the most engaging MMOs I've played since the late 2000s. This game has come so far in so many years. The game looks fantastic and continues to develop its engine to keep it modernized and the so many people are long time players who continue to play this player driven game. This game has the most sophisticated ecosystem and economy to date. No other game truly even comes close to the complexity of everything being made by a player. From basic ore refining to massive dreadnaughts. Everything is made by a player. \n\nThe complexities of this game at a social level are insane. Massive corporations forming, claiming and protecting their own areas of space. Have massive wars against each other or form up together to make massive alliances all of which have their own internal politics and laws/rules. \n\nIf you are looking for a proper space pvp/pve game fully driven by it’s player made economy this is it. No other game even comes close to this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am successfully addicted to this game, so much so that I am going to attend fanfest in Iceland next year. Yeah, this is a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its been a while, still stuff to do, but missing the story rich it used to be, its loosing its soul",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may be complex and time consuming but damn if it isnt a fun challenge. An open world with great complexity and some plans take years to unfold. Great communite and you meet some interesting people in the vastness of space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for PvPers and space nerds, find your niche and enjoy, and remember only fly what you can afford to lose, o7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore my limited hours here on Steam - I play using the EvE Client instead (recommended for performance)\n\nI first started in EvE in 2005, then took breaks and stopped altogether in 2015\n\nI have now returned to New Eden 10 years later... and the changes are immense, yet still simple enough for NEW players to grasp.  \n\nThe majority of negativity from players is that the game essentially requires a monthly subscription, yet I find it more of a blessing.  I've played plenty of MMOs where the free to play or less expensive subscription options allow more of the immature players in, so the subscription acts as a gatekeeper so to speak.\n\nYes, PvP is real and can occur in ANY part of the Universe but it is so rare in HiSec (High Security space) that players really don't benefit due to the increased penalties assessed... until they and their ships are destroyed as well.  The biggest complainers are the people who let emotion get the best of them, so don't react like a child... rather plan and conquer your part of the universe like an adult instead.\n\nCCP also provides all sorts of opportunity for you to see if the game is relevant for your tastes with its Alpha option prior to subscribing with the Omega option.  Not only that, but they also offer discounts and promotions all the time.\n\nIf you are interested in checking it out, you don't have really anything to lose as you can play for quite some time without spending any RL money.  ALSO, if you are smart enough, you can actually make enough in game ISK to pay for your subscription WITHOUT spending RL money ;)\n\nIf you decide to check it out as a New or Returning player, feel free to say hello and ask me about the extra 1 Million Skill Points you can get (even for FREE accounts)\n\n- Oroak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- Копаете руду с корпой\r\n- Нападают пираты и просят 500млн чтобы оставить в живых\r\n- Платите\r\n- Всех убивают\r\nВЫ НАХОДИТЕСЬ ЗДЕСЬ\r\n- Копаете руду с корпой\r\n...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game keeps people coming back.\nMany distinct activities to do, always with PvP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games that eat your soul... this is the one. Combining all possible elements of game play is what this game is all about. No one day will ever (if you choose) the Galaxy is yours for the taking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chips and Milk seriously need to start playing this game.\r\n\r\nEveryone seriously need to get back into Eve.\r\n\r\nIf I get COVID again, I will travel the country infecting every person that I can just so that we can have another lockdown and thus more time to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been inlove with this game For many years now! Try it and deep dive into it! and would love to help!! ne update has been great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EVE Online is probably the most complex game you will ever play. Its not for everybody. Find you self corporation that is friendly to new people and learn from your corporation mates. \n\nWithin game you will find a tons of opportunities what you can do. \n\nEconomy/business/trade\nResearch - inventing blueprints\nBuild - Make good use of Blueprints and build stuff you can fit or sell \nLogistics - transport stuff across galaxy \nSpace combat - combat vs NPCs or People \nSpace mining - Mine ore from asteroid belts and reprocess in to materials needed for building stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game.....your not ready for it!    Just kidding.  If you want to hate this game play all alone, do everything yourself,  be selfish and you will quit in a week or less. This game is about finding the right corp that will train you correctly give you ships to practice in that are not yours so you can blow up other players loan ships not yours. And follow their instructions, their advice, their methods until you have them down perfect. OR you can make 10,000 mistakes that they have already tried and failed and quit because your getting worse not better. The corps will give you Money if or when you need it because they have billions just laying around, they will give you ships that work really well. Not the crap that you try to make. The only down side that I must tell you about is the training that goes on in the background automatically even when your not playing the game, your training in a chosen area like missiles. The background training takes (real time weeks), to control how many different skills you master at one time, If you want to be a master of all, it will take you more than a year and there is no way to speed that up. SO I hope that helps \"Fly Dangerous\" Newbs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EVE Online is one of the most unique MMORPGs ever created, and Goonswarm Federation stands out as one of its most influential alliances, offering players a thrilling mix of strategy, camaraderie, and large-scale space warfare.\n\n🌌 EVE Online: A Universe Like No Other\n- Sandbox Freedom: Unlike most MMOs, EVE Online doesn’t lock you into a single path. You can be a miner, trader, pirate, mercenary, or fleet commander. The game’s sandbox design means your choices genuinely shape the galaxy.\n- Epic Scale: With over 7,200 star systems to explore, battles can involve thousands of players at once. These wars are not scripted events but player-driven conflicts that make headlines in the gaming world.\n- Community & Social Depth: Success in EVE isn’t just about grinding levels—it’s about building alliances, trust, and strategy. Many players highlight the long-term engagement and social bonds as the most rewarding aspects.\n- Positive Reception: On Steam, EVE Online holds a “Mostly Positive” rating from tens of thousands of reviews, with players praising its depth and uniqueness. Critics often call it the best true sandbox MMO ever made.\n\n🛡️ Goonswarm Federation: Legends of Nullsec\n- Massive Influence: Goonswarm is one of the largest and most iconic alliances in EVE Online, known for shaping the political and military landscape of New Eden.\n- Welcoming to New Players: Many newcomers report that joining Goonswarm provides structure, mentorship, and access to resources that make the steep learning curve of EVE much more manageable.\n- Rich History: From legendary wars to strategic relocations (such as their move from Delve to Tenerifis), Goonswarm has consistently demonstrated tactical mastery and resilience.\n- Community Spirit: Players often describe Goonswarm as a place where you can find camaraderie, humor, and shared purpose. Being part of BROTY (a Goonswarm corporation) is seen as a gateway to experiencing the best of EVE’s alliance life.\n\n⭐ Final Thoughts\nEVE Online rewards patience and ambition with one of the richest gaming experiences available. Goonswarm Federation exemplifies the best of what the game has to offer: epic battles, strong community bonds, and a lasting impact on the galaxy’s history. Together, they create a gaming experience that is both challenging and unforgettable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game since January 1, 2006. It remains engaging, but it's incredibly deep and complex. It requires significant patience and strategic thinking, almost an engineering mindset, for long-term play over several years. This isn't a casual game for everyone. Fly safe!\nPS: Test out Alpha for free. If you like it commit longterm to save money on the monthly subscription.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can play the game lots of different ways.  Graphics are lovely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you remember playing with construction blocks with other kids? When you spent a lot of time with a friend building a big castle? When the other kid smashed your tower? When you anticipated the inevitable collapse while you tried to balance every single block?\n\nEve is like that, but with spaceships. It stirs a lot of emotions inside you. It's a lot of fun, and more when you find a good corp.\n\nDo not be tricked : resource gathering activities are not the goal. They are a means to build your kingdom. Everyone could be building an ever bigger kingdom together, a glorious space odyssey. But someone comes and topples what you built : the kingdom shatters, splinters into factions.\n\nOf course everyone knows, deep inside, that it would end up this way. Scarcity coupled with boredom will do that to you. You'll eventually come to peace with the struggle, and come to appreciate what makes this game truly unique : watching things crumble together, cheer on the good fight, and build again with a vengence.\n\nThe vast majority of people in Eve want everybody to have a good time, and will care about you even though they just blew up your ship. You just need to learn into making that more... consensual? Idk the game does have the tendency to stimulate your inner psychopath, you just need to kinda lean on that.\n\nFinally Eve is pretty upfront about the business model : you try for free, and you pay for full content. Don't make the game into your second job. You can put in money for in game currency: be responsible, make a concious choice and don't fly what you are not willing to lose.\n\nAll in all, 9/10 would kill a keepstar with 1500 other people again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hugely deep and interesting gameplay. It does take some effort to break through the initial complexity but its worth it. Once you break through (which doesn't take too long) the depth and opportunity are unmatched.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best spaceship game.  Beautiful, great combat, great crafting, great politics ... unfortunately PvP-centric, it would be up there with WoW and FFIXV if they hadn't fixated on that part.  Still 100% worth, always re-sub again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EVE Online is an absolutely incredible experience for anyone who loves deep, strategic gameplay and true player freedom. The game’s vast universe feels alive, with an economy fully driven by the players, massive space battles that can involve thousands of ships, and intricate political alliances that rival real-world diplomacy. It’s not just a game—it’s a living, breathing galaxy where every choice matters and every success feels truly earned.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in  myearly 20's something back from 2006 to 2011.  I never joined a corp or had anyone really show me what I didn't know about this game.   I didn't know a lot.  There is so much depth to this sandbox, and they've added so much more content that BUILDS on itself instead of making other content outdated.\r\n\r\nFind yourself a learning corp like Eve University (they're the ones that make the wiki for eve), or any other big corp/alliance that offers newbro friendly training and learn what this game is about over a few months.\r\n\r\nYou'll play this for years and daily/weekly there will still be things you didn't know in this game.   It's FUN.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a very imersive game, you need a lot of time, but you can do amazing things. biggest issue is the learning cliff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a deep space 3rd person simulator with thousands of online players and it's own economy created by players. Be prepared to die though.\r\nA unique and fascinating experience for me since 2009",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A universe that truly feels alive and shaped by its players. The freedom to be an explorer, industrialist, or legendary fleet commander is unparalleled. An epic, player-driven saga",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely hard to find your groove, and its certainly not for everyone... but it could be! It has to be a game you want to play for years.... This isn't a start a character and I'm immediately immersed. I will find my way... I could easily classify this as one of the Greatest Games All Time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think I'm starting to get the hang of it. It's been pretty fun so far. I'll let you know when I get to the end game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eve is fun and engaging. Lots of challenges for all player types.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit steep learning curve, but once you learn a bit... way too good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PROS:\n-appealing space aesthetics\n-dynamic in-game economy. Almost all items are made by players and prices are determined through free market\n-balanced but non-forgiving PvP\n-choice matters. cooperation matters most\n\nCONS:\n-in-game tasks might enter your real life weekly schedule. Try to keep it casual\n-many mechanics in-game are specifically designed to be time-consuming. Even traveling from point A to point B has no good hands off implementation.\n\nAlso:\nSteam client usually does not provide cheapest options for subscription and user packs, consider non-Steam version first. However Steam's Proton is great option if you use Linux",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "20 years later and im still plinking rats.\n\n10/10 Ship painter simulator for all the ISK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can buy sell, build, level up skills, best space mmo around that is still kicking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is easier than before but add more languages too (persian language) please\r\nthanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played *way* more hours than what Steam thinks, I switched to Linux in 2016 and haven't looked back. Sooo mannnnyy Houourrrrrs. \r\n\r\nAvoid the Mercenary Dens, they will suck the life from you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Big and empty and no one can here you scream",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good. game very friendly players. never get ganked.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "THE GIFT THAT KEEPS ON GIVING!!!! IT DRAGS ME IN AND OUT EVERY FEW MONTHS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A brutal yet amazing full loot pvp game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok its better with people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game on and off for around 10 years now, would highly recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been  playing for over 15 years. Still a good game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game, tons to do, beware fo gankers :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the only game of its kind. If you like space games, this is a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best space MMO, so much to do you never get bored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gosh what can I say.. it's EVE! You have to try it at least once!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Space and sandbox - what could go wrong?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but  steeeeeeep learning curve",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "have played for nearly 20 years and still love the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nerdy, but amazing! Get into it. It's worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world, many options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "High risks, high losses, high fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "best CCP game so far",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best game ever...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shooting rocks (and fellow players) never grows old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It will suck the shit out of your soul, time and your wallet if you are dumb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of unwarranted violence",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than reality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like working a second job. love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think I finished the tutorial...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gud game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im addicted please send HELP! I haven't sen my kids in months!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is an awesome game, highly recommend this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BON, J'attend de voir le futur du jeu.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun if you have friends or play it smart",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Gave it a good college try. Spent over 150+ hours playing. Doing my best to learn. Taking things slow but by god this game is horrible for new players and even worse for new players trying to get into more advanced parts of the game. There is no good website or wiki that can give you straight answers to any questions you might have and any that they do are a roll of the dice as there has been so many changes that they may not apply anymore. You have to hope that years ago someone on reddit asked the same thing and got a usable answer.\n\nAll of this would be fine to deal with as you could take it easy and just learn as you go. Sadly the community is filled with people who have decided that they want to make your experience with the game much worse. Looking to build, mine, or explore anything slightly past the beginner stuff will put you in the firing line of pirate players and PVP. Even if you want nothing to do with that experience it is thrust upon you by their whims. Putting back hours of work and serenity for a moment of being stuck in place until they finish gunning you down. Followed by them shooting your escape pod for kicks and giggles. These basement dwelling bastards just make things worse.\n\nBefore anyone starts pointing out the many ways to avoid or escape from these wastes of space pirates. I no longer care. If the only way to learn these sorts of things is to have them pointed out in the comments of a negative review, then it is bad design and an even worse community. One I won't be part of anymore.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Most hilarious ad I saw about this game said like \"BUY THIS SPECIAL PACK AND YOU CAN SKIP 4 WEEKS OF TRAINING AND JUMP RIGHT IN THE ACTION\"\n\nMaybe it's just me but a game that normally takes 4 weeks to get into the action is not really a well designed game",
      "voted_up": false,
      "votes_helpful": 130
    },
    {
      "review": "Don’t really like the community.  This game doesn’t reward your time.  Well, it can, but the community makes sure it doesn’t.  Everything takes a long time to do, but stealing/ganking is easy and fast.  Y’all have fun",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "TL;DR - Kind of a mixed bag.\n\nIt's not a terrible game but the devs are constantly trying to force combat PVP onto players that want no part of it. Most game mechanics are geared toward this and it gets very tiresome very fast. It's like it's their only goal and any expansions or new features almost completely ignore players that aren't mouth-frothing psychopaths.\n\nThe latest Catalyst expansion is a good example. Sure it added some stuff and made some changes to mining that were sorely needed across the entire game but the really interesting stuff is locked behind PVP (as always). The mining changes that didn't involve trying to force PVP on everyone only highlighted the fact that asteroids are FAR TOO SMALL for serious miners. \"Let's make mining better but give them nothing to mine! HAHA NERDS!\" - CCP\nIt's like you can't facepalm hard enough...\n\nI've met some really awesome people in the game and made good friends over the years, but I've also witnessed the worst of humanity in it as well. Seriously, if some of these people aren't on government watch lists or literally playing from supermax prison I'd be very surprised. \n\nSomething is very broken in the human genome (clearly) and this game attracts it like fat kids to cupcakes. I guess my biggest problem with it is that the devs actively support and encourage it. It's kind of sad to see such wasted potential.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I have absolutely no idea why this game still exists or why anyone is still playing it. It’s one of the biggest scams ever created. “FREE”? Yeah, free to install. That’s it. The rest is a bottomless pit.\n\nI won’t even start with the industry behind this thing — the money people dump into “China farming” or PLEX is unbelievable. How can people be this blind and this dumb? Every so-called “patch” or “event” gets hyped like it’s revolutionary, yet nothing ever changes. It’s the same old mess, repackaged again and again.\n\nI deleted it from my Steam library. I tried every possible option to hide, block, or get rid of it. But no — this relic keeps crawling back into visibility like a bad infection.\n\nCCP, for the sake of humanity, shut down your servers. The game could have been great, but with its broken mechanics and the absurd need to buy Omega, it has become one of the worst scams in gaming. Seriously. Wake up.\n\nI can’t even say what I really think about the game and CCP, because it wouldn’t fit any rules or guidelines, not even remotely. So I’ll leave it at this: end the misery, free the poor souls trapped in that universe, and for anyone thinking about “trying it because it’s free” — please don’t. Do literally anything else with your time. Spend it with your family. Take a bath. Stare at a wall. Anything is better than this.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "its a very cool game, but it is a very serious time investment if you want to get good at it\nthe game is also free *to play*, it can be considered pay to win since most ships, skills, and some of the most important features are locked behind a subscription\n\nthis isnt to say i didnt like the game, i liked it, but i do not suggest you get into it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "EVE is more interesting to read about than to actually play.\nPower bloc clashes and battles involving thousands of pilots sound epic. I came to the game for the beautiful ships and space scenery, expecting an incredible adventure. But all the magic fades away right after completing the tutorial missions.\n\nFor decades, EVE has suffered from long-standing issues that seriously affect the player base. The support is unfriendly, and there’s no meaningful mid-game content. The core game design combines two incompatible things: grind and roaming. Whether you want PvE or PvP, you often have to roam endlessly. In the end, you spend far more hours searching and waiting than actually playing. The loot is inconsistent, and it’s easy to waste several hours grinding for a trivial reward.\n\nThe game gives massive PvP advantages to older accounts. Veterans know a thousand ways to destroy a new player. Newcomers in weak ships are killed “for fun” by pilots flying T2 or T3 ships through multiple accounts. They brag about their kill counts. It quickly becomes clear that new players are just prey — farmed by veterans. At that point, you realize what the developers’ design truly is, and it’s easy to decide your time deserves a better experience elsewhere.\n\nThe dev team completely lacks the courage to evolve the game. Everything is built around keeping EVE frozen in its broken state while a small core of loyal players keeps paying. Even multiboxing has been integrated into the monetization system.\n\nImagine looking for fair, exciting PvP — and your opponent simply switches to a second window with a stronger ship to finish you off once his first one tackles you. Where’s the fun in that? Gang-style PvP offers no thrill — only wasted time and a lost ship.\n\nLarge-scale battles with thousands of pilots cause massive time dilation. Ships pile up, and the server runs at the speed of 2 FPS per minute — pure disappointment.\n\nCCP keeps developing new games instead of fixing EVE. Yet all it would take to revive EVE is the courage to address its core problems.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This might run worse than Helldivers 2 and that is saying something considering how bad Helldivers 2 runs. The launcher even decides to lag half of the time in this game it is insane.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "20 eur paywall if u want to make actual progress in the game with the option of grinding for hundreds of hours to work around that paywall is just inexcusably bad game design in my eyes that undercuts all the deep mechanics that u basically only get a preview of without paying",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Advertized as free to play but good luck with that. The most limited free to play MMO out there with sub-fee that is more expensive than most popular MMO's that actually have a player base.\n\nForced PvP...",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I played this game for many years, went as far as constructing and maintaining a wormhole base with a small group of friends.\nuntil one day I was heading back from low sec after checking on some original blueprints I was upgrading.\nas I landed on the gate to jump to high sec space, Dead. Shuttle and Pod gone in an instant, no lock on, no time to jump, just dead.\nafter reading the kill mail, it seems I was killed by a smart bomb that was blown on the gate as I landed, no chance to do anything about it or have any clue that it was coming.\nI lost over 1 billion isk worth of implants on my character and will most likely never return to the game now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Biggest scam ever / you work for a week and all you get is players that have been here for years blowing up every ship you have , mostly when your doing nothing but mining . the game is setup do do nothing more them suck money out of new player s so they stand a chance to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Way too much stuff is locked behind an expensive monthly subscription. This game is just a huge money grab. Save your money and go play a game that doesn't try to clean out your wallet.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is boring and not worth the effort of learning how it plays",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Много лет назад это была невероятная игра. С одной стороны - Solid Sci-Fi, уникальный сеттинг, море возможностей и восторг открытий. Даже когда рутина и проблемы накрывали с головой - всё равно хотелось разобраться и превозмочь. С другой - та самая Свобода среди звезд, о которой грезили многие из нас, кто вырос на научной фантастике во всех её проявлениях. Но время шло.\n Контент быстро иссяк. Даже для самых ленивых порог восхождения не превышал полугода. Достичь ощутимых высот имея мозги было относительно несложно, но количество иссушающей рутины повышалось с каждым новым шагом. Разработчики решили бороться с этим упрощением геймплея. Первый гвоздь в гроб, так сказать. С другой стороны копилось разочарование. Свобода быстро обернулась вседозволенностью, которую тщательно оберегали и продвигали разработчики с тем умыслом, что любой движ идет на благо. Лишь бы наводили суету и жгли валюту. Игру затопил скам. Где нет правил, там рай для отморозков всех мастей. И если по началу это происходило изредка как неформальный перфоманс, то потом вошло в норму. Игра потеряла вменяемую аудиторию и выродилась в откровенный токсичный ширпотреб со скучающими гопниками. Постгуманизм смыло потоками злобного быдла, которому доступность их дегенеративного стиля игры была только на руку. Sic!\n Сейчас это медленно угасающая помойка, которая бьется в судорогах цветастых аддонов чтобы хоть как-то отсрочить свой неизбежный конец. Это уже не та Ева, о которой говорили с придыханием. Просто бледная пародия. Собственно туда ей и дорога.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was such a unique and interesting game until pearl abyss bought CCP and ran it into the ground.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not recommend. I used to play this game so many years ago and ready to try with old account and its completely broken and unable to play. Imagine that! So I had to create a new account, fresh start, and guess what... No appeal. The soul of this game is gone. \n\nAfter reading the reviews around here, it confirmed my suspicious. 100% seconded to all. It's better off to enjoy solo game without worry about your wallet slowly draining because of secret paywalls to move forward. This idea of paywall is getting old and depresssing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Paid money for this junk thinking it would work on my regular eve account from 2006 - WRONG. Waste of money, no refunds offered. Screw that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Omega costs around R$98 to R$107 per month for Brazilian players. That’s wild when a brand-new AAA game costs around R$200 to R$300. The value just doesn’t match the price.\n\nYou’re paying for “full access,” but it’s hard to feel the benefit when the subscription is almost half the price of an entire newly released game. For a hardcore space sandbox, that ends up being a huge barrier to entry, especially when so many other games respect regional pricing.\n\nGreat universe, great concepts, but the monthly cost makes it hard to recommend.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pretty deep and complex game managed and developed by one of the greediest and incompetent game development companies on earth.\n\nBeyond the very basics, this game requires multiple accounts that all need to be subscribed in order to be competitive.\n\nIt's one of the most pay to win games in existence. Buying real money currency from them can be used to buy better ships, skill points, etc. The more money you spend, the more powerful you get. Sky is the limit, really.\n\nContent is designed to cater to those who fly multiple accounts only. Most of the game is really designed around PVP, PVE content is ocean-wide but puddle-deep. There's next to no complexity in PVE, and PVE is only there to finance PVP. Most of the high-end PVE content is extremely restricted as it requires significant time investment and membership in the groups that would allow you to take advantage of it, which are limited at best. Yes, you read that right, in order to participate in some of the content in this game, you have to be a member of groups that control access to that content. If you're not one of them, enjoy the scraps you get in \"high-security space.\"\n\nThis game's general approach to player experience is \"if game mechanics allow it, it's fair game.\" On its surface it's a good proposition, but when you get down to it, this is a game run by griefers, gankers and scammers. You can get lied to and stolen from, scammed using anything from your naivete, to poorly designed ui and game mechanics, and the dev will do NOTHING. You're on your own.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a PvP space simulator, not a game. To do anything you'll need to do your own research about everything involved in such activity before another player or something that you didn't read about comes and kills you, which means you loose your ship and everything in it. And there is a lot to do, which means you'll have to learn it all before trying it. If you want a frustrating part time job that costs you money, Eve is it. Duck this simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its more toxic the some fps games. Multibox players keeps the game up and they make even the high sec (safer) zones unplayable. going somewhere is bloody imposible without getting fcked",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; Don't play for free, don't pay to win.  You will enjoy this game for a while, but your time will be better spent on other games.  You will never be able to compete with existing 10-20 year existing veterans.\n\nAs a free to play game it is terrible.  Playing for free is very limited.  Ships, skills, items and any way to make money is very limited for free accounts.  Also, it is a very expensive game to subscribe to, a base monthly sub of 20 dollars is quite a lot for an experience that is very bare bones and very player driven.\n\nThe 'safe' zone of high-sec is very NOT safe.  Veteran players who have literal decades of time training skills in the game (skills that give significant bonuses to ship performance) are able to pick off new and inexperience players while ignoring the NPC 'police' that are supposed to be keeping high-sec safe.\n\nI would say this is a good game, but only for those who have already played it for 10+ years.  \n\nI would suggest CCP spend less on advertising (seemingly to lure endless noobs for veterans to farm) and remove the pay to win real money -> PLEX -> in game currency.  They also need to crack down on people using multiple accounts, and multiple characters (multi-boxing) but they wont because it makes them more money.  You can run multiple instances of EVE if you are using omega characters.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Toxic community with a terrible, money hungry developer. This game will never get another penny from me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I tried, I honestly did. I read ALL the blogs, I haunted the EvE-O forums for better than ten years. (Christ what is wrong with me.)\n\nFor a month, I tried to engage with people. I joined chat channels, I flew to Null-Sec. (I even flew to Fountain in just my pod before I got exploded. That was a bit amusing.)\n\nI couldnt get the community to interact with me. The supposed \"new bro\" helping community does not exist. Oh, theyll go on and on about  it, but this is a killing people game. No one will talk to you or trust you, because the game and community have incentivized mistrust and ganking. Why WOULD they trust me enough to engage with me?\n\nHowever the stage was set, that's how it was. I couldnt get people to talk to me, to teach me, to respond to my congratulations on their silent execution of my pod wheresoever I died.\n\nSilent, incestous, sullen community sinks onto the sandbar, while complaining about it.\n\nYou guys enjoy yourselves, I guess.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "to scary to big and confusing for me but anyone who gets this game should get a standing ovation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i played for 10 minutes just to see why people would play this.\n\na lack of self would be my first guess.\n\ni love launcher games making it look like you have more time than you actually have. epic strat mk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Y'all are out of your mind charging $30 AUD a month for Omega. Keep in mind EVE is built around multi-boxing & now you have to pay for three-four lots of $30 every month! Good luck running one character. Most corps you join will be 3-4 real people and the rest are just their other characters. Getting ganged by a group of 3-4? Multi-boxers. I am hitting my spine.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "from what I can gather after 2 hours of playing, it's kinda 3d browser game with ramped up graphics... nice, but almost anything is better. X3, Elite, you name it...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It’s like if Stellaris had a baby with War Thunder. The combat isn’t great, if it was something more where you aim yourself I think it could cook. It just feels like I’m playing Stellaris but like inside the ship.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Worst Game I have ever played period, no advice nothing makes sense, UI screen is like someone threw up on my screen, O and when your ship is destroyed I hope your psykick as well well no advice what to do next, word of advice keep free to play and no wonder no one plays this could be great but lazy fuckers",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you're a sociopath with a flair for sato masochism then this is your game!  I have been playing EVE off an on for over two decades now.  Recently I have retired from playing because the devs just want ships to go boom.  The bottom line of this game and the underlying economy within rely on ships being blow up and replaced.  This is all well and good if you are in a mega corp in a corp controlled area of space where resources are mined and processed.  But if you have played EVE long enough you know that you can trust no one because every other player is looking for a come up however they can.  So after learning this and trying to play solo for the last few years i find the game broken and bent to the will of all of the large corporations.\n\nFavoring large corps over the individual is a byproduct of CCP's business model. This happens because the devs want to keep the large corps happy because they represent the largest portion of the player base.  There is no room in this game anymore for the individual, only giant corps.  If people need in game currency to replace their ship that was just blown up they can buy it rather than grind the game to earn ISK.  I have seen a constant push from CCP to limit what the individual can procure by themselves for a more corporation centered play style.  This leaves casual players out in the cold.  These days you cant even mine in Hi-Sec because fleets are so starved for anything fun to do that they attack mining and shipping vessles as a crutch for engaging, intriguing battles where others fight back.  The devs have facilitated this by making conditions more favorable to attackers rather than defenders even in Hi sec space.  At the end of the day they have made it more expensive to replace ships and modules (artificial scarcity) and limited the amount a miner or ship/module builder can make (market manipulation).  Thus the miner or builder must buy ISK as a replacement for actual in game earnings because his means to ends is destroyed either by other players (actual ship destruction) or his goods are vastly deflated in value (economic manipulation caused by CCP pulling strings, usually in the form of updates).\n\nPretty much all updates over the past 15 years have been newly introduced content centered around building higher tier items which command the highest prices on the market.  The issue?  Only large corporations are able to control the areas of space where these items can be found.  Thus handing even more power to these already elitist entities.  \n\nBeyond that, things that solo players are able to do are a waste of time now.  The systems that were set up for initial players and solo players were added to the game so long ago that the rewards for doing these tasks/missions no longer match the risk to reward ratio.\n\nWant to run a mission for 90,000 ISK? Sure, all you will need is a 3,750,000 ISK ship to do it in!\n   \nSolo Mining low level asteroids?  CCP nerfed the amount and concentration of minerals you are able to harvest in secure space.  CCP has also encouraged fleets to kill mining vessels in hi sec with no reperocussions (other than a T1 destroyer, destroyed and replaced by a SRP out of a corp hanger).  In my opinion if a character has killed in hi sec and their victim was not a legitimate war/faction target then security forces should kill on site in hi sec for the rest of time.  This would curtail the curb stomping of Bambis who are just learning the game.    \n\nBuilding modules?  CCP altered the distribution of higher tier constituent ingredients to space that is only accessible by, you guessed it, large corporations.  CCP locked reactions (Ingredients for T2 and T3 technologies) to low/null security space.  Making it so a solo player cannot create anything of actual value like T2/T3  ships or modules without buying astronomically priced ingredients and losing all profit margins to, you guessed it again, large corporations.\n\nFlying solo missions, Fetch, fight?  The missions have been around since basically the inception of EVE online.  I'm probably wrong but from what I have seen the developers of the game have never re-balanced rewards from solo missions.  The rewards you are able to get from grinding lvl 3 and 4 combat missions is abysmal.  The market has had issues, like a real economy does, which has led to inflation if ISK throughout New Eden over the years.  The rewards from mission givers and bounties from NPC rats has not kept up with inflationary trends by any means.  This is a deep topic as the missions were put into the game before the newer high end modules and ships.  I could speak on this more but for brevity's sake just know missions have not been updated in over a decade unless you are talking mission in low sec and null space, again handing more ISK and power to Corps.\n\nI give this game a 5/10 in its current state.  Awesome concept but has become somewhat of a trainwreck for new players IMHO.  I feel like the downfall of EVE is that they only cater to Corps and have left the individual behind.  Couple that with the fact that the price for OMEGA has doubled in the last 10 years for no additional content and there's really no place for me in the game anymore. \n\n-Some Rando w/ 73,000,000 SP",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "[h1] Not the Sandbox You’re Promised [/h1]\n\nEVE Online looks incredible and sounds deep, but it’s not the open-ended universe the trailers suggest.\n\nYou won’t forge your destiny, you’ll instead maintain someone else’s empire.\n\nThe economy is run by entrenched alliances operating like corporations. Miners, haulers, and industrialists grind to feed those machines, not to build for themselves. Exploration is mostly risk management.\n\nFaction Warfare is the closest thing left to purpose: small-scale empire combat where you can actually see territory change. But even that serves a static narrative as the empires never win or lose, the war just resets to keep you occupied.\n\nVeteran “whales” fund and dominate the system, and CCP designs around them. The lore barely advances, and new players fill the labor gap that keeps the game world spinning.\n\nIf you want to study a living experiment in digital feudalism, EVE is fascinating.\nIf you want a game where your time or choices matter, look elsewhere.\n\nPlay it for the spectacle, not the dream.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "super grindy but i guess thats really the only way an mmo can be fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you're mining as a beginner on a low security level sector and then some idiot was just waiting to blow your ship to bits and this is after a dozen or so warps to get to that sector, not to mention the damn AI will disrupt you and your mining ship making you move from one asteroid to another",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashing frequently even in very low settings. taking 1.5GB ram before even starting the game.\r\nMEMORY LEAK ISSUES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im not saying this is a bad game.... but damn its super complex... idk i guess im dumb but this has the most information to learn about a game.. and i play runescape lol anyways graphics are amazing but this isnt for me and again... I LOVE STAR TREK and was having high hopes for this game... might give it another chance but who knows...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New player experience... playing for ~2 weeks. Imagine an RTS where you control one(1) unit and your controls are a small bar of symbols that can be exited and lost in the UI. And they don't even work all the time due to pathing issues. The UI is awash in monetization, engagement, and progression mechanics. The worldbuilding is baked into the aesthetic and writing -- so much that it becomes unintuitive. From the game jargon, the acronyms, the endless windows and boxy forgettable symbols, it feels like a cyberpunk DMV just getting through the spaceport.\n\nHowever the main issue is, like I said, the controls. The most actiony part of the game is the least intuitive. When you warp into a cloud of enemies you cannot simply press back or turn to get to a better position. You move by clicking things to orient yourself towards, and click to move toward or away from them. There is an untargeted way to move, but it's buggy and the ship will often wander in circles, presumably because of bad pathing. You'll also get hung up on invisible walls, stuck pathing through a huge obstacle, or just disappear right through it because no collision.\n\nIn most games with real time combat you have simple movement controls, and then from that foundation you build other things like, targeting, interaction, firing, countermeasures, anything you need to do in a split second. That's absent here. Things that should be simple are bizarrely obscure.\n\nBecause of this it takes a while to get past the 'learning' and into the gameplay loop, which is basically a spaceship-centered RPG... with some extraction shooter edge. That could be fun, but it looks like most of the ships (including all the higher tier ones) require premium time to use. As if buying these ships after hundreds of hours to earn them, means they are held hostage if I don't pay real money to use them. This suggests a strong p2w model centered on whales. Apparently this game arose around the same time as WoW, and I have nothing against live service/freemium games, but people that make a living off of predatory marketing aren't likely to switch to another model. Similar to WoW, it's probably mostly fun with friends. I can't recommend it until they figure out how to simplify the UI in general and especially combat movement. The ships and the setting do look nice, for what it's worth.\n\nEdit: As expected, pvp combat is janky, there's no counterplay if you haven't spent more time and money, the emphasis is on stacking odds and punishing the weak for being weak. The game mechanics that allow and reward griefing have to be intentional after 22 years in.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Still only a game that is good to play if you are part of a large fleet.  If you are a solo player it still has a community that quickly punishes you for daring to play by yourself.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Let me start out by saying this game isn't for me.  I can definitely see how someone who loves economics, space, and a solid challenge might love this game, so take my review with a grain of salt.\n\nThis game has a huge learning curve.  The combat is not involved enough for my tastes, and the world is almost too sandbox.  I prefer MMO's with a little more direction - I know some people love the concept of doing essentially whatever you want in an MMO, but it's not for me. The combat is not my style - I like things that require more input from the player.  Also, I wish that there was more player communication outside of corporations - local channels tend to be dead, and global channels are very topically limited.  Doing missions is impossible as a pair (okay, you can, but only one person gets credit at a time). This makes Eve more of a single player game in the beginning, and makes it less attractive to play with friends than other MMO's might be.\n\nTl;Dr:\n\n- stale combat\n- not enough direction for an MMO\n- lack of overall community /early fleet gameplay for new players",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After uninstalling, check the location you installed the game to because it leaves behind EVERYTHING. Just realized there was still a EVE folder with 10GB+ to delete WEEKS after uninstalling the game..... What is it with games leaving behind their assets and anticheats when uninstalling their garbage?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Does not load  i don't recommend  so sad for a free to play game that looks good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant believe how toxic this game is. Dont waste your time with it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "money to win game. unless u got no job or u r millionare in real",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "X4 Foundations is better",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I regret ever having said anything nice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why play this when games like star citizen exist?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wasn't my type of game and felt really slow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is awful...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EVE... EVE never changes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "P2W game nuff said...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im a sneaky ninja",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy. Crazy? I Was Crazy Once. They locked me in a room. A rubber room. A rubber room with rats. And rats make me crazy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, the community ruins this game completely.\r\nEVE might have depth and cool ships, but none of that matters when every interaction feels toxic.\r\n\r\nNew players get mocked, scammed, or blown up for fun. Ask a question? You get sarcasm. Try to learn? Someone ganks you just because they can.\r\n\r\nPeople say EVE has a “hardcore” player base — nah, it’s just hostile and arrogant. Even League of Legends feels friendly compared to this mess.\r\n\r\nDoesn’t matter how good the game is if the people in it make you regret logging in.",
      "voted_up": false,
      "votes_helpful": 279
    },
    {
      "review": "Multiboxing effectively destroyed the game, and is the root of most of the games problems, particularly the griefing. CCP should have nipped it in the bud over a decade ago, now it's so far gone they can't stop multiboxing without killing the game. That fleet of 12 Catalysts that ganked your Exhumer? That's not 12 pilots, it's one guy input broadcasting to 12 accounts. \n\nHis entire fleet might be 100 mil. Your hull alone is three times more expensive than his entire fleet, that's before we even touch fittings. Meanwhile, you can roam nullsec for hours without seeing a soul. Why? Because griefers aren't PVPers, and people in Null fight back.\n\nAll the group content in this game? Multibox solo, absolutely no point in having a community. You can more easily do it yourself, than actually play the MMO like an MMO. How you might ask? Well it's easy, just open up your wallet. You can buy skill injectors, PLEX, sell it for ISK. You can have a fleet as big as you want as quickly as you desire, all you've gotta do is open your wallet wider. Isk and skillpoints are the only thing in this game that really matter, and you can buy both.\n\nPlay EVE? No, go to work instead, a 9 to 5 then come home and just buy your way to whatever you want to do. EVE Isn't a game, it's a multiboxing, P2W waste of time. The ONLY thing left here of any note is Nullsec PVP, and a bit of FW. That's it. If you plan to just live in high sec there's a 90% chance you'll quit this game within a month. I've put hours into EVE, I started my first toon back in 2007.\n\nThe game spat in my face repeatedly, the devs chose greed over gameplay. Today, I simply do not have the time to give to this game anymore, so I've quit. I've engaged in effectively every gameplay loop EVE has to offer, PVE and PVP. I've basically done it all. I've mined, fought, explored in null, low, high, WH. I've roamed, I've griefed, been griefed, pirated and been pirated, bubbled people and been caught in bubbles, missions, relics and data sites, solo roaming, small fleets, blobs, rats, daytrading, industry, PI. \n\nThe game isn't worth your time unless you want PVP and even then, you'll either multibox, or you'll lose.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "Even back in the old days, and i mean really old, Trinity old, the subscription model was a hard sell for the pace of the game. Doesnt matter how much you play, you can only advance as fast as the training allows.\n\nNow nearly 20 years later the only thing that has changed is that subscription has gotten more expensive. Sure you play the filler cannon fodder role for free now but thats about all you can do. No industry, no mining, no economics. No specialized roles such as stealth bombing or electronic warfare. Just an ordinary ship of the line to fill space in a fleet. Though even then you wont be the \"best\" ordinary ship as level 5 is blocked lol.\n\nThe concept of EVE is incredible, its one of the only games left to have a world that is run more by players than the game itself. with a real economy and real consequences to actions.\n\nHowever 20 dollars a month for a game that caps your progression speed is hilarious, especially when it is still essentially a spread sheet simulator with an amazing pretty screen saver running in the background as its always been.\n\nIf they removed omega (subscription) requirements from combat roles (as economic and progression ease should be enough of an incentive) id recommend it, but unless you plan to pay the sub you cant do anything serious even in a large corp other than just being an ordinary semi ok ship of the line lol.\n\nYou'll look nice after half a year wait of skill training in that shiny battleship loaded with missiles, youll be proud and ready to engage the enemy with your corp fleet.  But you'll also just be an extra in a movie to blow up and die because the level 5 of the skill which impacts missile range is locked behind a sub, meaning no matter what anyone who is paying that $20 will be better than you because they will out range you, and there is nothing you can do about it.\n\nIt's not pay to win\nbut it is free to die",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "Don’t really like the community.  This game doesn’t reward your time.  Well, it can, but the community makes sure it doesn’t.  Everything takes a long time to do, but stealing/ganking is easy and fast.  Y’all have fun",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "If you're new to EVE, prepare to be farmed by veterans. The game heavily favors older players with deep wallets and multibox fleets. PvE content is nearly nonexistent unless you're willing to risk being ganked constantly. Once your ship value crosses 250k, you're basically a flashing target.\nMultiboxing dominates every corner of space, making solo or casual play feel pointless. The economy is bloated, the learning curve is brutal, and the UI feels like it was designed in 2003 and never updated. Even basic tasks require third-party tools or spreadsheets.\nSure, some people enjoy this hardcore sandbox style. If you're one of them, more power to you. But for me, I'm just another name added to the pile of players who gave it a shot and bounced.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Most hilarious ad I saw about this game said like \"BUY THIS SPECIAL PACK AND YOU CAN SKIP 4 WEEKS OF TRAINING AND JUMP RIGHT IN THE ACTION\"\n\nMaybe it's just me but a game that normally takes 4 weeks to get into the action is not really a well designed game",
      "voted_up": false,
      "votes_helpful": 130
    },
    {
      "review": "Just play x4 foundations\nthis game is pay to win AND pay to play\nto get good in this game you need a good paying job",
      "voted_up": false,
      "votes_helpful": 59
    },
    {
      "review": "Gave it a good college try. Spent over 150+ hours playing. Doing my best to learn. Taking things slow but by god this game is horrible for new players and even worse for new players trying to get into more advanced parts of the game. There is no good website or wiki that can give you straight answers to any questions you might have and any that they do are a roll of the dice as there has been so many changes that they may not apply anymore. You have to hope that years ago someone on reddit asked the same thing and got a usable answer.\n\nAll of this would be fine to deal with as you could take it easy and just learn as you go. Sadly the community is filled with people who have decided that they want to make your experience with the game much worse. Looking to build, mine, or explore anything slightly past the beginner stuff will put you in the firing line of pirate players and PVP. Even if you want nothing to do with that experience it is thrust upon you by their whims. Putting back hours of work and serenity for a moment of being stuck in place until they finish gunning you down. Followed by them shooting your escape pod for kicks and giggles. These basement dwelling bastards just make things worse.\n\nBefore anyone starts pointing out the many ways to avoid or escape from these wastes of space pirates. I no longer care. If the only way to learn these sorts of things is to have them pointed out in the comments of a negative review, then it is bad design and an even worse community. One I won't be part of anymore.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "EVE Online is less a video game and more an intergalactic corporate job where your soul gets audited daily, and while that’s kind of impressive in scale, it’s also about as fun as actually working in corporate without getting paid for it and rather you having to pay for the work or at least if don't have an eternity of spare time. The universe is massive, player driven, and rich with history, but unless you’re willing to spend months learning acronyms and mechanics, you’ll be stuck as cannon fodder in a space war you don’t understand. The community stories are legendary, the heists, betrayals, massive space battles, but most of those are things you read about on gaming news sites you find whilst researching about what yet another thing is rather than experience yourself. In the end, it is fascinating to observe from the outside, like a digital anthropology project, but actually sitting down to play it often feels more like a club where the doors are locked to newcomers, and the only ones left inside are veterans playing politics.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I have been playing this game before many here were even born. First time I played Eve was in 2001 I think? Anyway, it captivated me a lot with its openness and truly what felt like endless space with endless possibilities, I fell in love with this game, back then the giants like BoB and Zombies ruled the land, Russians and their Red Army alliance and Swarm fought brutal wars in zero sec to capture resources and establish bases.   It was great fun, the Dynamic politics of the eve universe always made game play fun and dangerous and profitable.\r\n\r\nThe learning curve on the other hand was brutal, just brutal.  The death penalty is ... well.. Not fun at all. But hey.. You paid your 15 bucks a month and you had complete freedom, all and everything was accessible to you. Learn all the skills you want, fly all the ships you want, do anything you want. \r\n\r\nI returned to the game after being away for 13 years, and here is my impression:\r\n\r\nTons of garbage content, new this and new that, join this faction or join that faction, you get free daily rewards just for logging in... Tons of useless, dull content added. Just like in Korean or Chinese games, anything you click on … please buy, please purchase, this token or that upgrade ….. Ok whatever. \r\n\r\nOn \"Alpha\" account you can't do anything, I have over 22mil in skill points, and I can't train anything, I can't get my stuff from the planet industry, I can't do this and I can't do that... basically if you are playing free... you are cannon fodder. \r\n\r\nOK  somehow I have 500 flex or plex or whatever that garbage is, and I can buy myself 1 month of \"OMEGA\" account, which is \"I paid I can do anything account\" or pay to win account. OK!! Great! Did that, and..... what a disappointment... Turns out I can't train any of the skills because it's either my clone is not Omega... or I have too many skill pints, so now I have to spend +$20 a month of top of +$20 for omega that I already have to train skills.... \r\n\r\nOKAY, that's a bummer.  But wait.. let me fly over to my planets and get resources from the manufacturing OKAY Here I come...    I see something that says... I need to purchase an additional bonus of some crap for another +$20 to be able to play planet industry.. well that sucks, okay.. let me just scan the planet for resources... NOPE cant do that because you dont have a skill remote surveying or something... but guess what I do have that skill to level 5.. and I still can't do that.... Because I need another bonus to my omega account +$20 in order to do that….\r\n\r\nBottom line...over the years.. over many many years this game because pay to win garbage, There is ZERO of its former glory left in it.  IF you don't know any better, you might as well enjoy it .. But I remember what this game was and what it has become...  GARBAGE! \r\n\r\nCCP = Cheap, cheaper, pay",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Botters and multiboxers endlessly ganking new players, and you can't even cloak yourself without a subscription. Not worth the time to install sadly",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "TL;DR - Kind of a mixed bag.\n\nIt's not a terrible game but the devs are constantly trying to force combat PVP onto players that want no part of it. Most game mechanics are geared toward this and it gets very tiresome very fast. It's like it's their only goal and any expansions or new features almost completely ignore players that aren't mouth-frothing psychopaths.\n\nThe latest Catalyst expansion is a good example. Sure it added some stuff and made some changes to mining that were sorely needed across the entire game but the really interesting stuff is locked behind PVP (as always). The mining changes that didn't involve trying to force PVP on everyone only highlighted the fact that asteroids are FAR TOO SMALL for serious miners. \"Let's make mining better but give them nothing to mine! HAHA NERDS!\" - CCP\nIt's like you can't facepalm hard enough...\n\nI've met some really awesome people in the game and made good friends over the years, but I've also witnessed the worst of humanity in it as well. Seriously, if some of these people aren't on government watch lists or literally playing from supermax prison I'd be very surprised. \n\nSomething is very broken in the human genome (clearly) and this game attracts it like fat kids to cupcakes. I guess my biggest problem with it is that the devs actively support and encourage it. It's kind of sad to see such wasted potential.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I only liked the mining and hauling but I have to pay to be able to get access to better miners, mining equipment, and even forms of mining. I'll keep playing but i'd rather play a game that doesn't try to squeeze money out of me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I have absolutely no idea why this game still exists or why anyone is still playing it. It’s one of the biggest scams ever created. “FREE”? Yeah, free to install. That’s it. The rest is a bottomless pit.\n\nI won’t even start with the industry behind this thing — the money people dump into “China farming” or PLEX is unbelievable. How can people be this blind and this dumb? Every so-called “patch” or “event” gets hyped like it’s revolutionary, yet nothing ever changes. It’s the same old mess, repackaged again and again.\n\nI deleted it from my Steam library. I tried every possible option to hide, block, or get rid of it. But no — this relic keeps crawling back into visibility like a bad infection.\n\nCCP, for the sake of humanity, shut down your servers. The game could have been great, but with its broken mechanics and the absurd need to buy Omega, it has become one of the worst scams in gaming. Seriously. Wake up.\n\nI can’t even say what I really think about the game and CCP, because it wouldn’t fit any rules or guidelines, not even remotely. So I’ll leave it at this: end the misery, free the poor souls trapped in that universe, and for anyone thinking about “trying it because it’s free” — please don’t. Do literally anything else with your time. Spend it with your family. Take a bath. Stare at a wall. Anything is better than this.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Pure greed. There's no denying that Eve is a great game, but CPP is FAR too greedy for their grossly inadequate management of this game. I would love to come back, but I'm not paying $20/month just to be able to play... And, yes, you can technically play without Omega but you miss out on 90% of the things that make the game enjoyable. \n\nThink about how many excellent indie or even mid-sized dev games you can play for $20 dollars - like 3? \n\nDo that every month instead.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Extremely hard for the new players, all interesting things hidden under paywall, so or you need to pay subscription or grind like on full time job to get premium currency to buy subscription. Do not recommend",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Quite possibly the MOST negative game I have ever played. If you're new to Eve please make sure you understand this: the whole concept of the game is to kill someone or be killed (to pod another player, or be podded), and to get the BIGGEST kill possible. The results are posted on https://zkillboard.com/ and are updated almost instantly. If you die, your deaths and all your lossed items are posted on this website. How nice is that? Eve online is a podding/killing game dressed up in a Space MMO packaging, and it fails totally to be what a true Space MMO, or real MMO is.\n\nThere is a module in this game designed so that other players can scan your ship – view your fitting AND your cargo. What’s the aim? So they can see how valuable the kill will be (remember all kills are posted on https://zkillboard.com/). So if you have all that precious cargo, ore, or loot from a scanning trip that you want to sell, these will be scanned down at gates and will likely make you a target. So being an explorer, miner, or anything else apart from a PvP’er is just an illusion in this game.\n\nThere are NO defenses against the above scanners at all, you just have to ACCEPT it. Realistic isn’t it?\n\nIt is also not a healthy game. You are able to play the game for free and fly a good selection of ships. However, there are hundreds and hundreds of skills which need to be trained. These can be trained quickly by using real money and buying \"skill injectors\" (drugs?) which boost your skill level instantly, but can create a very negative spiral which causes you to drain all your cash on this game....THE RESULT? \n\nThe result is you still LOSE EVERYTHING. Nothing is safe in this game, because of the game's objective and design, which is to trap players and FORCE them to participate in pvp (whether you like it or not - this is whether you choose to be a miner, explorer, trader, solo player or whatever). \n\nThe travelling mechanism for instance is based on jump gates - you have to use X number of gates to get from point A to B, so if your route takes you through 7 jump gates - those are 7 opportunities for the game to force you to lose your ship, because of gate campers - well, there are the CONCORD POLICE - who are supposed to be a protective??? force for players in high-security zones, but the game developers have given them a REACTION DELAY before they come into action against an attacking player, oh how convenient!!! In low security space, there is no concord, only gate guns, which are practically useless. Oh - did I tell you? The lower security space, and null security space have the most valuable ORE to mine? So ofcourse, every player wants to go there...devisive.\n\nThe biggest trap in Eve Online is the warp disruptor or warp scrambler – it basically stops you from being able to warp away to safety, npc’s use these too!! Once you are hit with this, there is literally nothing you can do except either try and fight, or wait for your ship to blow up. There is NO defence against this device, so once you get scrambled, that’s it! In nullsec players erect ‘warp bubbles’ which stop you from warping within a huge area – again NO DEFENCE against this! Realistic Space MMO isn’t it????\n\nYou can also be killed INSTANTLY on undocking from any high-security station, because of the REACTION DELAY of Concord, yes and I mean INSTANTLY – you will find yourself warping without a ship.\n\nThere are two main trade hubs: Jita and Amarr. The fastest route between these systems is very short, however the game designers have intentionally placed 1 low security system on this route to increase the number of player deaths and ganking! The alternative route is nearly 50 jumps!!! This takes A VERY long time, especially if you have a big slow ship. The game then becomes a HUGE time-sink.\n\nOH – MINERS beware – the biggest mining ships in the game are command ships and LOOK very appealing and mouthwatering, but now to operate them you need to use a module which stops you from moving for 5 minutes at a time – great isn’t it? Means you can’t warp away if you see an enemy nearby, or to even prepare yourself to move your ASSETS to a safe spot, again you are FORCED into a combat situation YOU DIDN’T ASK FOR. AND – these mining ships are unable to use weapons!!!! SO YOU CAN’T DEFEND YOURSELF. Yes you can use drones….but what good are 5 drones against more than 1 player, especially when drones can be killed!!!???\n\nWant to be a hauler (trucker)? Good luck! The hauling missions are designed so that you earn just a tiny amount of in-game currency for each mission, which basically makes it a waste of time, so nobody does it. Now there’s a “courier contracts” market which is where players create missions for you to haul items from A to B for a much better fee, but ofcourse there’s a catch to this: to accept the contract you usually have to pay down a “collateral” worth between 500 million and several billion – yes, that much!!! WHY?? So that when your ship gets scanned, then destroyed (and it will), you'll not only lose the items you’re hauling AND your ship, but the collateral you paid as well!!! GREAT DESIGN!\n\nThe game is designed around gang warfare, or a large number of players, versus just 1. So if you want to be a solo miner, with a dream of owning your own station and miniature empire, and protecting yourself using great ships and weapons against attacking players, FORGET IT!! IT IS NOT POSSIBLE. All ships are designed for GROUP engagements, and stations themselves are so poor at offense, a single player can easily evade their weapons, it’s actually a complete joke just watching them in action. (Oh – stations take 24 hours to anchor in space, and during a certain timeframe they can be stolen!!!) So solo players with stations ALWAYS get wardecced (basically get their stations destroyed) eventually by other corporations. THERE ARE NO OPTIONS TO DEFEND YOURSELF unless you have other players to help you (LOTS) , even though you spent ALL THAT MONEY and time setting up your business empire. \n\nIf you want to be a miner, you will die, if you want to have your own solo station/empire, it will all be destroyed, if you want to roam null sec seeing what's around, you will die, if you want to do high-sec missions you will die – of boredom, if you want to boost your skills and level up your character using an omega subscription, and fly EXPENSIVE, VERY GOOD LOOKING ships - these will all be destroyed, because THAT IS THE PLOT OF THE GAME. NOTHING HAS ANY VALUE.\n\nEven the PvE gameplay forces you into situations where you get destroyed - oh  and there are spreadsheets, and all that crap you can read online about which enemies do which damage types and what weapons you need in certain zones to be fitted to your ship, but the game will eventually win, you will get attacked by a random npc who is 50x stronger than you and be unable to warp away and have to sit and watch your beautiful ship get destroyed slowly. AND THERE IS NOTHING YOU CAN DO!!! Quite sickening.\n\nThe only true space MMO feature this game has ....oh wait??? I can't think of one. Oh - maybe the player market - where you buy modules to fit your ship with, so it can get destroyed.\n\nThink about it like this: Eve online is a game where you can pay £5,000 of real money on the item called PLEX - sell all these PLEX at the main trading station in game, and then convert it to in-game currency, then use it buy the most expensive items in the game - you load these items into a tiny frigate, undock your ship, wait for it to get scanned by another player, or just warp to any gate, and watch it get blown up.\n\nOR - you can just undock, right-click your vessel and choose \"auto-destruct\".\n\nOR - you can stay docked, right-click on the expensive stuff you bought, and click \"trash\". Nice game - WHERE EVERYTHING IS DESTROYABLE!!\n\nTo sum it all up: Eve Online = a game where you play to be destroyed, and pay to be destroyed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "EVE is more interesting to read about than to actually play.\nPower bloc clashes and battles involving thousands of pilots sound epic. I came to the game for the beautiful ships and space scenery, expecting an incredible adventure. But all the magic fades away right after completing the tutorial missions.\n\nFor decades, EVE has suffered from long-standing issues that seriously affect the player base. The support is unfriendly, and there’s no meaningful mid-game content. The core game design combines two incompatible things: grind and roaming. Whether you want PvE or PvP, you often have to roam endlessly. In the end, you spend far more hours searching and waiting than actually playing. The loot is inconsistent, and it’s easy to waste several hours grinding for a trivial reward.\n\nThe game gives massive PvP advantages to older accounts. Veterans know a thousand ways to destroy a new player. Newcomers in weak ships are killed “for fun” by pilots flying T2 or T3 ships through multiple accounts. They brag about their kill counts. It quickly becomes clear that new players are just prey — farmed by veterans. At that point, you realize what the developers’ design truly is, and it’s easy to decide your time deserves a better experience elsewhere.\n\nThe dev team completely lacks the courage to evolve the game. Everything is built around keeping EVE frozen in its broken state while a small core of loyal players keeps paying. Even multiboxing has been integrated into the monetization system.\n\nImagine looking for fair, exciting PvP — and your opponent simply switches to a second window with a stronger ship to finish you off once his first one tackles you. Where’s the fun in that? Gang-style PvP offers no thrill — only wasted time and a lost ship.\n\nLarge-scale battles with thousands of pilots cause massive time dilation. Ships pile up, and the server runs at the speed of 2 FPS per minute — pure disappointment.\n\nCCP keeps developing new games instead of fixing EVE. Yet all it would take to revive EVE is the courage to address its core problems.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Do not install 2024/25  eve online. unless u got loads of money for omega status. otherwise. u cant kill other players only omega players can kill players. so u cant even attack the one that attacked u. wasted of time. no gm help nothing chat banns all over.  u can only attack bots. no real players. unless u pay 20 euro a month there beter space games out there. none paid and u can kill the attack that attack u paid or not paid.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Advertized as free to play but good luck with that. The most limited free to play MMO out there with sub-fee that is more expensive than most popular MMO's that actually have a player base.\n\nForced PvP...",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I really enjoy playing on pc and mobile as i have almost a 1500hr on mobile EVE and really wanted to get in to the pc version seriously i still find my self doubting if the monthly price for omega is really worth it given the mobile one is not to bad but given \nX4: Foundations on steam is currently only  around 23.51 usd and thats the full space game and you get to walk around inside your ship i cant justifie the current OMEGA monthly price. for PC EVE monthly price.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This might run worse than Helldivers 2 and that is saying something considering how bad Helldivers 2 runs. The launcher even decides to lag half of the time in this game it is insane.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Played like 20hrs last week. Kinda of confusing but players are helpful. I go to do a mission, leave the Imperial Academy space station and my ship is destroyed by slavers immediately. Lost all of my fittings and stuff on ship. There should be protection for new players. Slow games wastes your time",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not play this game unless you are willing to spend hundreds of dollars of your own money to be able to particpate.  Just signing up for omega won't get you anywhere, you will be hunted down by players who have years and thousands of dollars invested in this game.  You do have the option of catching up, so to speak, but that would require you to buy Skill Points which range anywhere from 10 dollars for a small amount upwards of 500 dollars.  \n\nThe game is designed to extract as much money from the player in order to participate, this is just the facts of the game.  You need time to train skills, but you only learn skills slightly faster if you pay for omega.  You then will acquire the skills to fly ships that don't get 2 shot by level 1 PVE mobs or 1 shot with the majority of players who have years (and thousands of dollars) invested into this game.  \n\nYou can get by doing High Sec PVE or Mining, but you're making virtually no money for hours worth of work, but if you get ganked you've basically lost a ship and several hours worth of money to recover that ship and if you are a casual player it will take you several hours or maybe days depending  on your time spent to recover your losses.  \n\nThat's where the credit card comes in, you're going to die non-stop, you will get griefed by players and they will mass report you if you retaliate for being picked on or camped so don't say anything to them, just accept it.  You can recover your losses which you will face a metric ton of losses, but the easiest way to earn isk is to spend 5-10 dollars every day so you can participate in the game.\n\nScamming is promoted in this game, you will have corps who will take advantage of you, you will have PVP corps who will see the new player flying around your brand new ship which cost you a lot of time and effort to buy, or your own hard earned dollars and they will camp you.  From there they will either hold you in space so you can't move, tell you to give them all of your money and they will destroy your ship.  You will then start off with nothing and have to spend weeks recovering all of the funds you lost.  If you don't give them your money they will blow up your ship, if they are kind they won't blow up your ship after you give away all of your money but that's pretty rare.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I once enjoyed this game a long time ago before other space games took its place, but their recent collaboration with Elon Musk makes me feel incredibly disgusted that I ever supported this developer.\n\nI'm unlinking and deleting all my accounts with CCP.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "20 eur paywall if u want to make actual progress in the game with the option of grinding for hundreds of hours to work around that paywall is just inexcusably bad game design in my eyes that undercuts all the deep mechanics that u basically only get a preview of without paying",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Completely unfriendly UI and a total lack of music or sound effects make the game feel lifeless. The interface looks like it was designed for spreadsheets, not for players, and navigating it feels like doing office work instead of exploring space.\n\nThe learning curve is absurdly steep — not in a challenging, rewarding way, but in a way that feels like the game is actively trying to push new players away. Even basic actions require multiple menus and unnecessary steps.\n\nOn the positive side, EVE Online has one of the most impressive player-driven economies and large-scale battles ever seen in gaming. But all that potential is buried under layers of outdated design and user hostility.\n\nIt’s a game that could have been a living universe — but instead, it feels like a sterile simulation that forgot about fun somewhere along the way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Biggest scam ever / you work for a week and all you get is players that have been here for years blowing up every ship you have , mostly when your doing nothing but mining . the game is setup do do nothing more them suck money out of new player s so they stand a chance to play",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you are coming to EVE online looking for a casual, relaxing space sim. Go find a different game. Elite Dangerous will be a far better choice for a space sim the EVE online. At least in Elite Dangerous you can enjoy the game without having to deal with non-consensual PVP, ingame scammers, market scalpers, a heavy alt account focused culture, and recruiters that don't care about leaving people alone. Not to mention 95% of the ships and skills are locked behind the subscription service.\n\nThat not enough to be a red flag? Thinking of joining EVE's equivalent of a guild or an alliance? That is, in my opinion, probably one of the worst decisions you can make. While I am sure there are some good groups out there that are playing just for fun, there are ones out there that will dictate how and when you play. How often you have to be on to stay in their group and what skills you are going to train. Alliances such as \"The Initiative\" and \"Brave\" are two of the older groups, from my understanding, and will make such dictates. Both also are lead by vainglorious, narcissistic leaders who only care about their appearance and how many people they can get to show up for activities they decide are important. Additionally, 99% of these player groups in EVE online will put pressure on their players to make additional subscription accounts to bolster their numbers rather then trying to bring in new players. \n\nIf you are looking to spend too many hours in-game only to be rewarded less then an Amazon fulfillment center employee, then be my guest and give Eve online a download. Just don't complain that you were not warned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the game on steam only installs the *launcher*. they've also disabled verifying files through steam, something i did not think possible till now. this is very fun to deal with when the launcher decides it's \"too old to update\" and brings you to a url for a non-steam download for the launcher. very cool!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Beyond hard for new players coming to the game. I sunk 30 hours into this game trying to learn how to play it and I still can barely fly my ship. Horrible. 3/10 imo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiboxing is a cancer in this game. Once you realize that 2/3 of the population doesn't exist the game loses its charm, most of the population are just bots of someone who runs 5-30 accounts at the same time. There's no PVP to be had when a multiboxer can just pop in his other 20 accounts and have you murdered. And, as others have stated, the cancer has grown, and CCP doesn't know what to do about it without killing the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too much stuff is locked behind an expensive monthly subscription. This game is just a huge money grab. Save your money and go play a game that doesn't try to clean out your wallet.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The character creator, one of the first things you see entering the game,  doesn't even work! Your model disappears immediately after selecting any options and you can't see what your customising.\n\nNot a good look..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s honestly hard to understand this game has been around for so many years, with a huge community worldwide, including a large number of Polish players, and yet it still doesn’t have Polish language support. Most of us can manage with English, but that doesn’t mean we should be ignored. It’s about respect and appreciation for a community that has supported the game for decades. To be honest, I feel disappointed. How much longer do we have to wait until the developers finally acknowledge that Polish players matter too? After all this time, it feels like we’re treated as less important, and that’s really discouraging to see.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is boring and not worth the effort of learning how it plays",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Много лет назад это была невероятная игра. С одной стороны - Solid Sci-Fi, уникальный сеттинг, море возможностей и восторг открытий. Даже когда рутина и проблемы накрывали с головой - всё равно хотелось разобраться и превозмочь. С другой - та самая Свобода среди звезд, о которой грезили многие из нас, кто вырос на научной фантастике во всех её проявлениях. Но время шло.\n Контент быстро иссяк. Даже для самых ленивых порог восхождения не превышал полугода. Достичь ощутимых высот имея мозги было относительно несложно, но количество иссушающей рутины повышалось с каждым новым шагом. Разработчики решили бороться с этим упрощением геймплея. Первый гвоздь в гроб, так сказать. С другой стороны копилось разочарование. Свобода быстро обернулась вседозволенностью, которую тщательно оберегали и продвигали разработчики с тем умыслом, что любой движ идет на благо. Лишь бы наводили суету и жгли валюту. Игру затопил скам. Где нет правил, там рай для отморозков всех мастей. И если по началу это происходило изредка как неформальный перфоманс, то потом вошло в норму. Игра потеряла вменяемую аудиторию и выродилась в откровенный токсичный ширпотреб со скучающими гопниками. Постгуманизм смыло потоками злобного быдла, которому доступность их дегенеративного стиля игры была только на руку. Sic!\n Сейчас это медленно угасающая помойка, которая бьется в судорогах цветастых аддонов чтобы хоть как-то отсрочить свой неизбежный конец. Это уже не та Ева, о которой говорили с придыханием. Просто бледная пародия. Собственно туда ей и дорога.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was such a unique and interesting game until pearl abyss bought CCP and ran it into the ground.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is PAY TO WIN, more than 60% of the game is unavailable to free players which is really annoying. The skills needed to level the playing field takes forever for free players, and you cannot access more than 60 % of them anyways without paying a monthly premium. That also include tons of ships, modules, equipment. Even If you are gifted these items you cant use them. sooo Grindy I hate it. 90 days for skill training like what? you will need a lot of money to play this game, like you better get a second job just for EVE ONLINE. ITS A MESS AND I WILL BE NO PART OF IT. Omega clones can enjoy it, still grindy though",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not recommend. I used to play this game so many years ago and ready to try with old account and its completely broken and unable to play. Imagine that! So I had to create a new account, fresh start, and guess what... No appeal. The soul of this game is gone. \n\nAfter reading the reviews around here, it confirmed my suspicious. 100% seconded to all. It's better off to enjoy solo game without worry about your wallet slowly draining because of secret paywalls to move forward. This idea of paywall is getting old and depresssing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game contains too many jackass players who take enjoyment out of hunting down and destroying new players... not reccomendable...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good. But most of the items are locked without subscription. So every one have to pay after reaching a point.\nYou guys should sell this game for an amount and make in app purchases for those who need more in game currency.\nSo those who have the skills can enjoy the game without additional payment.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is objectively bad. It combines the two worst parts of MMO (pay to win/play and toxic playerbase) and Roguelites (permadeath with slow progression systems).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unless you plan on buying, WITH REAL MONEY, multiple accounts worth of Omega time (which is this game's subscription), then don't bother. Everyone does what is called \"multiboxing\", which in most games is heavily against TOS because it gives a massive unfair advantage to people with mountains of cash to burn. Multiboxing is the act of having multiple accounts playing at once. Here's the issue: This game's devs ENCOURAGE multiboxing. They encourage something that actively makes the game worse for people who don't have tons of monthly cash to burn. There is a system specifically meant to make multiboxing easier/better, and that is allowing you to multibox other characters on the same account, but ONLY if they are also Omega. \n\nI'm sure the devs will try to comment here to defend this stupid \"medhanic\", but if not just know they 100% encourage this, and if you don't multibox, you will be essentially barred from half of the game's content because of it. \nWant to just enjoy one character? Too bad, spend 100s of bucks a month bucko.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "to be totally honest when i played this game a couple years ago i found it to be pretty boring\n\n| that's all i had to say - DOOFEN |",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}