{
  "positive": [
    {
      "review": "Little Nightmares II is not just an incredible horror title but a fantastic sequel to its predecessor. It takes what made the original so unique and popular and twists it in such a way that it feels like a massive improvement in every single aspect. What it lacks in combat it makes up for with smartly crafted scares and spine-chilling monster design. It is a delightfully spooky world with inventive puzzles and some original levels. 10/10 recommended.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Little nightmares II is actually a prequel to the first game. It has an incredibly beautiful story with a shocking ending! a reminder that anyone is capable of anything, even someone you've helped so much :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Little Nightmares II is not just an incredible horror title but a fantastic sequel to its predecessor. It takes what made the original so unique and popular and twists it in such a way that it feels like a massive improvement in every single aspect. What it lacks in combat it makes up for with smartly crafted scares and spine-chilling monster design. It is a delightfully spooky world with inventive puzzles and some original levels. 10/10 recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jogo bom dms, é o primeiro game da franquia que tenho contato, e vale mais doq a pena jogar, o jogo mistura um terror psicologico com suspense e uma sensação de mega cidades coisa que poucos jogos tem, ent o fato deles trabalharem bem a questão da proporção é oque me prende nesse jogo 11/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great and beautiful game, I'm very invested in it and wish I knew more about the backstory of the characters. \n\nFun to play, and scary at times, but the movement is a facking pain in the neck.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Little Nightmares II is a game built around the tension between smallness and danger, using its unsettling world to create the sensation of navigating a nightmare that is constantly shifting and tightening around you. As Mono, a quiet and vulnerable child armed with nothing but determination and caution, you wake in a forest that feels alive with menace. Every creaking branch, every rustle, every silhouette on the horizon seems to hint at something watching. When you soon meet Six — the protagonist of the first game — you gain not just a companion, but a silent emotional tether. The game uses their developing partnership to ground the journey through a world that feels both dreamlike and disturbingly real, where everyday places are transformed into hostile labyrinths.\n\nThe game’s environments are its greatest triumph, each one crafted to feel like a distorted reinterpretation of reality. The forest gives way to a ramshackle cabin full of grotesque trophies, then to a sprawling, decaying city swallowed by static. One of the most memorable segments is the school, where the Teacher’s grotesque elasticity and the violent, doll-like children turn an ordinary classroom into one of the most nightmarish sequences in the entire series. The Pale City that follows is a haunting landscape of warped buildings and shadowy figures transfixed by television screens, evoking themes of apathy, addiction, and the unseen power of the Signal Tower. All these environments share a visual language of decay, loneliness, and warped proportions, creating a dreamscape filled with childhood fears made monstrous.\n\nPuzzle-solving and platforming blend seamlessly with stealth, making progression feel organic rather than segmented. Mono is not helpless; he can wield small weapons, drag objects, and use tools to break through obstacles or defend himself in a limited fashion. These moments of empowerment are brief and always overshadowed by the overwhelming sense that he is still a child in a world far too large and hostile for him. Platforming is often tense and deliberate, with chases that force quick reactions and stealth sections that require precision. While the fixed camera enhances the game’s cinematic framing, it occasionally complicates depth perception, making some platforming moments feel fragile or unpredictable. Still, the environmental design ensures that nearly every puzzle feels like a natural extension of the world rather than an artificial obstacle.\n\nWhat makes Little Nightmares II emotionally resonant is how it communicates its story without a single line of spoken dialogue. Mono and Six interact through gestures, glances, and the small ways they help one another across gaps or through danger. These subtle moments carry more weight than scripted conversations in many narrative-heavy games. The story unfolds through implication and symbolism — the influence of the Signal Tower, the eeriness of the static-filled televisions, and the way ordinary objects become ominous in the game’s perspective. This form of environmental storytelling invites interpretation, allowing players to draw meaning from visual cues, the behavior of enemies, and the shift in atmosphere from chapter to chapter.\n\nAudio design plays a huge role in building tension. Ambient sounds echo through empty hallways, distant thumps hint at approaching threats, and the music swells at key moments with a strange blend of melancholy and dread. Even silence is weaponized, used to make every sudden noise more unsettling. Each creature’s presence is amplified through sound — the Teacher’s scraping, the Mannequins’ twitching movements, the Thin Man’s staticky interference — creating anxiety that lingers long before and after each encounter.\n\nThough the game’s pacing is tight and deliberate, its short length may leave some players wishing for more time in this horrifying but fascinating world. Its storytelling is intentionally vague, and some narrative threads remain mysterious even at the end, which can feel either enticing or unsatisfying depending on the player’s preference. At times, the action-oriented sequences — especially those involving weapon swings — can feel a bit clumsy, momentarily breaking the otherwise smooth immersion. But these are minor cracks in a structure that otherwise holds together powerfully.\n\nLittle Nightmares II stands out as one of the most atmospheric and emotionally gripping horror experiences of its kind, blending haunting visuals, tactile tension, and wordless storytelling into a compact but unforgettable journey. It enhances the strengths of its predecessor while expanding the scale and ambition of the world. The result is a dark, surreal adventure that lingers long after the credits, not just for its scares but for the strange, heartbreaking beauty that permeates its nightmarish world.\n\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Little Nightmares 2 is flawed masterpiece. I absolutely love the artstyle, story, and atmosphere for both games as well as all the twisted monsters you meet, but the controls are clunky and the actual feel of playing the game is like I'm fighting in knee-deep mud to get Mono/Six to do what I want. Some areas rely too much on trial and error (the mannequin section almost made me drop the game entirely) but for the most part the checkpoints are fairly generous. Most of the puzzles are usually fun and interesting (such as the furnace one), some are frustrating (especially ones with platforming). I'm not sure if I'll replay it to uncover all the hidden secrets since the controls are bad, but it's 100% worth it for at least one playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Great puzzle game. Many challenging levels with lots of lore if your willing to look into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While not quite as captivating as the first one, this one is very fun and has some cute scares! Love the little nightmares franchise in general the controls are pretty wonky and frustrating at times but generally speaking this game was pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, love the storyline of the game and ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. Super scary and creeps me out. Just like the first game. So far, I love it. Weird how it doesn't have FSR or DLSS like the first one, but it runs great on any hardware. Doesn't stress the hardware as much as the first one. Still would be nice to have DLSS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, hate that mannequin room and was stuck in some other areas\r\nLove the story, can't wait to play the 3rd game that was released",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Nightmares II delivers exactly what it promises: a chilling, atmospheric adventure packed with tension, creativity, and emotional weight. From the very beginning, the game pulls you into its twisted world with stunning visuals, eerie environments, and sound design that’s unsettling in all the best ways.\r\n\r\nMono and Six make an unforgettable duo. Their animations, interactions, and silent storytelling create a bond that feels surprisingly real, especially for a game with no dialogue. Every moment with them adds to the world’s charm and mystery.\r\n\r\nThe level design is where LN2 truly shines. Each area feels distinct, imaginative, and filled with clever, satisfying puzzles that strike a perfect balance between challenging and intuitive. And the enemies? Terrifying in a way only this series can pull off—creative, symbolic, and genuinely memorable.\r\n\r\nThe pacing is tight, the atmosphere is rich, and the story leaves you thinking long after the credits roll. It’s one of those rare games that manages to be both beautiful and horrifying at the same time.\r\n\r\nSimply put, Little Nightmares II is a standout experience—creepy, emotional, and artistically brilliant. A must-play for fans of atmospheric horror and smart, stylish storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, follows in the footsteps of the first but never really reaching the same heights",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little nighmares is a great thriling game with lots of puzzles and awsome design and graphics i defiently recommend little nighmares.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great atmospheric story telling and visuals.  The game play is mot to hard and annoying.  great game just like the 1st one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Nightmares II is compact, eerie and impeccably designed. Every set piece is crafted to unsettle and intrigue — puzzles are smart, and the atmosphere is the star. It’s short, but the density of ideas and tension makes each minute count.\n\nWhat I liked: unique visual design; tight level-puzzle integration; perfect pacing for a short experience.\nWhat I disliked: short length — you’ll want more once it ends.\n\nPros: mood, design and puzzles; high craft in a condensed package.\nCons: short runtime.\n\nTip: explore thoroughly — secrets and environmental storytelling reward curiosity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I liked it, I played the Enhanced Edition before writing this review.\n\nTHE GOOD ---\nThe puzzles are pretty engaging, as someone who last played this game in like 2021 when it came out, I found the puzzles to be intuitive enough for me, if I didn't get something the first time I thought about it and then went \"oohhh\".\nThe 'story' (or lack thereof) is also pleasing, the enemies they made up for this game are stunningly awesome but I fear some may be quite different to expectations if you're fresh off the first game.\n\nTHE BAD ---\nMy major problem with this game is the movement tech, it's hard to tell where you're jumping to sometimes and it made me fluff about during the [spoiler]school & hospital[/spoiler] segments where I was up high asf and falling meant certain death, it is also obvious during the [spoiler]Doctor's[/spoiler] chase scene where you must outrun falling shelves, sometimes I just died to the shelf or he managed to grab me somehow.\n\nTHE UGLY ---\nIt never jiggled in my brain that this game didn't get a DLC like LN1 (probably because I didn't play the first game until last month), now I have not yet played the LN1 DLC for myself ...Yet, but I've heard nothing but good things about it and after watching some videos on LN in preparation for playing this game & possibly making a video on the franchise and I was shocked to hear that Tarsier was booted off the franchise, but what can you do about it? This game is incredible enough to stand on its own & I am excited for their next project \"REANIMAL\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\r\nCould not have made a better sequel to this great, one of a kind series. Every single aspect of the previous game improved in every way. The same immersive atmosphere much thicker and intoxicating, definitely much more scary than the last game for sure.  Gameplay and physics still 100% on point. Challenges and puzzles far more entertaining and challenging than the already very entertaining previous, in which I was able to rejoice upon my own accomplishment. The same powerful environmental storytelling and lore to add much more to this very interesting story. Goated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this has to be one of the greatest horror games created of all times. Most people say this franchise is successful only because of the crazy visuals but the gameplay offers so much as well. Its just a really well balanced game and I would highly recommend it to anyone!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember being excited after watching the trailers for this game before it came out, I watched tons of playthroughs as I was not able to play the game myself yet, I got it for my switch roughly 3 years ago and finally played it for myself. replaying it again but on Pc this time still gave me a great experience, the game holds up and remains my favorite in the franchise. while I do enjoy the atmosphere in the first game more, the story and the puzzles in this game are an improvement. \r\n\r\nI highly recommend the second instalment to anyone that enjoyed the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the first game but the storyline of the second one is so much better in my opinion, this one also terrified me more than the first one lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game visually. Great game to play. Transparently, thought the first one was more engaging, but still had a great time with this one. Maybe it was the difficulty or the toned down action, something just didn’t feel as great in this one as the first, but hard to pinpoint what that was exactly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great atmosphere and a well designed sequel to the first game! Highly recommended if on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This entry continues the series’ talent for creating a dark and haunting atmosphere, with beautiful art direction, smooth animation, and impressive camera work that matches the style of the first game. The pacing works well overall, keeping the tension high and the environments unsettling in all the right ways.\n\nThere are a few glitches that can get annoying, though they don’t break the experience, and the story feels a bit thin and less substantial than it could be. It also runs a little long for what it’s trying to deliver. Still, despite these issues, it’s a strong and visually striking horror platformer worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The psychic horror & storytelling quality of Little Nightmares II and it's predecessor are simply unmatched.\nLittle Nightmares II just f****** delivers!! I wish I could go back in time when the game first came out and experience its narrative for the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME, just the the first one i love the franchise, and every unique and amazing world building, deffinently my favorite part. THE MUSIC AND SOUND DESIGN also really good, and story 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "by far the best game I've ever played, I could easily play this for the rest of my life and not get bored of it even a little bit. I have 0 complaints about it, I've played it over 12 times probably.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atmosphäre und Story noch besser als bei Teil 1. Sehr gutes Game. Freue mich teil 3 anzufangen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The monster designs in game is a step up from little nightmares 1. The game also introduces some amazing new mechanics like playing with another character that follows us, adding the ability to call the other character near you. Fantastic edition to the little nightmares series. The ending is also fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Little Nightmares II[/i] is one of the few sequels in any medium that outshines its predecessor. Its haunting atmosphere, masterful sound design, beautiful art style, amazing lighting, and so much more combine to create an unforgettable experience. It’s a [b]perfect[/b] narrative-focused game, aside from a few bugs here and there. If you liked [i]Little Nightmares[/i] and the atmosphere it created, you will love [i]Little Nightmares II[/i].",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally really enjoyed the atmosphere and all the metaphors put into the game and its world, plus the combat and everything. The story was great, but not many would catch it unless they pay attention, and I think the fighting was really creatively made. Would definitely recommend if you want a game that will make you think rather than just serve you its whole story on a silver platter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A much better game than its predecessor with better puzzle design and some nice quirkiness to it. Much better save points this time around. The ending was interesting. My biggest knock on the game was  the stupid purple door puzzles, how was i suppose to figure that out, dumb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The art design and atmosphere of the game are great. The setpieces are well laid out. Things are genuinely unnerving at times but I wouldn't call it scary. The art department definitely knocked it out of the park!\n\nI've finished the game and the amount of times I've soft-locked or encountered bugs is unreasonably high. These range from getting stuck in a climbing animation on a crate to getting stuck in an infinite death animation to things just being unable to be interacted with (key, pipe, door, etc.) to items just not spawning at all. Several times I spent 10+ minutes trying to figure out what to do and the real answer was to reload. Luckily, the game auto-saves fairly often so reloading a checkpoint wasn't a huge setback most of the time. \n\nThe game will often kill you with traps that are probably unavoidable on your first attempt, though it's only annoying when you have it happen several times due to sluggish controls or because you got stuck on a random bit of environment. Plays fine on keyboard except for one section where you have to use a flashlight that was so awkward I had to use a controller. \n\nI'd compare it to a game like LImbo where the story is vague and there are a few too many \"puzzles\" that require you to very slowly push a crate or physics object somewhere. I don't regret playing it but I'd wait for it to go on sale if you're going to pick it up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "little nightmares II is not only a quality horror game, but also a fantastic sequel to a great game. the visuals and atmosphere are amazing. the puzzles are well-crafted, and each chapter presents a new way to navigate the world and solve new challenges. the game has some great grotesque villains - the teacher has a disturbing expression reminiscent of uncanny valley, the doctor crawls on the ceiling like a spider, and the mannequins in the hospital move in the dark. the ending of the game is tragic, and the final plot twist is unexpected. \n\nand even though some parts of it were incredibly frustrating, little nightmares II is one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The aspect that keeps me coming back to Little Nightmares II is the setting and atmosphere. The developers and artists have created an eerie world that is begging to be explored. The puzzles sprinkled throughout the platforming feel fair and satisfying once you figure them out. I also quite enjoy the segments where you have to sneak around the big baddies in the level. If you like exploration platforming in a truly bizarre, creepy world then give Little Nightmares II a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, it encapsulates everything great in Little Nightmares I and improves upon it.\r\n\r\nPlaying with a keyboard and mouse may feel a bit awkward, as a console would offer better control of the character, thus some sequences were a little bit annoying/tedious.\r\n\r\nThe game design: sound, environment and graphics all are beautifully crafted, mirroring each situation greatly and seamlessly evoking disgust, stress and fear.\r\nWe move from a forest to the city and through city related locations: school, hospital, apartments/buildings, and alleyways. These locations alongside the well integrated puzzles creates a seamless progression in location alongside the story for amazing immersion.\r\n\r\nAs the story progresses, the silent telling of the world displays how messed up the world is, and we get to create a bond with a certain girl. This girl turns out to be Six, and she helps us repeatedly, catching us when we need help with jumping long distances. This repeated action gradually builds up trust and an obvious dependence on each other, thus the decision from Six to betray this pattern at the end creates a greater emotional impact on her betrayal.\r\n\r\nVery good, happy there wasn't a deathless speedrun achievement, I would've lost it more than I did with my dead cat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a bit short but loved how much lore it adds to the whole series, completely recommended if you enjoyed the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very atmospheric and thrilling experience. Its a amazing puzzle game that can be frustrating at times, but thats part of the fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, an excellent prequel to the original with harder levels and an interesting storyline. Having two characters is a fun new way to make the game more interesting, and in my opinion it's an excellent play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest that I only really got into the original Little Nightmares as it being an INSIDE clone rather than something with its own merit (an idea that I eventually overcame years after playing it, and ended up adoring Little Nightmares in its own right). All this to say that I wasn't particularly excited to play this game when it came out and only really played out of vague interest. And while I don't think this hits the (incredibly high) heights of the original, this is still one of the best video game sequels of the few that I've played, and one that does really well at holding its own identity (new mechanics, new world-building, new characters) compared to the original, while also not straying far enough to feel like a departure from it. 100% a game worth playing for any fans of the original, though I would also recommend that anyone play the original before coming to this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Nightmares II offers a hauntingly atmospheric experience with clever puzzles and visual storytelling, \r\nHere’s a breakdown of the key pros and cons:\r\n\r\n🌟 Pros\r\n• \tAtmospheric Worldbuilding: The game excels at creating a creepy, immersive environment without any spoken dialogue. Every detail contributes to the unsettling mood.\r\n• \tVisual Storytelling: It continues the series’ tradition of telling a compelling story through visuals and environmental cues.\r\n• \tPuzzle Design: Puzzles are often clever and require lateral thinking, adding depth to the gameplay.\r\n• \tExpanded Gameplay Mechanics: Compared to the first game, Little Nightmares II introduces new mechanics and interactions, offering fresh challenges.\r\n• \tArt Direction: The disturbing yet beautiful art style remains a standout feature, enhancing the emotional impact of the game.\r\n\r\n⚠️ Cons\r\n• \tClunky Controls: Some players found the controls and mechanics less polished than in the first game, leading to occasional frustration.\r\n• \tNarrative Weakness: As a prequel, the story didn’t resonate as strongly for some fans, lacking the emotional punch and mystery of the original.\r\n• \tShort Length: Like its predecessor, the game is relatively short, which may leave players wanting more content.\r\n• \tLimited Replayability: Once completed, there’s little incentive to replay unless you're hunting for collectibles or lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can see why this franchise is successful... The game is polished, creepy, atmospheric and did exactly what it says on the tin… but I also found myself disengage from it. Perhaps because it progressed at a plodding pace, maybe because I enjoyed similar games (Inside) more. Still, can't knock its quality and for that I recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I already knew I was going into goated games, but woah. This game was amazing and I love it. I enjoyed the sequel(Little Nightmares) which I played first but this game was much more enjoyable for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An outstandingly good time, that is even creepier and weirder than the original.\nGreat world design, tons of atmosphere, and some very chilling enemies.\nA game I enjoyed very much, and something I highly recommend, especially if you liked the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wild. Slow burn -> immediate anxiety-inducing-must-go-pottie-feeling-while-playing-hide-n-go-seek -> loop process till end of game.\r\n\r\nThoroughly steeped in the lore now. Down the rabbit hole I go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love everything about this game and have played it several times by now. Story made me ball my eyes out, visuals are stellar, music is stellar, puzzles are great, this world is just so intriguing and awe inspiring I adore it so much. I played this for the first time back in 2021, but I'm just coming back here to give my praise cause this game deserves it.\n\nSix and Mono my belovedddd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really really really one of the best horror games if not the best. Really nice story and graphics but the sound is just the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best little nightmares game better than little nightmares and ln 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite little nightmares game!!!!!! I love everything about it. The style, story, music, intense detail to everything around you and Mono :) as well as all his little hats!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game said ‘no thoughts, just run.’ So I ran, panicked, got chased, and still kept playing. 11/10 would sprint again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game. Full stop. I do feel as though some bits are clunky, like the hand boss battle, or even the whole flashlight gimmick. Overall though, the gameplay is fun and engaging. The puzzles are pretty intuitive and in my opinion, great. I would 100% recommend others to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the perfect combo of stealth horror and puzzle solving i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good i dont know if it matches up with the story from the first one but there is pretty much more chase scenes and interesting lore you can get hats in the game and out the game but outside of the game it cost money and when i got it as a gift for free i was so excited because ive been yearning for this game and the fact that it has achievements and trading cards just made the gameplay better in a good way because if there was a game like this without achievements i would probably review a thumbs down depending on how good the game is and the storyline in the game it is the best because not only does it take almost ten hours if you try to beat it in one day without speedrunning but it would take days because who wants to spend ten hours in one whole time and not only is the first 2 games good but Bandai Namco didnt make the third one bad it was super massive games i know that for sure because Bandai Namco made the first 2 games with some help so dont blame Bandai Namco or you got the wrong guy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Love the environments and visuals, looking forward to playing Little Nightmares 3  =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Second Installment in these series was definitely big improvement from first one when it comes to whole visual & some other few things\r\n\r\nBeautiful music, once again dark atmosphere and good story .. some of the moments catched me off guard\r\n\r\nI´m not even gonna complain about some stages as i did not take them as frustrating but more like challenging, enjoyed some chapters way more than LN 1 especially Hospital\r\n\r\nControls are still kind of weird and camera too same as first game, a little better but still not my cup of tea in terms of movement and general idea\r\n\r\n9/10 - some elements and ideas in story was amazing, loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love All Little Nightmare Games.. The Storyline And Interesting Characters Made Me Fall In Love With This Game.. I Like Games That Test My Mind And Challenge Me.. Congratulation To The Creator And Team Of This Game..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A sequel just as good, if not better, than the original. All of the horror and character designs live up to its predecessor in every way. The new city feels huge and further dwarfs your size and the entire ending sequence is unforgettable. The controls are improved from the previous game as well. My only gripe is that there isn't enough game. (9/10)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this gave me big nightmares but it was worth it\r\ni love replaying good games instead of the shit new sequels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a wonderful puzzel game. Its jumpscares are mild, it gets me to actually think im in a nightmare. Although this game is challenging it does have some sad parts...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "teddy bear glitch is still present, and i have seen complaints on it since 2021...otherwise fun and i am slightly wetting my pants",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Nightmares II is everything the first game was  and MORE. It’s dark, eerie, and hauntingly beautiful, but this time the themes hit even harder. The hospital and school levels? Absolutely terrifying! The devs nailed the atmosphere and tension in each of those areas.\n\nWhat really stood out is how they expanded the gameplay. The introduction of combat makes you face your fears instead of just running or hiding, and it fits perfectly with the tone...  it’s scarier because you're forced to engage with the nightmare now. A small nitpick criticism is the ending was confusing and unclear, had to search up what it meant and why.\n\nAmazing experience overall, and I personally enjoyed Little Nightmares II even more than the first. \nHighly recommend. 👏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banger game, love this style and formula. \nThe endings are well thought out and the game leaves plenty up to your imagination of the world and beyond.\n\nLittle night mares 2 specifically is my favourite, it took me 3.7 hours to complete the first game and 7.9 hours for this one, so you get roughly 4 hours more playtime and its executed in all the right ways!\n\nPlease keep making these games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the funnest and most satisfying games I have ever played. I recommend this to players who like action video games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played. The music, the sounds, the graphics, the atmosphere—everything is wonderful, beautiful. The social commentary (similar to the first game) is also spot on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game ! Another amazing installment, and I cannot wait for more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Storyline and gameplay as usual liked the earlier one as well yet to play the 3rd part but  can say anything from this franchise is going to be good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insane. And with 2 of the most mental plot twists I've ever experienced (and I've watched AOT). Crazy good game 1000/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best little nightmares game, build up to the first game so insanely well. The ending gave me goosebumps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Describing this game in words is impossible.... Gameplay is really interesting and some puzzles left me scratching my head. Artstyle and sound design is off the charts. And the ending......... chefs kiss... (Although I really wanted a different ending) [NO SPOILERS]. 100% Worth my money and time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i Think they Really nail The scale Of the Environment in This game\n\nyou Feel very Lost and Helpless quite Often\n\nthe Graphics are Very nice And so Are the Characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game Is really fun and scary my heart almost came out you should buy this Is such a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i actually get scared playing this game but i thoroughly enjoy playing it. i play on my laptop and the sound and graphics are pretty good. Little Nightmares was good but the quality displayed on my laptop is better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I won't even bother explaining how good it is - you must play it\nOne thing that amused me the most - sound design! It's atmost brilliant. From the music to the hammer sound which you drag behind across wooden floor\nLast chapter can be recorded and shown at modern art exhibits",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished Little Nightmares II, and I really enjoyed it. The soundtrack is amazing, the puzzles are fun, and the connection between the two main characters really pulled me in. It carried that same vibe from the first game, which I loved.\n\nMy only complain is how much the camera zooms out, especially during chase scenes. I have astigmatism and the zooming made it hard to judge distance and depth sometimes. It got frustrating dying over and over because I couldn’t tell exactly where things were.\n\nStill, the atmosphere, music, and the story made it totally worth playing. I just wish the camera was a bit more friendly for players with vision issues.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A haunting, beautifully crafted horror experience.\r\nLittle Nightmares II is one of the best atmospheric horror games of its generation—creepy, emotional, and unforgettable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Coming from someone who finished their blind playthrough in November 2025.)\r\n\r\nThis game was a big step up from the first game and really did a lot better with the whole \"Making you feel so small in a big world\" feeling. I'm so glad I gave this franchise a chance and I also really like how you have an AI playing with you throughout the game while also having some solo gameplay as well! The monsters are absolutely terrifying and my goodness the ending is one of the biggest plot twists I've seen in my life and if you haven't seen it, YOU GOTTA PLAY IT AND EXPERIENCE IT FOR YOURSELF!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing!!!! Very fun and scary, love the color palette, love the story, love the music, literally EVERYTHING.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been a fan of Little Nightmares for a long time, I've followed the franchise for years, since the first installment! This is one of the best games I've ever played, the story, the details, the characters, everything!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "справжній жахастик - це складність босів в цій грі, до всього іншого питань не маю",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Nightmares II – A Dark, Twisted Adventure That Sticks With You\n\n★★★★★ (5/5)\n\nLittle Nightmares II builds on the eerie, unsettling world of the original game, delivering a haunting adventure that’s equal parts creepy and captivating. The environments are meticulously crafted, full of grotesque details and imaginative horrors that make every corner feel tense and unpredictable.\n\nThe puzzles and platforming are cleverly designed, requiring both timing and thought, while the stealth sections keep you on edge. The story, though minimalistic, is emotionally resonant and mysterious, leaving you constantly questioning the world and your place in it.\n\nThe combination of atmosphere, sound design, and visual storytelling creates a truly immersive experience. Little Nightmares II isn’t just a game—it’s a journey into a dark, unforgettable world that stays with you long after the credits roll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great follow up. Would absolutely recommend if you enjoyed the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Friend gifted me this and watched me playing.\nI could not jump to the other platform and fell.\nHe said: \"So that's how aging looks like.\"\n10/10 Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PEAK PEAK PEAK OMG PEAK I LOVE LITTLE NIGHTMARES SO MCUH WOULD PLAY FOR HOURS AND HAVE ON MY SWITCH AND PC DONT PLAY WITH ME AND MY LITTLE NIGHTMARES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Controls are a bit clunky on mnk, but otherwise very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible feat of visual storytelling and so far the peak of the 2D horror genre started by Limbo back in 2010 which was then followed by Inside and Little Nightmares.\n\nThe first Little Nightmares was mostly about being a little kid in an ominous world of grotesque adults. The sequel takes those themes and amplifies them by fleshing out the adults. What if the adults are being manipulated by ideology through things like television? What if you are destined to become an adult yourself and so part of the problem? What about kids who don't question society's malign influence and so functionally become robots?\n\nThe art is gorgeous and genuinely unnerving at multiple times (my favorite part was mid-game when you're stalked by dismembered mannequins in a derelict hospital). But the gameplay is frequently poorly thought out. I got stuck on one early combat section without enough checkpoints and wound up having to use WeMod cheats to make my character super-fast so I could just run past enemies.\n\nLittle Nightmares the IP is owned by Bandai-Namco, who have cut relations with developer Tarsier Studios for some reason. So Little Nightmares 3 is actually a scam and not worth buying. But keep an eye out for Reanimal, the actual sequel to Little Nightmares 2 whose demo is already out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game I've ever played, it changed me as a person gotta be honest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing the 3rd game it makes this one even better. By far the peak of little nightmares.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game. Fair price. I play it with my sons on their xbox all the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ein weiteres perfektes Spiel, vielen Dank an Tarsier Studios.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love The Little Nightmares series, the second addition especially! I love the way the creators expanded and refined the creep factors and improved so much from the first game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i liked the game but its honestly not as good as the first in the series. also i didnt like the ending.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Little Nightmare II is a great addition to the dark and gritty world that we fell in love with in the first game. I'm pretty partial to the first game but I have to say Little nightmares II has about 3-4X more game, more zones, more puzzles  and leaves you with MANY more questions. It's so hard to create a story without using dialogue and this is where Tarsier Studios excel they are master class at using the environment, creature design and subtle movements to convey a story. The art style music and just overall aesthetic is truly special in these games it's both beautiful and disgusting, appalling and luring what ever it is, it always leaving you wanting more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely gorgeous game. Very atmospherically spooky, fantastic story.\r\n\r\nOnly issue with the game was constant frame drops when different sections of the screen were being loaded in as you progressed forward. As a side scrolling game, with sections constantly being loaded in, this made it feel very choppy, constantly. It was a ray tracing issue as it completely went away if I disabled ray tracing. I did keep max ray tracing enabled, however, and just played through it, as it was gorgeous lol.  Played on fullscreen, 32\", 4k, 240hz QD OLED\r\n\r\nR7 9800x3d\r\nYeston Sakura Atlantis RX 9070 XT\r\nGigabyte B650 Aorus Elite AX Ice\r\nG.Skill Trident z25 Neo RGB 64 GB DDR5-6000 CL 30",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10 Enjoyable but very far from the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game Love The scary Things That Scared Me So Scary 10/10 Heya!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive Played This Game Before And Again And Again And This Is My Fav So Far The First Didn't Really Change Places And Was Too Short But This One Was More Of A Story To It Can't Wait To Play The 3rd One. If You Enjoyed The First Game Trust Me You'll Enjoy This One",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LN II has some big shoes to fill with LN I being one of my all time favorite games. It did not disappoint. Mono and Six co-op plays wonderfully into the storyline and builds into a sense of comradery. Amidst the spooky horror and jump-scares the story unfolds without a word needed to be spoken. Beautiful design, captivating landscapes and a plot-twist ending that makes you question everything you thought you knew about the world of LN II. 10/10 5 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game i have ever played indefinitely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite game of all time it is nearly perfect",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The atmosphere is great but, when you have no intuitiveness on your controls in your game along with having to do absolutely everything manually and hold the games hand like a small child is when its not fun anymore and just a chore. The amount of times I've died to getting caught by a pixel or my character not crouching/sliding on just refusing to crouch and walk forward was enough for me to actually write a review. \n\nThe atmosphere, the environment and design all looks fantastic. I loved the first game and this expanded on that but, it is overshadowed by the random dogwater controls that absolutely ruin it. Having to die 7 times because my character bumped into the pixel of an inanimate object is infuriating when it keeps happening but, on different objects! I'm sure I'll finish the game eventually but, being absolutely distraught because I didn't do anything wrong really seals the -Do not recommend without at least a hefty sale- review.\n\nEdit: After finishing the game... honestly don't even buy it just watch someone run through it in about 3.5 hours and save your money. The atmosphere and horror aspects are fantastic that are held back by horrible interaction and controls.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h3]The controls are clumsy, the gameplay is boring. I don't understand why everyone praises this game.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is frustrating compared to the first. It is not forgiving and requires you to die in order to complete each area exactly as the devs intended it. Many of the areas are not intuitive. For example in one area you must sprint, and another similar area you must sneak, but it's a coin toss to whether you pick the right one and die",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "How are people defending this game? Bad combat, bad mouse + keyboard controls. Only good thing is the art direction. \r\n\r\nGet it maybe on 90% discount!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you ever doubt that a side-scrolling, 2.5D game can scare you, \"Little Nightmares II\" is here to prove you wrong. The atmosphere, the tension and the events of this game can cause you more fear than some of the so-called big horror games. And it doesn't rely on jumpscares. Even the story and lore can be eerie and frightening.\nBut why am I giving \"Little Nightmares II\" a thumbs down? Simply because, however, I enjoyed the artistic part, the technical part was a pain. I played the enhanced version (there is another version which I never launched, so I don't know about it), yet I was having some major problems with it.\nThe first thing that really bugged me was random stuttering. Randomly, you would see the game stutters a bit and loses its smoothness. In some cases, even shaders don't load properly, and you will see objects blink while trying to load. I really don't know the reason, cause they usually happen in more peaceful, empty moments rather than the sequences in which lots of things happen. Changing the video setting doesn't seem to resolve it either. Probably something that is caused by the game engine, which is Unreal Engine.\nAnother big problem I had with \"Little Nightmares II\" was the fact that the protagonist would constantly get stuck in environments and objects of the maps. You want to pass through this door? You will get stuck to its frame. You want to crawl under this table? You will get stuck to its legs. Are you passing through this vent? The last part of it, you will get dragged on the ceiling, and your speed would be 1CM per second. This has caused so much pain in chase scenarios where you will get busted, and you will have to try over and over again to finally have a perfect run.\nThe need to be perfect is also another source of trouble. \"Little Nightmares II\" consists mostly of two gameplay mechanisms: puzzles and tense scenarios. Puzzles are obvious what they are. And even though they are challenging, they are not impossible, and at worst, you will need a few trial and errors to solve them. But tense scenarios are the scary parts of the games. Those are the moments you are running away or fighting. As I've said, the technical part of \"Little Nightmares II\" makes these moments quite frustrating.\nYou have to have a perfect run in order to pass a part of the game. Otherwise, you are stuck in it forever. The sticking into environments makes sure of that. Then there are the fighting scenes, which are unfair as they are, but the environments make it even harder and again, you constantly die and repeat till you finally get a perfect run. One mistake in any of these tense parts means death and checkpoint reload. Again, sticking to environments makes sure you will experience it a lot.\nThe technical problem persists in checkpoints, too. I know at least two places where checkpoints don't work properly, and the player is forced to reload again in order to proceed. One moment is when you open a door in the school chapter, but the camera doesn't follow you into the new room, yet you have reached the checkpoint. So you are forced to reload, so the camera is finally showing inside the room.\nThe other is in the hospital, where, after solving a puzzle and getting the key, you will unlock the door. For some reason, the game gets stuck here, without activating the checkpoint, and you are forced to reload the checkpoint, which is before the puzzle, solve the puzzle again and then proceed to the next room. Both of them happened to me twice, since I beat the game twice.\nAll in all, I can only say that \"Little Nightmares II\" could have been a great game, but the technical part has ruined the artistic part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk guys... I've played the first one time a long time ago and I don't remember much of it (I remember terrible loading times on switch perfectly:)) and that one feels like such an upgrade. I like the themes, the mechanics (at least most of them) and most of all the presentation. First ~two levels are wonderful but then it kind of went downward spiral for me.. Many physics and collision glitches made me restart from last checkpoint more than a couple of times and booby traps, while funny for a first time, becomes irritating and pointless after a while. I feel like dark cartoony-like graphics and cinematic presentation stand in opposite to this Limbo-like style of gameplay where sometimes you're supposed to die for the first time. Iiidk, maybe it's skill issue lol but I feel like it could be so much better and more polished, especially when it's the sequel",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh. Molasses-based physics. Frustrating to control.\r\n\r\nTry to solve an obvious puzzle. An object that is part of the puzzle won't cooperate. Okay maybe this isn't it after all... Time to explore, try other things. Waste a lot of time. Only then go back and it was the first object after all. I just wasn't touching the pixels right, I guess. This happened a lot.\r\n\r\nCombat? Also incredibly slow and hard to control. The enemies are of course lightning fast.\r\n\r\nChase scenes? If the baddies wanna catch you, they will. Their hands will suck you in and catch you even if you weren't anywhere near them.\r\n\r\nFail any of the things above, go back to the checkpoint which is always a couple screens back. I repeated a lot of pointless shit.\r\n\r\nThe first game was great and it's what made me get this one. I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game breaking bug in one of the opening puzzles. Seems many others experience it too.  How does that make it to release. and still not be patched now? Requires full restart to fix.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Liked the first game.  This one has great graphics, but I just got tired of not knowing what to do and trying different things until I stopped dying.  There's no skill involved in that.  Won't be buying the third one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Eerie and atmospheric, but playing back-to-back off the first game revealed to me that this game is a bit on the tedious side and isn't quite as stable. Controls feel \"off\" at best and are incredibly frustrating otherwise. Had to put the game down for a while near the middle because it simply wasn't fun to play, and even the unsettling yet beautiful environments weren't enough to keep me engaged through unpleasant gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "---{ 05 / 10 }---\r\nLittle Nightmares 2 has beautiful, surreal and stunning visuals, as well as music, and is very intriguing. The story builds around love and trust in a hopeless, TV-addicted world, where the protagonist learns to be himself.\r\n[spoiler]Sadly, the ending completely undercuts that. The girls' final choice is a huge step backward, erasing any sense of character growth after learning to trust the protagonist. Just because he has the power that corrupted her? He also rescued you with said power...[/spoiler]\r\nGameplay-wise, the mix of horror and puzzles is clunky. The 2.5D controls make precise movement frustrating, especially during timed chases. [spoiler]And there are a LOT.[/spoiler]\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n[b]☑ Beautiful[/b]\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n[b]☑ Mehh[/b]\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n[b]☑ Eargasm[/b]\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Story }---\r\n☐ It'll replace your life\r\n☐ Lovely\r\n[b]☑ Good[/b]\r\n☐ Average\r\n☐ Some lore\r\n☐ No Story\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n[b]☑ Can get annoying[/b]\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n[b]☑ Significant brain usage[/b]\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n[b]☑ Nothing to grind[/b]\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great atmosphere, aesthetics and music. Terrible controls and really hard to tell what you are doing or can interact with sometimes. Designed to be incredibly frustrating or just form over function?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It breaks my heart to downvote this game, but unfortunately I decided to not finish it.\nI was a huge fan of the first one and got excited about this. The atmosphere and level design are 10/10, but the imposssible, and more than frustrating controls, made me rage quit this game for good. The hospital part with the flash light is nearly impossible with mouse and keybord. It got so frustrating, that it killed the mood and excitement to continue play this game. Seeing the online reviews reporting the exact same issues, proves that this game is not refined and bugged.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game is good and all but unless you can get it at a reduced price its not worth it.\nOn PC, filled with bugs, terrible inout control, multiple times had to restart.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was the most buggy game. froze and glitched every twenty seconds. Ive played lots of games and never had those issues not even with the first little nightmares. i really had no fun playing this one. i was so frustrated with the game freezing and the perfectness you have to do with timing and movement.  it took me way too long to finish this game because i didnt want to touch it for weeks but forced myself to finish so it wouldnt be a total waste of money. a game thats on all streaming devices needs to be easier to play on keyboard. i was excited but so disappointed and i dont know if ill take the chance with little nightmares three because of this... shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is prone to bugs that can force you to replay entire levels, especially since there’s no option to create backup saves. The controls are incredibly tedious, to the point where part of the “horror experience” becomes trying to get the character to respond the way you intend. I’m specifically referring to the awkward flashlight handling, the strange and unchangeable controller layout, the character’s inability to automatically step up minor elevation changes, and the lack of multidirectional climbing mechanics.\n\nIt’s the accumulation of small issues like these—never addressed during development—that makes the game feel like a chore to play. I won’t be completing this title; after the game bugged out at the end of the already frustrating Chapter 3 and prevented me from finishing it, I decided I’m done.\n\nI love the atmosphere, and it’s clear this installment aimed to introduce more complexity, but ultimately it falls short of the first game.\n\nEdit: completed the final chapter and the ending was a bit disappointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started this game once, but switched to something else. Then came back fresh after a couple of months and couldn't solve the hand puzzle, it felt so arbitrary and intuitive in a bad, Sierra way that I just uninstalled the game. I don't have patience for bad game design anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game breaking bug half-way through the game: I couldn't progress because the required item doesn't spawn. Fucking ridiculous. Fix your dogwater game. I can't believe I paid for this crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Softlocks where necessary items just don't spawn in are really frequent. They can't be fixed by reloading checkpoints or relaunching the game. You have to redo entire levels repeatedly until you get lucky and they actually show up. I'm only a bit over 3 chapters into the game and almost a third of my time has been spent reloading saves and redoing areas I already beat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lovely sequel of the first one, but the controls of this installment are just dogsh***, no matter if you use mouse & keyboard or controller, be prepared to get tilted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You got to be a psyco to enjoy this game. This is a quite disturbing story of a child, that's at least how I percieve it. It's horrible masterpiece. Do not buy. Play something more cheerful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk guys... I've played the first one time a long time ago and I don't remember much of it (I remember terrible loading times on switch perfectly:)) and that one feels like such an upgrade. I like the themes, the mechanics (at least most of them) and most of all the presentation. First ~two levels are wonderful but then it kind of went downward spiral for me.. Many physics and collision glitches made me restart from last checkpoint more than a couple of times and booby traps, while funny for a first time, becomes irritating and pointless after a while. I feel like dark cartoony-like graphics and cinematic presentation stand in opposite to this Limbo-like style of gameplay where sometimes you're supposed to die for the first time. Iiidk, maybe it's skill issue lol but I feel like it could be so much better and more polished, especially when it's the sequel",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. Molasses-based physics. Frustrating to control.\r\n\r\nTry to solve an obvious puzzle. An object that is part of the puzzle won't cooperate. Okay maybe this isn't it after all... Time to explore, try other things. Waste a lot of time. Only then go back and it was the first object after all. I just wasn't touching the pixels right, I guess. This happened a lot.\r\n\r\nCombat? Also incredibly slow and hard to control. The enemies are of course lightning fast.\r\n\r\nChase scenes? If the baddies wanna catch you, they will. Their hands will suck you in and catch you even if you weren't anywhere near them.\r\n\r\nFail any of the things above, go back to the checkpoint which is always a couple screens back. I repeated a lot of pointless shit.\r\n\r\nThe first game was great and it's what made me get this one. I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a nice try.  Unfortunately they added too much 'action' gameplay with combat that feels like a drag given the sluggish unresponsive controls. The first one was better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game breaking bug in one of the opening puzzles. Seems many others experience it too.  How does that make it to release. and still not be patched now? Requires full restart to fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Liked the first game.  This one has great graphics, but I just got tired of not knowing what to do and trying different things until I stopped dying.  There's no skill involved in that.  Won't be buying the third one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eerie and atmospheric, but playing back-to-back off the first game revealed to me that this game is a bit on the tedious side and isn't quite as stable. Controls feel \"off\" at best and are incredibly frustrating otherwise. Had to put the game down for a while near the middle because it simply wasn't fun to play, and even the unsettling yet beautiful environments weren't enough to keep me engaged through unpleasant gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seriously no Couch Co-op. Huge Disappointment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst fucking controls I've ever seen in ANY video games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jeu de merde",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere is great but, when you have no intuitiveness on your controls in your game along with having to do absolutely everything manually and hold the games hand like a small child is when its not fun anymore and just a chore. The amount of times I've died to getting caught by a pixel or my character not crouching/sliding on just refusing to crouch and walk forward was enough for me to actually write a review. \n\nThe atmosphere, the environment and design all looks fantastic. I loved the first game and this expanded on that but, it is overshadowed by the random dogwater controls that absolutely ruin it. Having to die 7 times because my character bumped into the pixel of an inanimate object is infuriating when it keeps happening but, on different objects! I'm sure I'll finish the game eventually but, being absolutely distraught because I didn't do anything wrong really seals the -Do not recommend without at least a hefty sale- review.\n\nEdit: After finishing the game... honestly don't even buy it just watch someone run through it in about 3.5 hours and save your money. The atmosphere and horror aspects are fantastic that are held back by horrible interaction and controls.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately, Little Nightmares II lost what made the first game special for me. Instead of that slow, creeping dread, it keeps throwing in loud set-pieces and timing-based chases. By the third “run-die-repeat” sequence, the tension turns into routine and the mood breaks. The world and lore are still fantastic, but the action-heavy pacing drowns out the magic",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "It pains me greatly to give a thumb down to what is a gorgeous and carefully made piece of horror. Especially after a first episode I am very fond of. But the reality is, after finishing the game, I think Little Nightmare II is more trouble than it's worth.\n\nThat is, I realize it, saying a lot from the outside looking in, when presented with the incredibly nuanced and creative art direction; an art direction that manages to continuously surprise, even when staying monochrome, cool colors, mostly dark blues, with little kids and big monsters as a main concept. The monsters are grotesque and unnerving. The animations are masterfully done to make the whole cast move as expected and unexpected, depending if we’re looking at heroes or foes. \n\nThe sound design is also excellent…like genuinely some of the best work I’ve heard in horror games, which is a high praise, since the genre is well known for excelling in that precise department. And the music is ominous, ambient and sometimes melancholic and melodic.\n\nAnd all that is used in service of a purely visual and auditory narration: no voices, no written words, just animations and actions. The story is also…it’s good? From what I could gather on one playthrough, it is vague enough that you have to feel the blanks, but still not too abstract to be comprehensible even without words. I’m sure there is more to dig in…\n\n…that is if you actually want to play and replay the game. The issue being, the game feels like it was not playtested.\n\nI want to make clear that I respect the work of game devs a lot, and I am not saying this in an hyperbolic “it’s a buggy mess, these devs are so lazy these days” kind of way. For one, because I had a relatively bug free experience: there was one instance where I had to try from the last checkpoint because a script had not spawned the fuse that was required to continue forward; and another time where I swear I pressed the grab trigger but fell through my partners hands and died, having to restart a chase sequence. But other than that, the game is pretty bug free.\n\nThe reason the game feels like nobody playtested before launch is simply how unforgiving and frustrating it is to play…ALMOST ALL THE TIME.\n\nIt is a staple of the cinematic platformer genre to be a bit stupidly challenging at times. But I liked the most about the first Little Nightmares, or a game like Inside, is that after failing a test once, either because you didn’t pay attention, or because the game was being cruel in that instance (not a rare occurrence), you generally can pass the sequence the next time around, once you get it. These games also try to balance having tense situations, some slow controls, and giving the player some leeway to get out of it without dying. Because dying resets the tension to zero. And dying several times in a row transforms tension and thrill into frustration, and potentially anger (and then into sadness, and then the dark side).\n\nLittle Nightmares 2, on the other hand, does not give a sh*t about tension.\n\nThe game is of course filled to the brim with unwinnable situations on the first try; which, as I said, is par for the course in that genre; but they are also hardly passable on subsequent attempts. \n\nAt first glance, you might want to point to the controls. The combat “system” consists in placing your character carefully next to a usable pipe, hammer or axe, then letting the grab animation playing out for an eternity, then timing the swing of the thing that moves with the velocity of a slug taking a sh*t, and doing all this without the possibility of dodging. In the same vein, jumps are limp, delayed, full of inertia, as in they require a bit of a start up if you don’t want to jump where you are, instead of where you want to go. There is also a sprint that, combined with the crouch, can turn into a slide, although I struggled to get that consistently (let’s call it skill issue); and you can finally grab and climb. And you, of course, die in one shot. There is no surviving an attack in Little Nightmare 2.\n\nNow the issue isn’t necessarily in the sluggishness of the controls themselves: Inside and Little Nightmares are not exactly precision platformers and they make it work. No, the issue is the absurdity of the timings that the game demands in conjunction with these controls. \n\nThe combat system is all well and good at first, when it comes to just sneaking behind a porcelain kid and smashing its head off with a clean swing from behind. But when two, three kids in a row, running towards you, are starting to pile up during a chase sequence, the slow grab animation, and the extra slow build up animation to the swing are merciless, even when you actually understand the attack timing (YES, I KNOW YOU NEED TO PRESS A WHEN THEY START SCREAMING!). That is not even talking about the tiny spider type enemies that move fast as sh*t, granted with a huge pause before attacking, but that made for one of the worst combat situations of the whole game when you have to deal with two of them at the same time.\n\nThere is also a torch mechanic later, that I won’t spoil, where the game expects you to point properly in the right direction in sync with moving and it’s…it’s just such a pain.\n\nAs for the movements, you are very regularly thrown into chase or stealth sequences where the beauty of the detailed animations becomes the bane of your existence, because all these extra frames are just more opportunity to slow you down, when the game wants you to PICK-UP-THE-PACE-YOU-SNAIL. And these moments are not necessarily super hard, but they are really testing the limits of the reactivity you can have with these controls, generally ending up with 2 to 5 deaths, pretty much destroying any sense of pacing and engagement with the actual horrific situation.\n\nAnd I’m not even mad, as in, I never threw my controller (I mean, my controller is a Steam Deck so I’d be hard pressed to throw it anyway) or really shook my fist in the air. It is just…sad. It genuinely bums me out that there isn’t a “story” mode where the game would be more lenient with the timing and maybe just gets rid of half the enemies in the combat situations that don’t bring anything but frustration. That I’m stuck in a reality where this cool piece of visual horror storytelling, with some cool puzzles and great atmosphere is stuck between rage baits. This sequel to a game I really loved looks and sounds amazing, and was obviously made by talented people who put great care into making it. And I’m just heart broken they didn’t see they were ruining a large portion of it with a challenge that does not work with what the controls are.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game is frustrating compared to the first. It is not forgiving and requires you to die in order to complete each area exactly as the devs intended it. Many of the areas are not intuitive. For example in one area you must sprint, and another similar area you must sneak, but it's a coin toss to whether you pick the right one and die",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[h3]The controls are clumsy, the gameplay is boring. I don't understand why everyone praises this game.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "氛围感塑造的非常好。游戏难度一般，很多人说的恐怖到不见得，基本都是可以预见的恐怖套路。\r\n\r\n游戏在纯横版和能纵深操作的空间上不明确。这点上可能是设计问题。\r\n\r\n操作设计上中等偏下，而且在2025年还能如此经常的遇见物品消失BUG，只能怀疑开发团队技术实力有限。\r\n\r\n整体流程非常短，游戏荒的时候可以拿出来玩儿。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has some great setpieces, but also quite a few situations where the solution seems obvious and you just can't do it because the controls suck. The game is current sitting at 30€ undiscounted, which is absurdly high. Even discounted at 2/3 off I would tell you to wait for the price to drop further because of how short it is. \n\nI found the first game intriguing, but with this one I was just glad that it was over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How are people defending this game? Bad combat, bad mouse + keyboard controls. Only good thing is the art direction. \r\n\r\nGet it maybe on 90% discount!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautifully dark and atmospheric, suitably creepy, but too often is precision demanded when the controls can't accommodate.  Running, platforming, even navigating obstacles feels mucky, sticky, and overall it's hard to appreciate the horror of the game when you find yourself more frustrated by the controls than by the intended mechanics.  Put on headphones, play with the lights out, and be prepared to slog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you ever doubt that a side-scrolling, 2.5D game can scare you, \"Little Nightmares II\" is here to prove you wrong. The atmosphere, the tension and the events of this game can cause you more fear than some of the so-called big horror games. And it doesn't rely on jumpscares. Even the story and lore can be eerie and frightening.\nBut why am I giving \"Little Nightmares II\" a thumbs down? Simply because, however, I enjoyed the artistic part, the technical part was a pain. I played the enhanced version (there is another version which I never launched, so I don't know about it), yet I was having some major problems with it.\nThe first thing that really bugged me was random stuttering. Randomly, you would see the game stutters a bit and loses its smoothness. In some cases, even shaders don't load properly, and you will see objects blink while trying to load. I really don't know the reason, cause they usually happen in more peaceful, empty moments rather than the sequences in which lots of things happen. Changing the video setting doesn't seem to resolve it either. Probably something that is caused by the game engine, which is Unreal Engine.\nAnother big problem I had with \"Little Nightmares II\" was the fact that the protagonist would constantly get stuck in environments and objects of the maps. You want to pass through this door? You will get stuck to its frame. You want to crawl under this table? You will get stuck to its legs. Are you passing through this vent? The last part of it, you will get dragged on the ceiling, and your speed would be 1CM per second. This has caused so much pain in chase scenarios where you will get busted, and you will have to try over and over again to finally have a perfect run.\nThe need to be perfect is also another source of trouble. \"Little Nightmares II\" consists mostly of two gameplay mechanisms: puzzles and tense scenarios. Puzzles are obvious what they are. And even though they are challenging, they are not impossible, and at worst, you will need a few trial and errors to solve them. But tense scenarios are the scary parts of the games. Those are the moments you are running away or fighting. As I've said, the technical part of \"Little Nightmares II\" makes these moments quite frustrating.\nYou have to have a perfect run in order to pass a part of the game. Otherwise, you are stuck in it forever. The sticking into environments makes sure of that. Then there are the fighting scenes, which are unfair as they are, but the environments make it even harder and again, you constantly die and repeat till you finally get a perfect run. One mistake in any of these tense parts means death and checkpoint reload. Again, sticking to environments makes sure you will experience it a lot.\nThe technical problem persists in checkpoints, too. I know at least two places where checkpoints don't work properly, and the player is forced to reload again in order to proceed. One moment is when you open a door in the school chapter, but the camera doesn't follow you into the new room, yet you have reached the checkpoint. So you are forced to reload, so the camera is finally showing inside the room.\nThe other is in the hospital, where, after solving a puzzle and getting the key, you will unlock the door. For some reason, the game gets stuck here, without activating the checkpoint, and you are forced to reload the checkpoint, which is before the puzzle, solve the puzzle again and then proceed to the next room. Both of them happened to me twice, since I beat the game twice.\nAll in all, I can only say that \"Little Nightmares II\" could have been a great game, but the technical part has ruined the artistic part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was the most buggy game. froze and glitched every twenty seconds. Ive played lots of games and never had those issues not even with the first little nightmares. i really had no fun playing this one. i was so frustrated with the game freezing and the perfectness you have to do with timing and movement.  it took me way too long to finish this game because i didnt want to touch it for weeks but forced myself to finish so it wouldnt be a total waste of money. a game thats on all streaming devices needs to be easier to play on keyboard. i was excited but so disappointed and i dont know if ill take the chance with little nightmares three because of this... shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is prone to bugs that can force you to replay entire levels, especially since there’s no option to create backup saves. The controls are incredibly tedious, to the point where part of the “horror experience” becomes trying to get the character to respond the way you intend. I’m specifically referring to the awkward flashlight handling, the strange and unchangeable controller layout, the character’s inability to automatically step up minor elevation changes, and the lack of multidirectional climbing mechanics.\n\nIt’s the accumulation of small issues like these—never addressed during development—that makes the game feel like a chore to play. I won’t be completing this title; after the game bugged out at the end of the already frustrating Chapter 3 and prevented me from finishing it, I decided I’m done.\n\nI love the atmosphere, and it’s clear this installment aimed to introduce more complexity, but ultimately it falls short of the first game.\n\nEdit: completed the final chapter and the ending was a bit disappointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started this game once, but switched to something else. Then came back fresh after a couple of months and couldn't solve the hand puzzle, it felt so arbitrary and intuitive in a bad, Sierra way that I just uninstalled the game. I don't have patience for bad game design anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game breaking bug half-way through the game: I couldn't progress because the required item doesn't spawn. Fucking ridiculous. Fix your dogwater game. I can't believe I paid for this crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Softlocks where necessary items just don't spawn in are really frequent. They can't be fixed by reloading checkpoints or relaunching the game. You have to redo entire levels repeatedly until you get lucky and they actually show up. I'm only a bit over 3 chapters into the game and almost a third of my time has been spent reloading saves and redoing areas I already beat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lovely sequel of the first one, but the controls of this installment are just dogsh***, no matter if you use mouse & keyboard or controller, be prepared to get tilted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You got to be a psyco to enjoy this game. This is a quite disturbing story of a child, that's at least how I percieve it. It's horrible masterpiece. Do not buy. Play something more cheerful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk guys... I've played the first one time a long time ago and I don't remember much of it (I remember terrible loading times on switch perfectly:)) and that one feels like such an upgrade. I like the themes, the mechanics (at least most of them) and most of all the presentation. First ~two levels are wonderful but then it kind of went downward spiral for me.. Many physics and collision glitches made me restart from last checkpoint more than a couple of times and booby traps, while funny for a first time, becomes irritating and pointless after a while. I feel like dark cartoony-like graphics and cinematic presentation stand in opposite to this Limbo-like style of gameplay where sometimes you're supposed to die for the first time. Iiidk, maybe it's skill issue lol but I feel like it could be so much better and more polished, especially when it's the sequel",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. Molasses-based physics. Frustrating to control.\r\n\r\nTry to solve an obvious puzzle. An object that is part of the puzzle won't cooperate. Okay maybe this isn't it after all... Time to explore, try other things. Waste a lot of time. Only then go back and it was the first object after all. I just wasn't touching the pixels right, I guess. This happened a lot.\r\n\r\nCombat? Also incredibly slow and hard to control. The enemies are of course lightning fast.\r\n\r\nChase scenes? If the baddies wanna catch you, they will. Their hands will suck you in and catch you even if you weren't anywhere near them.\r\n\r\nFail any of the things above, go back to the checkpoint which is always a couple screens back. I repeated a lot of pointless shit.\r\n\r\nThe first game was great and it's what made me get this one. I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a nice try.  Unfortunately they added too much 'action' gameplay with combat that feels like a drag given the sluggish unresponsive controls. The first one was better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game breaking bug in one of the opening puzzles. Seems many others experience it too.  How does that make it to release. and still not be patched now? Requires full restart to fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Liked the first game.  This one has great graphics, but I just got tired of not knowing what to do and trying different things until I stopped dying.  There's no skill involved in that.  Won't be buying the third one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eerie and atmospheric, but playing back-to-back off the first game revealed to me that this game is a bit on the tedious side and isn't quite as stable. Controls feel \"off\" at best and are incredibly frustrating otherwise. Had to put the game down for a while near the middle because it simply wasn't fun to play, and even the unsettling yet beautiful environments weren't enough to keep me engaged through unpleasant gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seriously no Couch Co-op. Huge Disappointment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst fucking controls I've ever seen in ANY video games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jeu de merde",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere is great but, when you have no intuitiveness on your controls in your game along with having to do absolutely everything manually and hold the games hand like a small child is when its not fun anymore and just a chore. The amount of times I've died to getting caught by a pixel or my character not crouching/sliding on just refusing to crouch and walk forward was enough for me to actually write a review. \n\nThe atmosphere, the environment and design all looks fantastic. I loved the first game and this expanded on that but, it is overshadowed by the random dogwater controls that absolutely ruin it. Having to die 7 times because my character bumped into the pixel of an inanimate object is infuriating when it keeps happening but, on different objects! I'm sure I'll finish the game eventually but, being absolutely distraught because I didn't do anything wrong really seals the -Do not recommend without at least a hefty sale- review.\n\nEdit: After finishing the game... honestly don't even buy it just watch someone run through it in about 3.5 hours and save your money. The atmosphere and horror aspects are fantastic that are held back by horrible interaction and controls.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately, Little Nightmares II lost what made the first game special for me. Instead of that slow, creeping dread, it keeps throwing in loud set-pieces and timing-based chases. By the third “run-die-repeat” sequence, the tension turns into routine and the mood breaks. The world and lore are still fantastic, but the action-heavy pacing drowns out the magic",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "It pains me greatly to give a thumb down to what is a gorgeous and carefully made piece of horror. Especially after a first episode I am very fond of. But the reality is, after finishing the game, I think Little Nightmare II is more trouble than it's worth.\n\nThat is, I realize it, saying a lot from the outside looking in, when presented with the incredibly nuanced and creative art direction; an art direction that manages to continuously surprise, even when staying monochrome, cool colors, mostly dark blues, with little kids and big monsters as a main concept. The monsters are grotesque and unnerving. The animations are masterfully done to make the whole cast move as expected and unexpected, depending if we’re looking at heroes or foes. \n\nThe sound design is also excellent…like genuinely some of the best work I’ve heard in horror games, which is a high praise, since the genre is well known for excelling in that precise department. And the music is ominous, ambient and sometimes melancholic and melodic.\n\nAnd all that is used in service of a purely visual and auditory narration: no voices, no written words, just animations and actions. The story is also…it’s good? From what I could gather on one playthrough, it is vague enough that you have to feel the blanks, but still not too abstract to be comprehensible even without words. I’m sure there is more to dig in…\n\n…that is if you actually want to play and replay the game. The issue being, the game feels like it was not playtested.\n\nI want to make clear that I respect the work of game devs a lot, and I am not saying this in an hyperbolic “it’s a buggy mess, these devs are so lazy these days” kind of way. For one, because I had a relatively bug free experience: there was one instance where I had to try from the last checkpoint because a script had not spawned the fuse that was required to continue forward; and another time where I swear I pressed the grab trigger but fell through my partners hands and died, having to restart a chase sequence. But other than that, the game is pretty bug free.\n\nThe reason the game feels like nobody playtested before launch is simply how unforgiving and frustrating it is to play…ALMOST ALL THE TIME.\n\nIt is a staple of the cinematic platformer genre to be a bit stupidly challenging at times. But I liked the most about the first Little Nightmares, or a game like Inside, is that after failing a test once, either because you didn’t pay attention, or because the game was being cruel in that instance (not a rare occurrence), you generally can pass the sequence the next time around, once you get it. These games also try to balance having tense situations, some slow controls, and giving the player some leeway to get out of it without dying. Because dying resets the tension to zero. And dying several times in a row transforms tension and thrill into frustration, and potentially anger (and then into sadness, and then the dark side).\n\nLittle Nightmares 2, on the other hand, does not give a sh*t about tension.\n\nThe game is of course filled to the brim with unwinnable situations on the first try; which, as I said, is par for the course in that genre; but they are also hardly passable on subsequent attempts. \n\nAt first glance, you might want to point to the controls. The combat “system” consists in placing your character carefully next to a usable pipe, hammer or axe, then letting the grab animation playing out for an eternity, then timing the swing of the thing that moves with the velocity of a slug taking a sh*t, and doing all this without the possibility of dodging. In the same vein, jumps are limp, delayed, full of inertia, as in they require a bit of a start up if you don’t want to jump where you are, instead of where you want to go. There is also a sprint that, combined with the crouch, can turn into a slide, although I struggled to get that consistently (let’s call it skill issue); and you can finally grab and climb. And you, of course, die in one shot. There is no surviving an attack in Little Nightmare 2.\n\nNow the issue isn’t necessarily in the sluggishness of the controls themselves: Inside and Little Nightmares are not exactly precision platformers and they make it work. No, the issue is the absurdity of the timings that the game demands in conjunction with these controls. \n\nThe combat system is all well and good at first, when it comes to just sneaking behind a porcelain kid and smashing its head off with a clean swing from behind. But when two, three kids in a row, running towards you, are starting to pile up during a chase sequence, the slow grab animation, and the extra slow build up animation to the swing are merciless, even when you actually understand the attack timing (YES, I KNOW YOU NEED TO PRESS A WHEN THEY START SCREAMING!). That is not even talking about the tiny spider type enemies that move fast as sh*t, granted with a huge pause before attacking, but that made for one of the worst combat situations of the whole game when you have to deal with two of them at the same time.\n\nThere is also a torch mechanic later, that I won’t spoil, where the game expects you to point properly in the right direction in sync with moving and it’s…it’s just such a pain.\n\nAs for the movements, you are very regularly thrown into chase or stealth sequences where the beauty of the detailed animations becomes the bane of your existence, because all these extra frames are just more opportunity to slow you down, when the game wants you to PICK-UP-THE-PACE-YOU-SNAIL. And these moments are not necessarily super hard, but they are really testing the limits of the reactivity you can have with these controls, generally ending up with 2 to 5 deaths, pretty much destroying any sense of pacing and engagement with the actual horrific situation.\n\nAnd I’m not even mad, as in, I never threw my controller (I mean, my controller is a Steam Deck so I’d be hard pressed to throw it anyway) or really shook my fist in the air. It is just…sad. It genuinely bums me out that there isn’t a “story” mode where the game would be more lenient with the timing and maybe just gets rid of half the enemies in the combat situations that don’t bring anything but frustration. That I’m stuck in a reality where this cool piece of visual horror storytelling, with some cool puzzles and great atmosphere is stuck between rage baits. This sequel to a game I really loved looks and sounds amazing, and was obviously made by talented people who put great care into making it. And I’m just heart broken they didn’t see they were ruining a large portion of it with a challenge that does not work with what the controls are.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game is frustrating compared to the first. It is not forgiving and requires you to die in order to complete each area exactly as the devs intended it. Many of the areas are not intuitive. For example in one area you must sprint, and another similar area you must sneak, but it's a coin toss to whether you pick the right one and die",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[h3]The controls are clumsy, the gameplay is boring. I don't understand why everyone praises this game.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "氛围感塑造的非常好。游戏难度一般，很多人说的恐怖到不见得，基本都是可以预见的恐怖套路。\r\n\r\n游戏在纯横版和能纵深操作的空间上不明确。这点上可能是设计问题。\r\n\r\n操作设计上中等偏下，而且在2025年还能如此经常的遇见物品消失BUG，只能怀疑开发团队技术实力有限。\r\n\r\n整体流程非常短，游戏荒的时候可以拿出来玩儿。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has some great setpieces, but also quite a few situations where the solution seems obvious and you just can't do it because the controls suck. The game is current sitting at 30€ undiscounted, which is absurdly high. Even discounted at 2/3 off I would tell you to wait for the price to drop further because of how short it is. \n\nI found the first game intriguing, but with this one I was just glad that it was over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How are people defending this game? Bad combat, bad mouse + keyboard controls. Only good thing is the art direction. \r\n\r\nGet it maybe on 90% discount!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautifully dark and atmospheric, suitably creepy, but too often is precision demanded when the controls can't accommodate.  Running, platforming, even navigating obstacles feels mucky, sticky, and overall it's hard to appreciate the horror of the game when you find yourself more frustrated by the controls than by the intended mechanics.  Put on headphones, play with the lights out, and be prepared to slog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you ever doubt that a side-scrolling, 2.5D game can scare you, \"Little Nightmares II\" is here to prove you wrong. The atmosphere, the tension and the events of this game can cause you more fear than some of the so-called big horror games. And it doesn't rely on jumpscares. Even the story and lore can be eerie and frightening.\nBut why am I giving \"Little Nightmares II\" a thumbs down? Simply because, however, I enjoyed the artistic part, the technical part was a pain. I played the enhanced version (there is another version which I never launched, so I don't know about it), yet I was having some major problems with it.\nThe first thing that really bugged me was random stuttering. Randomly, you would see the game stutters a bit and loses its smoothness. In some cases, even shaders don't load properly, and you will see objects blink while trying to load. I really don't know the reason, cause they usually happen in more peaceful, empty moments rather than the sequences in which lots of things happen. Changing the video setting doesn't seem to resolve it either. Probably something that is caused by the game engine, which is Unreal Engine.\nAnother big problem I had with \"Little Nightmares II\" was the fact that the protagonist would constantly get stuck in environments and objects of the maps. You want to pass through this door? You will get stuck to its frame. You want to crawl under this table? You will get stuck to its legs. Are you passing through this vent? The last part of it, you will get dragged on the ceiling, and your speed would be 1CM per second. This has caused so much pain in chase scenarios where you will get busted, and you will have to try over and over again to finally have a perfect run.\nThe need to be perfect is also another source of trouble. \"Little Nightmares II\" consists mostly of two gameplay mechanisms: puzzles and tense scenarios. Puzzles are obvious what they are. And even though they are challenging, they are not impossible, and at worst, you will need a few trial and errors to solve them. But tense scenarios are the scary parts of the games. Those are the moments you are running away or fighting. As I've said, the technical part of \"Little Nightmares II\" makes these moments quite frustrating.\nYou have to have a perfect run in order to pass a part of the game. Otherwise, you are stuck in it forever. The sticking into environments makes sure of that. Then there are the fighting scenes, which are unfair as they are, but the environments make it even harder and again, you constantly die and repeat till you finally get a perfect run. One mistake in any of these tense parts means death and checkpoint reload. Again, sticking to environments makes sure you will experience it a lot.\nThe technical problem persists in checkpoints, too. I know at least two places where checkpoints don't work properly, and the player is forced to reload again in order to proceed. One moment is when you open a door in the school chapter, but the camera doesn't follow you into the new room, yet you have reached the checkpoint. So you are forced to reload, so the camera is finally showing inside the room.\nThe other is in the hospital, where, after solving a puzzle and getting the key, you will unlock the door. For some reason, the game gets stuck here, without activating the checkpoint, and you are forced to reload the checkpoint, which is before the puzzle, solve the puzzle again and then proceed to the next room. Both of them happened to me twice, since I beat the game twice.\nAll in all, I can only say that \"Little Nightmares II\" could have been a great game, but the technical part has ruined the artistic part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was the most buggy game. froze and glitched every twenty seconds. Ive played lots of games and never had those issues not even with the first little nightmares. i really had no fun playing this one. i was so frustrated with the game freezing and the perfectness you have to do with timing and movement.  it took me way too long to finish this game because i didnt want to touch it for weeks but forced myself to finish so it wouldnt be a total waste of money. a game thats on all streaming devices needs to be easier to play on keyboard. i was excited but so disappointed and i dont know if ill take the chance with little nightmares three because of this... shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is prone to bugs that can force you to replay entire levels, especially since there’s no option to create backup saves. The controls are incredibly tedious, to the point where part of the “horror experience” becomes trying to get the character to respond the way you intend. I’m specifically referring to the awkward flashlight handling, the strange and unchangeable controller layout, the character’s inability to automatically step up minor elevation changes, and the lack of multidirectional climbing mechanics.\n\nIt’s the accumulation of small issues like these—never addressed during development—that makes the game feel like a chore to play. I won’t be completing this title; after the game bugged out at the end of the already frustrating Chapter 3 and prevented me from finishing it, I decided I’m done.\n\nI love the atmosphere, and it’s clear this installment aimed to introduce more complexity, but ultimately it falls short of the first game.\n\nEdit: completed the final chapter and the ending was a bit disappointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started this game once, but switched to something else. Then came back fresh after a couple of months and couldn't solve the hand puzzle, it felt so arbitrary and intuitive in a bad, Sierra way that I just uninstalled the game. I don't have patience for bad game design anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game breaking bug half-way through the game: I couldn't progress because the required item doesn't spawn. Fucking ridiculous. Fix your dogwater game. I can't believe I paid for this crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Softlocks where necessary items just don't spawn in are really frequent. They can't be fixed by reloading checkpoints or relaunching the game. You have to redo entire levels repeatedly until you get lucky and they actually show up. I'm only a bit over 3 chapters into the game and almost a third of my time has been spent reloading saves and redoing areas I already beat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lovely sequel of the first one, but the controls of this installment are just dogsh***, no matter if you use mouse & keyboard or controller, be prepared to get tilted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You got to be a psyco to enjoy this game. This is a quite disturbing story of a child, that's at least how I percieve it. It's horrible masterpiece. Do not buy. Play something more cheerful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk guys... I've played the first one time a long time ago and I don't remember much of it (I remember terrible loading times on switch perfectly:)) and that one feels like such an upgrade. I like the themes, the mechanics (at least most of them) and most of all the presentation. First ~two levels are wonderful but then it kind of went downward spiral for me.. Many physics and collision glitches made me restart from last checkpoint more than a couple of times and booby traps, while funny for a first time, becomes irritating and pointless after a while. I feel like dark cartoony-like graphics and cinematic presentation stand in opposite to this Limbo-like style of gameplay where sometimes you're supposed to die for the first time. Iiidk, maybe it's skill issue lol but I feel like it could be so much better and more polished, especially when it's the sequel",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. Molasses-based physics. Frustrating to control.\r\n\r\nTry to solve an obvious puzzle. An object that is part of the puzzle won't cooperate. Okay maybe this isn't it after all... Time to explore, try other things. Waste a lot of time. Only then go back and it was the first object after all. I just wasn't touching the pixels right, I guess. This happened a lot.\r\n\r\nCombat? Also incredibly slow and hard to control. The enemies are of course lightning fast.\r\n\r\nChase scenes? If the baddies wanna catch you, they will. Their hands will suck you in and catch you even if you weren't anywhere near them.\r\n\r\nFail any of the things above, go back to the checkpoint which is always a couple screens back. I repeated a lot of pointless shit.\r\n\r\nThe first game was great and it's what made me get this one. I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a nice try.  Unfortunately they added too much 'action' gameplay with combat that feels like a drag given the sluggish unresponsive controls. The first one was better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game breaking bug in one of the opening puzzles. Seems many others experience it too.  How does that make it to release. and still not be patched now? Requires full restart to fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Liked the first game.  This one has great graphics, but I just got tired of not knowing what to do and trying different things until I stopped dying.  There's no skill involved in that.  Won't be buying the third one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eerie and atmospheric, but playing back-to-back off the first game revealed to me that this game is a bit on the tedious side and isn't quite as stable. Controls feel \"off\" at best and are incredibly frustrating otherwise. Had to put the game down for a while near the middle because it simply wasn't fun to play, and even the unsettling yet beautiful environments weren't enough to keep me engaged through unpleasant gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seriously no Couch Co-op. Huge Disappointment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst fucking controls I've ever seen in ANY video games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "jeu de merde",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere is great but, when you have no intuitiveness on your controls in your game along with having to do absolutely everything manually and hold the games hand like a small child is when its not fun anymore and just a chore. The amount of times I've died to getting caught by a pixel or my character not crouching/sliding on just refusing to crouch and walk forward was enough for me to actually write a review. \n\nThe atmosphere, the environment and design all looks fantastic. I loved the first game and this expanded on that but, it is overshadowed by the random dogwater controls that absolutely ruin it. Having to die 7 times because my character bumped into the pixel of an inanimate object is infuriating when it keeps happening but, on different objects! I'm sure I'll finish the game eventually but, being absolutely distraught because I didn't do anything wrong really seals the -Do not recommend without at least a hefty sale- review.\n\nEdit: After finishing the game... honestly don't even buy it just watch someone run through it in about 3.5 hours and save your money. The atmosphere and horror aspects are fantastic that are held back by horrible interaction and controls.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately, Little Nightmares II lost what made the first game special for me. Instead of that slow, creeping dread, it keeps throwing in loud set-pieces and timing-based chases. By the third “run-die-repeat” sequence, the tension turns into routine and the mood breaks. The world and lore are still fantastic, but the action-heavy pacing drowns out the magic",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "It pains me greatly to give a thumb down to what is a gorgeous and carefully made piece of horror. Especially after a first episode I am very fond of. But the reality is, after finishing the game, I think Little Nightmare II is more trouble than it's worth.\n\nThat is, I realize it, saying a lot from the outside looking in, when presented with the incredibly nuanced and creative art direction; an art direction that manages to continuously surprise, even when staying monochrome, cool colors, mostly dark blues, with little kids and big monsters as a main concept. The monsters are grotesque and unnerving. The animations are masterfully done to make the whole cast move as expected and unexpected, depending if we’re looking at heroes or foes. \n\nThe sound design is also excellent…like genuinely some of the best work I’ve heard in horror games, which is a high praise, since the genre is well known for excelling in that precise department. And the music is ominous, ambient and sometimes melancholic and melodic.\n\nAnd all that is used in service of a purely visual and auditory narration: no voices, no written words, just animations and actions. The story is also…it’s good? From what I could gather on one playthrough, it is vague enough that you have to feel the blanks, but still not too abstract to be comprehensible even without words. I’m sure there is more to dig in…\n\n…that is if you actually want to play and replay the game. The issue being, the game feels like it was not playtested.\n\nI want to make clear that I respect the work of game devs a lot, and I am not saying this in an hyperbolic “it’s a buggy mess, these devs are so lazy these days” kind of way. For one, because I had a relatively bug free experience: there was one instance where I had to try from the last checkpoint because a script had not spawned the fuse that was required to continue forward; and another time where I swear I pressed the grab trigger but fell through my partners hands and died, having to restart a chase sequence. But other than that, the game is pretty bug free.\n\nThe reason the game feels like nobody playtested before launch is simply how unforgiving and frustrating it is to play…ALMOST ALL THE TIME.\n\nIt is a staple of the cinematic platformer genre to be a bit stupidly challenging at times. But I liked the most about the first Little Nightmares, or a game like Inside, is that after failing a test once, either because you didn’t pay attention, or because the game was being cruel in that instance (not a rare occurrence), you generally can pass the sequence the next time around, once you get it. These games also try to balance having tense situations, some slow controls, and giving the player some leeway to get out of it without dying. Because dying resets the tension to zero. And dying several times in a row transforms tension and thrill into frustration, and potentially anger (and then into sadness, and then the dark side).\n\nLittle Nightmares 2, on the other hand, does not give a sh*t about tension.\n\nThe game is of course filled to the brim with unwinnable situations on the first try; which, as I said, is par for the course in that genre; but they are also hardly passable on subsequent attempts. \n\nAt first glance, you might want to point to the controls. The combat “system” consists in placing your character carefully next to a usable pipe, hammer or axe, then letting the grab animation playing out for an eternity, then timing the swing of the thing that moves with the velocity of a slug taking a sh*t, and doing all this without the possibility of dodging. In the same vein, jumps are limp, delayed, full of inertia, as in they require a bit of a start up if you don’t want to jump where you are, instead of where you want to go. There is also a sprint that, combined with the crouch, can turn into a slide, although I struggled to get that consistently (let’s call it skill issue); and you can finally grab and climb. And you, of course, die in one shot. There is no surviving an attack in Little Nightmare 2.\n\nNow the issue isn’t necessarily in the sluggishness of the controls themselves: Inside and Little Nightmares are not exactly precision platformers and they make it work. No, the issue is the absurdity of the timings that the game demands in conjunction with these controls. \n\nThe combat system is all well and good at first, when it comes to just sneaking behind a porcelain kid and smashing its head off with a clean swing from behind. But when two, three kids in a row, running towards you, are starting to pile up during a chase sequence, the slow grab animation, and the extra slow build up animation to the swing are merciless, even when you actually understand the attack timing (YES, I KNOW YOU NEED TO PRESS A WHEN THEY START SCREAMING!). That is not even talking about the tiny spider type enemies that move fast as sh*t, granted with a huge pause before attacking, but that made for one of the worst combat situations of the whole game when you have to deal with two of them at the same time.\n\nThere is also a torch mechanic later, that I won’t spoil, where the game expects you to point properly in the right direction in sync with moving and it’s…it’s just such a pain.\n\nAs for the movements, you are very regularly thrown into chase or stealth sequences where the beauty of the detailed animations becomes the bane of your existence, because all these extra frames are just more opportunity to slow you down, when the game wants you to PICK-UP-THE-PACE-YOU-SNAIL. And these moments are not necessarily super hard, but they are really testing the limits of the reactivity you can have with these controls, generally ending up with 2 to 5 deaths, pretty much destroying any sense of pacing and engagement with the actual horrific situation.\n\nAnd I’m not even mad, as in, I never threw my controller (I mean, my controller is a Steam Deck so I’d be hard pressed to throw it anyway) or really shook my fist in the air. It is just…sad. It genuinely bums me out that there isn’t a “story” mode where the game would be more lenient with the timing and maybe just gets rid of half the enemies in the combat situations that don’t bring anything but frustration. That I’m stuck in a reality where this cool piece of visual horror storytelling, with some cool puzzles and great atmosphere is stuck between rage baits. This sequel to a game I really loved looks and sounds amazing, and was obviously made by talented people who put great care into making it. And I’m just heart broken they didn’t see they were ruining a large portion of it with a challenge that does not work with what the controls are.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game is frustrating compared to the first. It is not forgiving and requires you to die in order to complete each area exactly as the devs intended it. Many of the areas are not intuitive. For example in one area you must sprint, and another similar area you must sneak, but it's a coin toss to whether you pick the right one and die",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[h3]The controls are clumsy, the gameplay is boring. I don't understand why everyone praises this game.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "氛围感塑造的非常好。游戏难度一般，很多人说的恐怖到不见得，基本都是可以预见的恐怖套路。\r\n\r\n游戏在纯横版和能纵深操作的空间上不明确。这点上可能是设计问题。\r\n\r\n操作设计上中等偏下，而且在2025年还能如此经常的遇见物品消失BUG，只能怀疑开发团队技术实力有限。\r\n\r\n整体流程非常短，游戏荒的时候可以拿出来玩儿。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has some great setpieces, but also quite a few situations where the solution seems obvious and you just can't do it because the controls suck. The game is current sitting at 30€ undiscounted, which is absurdly high. Even discounted at 2/3 off I would tell you to wait for the price to drop further because of how short it is. \n\nI found the first game intriguing, but with this one I was just glad that it was over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How are people defending this game? Bad combat, bad mouse + keyboard controls. Only good thing is the art direction. \r\n\r\nGet it maybe on 90% discount!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautifully dark and atmospheric, suitably creepy, but too often is precision demanded when the controls can't accommodate.  Running, platforming, even navigating obstacles feels mucky, sticky, and overall it's hard to appreciate the horror of the game when you find yourself more frustrated by the controls than by the intended mechanics.  Put on headphones, play with the lights out, and be prepared to slog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you ever doubt that a side-scrolling, 2.5D game can scare you, \"Little Nightmares II\" is here to prove you wrong. The atmosphere, the tension and the events of this game can cause you more fear than some of the so-called big horror games. And it doesn't rely on jumpscares. Even the story and lore can be eerie and frightening.\nBut why am I giving \"Little Nightmares II\" a thumbs down? Simply because, however, I enjoyed the artistic part, the technical part was a pain. I played the enhanced version (there is another version which I never launched, so I don't know about it), yet I was having some major problems with it.\nThe first thing that really bugged me was random stuttering. Randomly, you would see the game stutters a bit and loses its smoothness. In some cases, even shaders don't load properly, and you will see objects blink while trying to load. I really don't know the reason, cause they usually happen in more peaceful, empty moments rather than the sequences in which lots of things happen. Changing the video setting doesn't seem to resolve it either. Probably something that is caused by the game engine, which is Unreal Engine.\nAnother big problem I had with \"Little Nightmares II\" was the fact that the protagonist would constantly get stuck in environments and objects of the maps. You want to pass through this door? You will get stuck to its frame. You want to crawl under this table? You will get stuck to its legs. Are you passing through this vent? The last part of it, you will get dragged on the ceiling, and your speed would be 1CM per second. This has caused so much pain in chase scenarios where you will get busted, and you will have to try over and over again to finally have a perfect run.\nThe need to be perfect is also another source of trouble. \"Little Nightmares II\" consists mostly of two gameplay mechanisms: puzzles and tense scenarios. Puzzles are obvious what they are. And even though they are challenging, they are not impossible, and at worst, you will need a few trial and errors to solve them. But tense scenarios are the scary parts of the games. Those are the moments you are running away or fighting. As I've said, the technical part of \"Little Nightmares II\" makes these moments quite frustrating.\nYou have to have a perfect run in order to pass a part of the game. Otherwise, you are stuck in it forever. The sticking into environments makes sure of that. Then there are the fighting scenes, which are unfair as they are, but the environments make it even harder and again, you constantly die and repeat till you finally get a perfect run. One mistake in any of these tense parts means death and checkpoint reload. Again, sticking to environments makes sure you will experience it a lot.\nThe technical problem persists in checkpoints, too. I know at least two places where checkpoints don't work properly, and the player is forced to reload again in order to proceed. One moment is when you open a door in the school chapter, but the camera doesn't follow you into the new room, yet you have reached the checkpoint. So you are forced to reload, so the camera is finally showing inside the room.\nThe other is in the hospital, where, after solving a puzzle and getting the key, you will unlock the door. For some reason, the game gets stuck here, without activating the checkpoint, and you are forced to reload the checkpoint, which is before the puzzle, solve the puzzle again and then proceed to the next room. Both of them happened to me twice, since I beat the game twice.\nAll in all, I can only say that \"Little Nightmares II\" could have been a great game, but the technical part has ruined the artistic part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was the most buggy game. froze and glitched every twenty seconds. Ive played lots of games and never had those issues not even with the first little nightmares. i really had no fun playing this one. i was so frustrated with the game freezing and the perfectness you have to do with timing and movement.  it took me way too long to finish this game because i didnt want to touch it for weeks but forced myself to finish so it wouldnt be a total waste of money. a game thats on all streaming devices needs to be easier to play on keyboard. i was excited but so disappointed and i dont know if ill take the chance with little nightmares three because of this... shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is prone to bugs that can force you to replay entire levels, especially since there’s no option to create backup saves. The controls are incredibly tedious, to the point where part of the “horror experience” becomes trying to get the character to respond the way you intend. I’m specifically referring to the awkward flashlight handling, the strange and unchangeable controller layout, the character’s inability to automatically step up minor elevation changes, and the lack of multidirectional climbing mechanics.\n\nIt’s the accumulation of small issues like these—never addressed during development—that makes the game feel like a chore to play. I won’t be completing this title; after the game bugged out at the end of the already frustrating Chapter 3 and prevented me from finishing it, I decided I’m done.\n\nI love the atmosphere, and it’s clear this installment aimed to introduce more complexity, but ultimately it falls short of the first game.\n\nEdit: completed the final chapter and the ending was a bit disappointing",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}