{
  "positive": [
    {
      "review": "EN:\nGranblue Fantasy is a great RPG with quite a great amount of content; however, the game still has several issues. I will give the details about what exactly this game is.\n\nGameplay:\nThe gameplay for this game is a mix between Tales of Arise and Monster Hunter series. The combat feels like Tales of Aries, while the feature of the game is just like Monster Hunter series, and what exactly am I meant for? well for the combat just like tales of arise where you can do perfect dodge, cast some spells, do finishing move alone or with groups you will understand what I meant if you play tales of arise and now for the feature like I mention just like monster hunter you either hunt a boss or just hunt a small foes this get items and sigils the item function just like monster hunter to build a new weapons however in this game there is no armor to increase your defense to increase the defense the player need to level up the charters or find the right sigil oh and I need to mention two things first just like monster hunter the fun is when you using a differences weapon but in this game you need to use different characters because the moveset is different for each characters and second for sigils is just like jewel in monster hunter to add or increase skills\n\n\nStory:\nWell, I can’t say anything about the story, but the story of this game is, let’s just say okay, not bad, but also not good, it’s just okay, typical of friendship and rescuing your friend from the bad guy. The story goes around 12 hours, if I'm not mistaken\n\n\nContents:\nWell, the contents in this game, I say around 100 hours if you really care to defeat the super final boss, but to be honest, the content feels even less from base monster hunter content\n\n\nMultiplayer/Online:\nFor the Multiplayer, I can still find any active players, especially JP and KR players however, most of them are already at level max and overpower, so it’s hard to find a beginner player. So for me, you can enjoy the multiplayer aspect in the end-game content.\n\nBug and Glitch:\nI don’t know if it’s a bug or not, but my GPU is hot and the fps drops every time the player is close or talk to the npc and for some reason, when entering the combat zone with intense stuff, the GPU is just not hot and normal for gaming so it’s just when the player talk or close to npc the issue start\n\n\nOverall:\n\nThis is a great game I recommend for full price or discount however if you expect to find someone in lobby for multiplayer aspect you can still find it but like I mention most of them already at the end game and for story it’s okay not good and not bad the fun for this game is from the boss and difference playable characters and for graphics it’s good the model and the effect of spell, attack and finishing move looks amazing and don’t forget about the bug drop fps and hot GPU when talk or close to npc.\n\nJP:\nグランブルーファンタジーは、非常に充実したコンテンツを備えた素晴らしいRPGです。しかし、いくつか問題点も抱えています。このゲームがどのようなものなのか、詳しく説明します。\n\nゲームプレイ：\nこのゲームのゲームプレイは、「テイルズ オブ アライズ」と「モンスターハンター」シリーズを融合させたような感じですね。戦闘は「テイルズ オブ アリエス」を彷彿とさせますが、ゲームシステムは「モンスターハンター」シリーズそのもの。一体何を目的にプレイしているのでしょうか？戦闘に関しては、テイルズ オブ アライズのように、完璧な回避、呪文の詠唱、フィニッシュムーブを一人でもグループでも繰り出せるので、テイルズ オブ アライズをプレイしていれば、私の言いたいことがお分かりいただけると思います。そして、先ほども触れた機能についてですが、モンスターハンターのようにボスを倒すか、ちょっとした敵を倒すかのどちらかです。アイテムや印章はモンスターハンターのように新しい武器を作るためのアイテム機能ですが、このゲームには防御力を高めるための防具がありません。防御力を高めるには、プレイヤーはチャーターをレベルアップするか、適切な印章を見つける必要があります。そうそう、2つほど付け加えておきたいことがあります。まず、モンスターハンターのように異なる武器を使うのが楽しいですが、このゲームではキャラクターごとに動きが異なるため、異なるキャラクターを使う必要があります。そして、印章はモンスターハンターの宝石のように、スキルを追加したり強化したりするためのものです。\n\nストーリー：\nストーリーについては何も言えませんが、このゲームのストーリーはまあまあといったところです。悪くはないですが、良いわけでもありません。まあまあといったところです。典型的な友情の物語です。悪者から仲間を救出するストーリー。私の記憶が正しければ、ストーリーは約12時間です。\n\nコンテンツ：\nええと、このゲームのコンテンツは、スーパーラスボスを倒すのに本気で取り組めば100時間くらいかかると思いますが、正直言って、モンスターハンターのベースコンテンツよりもコンテンツが少なめに感じます。\n\nマルチプレイ/オンライン：\nマルチプレイに関しては、特にJPとKRのプレイヤーを中心に、アクティブなプレイヤーはまだ見つかりますが、ほとんどのプレイヤーは既にレベルマックスで圧倒的な強さを誇っているので、初心者プレイヤーを見つけるのは難しいです。なので、個人的には、マルチプレイはエンドコンテンツで楽しめると思います。\n\nバグと不具合:\nバグかどうかは分かりませんが、GPUが熱くなり、プレイヤーがNPCに近づいたり話しかけたりするたびにフレームレートが低下します。なぜか、激しい戦闘シーンのある戦闘ゾーンに入るとGPUは熱くならず、ゲームプレイには問題ない状態です。問題はプレイヤーがNPCに近づいたり話しかけたりした時に発生します。\n\n総合的に:\n\nこのゲームは素晴らしいので、定価でも割引価格でもお勧めします。ただし、マルチプレイヤーのためにロビーで誰かを見つけることを期待しているなら、それでも見つかります。しかし、前述したように、ほとんどの人は既にエンドゲームで既に登場しています。ストーリーはまあまあで、良くも悪くもありません。このゲームの面白さはボスや個性的なプレイアブルキャラクターにあります。グラフィックは良好で、モデルや呪文、攻撃、フィニッシュムーブのエフェクトは素晴らしく、NPCに近づいたり話しかけたりするとフレームレートが低下し、GPUが熱くなるというバグも忘れてはいけません",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "The game burned pretty bright, but it didn't burn for very long. Nowadays you best look to this game for its single player experience. I played through the game in its entirety during the first few weeks of release and it was a blast. \n\nThere is a bit of a grind so if not fond of doing the same thing over and over to get specific drops this game is not going to be the one to change your mind. Now that the player base has dropped off you will likely be grinding by yourself as well. IT ran smoothly, the moves were flashy, the characters were fun to play with each having their own strengths and weaknesses and of course it being a multiplayer focused grind game there are \"Metas\"  \n\nIf you have played Monster Hunter or Toukiden that is effectively what this games EndGame boils down to though which is fine when in groups but solo, it can become a real grind that gets real boring real fast by the time the new characters were released people had already moved on to something different. There are mods for the game too if you need something besides the gameplay to keep you locked in. \n\nTLDR: The game ran its course a few weeks after release but has a decent single player experience behind it. If you don't mind playing solo through a game clearly meant for groups or an endgame built for multiplayer grinding give it a shot. If you are not interested in any of that. Skip it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Anime monster hunter. Sadly multiplayer seems to be dead. Still a lot of fun though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An amazing experience from beginning to end. Great story and great gameplay.\n\nI enjoyed every second of this, from the first quest to fighting the most difficult bosses.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Granblue Fantasy: Relink is a fantastic game, absolutely worth playing!\n\nIt's a shame that it's not being updated any longer, however it's still an amazingly fun time with friends and clearing the story for the first time is magical. I love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game, fun characters and really cool boss fights.\nHope it gets an sequel with Fediel in it.\nMy life mostly consists now praying that she gets into existence. Every breath I take is for her.\nI don't know why Cyvames lied to me. Where is Fediel in rl?\nI don't belive they could create such perfection out of the blue. There has to be a 209cm woman out there and I will find her.\nIt is meant to be.\n\nWhy does life keep forcing cruel choices??",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun combat, cool characters, great character development and skill based gameplay. AI is good but multiplayer is also a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flashy Anime fights with grinding madness like good old Monster Hunter. Online gameplay is pretty much dead but the AI is quite good, i like it, will keep me busy for awhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast and fun action RPG, need more players to do online stuff with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "combat is extremely fun , story is good , graphics very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game felt a lot like FF16 the more I got to the end of the main story.\r\n\r\nIt actually has really cool combat. Perfect parry, dodges, a lot of different characters. As a Greatsword enjoyer I mainly played with Siegfried. All the hits you land have a lot of weight behind it. The music for some boss fights got really good and they always matched the setting.\r\n\r\nI usually never enjoy anime games, but this one was my first exception. The combat is good. The \"main\"story doesnt drag itself on too much and doesn't take very long. It has some really \"anime-style\" cinematic moments which are actually really cool. The voice acting is good, although I noticed a lot of characters pronounced words with s weirdly.\r\n\r\nSo from my side, I enjoyed it for what it is and had fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so fun. The man story is amazing and super fun to play in parties if you can!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awesome. I'll easy put 100+ hours into it. I only wish I had bought it when it launched. Don't let that discourage you though, solo is very fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8.5/10\nFun & engaging combat, nice growth system/mechanics, decent graphics & music, lots of content.\nMeh story, some scenes are super cringe.\nAlso barely any available players for co op anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is honestly just a refreshingly well polished good game. Gameplay is sort of like Monster Hunter? Hard to explain but its engaging and the different characters give a nice variety. Music is pretty good and the game has a nice artstyle. The characters feel well written, a lot of that probably comes from their appearances and developments across the other games. A decent bit of the content is in the endgame which I didn't get too far into but have heard good things of.\n\nPretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gameplay, good music, good presentation, good ui, good combat, good characters, good progression, good content strong 8/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, really fun coop. Hope we get another entry of this style in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relink is quite good. It ended up as one of my favorite games of 2024.\n\nThe story is... there, but the game really shines with its visuals, combat and progression. Not many people playing online anymore, but that shouldn't deter anyone from buying IMO. I only played in single player and I still loved it.\n\nIt's a shame there won't be future updates. As much as I don't really like live service games, this is one game that actually could've benefitted from it, or a Monster Hunter style expansion. \n\nAchievement hunters beware; Relink's endgame is an absolute GRIND. Some may love that, some may hate it. I thought I wanted to get all achievements, but after looking into the list more and seeing what's required, I think I'll pass on this one lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into beauitful characters, cool combat, related easy and beginner friendly action game, this is a great game for you. each character has it own different style and each of them are unique and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I'm really enjoying the game and it low key kinda reminds me of monster hunter world in a way probably because of how the online works. The fight style is simple and still fast enough where its not boring so that's nice. You can choose the difficulty of the game you'd like to play in case you don't want the fighting to be too hard. So if you haven't already tried the game out I recommend for a fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished this game for the fun boss fights, Please delete Vyrn he ruined alot of scenes that felt like they could of been more impactful without him speaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gacha game for responsible people that know their money's worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, unfortunately by the time I started playing online was pretty much dead. The story is fairly straightforward and moves along at a good place.  Plenty of replayability as there are special challenges you will have to come back to once stronger and better and there is plenty to explore. the game does hold your hand a bit and pretty much show all the secrets on the map, its just a question of how to get to them. You play as the captain of a crew, which works in some ways and not others. You get to make some surface level choices that can feel fun but dont effect the game in sny meaningful way, and being the captain contextualises deciding where to go and when. The game does wewll enough at explaining what is happening without lengthy exposition dumps, however it is not done well enough to really provide the deeper, meaty lore you may be interested in, the really good stufff is relegated to codex entries. Excellent characters, combat is smooth and fun. When you land that big team ability in combat it feels weighty and exciting. Artistically wonderful, a feast for the eyes, the painterly anime aesthetic can be a nice relief from the gaming industry push to try and churn out more and more hyper realistic content, but that's a product of this game being anime style I guess so its by no means unique to GB. The story is pretty straight forward but excels in not just brushing over exciting moments with cutscenes, you get to fight on airships and at one point even climb a giant enemy shadow of the colossus style. The ending few hours of the game are phenomenally fun, stick with it and you will be satisfied.\n\nThe online was clearly an opportunity to raid with players to grind the various materials you need for upgrades in order to push on to the harder difficulties, however I could not find anyone to play with. Half way through my second playthrough on hard mode I got a bit burnt out just playing the same story immediately again, even with a few new characters I'd unlocked. With no online the game really feels like something I'll maybe come back to every year or 2 for a playthrough. It is fun and I do like it, but once you've done it, unless you are really taken by it, you'll likely find yourself distracted by other games and willing to move one. For this reason I say get it! But if you can hold out and get it on discount, even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Defs worth the play through. The combat is some of the best i have played and keeps you engaged. Looks really pretty too. Have yet to start the end game loop, but so far, i highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Granblue Fantasy: Relink[/b] really nails the characters and combat. The roster is big, with tons of diverse playstyles, and each of the 23 characters feels completely different to play. The action is tight and satisfying, and the music fits perfectly. The story is ... fine—not bad, just nothing special.\n\nThe main downside is the endgame. It’s all about farming the same bosses (Monster Hunter-style) to power up your characters. It’s fun at first, but after a while it gets repetitive. The variety of characters helps keep it fresh, but since you need to grind even more to upgrade each one, it eventually becomes a bit of a slog.\n\n[b]Pros[/b] \n• Excellent combat and a big roster (23 unique playstyles)\n• Great character designs and animations\n• Good music\n\n[b]Cons[/b] \n• Average story\n• Repetitive endgame boss farming\n\nVerdict: Overall, it’s a really solid action RPG. The grind can get old, but if you enjoy experimenting with different characters and playstyles, you’ll have a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game! Super fun!! Super addictive! Love the characters, story, and gameplay!! >.<",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I've played in a really long time. Story is fire. Combat is fire. Game runs so smooth that it makes me question why everything else isn't running like this. Only qualm I have is how short the story is. I normally favor short stories, but this one had me craving more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game good, combos with friend go brrrrrrr, brain says yes , friends say fun , me happy , friends happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This company should give Bandai Namco a f*cking tutorial of how to do a proper anime game. \n\nF*CK u Bandai Namco!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's plot is a cliché\r\nCliché after cliché\r\nNothing interesting\r\nBUT, this plot is wrapped in cool cutscenes, excellent voice acting, and good direction\r\nAnd ultimately, the work of some people is negated by the incompetence of others\r\nBut this is somewhat compensated by the fact that the length of the story campaign is shorter compared to other JRPGs (about 15 hours).\r\nAnd the narrative is fast-paced.\r\nThe plot wasn't stretched out, and that's good.\r\nBut at the beginning of the game, there's not enough information about the world's lore.\r\nAnd you're like, \"What? Why? Who?\"\r\n\r\nThere are no complaints about the sound effects.\r\nThere's nothing to say about the music either.\r\nNothing great or bad.\r\n\r\nThe game features 20 playable characters, and they're all different—they're not just skins.\r\nThe only downside is that when you play through the story, you can only unlock three characters from the list.\r\nSo you just have to choose the ones you like.\r\n\r\nWhat about the combat?\r\nThere are various combo attacks and skills.\r\nDodges, blocks, parries, and link attacks.\r\nBut it all comes down to spamming skills.\r\nBoss fights are awesome.\r\nOtherwise, the combat is effective, but not gameplay-wise impressive.\r\nThe game has co-op, but its biggest drawback is that you can't play the story in co-op, which could have been a great feature.\r\n\r\nSo what do we get? The game isn't perfect and it's hardly bad.\r\nIt can be used to get into Japanese RPGs.\r\nI wouldn't recommend sticking with it longer than the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great! A mix between Monster Hunter grind and a proper action JRPG. Lot of characters to play.\nMain story is OK -  a bit too \"deja vu\" but end game is where this game shines.\n\nI really hope Cygames will make a sequel. The Granblue Fantasy franchise is full of potential.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I bought this for my little brother, he really liked it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful!\nWell written\nSatisfying gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deliver to everyone... \r\n\r\n....SALVATION!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need update ASAP\nthis game was too good ;'",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Get it on sale for a fun 40 odd hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly one of the best JRPGs I've played.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Got my moneys worth, better with friends though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun Game, Great Combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unite and Fight \r\n\r\nᗜಠ o ಠ)¤=[]======>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best JRPG I have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don`t sleep on it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best combat systems I've ever experienced in an Action RPG. Single Player and Multiplayer, this game delivers. Let me explain why.\n\nEvery character in the game has a unique mechanic that gives them identity and win Condition. The main character, \"Danchou\" is geared for team support, but also chains combo finishers to massively increase skill damage. Carlotta's goal relies on her staying on the enemy and delivering constant damage, using her parry frames frames, gap closers and defensive skills to stay in the enemies face. Narmaya is far more technical, managing her butterfly resource and different stance combos and self buffs to optimize her damage.\n\nThe game can be compared to the Monster Hunter Series in terms of gameplay variety if you consider each character a \"weapon\"\n\nMany Action RPGs fall into a \"Damage sponge enemy\" trope where the boss doesn't budge outside of a stagger meter. Forcing your party to dance around its attacks while you look for openings to land yours. Challenging but not Interactive. Relink circumvents that with both the titular \"Link System\" and the games mechanic for ultimate skills : Skybound Arts.\n\nLink Attacks stagger the enemy when used and utilize multiplayer , encouraging everyone to join in the attack. When used enough times and the meter hits 100% Link Time is activated. This slows down time, Applying multiple buffs, including character specific ones. Giving you the opportunity to go wild on the enemy with optimal dps rotations.\n\nSkybound Arts can be used any time your meter is full , but is best used when everyone has close to full meter. This attack completely interrupts the enemy's current attack, and can be chained together to optimize the damage. A full 4 player burst adds a huge damage bonus.\n\nCoordinating these mechanics for regular use already adds a layer of depth to combat. the push and pull of fights of enemies going into \"Overdrive\" where they become hyper aggressive, and the pull of SBA and Link Attacks pulling the advantage state back to the player is extremely satisfying and makes combat much more hype.\n\nAt HIGHER levels of play, link attacks and SBAs can be optimized further: SBAs can be staggered between uses to give the party more downtime to damage a stunned monster. Link Attacks AND SBAs, can also be saved for the right time to immediately chunk through a bosses overdrive meter. OR interrupt a particularly difficult attack or mechanic. There is a HUGE amount of space for expression, coordination and enemy knowledge to come together.\n\nAll of this comes together to create what is one of the BEST combat systems I've ever played in an Action RPG, as a fan of them since the SNES era, This ranks in my top 10 of all time.\n\nThe game does have its flaws, however. I think the post release endgame falls flat, with bosses falling into the stressful \"One hit KO\" hyper aggressive battle style. Forcing players to stack lots of guts and anti one shot sigils. This ruins the build variety we get to enjoy up until this late game.\n\nI also do not like the Terminus weapons, they become hyper centralizing and locks people into a low HP cap to meet dps, the entertaining build variety takes a back seat to a very limiting game direction. Challenging? Yes, but expression is the spice of the game and unfortunately, it drops the ball here.\n\nDespite all my love for the game, I'm more interested in replaying a low level game instead of conquering the unforgiving Lucilius and the exhausting amount of 1 shot and wipe mechanics. It's a Superboss, and not a necessary part of the core game experience. So it can be forgiven.\n\nOverall, this game is absolutely worth experiencing. The Story is not ground breaking but full of hype music, battle scenes, and setpiece moments. it's almost like a playable action movie. For a multiplayer focused action game? I'd rather be entertained through a 20 hour action filled main campaign, than be forced to sit through tons of world building cutscenes in a single player focused game like Final Fantasy 16. It works for what it is.\n\nIt may not be a live service, but the fact that it isn't is WHY it works so well, without that incentive to make money, the devs are not pressured to monetize and frustrate players to keep the money coming. What we are left with is an amazing experience you'll easily get 100+ hours out of, and possibly more should you decided to play more characters and really master the game.\n\nThank you very much for reading.",
      "voted_up": true,
      "votes_helpful": 62
    },
    {
      "review": "EN:\nGranblue Fantasy is a great RPG with quite a great amount of content; however, the game still has several issues. I will give the details about what exactly this game is.\n\nGameplay:\nThe gameplay for this game is a mix between Tales of Arise and Monster Hunter series. The combat feels like Tales of Aries, while the feature of the game is just like Monster Hunter series, and what exactly am I meant for? well for the combat just like tales of arise where you can do perfect dodge, cast some spells, do finishing move alone or with groups you will understand what I meant if you play tales of arise and now for the feature like I mention just like monster hunter you either hunt a boss or just hunt a small foes this get items and sigils the item function just like monster hunter to build a new weapons however in this game there is no armor to increase your defense to increase the defense the player need to level up the charters or find the right sigil oh and I need to mention two things first just like monster hunter the fun is when you using a differences weapon but in this game you need to use different characters because the moveset is different for each characters and second for sigils is just like jewel in monster hunter to add or increase skills\n\n\nStory:\nWell, I can’t say anything about the story, but the story of this game is, let’s just say okay, not bad, but also not good, it’s just okay, typical of friendship and rescuing your friend from the bad guy. The story goes around 12 hours, if I'm not mistaken\n\n\nContents:\nWell, the contents in this game, I say around 100 hours if you really care to defeat the super final boss, but to be honest, the content feels even less from base monster hunter content\n\n\nMultiplayer/Online:\nFor the Multiplayer, I can still find any active players, especially JP and KR players however, most of them are already at level max and overpower, so it’s hard to find a beginner player. So for me, you can enjoy the multiplayer aspect in the end-game content.\n\nBug and Glitch:\nI don’t know if it’s a bug or not, but my GPU is hot and the fps drops every time the player is close or talk to the npc and for some reason, when entering the combat zone with intense stuff, the GPU is just not hot and normal for gaming so it’s just when the player talk or close to npc the issue start\n\n\nOverall:\n\nThis is a great game I recommend for full price or discount however if you expect to find someone in lobby for multiplayer aspect you can still find it but like I mention most of them already at the end game and for story it’s okay not good and not bad the fun for this game is from the boss and difference playable characters and for graphics it’s good the model and the effect of spell, attack and finishing move looks amazing and don’t forget about the bug drop fps and hot GPU when talk or close to npc.\n\nJP:\nグランブルーファンタジーは、非常に充実したコンテンツを備えた素晴らしいRPGです。しかし、いくつか問題点も抱えています。このゲームがどのようなものなのか、詳しく説明します。\n\nゲームプレイ：\nこのゲームのゲームプレイは、「テイルズ オブ アライズ」と「モンスターハンター」シリーズを融合させたような感じですね。戦闘は「テイルズ オブ アリエス」を彷彿とさせますが、ゲームシステムは「モンスターハンター」シリーズそのもの。一体何を目的にプレイしているのでしょうか？戦闘に関しては、テイルズ オブ アライズのように、完璧な回避、呪文の詠唱、フィニッシュムーブを一人でもグループでも繰り出せるので、テイルズ オブ アライズをプレイしていれば、私の言いたいことがお分かりいただけると思います。そして、先ほども触れた機能についてですが、モンスターハンターのようにボスを倒すか、ちょっとした敵を倒すかのどちらかです。アイテムや印章はモンスターハンターのように新しい武器を作るためのアイテム機能ですが、このゲームには防御力を高めるための防具がありません。防御力を高めるには、プレイヤーはチャーターをレベルアップするか、適切な印章を見つける必要があります。そうそう、2つほど付け加えておきたいことがあります。まず、モンスターハンターのように異なる武器を使うのが楽しいですが、このゲームではキャラクターごとに動きが異なるため、異なるキャラクターを使う必要があります。そして、印章はモンスターハンターの宝石のように、スキルを追加したり強化したりするためのものです。\n\nストーリー：\nストーリーについては何も言えませんが、このゲームのストーリーはまあまあといったところです。悪くはないですが、良いわけでもありません。まあまあといったところです。典型的な友情の物語です。悪者から仲間を救出するストーリー。私の記憶が正しければ、ストーリーは約12時間です。\n\nコンテンツ：\nええと、このゲームのコンテンツは、スーパーラスボスを倒すのに本気で取り組めば100時間くらいかかると思いますが、正直言って、モンスターハンターのベースコンテンツよりもコンテンツが少なめに感じます。\n\nマルチプレイ/オンライン：\nマルチプレイに関しては、特にJPとKRのプレイヤーを中心に、アクティブなプレイヤーはまだ見つかりますが、ほとんどのプレイヤーは既にレベルマックスで圧倒的な強さを誇っているので、初心者プレイヤーを見つけるのは難しいです。なので、個人的には、マルチプレイはエンドコンテンツで楽しめると思います。\n\nバグと不具合:\nバグかどうかは分かりませんが、GPUが熱くなり、プレイヤーがNPCに近づいたり話しかけたりするたびにフレームレートが低下します。なぜか、激しい戦闘シーンのある戦闘ゾーンに入るとGPUは熱くならず、ゲームプレイには問題ない状態です。問題はプレイヤーがNPCに近づいたり話しかけたりした時に発生します。\n\n総合的に:\n\nこのゲームは素晴らしいので、定価でも割引価格でもお勧めします。ただし、マルチプレイヤーのためにロビーで誰かを見つけることを期待しているなら、それでも見つかります。しかし、前述したように、ほとんどの人は既にエンドゲームで既に登場しています。ストーリーはまあまあで、良くも悪くもありません。このゲームの面白さはボスや個性的なプレイアブルキャラクターにあります。グラフィックは良好で、モデルや呪文、攻撃、フィニッシュムーブのエフェクトは素晴らしく、NPCに近づいたり話しかけたりするとフレームレートが低下し、GPUが熱くなるというバグも忘れてはいけません",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "One of the best action RPGs of all time. Literally the only negative aspect of this game is that there is not enough of it. Wish there was a little bit more end content but this game is amazing. Absolutely pick this up.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Thanks for Cygames who made this beautiful game. This game deserve better.\nStunning visual, great story, character design, voice actor, mechanics, and easy to learn.\n\nVery recommended! (9 of 10)",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "The game burned pretty bright, but it didn't burn for very long. Nowadays you best look to this game for its single player experience. I played through the game in its entirety during the first few weeks of release and it was a blast. \n\nThere is a bit of a grind so if not fond of doing the same thing over and over to get specific drops this game is not going to be the one to change your mind. Now that the player base has dropped off you will likely be grinding by yourself as well. IT ran smoothly, the moves were flashy, the characters were fun to play with each having their own strengths and weaknesses and of course it being a multiplayer focused grind game there are \"Metas\"  \n\nIf you have played Monster Hunter or Toukiden that is effectively what this games EndGame boils down to though which is fine when in groups but solo, it can become a real grind that gets real boring real fast by the time the new characters were released people had already moved on to something different. There are mods for the game too if you need something besides the gameplay to keep you locked in. \n\nTLDR: The game ran its course a few weeks after release but has a decent single player experience behind it. If you don't mind playing solo through a game clearly meant for groups or an endgame built for multiplayer grinding give it a shot. If you are not interested in any of that. Skip it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "400+ hours on PS5 ^.^\r\nWill be enjoying this banger again with some buddies who picked it up while on sale.\r\nA combination of 90s style JRPG with some Monster Hunter, Dark Souls lite, Zeldaesque gameplay.  Epic af boss fights!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Granblue Fantasy: Relink is a spin off of the mobile game Granblue Fantasy, but you don’t need to know the original in order to understand it. There are no microtransactions, loot boxes, premium currencies, or any of the usual gacha systems. This is a full-fledged action RPG where character and equipment progression come entirely from playing (but you can still buy really overpriced DLC's to make your game easier) ((Remember to not buy character DLC, you can get all characters for free in game, DLC basically give you one special sigil that slightly upgrades that certain character))\n\nThe biggest strength of Relink is its combat system. It is dynamic and very fluid, somewhat similar to Nier: Automata or Devil May Cry, but with a stronger team focus. You can play as more than twenty different characters (I love you, Tweyen), each with their own style, weapons, attack animations and abilities. Every battle feels a bit different (unless you're grinding the endgame quests, especially the Bahamut fight for Ascended weapons, then God bless you). The Skybound Arts and linked attacks system is especially fun, particularly in co-op mode (unfortunately I wasn't able to experience it myself at all due to lack of playerbase)\n\nExploration and character progression are also well thought out. Characters grow through missions and upgrades made to them really make a difference. New weapons and sigils have a clear impact. The problem starts later in the game, when the grind becomes heavy and relies on repeating the same missions over and over to get single materials for upgrades. Some weapons or items require combining and farming extremely rare drops multiple times, which can get discouraging. The fun starts to fade when you realize you have to spend hours just to slightly increase one character’s damage. The overall progression structure won’t appeal to everyone. It can feel too stretched out and artificially slowed down. On the other hand, if you enjoy games with long endgames and detailed character development, that is where the real fun begins.\n\nThe story is a classic anime style fantasy adventure, full of dialogue, emotional scenes, and well acted cutscenes, but without many surprises. If you have watched even one anime about a group of heroes on a quest or simply some isekai slop, you already know what to expect. The characters are likable but predictable, and the story completely loses focus near the end. The last few chapters feel messy and repetitive. You think the story is over, but then another fight starts, and then another, and it keeps going. After chapter seven, it starts to fall apart, and it’s hard to stay invested. On the other hand, the world looks amazing. Locations are colorful and full of detail. Great voice acting and music keep the atmosphere strong even when the plot doesn’t.\n\nFrom a technical standpoint, Relink is a very solid game. It runs smoothly, I didn’t experience crashes or bugs even after dozens of hours. The graphics are beautiful, animations are fluid and on PC everything performs perfectly. The main campaign takes around twenty hours, but the real content lies in the endgame, with hundreds of missions, character upgrades, better gear and 54 achievements that will make you question your life choices. \n\nOverall, I’d say the game is impressive in how complete and polished it feels, especially for something based on a gacha series. The combat, visuals, and smooth performance make it easy to recommend. The story, balance, and late game grind are weaker points. In short: a great game if you enjoy combat and grinding, but most improtantly, always get it on a sale. You won't be able to experience 100% of it due to game no longer having live updates and active playerbase.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "One of the Game, that I didn't wanted to play, But ended being love with it, after playing it, first game of its series that I played, the gameplay and its music Hook me the most. it was so good, progression bit on a Grindy side, however the gameplay and its music the top notch which make forget its annoyances.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Granblue Fantasy Relink is an absolutely beautiful game the art style, the world, the characters, everything comes together to create something truly beautiful. It’s one of those games that makes you smile just by playing it; you will find yourself completely absorbed in its charm and atmosphere.\nUnfortunately, the endgame experience is where things start to falter. It relies heavily on co-op, yet the online player base is empty. You will choose to spend hours grinding alone for something basic or find three friends and clear the same content in ten minutes.\nI still recommend Granblue Fantasy for its main story and emotional depth. The narrative and characters make it well worth playing, just be aware that the late-game content can feel frustrating without a group.\nThe price is a bit too high for what you get, especially given the state of the endgame.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "a fun game with pretty visuals one of the best ive seen in this category, quick combat, nice music score, story is not bad, but i cant for the love of it speak well of its gameplay as a whole, it feels like a hybrid gacha/offline mmorpg system and i dont like it at all, which is a shame because i expected something similar to games like Tales of, trails in the sky kind of enviroment exploration, trials of mana and so on.\n\nso its definitely difficult for me to recommend or discard, dive in at your own choice.\ni wish steam had an unsure option for reviews.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Granblue Fantasy: Relink turned out to be a pleasant surprise, combining action and strategy in a way that feels both fresh and deeply engaging. Each battle demands attention and precision, offering a fair but satisfying challenge throughout the campaign.\nThe story is well-written and emotionally resonant, serving as the perfect backdrop for a game that places strong emphasis on its end-game content—a part I didn’t explore extensively, mostly because that kind of progression system isn’t my personal preference. Exploration is modestly rewarding, with small collectibles scattered across the maps, though many of them serve limited practical use. The skill system, on the other hand, is smartly designed and well-balanced, offering a clear sense of progression and customization.\nIf there’s one area that could use improvement, it’s the companion AI. While it works adequately, a deeper layer of control over teammates’ decision-making would add welcome complexity for more experienced players. Still, the current system allows newcomers to easily personalize their team’s behavior without feeling overwhelmed.\nGranblue Fantasy: Relink is a solid and engaging title that blends accessibility with depth. I’d be genuinely excited to see how a sequel could expand on its already strong foundations.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Get it while on sale. Hard to find a anime game with such a good fluid combat system and nice visiuals like Granblue Relink has. It runs smooth on my 3060ti even on my WQHD monitor (3440x1440) I get around 90-100 fps. I use a mod for widescreen.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Anime monster hunter. Sadly multiplayer seems to be dead. Still a lot of fun though.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly a beautiful and fun game. The story felt very well paced. There were clear character goals and EPIC battles. It reminded me of Final fantasy XIV Boss trials whenever we had to fight a boss and they all hit. I kept thinking damn they can't possibly top this fight and they always did.\n\nIt was a very fun experience. It had a wonderful feeling of feeling like a gacha game without the gacha lol its a shame the game couldn't have continued to keep getting updated because I would purchase DLC and expansions if it had it.\n\nI would love to keep doing missions with other people if they ever wanted to have a monster hunter or phantasy start type of vibe with this game. It fits.\n\nYou can tell who ever worked on this game actually loved granblu and all of its characters. Thank you for the experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "An amazing experience from beginning to end. Great story and great gameplay.\n\nI enjoyed every second of this, from the first quest to fighting the most difficult bosses.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Took some time to complete before posting a review. Game is quite well polished.\r\n\r\nGameplay is fun, with unlockable characters able to add on to different playing style. Combat is fast paced and kinda like mmo rpg style each char has their own skills rotation to be effective, which is fun.\r\n\r\nThe graphics is honestly way better than I thought. The anime style looks great and the details are amazing. Its extremely pleasing to the eye.\r\n\r\nLastly, the game does respect my time. I don't feel like its grindy when I completed it and the post-game feels like it'll allow me to fully familiarise with all the unlockables.\r\n\r\nGreat game overall and I'll look out for the developer.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very windy. Amazing looking, so many screen shot moments, the effects are OTT and fights are fun. I would like to feel a bit more in control of the fight, but that might be a skill issue.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Granblue Fantasy: Relink is a fantastic game, absolutely worth playing!\n\nIt's a shame that it's not being updated any longer, however it's still an amazingly fun time with friends and clearing the story for the first time is magical. I love this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is an absolute joy to play. From the moment you dive in, it’s clear how much care and passion went into this game. The visuals are stunning — the character models, environments, and animations are all beautiful.\nCombat is fast, fluid, and deeply satisfying, and every character feels unique, one of the best combat systems I've ever experienced.\nSolo or Co-op you really feel like the protagonist of the story.\nHonestly i came for the gameplay, but the story was very good, i was intrigued.\nBoss fight and raids are visually stunning, i am very excited for future updates/DLCs or even future games.\n\nThe game also execute very nicely to play in multiplayer with Link attack and Skybound Art, encouraging players to work together, i've never seen such a system in any other game.\nCoordinating link attacks and skills as a team feels amazing, especially during tougher boss fights where teamwork really matters. Just the right mix of challenge and synergy, it’s fast, flashy, and incredibly smooth — every hit feels impactful.\nOverall, this game is absolutely worth experiencing.\n\n(As for customization, I wish the characters had more skins and colors patterns, but it's not really needed as every character it's really well made and unique)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fun combat\r\nstory is passable, but maybe i just have a soft spot for big kaiju battles\r\nmade me wanna play ff16 all the while tho",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly fun game! I think if they continue down this path we could have a decent series with this game. Combat was really fun, sort of reminded me of FFXIV but still different. Exploration was pretty poor, but the cities actually felt like cities. Visually the game looked really good! Music wasn't bad, I enjoyed it. The story wasn't all that interesting and seemed to start to drag towards the end of the msq. They do that thing where you face off and against people who have already defeated... main baddie just doesn't die. Out of the 10 chapters around 8 is where you sort of feel done and let down it's still going. However, they did keep the boss fights entertaining. I had a lot of fun with them and really liked the approach for them. None of theme felt the same, had their own mechanics, and things that kept the game fresh. \r\n\r\nOverall entertaining game with a really short story, but quite a few things to do after!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game, fun characters and really cool boss fights.\nHope it gets an sequel with Fediel in it.\nMy life mostly consists now praying that she gets into existence. Every breath I take is for her.\nI don't know why Cyvames lied to me. Where is Fediel in rl?\nI don't belive they could create such perfection out of the blue. There has to be a 209cm woman out there and I will find her.\nIt is meant to be.\n\nWhy does life keep forcing cruel choices??",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid game! Visually it is gorgeous, it offers some of the best action combat in this genre, exploring and building your character(s) is a ton of fun.\r\nThe combat didn't get stale throughout the game though the definitive ending required some insane quest grinding to get to the end, once you're at the end your character will be level 100 to give you an indication.\r\n\r\nStory wise it's very typical anime stuff, it didn't compel me much if it all because the characters also are very standard, you've seen them before if you have experienced even the slightest bit of anime or played another JRPG. Vyrn could've been removed entirely and the game would improve, that little twerp adds absolutely nothing other than annoyance.\r\nNo twists or turns, what you expect will happen will happen type beat.\r\n\r\nSo much potential here however for a sequel, I got a feeling a lot got scrapped and the story got rushed hence why the story and characters feel very run of the mill.\r\nIt's very much a 7/10 game all things considered, the combat and visuals do some very heavy lifting.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Me sorprendió la calidad grafica, re da para hacer turismo dentro del juego apreciando los grandes detalles que hicieron.\nLa historia es muy entretenida, la disfrute un monton, está buena.\nLos combates son divertidos y desafiantes.\nLo malo es que es muy corto, y hay poca gente online para el endgame, pero a pesar de esto lo recomiendo al %100",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun combat, cool characters, great character development and skill based gameplay. AI is good but multiplayer is also a blast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm kind of on the outs with gaming right now, so I haven't played much of this yet. But, it plays like a quality 3rd-person \"character action\" game. It's not as thrilling and complex as something like Devil May Cry or even Elden Ring.\n\nIt's far more casual than that, but the combat is crunchy and your actions have consequences. There's a robust system for dodges and guards and synergy with your teammates. This is the kind of game where if I were more interested right now I could easily sink a dozen hours into over Holiday break.\n\nIt's easily worth it if it looks appealing to you. The art is fantastic, the voicework incredible. This is a sleeper hit imo and one of the most underappreciated games I've played in a long time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i bought this on day one but didn't really get to play the game until now. it had taken a long time to come out of development so it's so great to be out for real\n\nrelink is absolute peak. love being able to see the granblue characters in action! seeing the scale of the monsters and the combat is incredible, especially coming from the mobage. beautiful art and graphics, great characters as always, and the combat is very fun.\n\ni dislike the lock-on controls greatly though. i like being able to control my camera on my own, even in combat, but i do have to lock-on to many of the enemies to hit some of the skills--especially projectile moves. the game is also a bit intensive on my build's fan but honestly? worth it.\n\ni ended up getting all the character dlcs to unlock siete, song, and sandalphon because while you can obtain them for free, they require a lot of grinding. i love siete and sandy though, so i have no regrets unlocking them this way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Flashy Anime fights with grinding madness like good old Monster Hunter. Online gameplay is pretty much dead but the AI is quite good, i like it, will keep me busy for awhile.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everything in this game is perfect, from dialogues, story plot to character designs. When I was stressful, I entered the GranBlue world and it relieved my burden. I love how bright and positive the world is even though having bad guys as players' foes. The gameplay, combo and especially the Chainlink combo are beyond the horizon. I'm looking for more products from Cygames.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "combat is extremely fun , story is good , graphics very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game felt a lot like FF16 the more I got to the end of the main story.\r\n\r\nIt actually has really cool combat. Perfect parry, dodges, a lot of different characters. As a Greatsword enjoyer I mainly played with Siegfried. All the hits you land have a lot of weight behind it. The music for some boss fights got really good and they always matched the setting.\r\n\r\nI usually never enjoy anime games, but this one was my first exception. The combat is good. The \"main\"story doesnt drag itself on too much and doesn't take very long. It has some really \"anime-style\" cinematic moments which are actually really cool. The voice acting is good, although I noticed a lot of characters pronounced words with s weirdly.\r\n\r\nSo from my side, I enjoyed it for what it is and had fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so fun. The man story is amazing and super fun to play in parties if you can!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awesome. I'll easy put 100+ hours into it. I only wish I had bought it when it launched. Don't let that discourage you though, solo is very fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8.5/10\nFun & engaging combat, nice growth system/mechanics, decent graphics & music, lots of content.\nMeh story, some scenes are super cringe.\nAlso barely any available players for co op anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is honestly just a refreshingly well polished good game. Gameplay is sort of like Monster Hunter? Hard to explain but its engaging and the different characters give a nice variety. Music is pretty good and the game has a nice artstyle. The characters feel well written, a lot of that probably comes from their appearances and developments across the other games. A decent bit of the content is in the endgame which I didn't get too far into but have heard good things of.\n\nPretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gameplay, good music, good presentation, good ui, good combat, good characters, good progression, good content strong 8/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, really fun coop. Hope we get another entry of this style in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relink is quite good. It ended up as one of my favorite games of 2024.\n\nThe story is... there, but the game really shines with its visuals, combat and progression. Not many people playing online anymore, but that shouldn't deter anyone from buying IMO. I only played in single player and I still loved it.\n\nIt's a shame there won't be future updates. As much as I don't really like live service games, this is one game that actually could've benefitted from it, or a Monster Hunter style expansion. \n\nAchievement hunters beware; Relink's endgame is an absolute GRIND. Some may love that, some may hate it. I thought I wanted to get all achievements, but after looking into the list more and seeing what's required, I think I'll pass on this one lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into beauitful characters, cool combat, related easy and beginner friendly action game, this is a great game for you. each character has it own different style and each of them are unique and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I'm really enjoying the game and it low key kinda reminds me of monster hunter world in a way probably because of how the online works. The fight style is simple and still fast enough where its not boring so that's nice. You can choose the difficulty of the game you'd like to play in case you don't want the fighting to be too hard. So if you haven't already tried the game out I recommend for a fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished this game for the fun boss fights, Please delete Vyrn he ruined alot of scenes that felt like they could of been more impactful without him speaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gacha game for responsible people that know their money's worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, unfortunately by the time I started playing online was pretty much dead. The story is fairly straightforward and moves along at a good place.  Plenty of replayability as there are special challenges you will have to come back to once stronger and better and there is plenty to explore. the game does hold your hand a bit and pretty much show all the secrets on the map, its just a question of how to get to them. You play as the captain of a crew, which works in some ways and not others. You get to make some surface level choices that can feel fun but dont effect the game in sny meaningful way, and being the captain contextualises deciding where to go and when. The game does wewll enough at explaining what is happening without lengthy exposition dumps, however it is not done well enough to really provide the deeper, meaty lore you may be interested in, the really good stufff is relegated to codex entries. Excellent characters, combat is smooth and fun. When you land that big team ability in combat it feels weighty and exciting. Artistically wonderful, a feast for the eyes, the painterly anime aesthetic can be a nice relief from the gaming industry push to try and churn out more and more hyper realistic content, but that's a product of this game being anime style I guess so its by no means unique to GB. The story is pretty straight forward but excels in not just brushing over exciting moments with cutscenes, you get to fight on airships and at one point even climb a giant enemy shadow of the colossus style. The ending few hours of the game are phenomenally fun, stick with it and you will be satisfied.\n\nThe online was clearly an opportunity to raid with players to grind the various materials you need for upgrades in order to push on to the harder difficulties, however I could not find anyone to play with. Half way through my second playthrough on hard mode I got a bit burnt out just playing the same story immediately again, even with a few new characters I'd unlocked. With no online the game really feels like something I'll maybe come back to every year or 2 for a playthrough. It is fun and I do like it, but once you've done it, unless you are really taken by it, you'll likely find yourself distracted by other games and willing to move one. For this reason I say get it! But if you can hold out and get it on discount, even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Defs worth the play through. The combat is some of the best i have played and keeps you engaged. Looks really pretty too. Have yet to start the end game loop, but so far, i highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Granblue Fantasy: Relink[/b] really nails the characters and combat. The roster is big, with tons of diverse playstyles, and each of the 23 characters feels completely different to play. The action is tight and satisfying, and the music fits perfectly. The story is ... fine—not bad, just nothing special.\n\nThe main downside is the endgame. It’s all about farming the same bosses (Monster Hunter-style) to power up your characters. It’s fun at first, but after a while it gets repetitive. The variety of characters helps keep it fresh, but since you need to grind even more to upgrade each one, it eventually becomes a bit of a slog.\n\n[b]Pros[/b] \n• Excellent combat and a big roster (23 unique playstyles)\n• Great character designs and animations\n• Good music\n\n[b]Cons[/b] \n• Average story\n• Repetitive endgame boss farming\n\nVerdict: Overall, it’s a really solid action RPG. The grind can get old, but if you enjoy experimenting with different characters and playstyles, you’ll have a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this game! Super fun!! Super addictive! Love the characters, story, and gameplay!! >.<",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bounced off hard. It’s trying to be emotional and epic without doing the work.\n\nI even liked the first season of the anime. It was basic but watchable. Like dipping your toe into an easy-going fantasy world without having to study up a lot of lore, or getting too emotionally attached. But Relink takes that and tries to retell it through dry text dumps and stiff narration. I mean the FATE quests that are supposed to summarize things if you didn't watch the anime. They're paragraphs of \"emotional\" backstory dumped at you. Characters narrate their own past like they're reading a script. The english voice actors are trying hard to make it sound like they were big moments. But because you don't know them, and don't see anything other than a still frame with text over it, it just appears to be so cringe. I couldn’t take it seriously. And I watched all that before. Imagine, even knowing what happened, it still managed to be so poor in execution.\n\nThe actual intro didn't help. You’re dropped onto the ship, surrounded by characters who act like you’ve been best friends for years. No buildup, flat chemistry. \"Here’s the crew, you like them now.\" Then they introduce a character new for me in the first quest. He's also cringe. They call it overly dramatic. Is this the tone the game is going to be? I rarely skip cutscenes in MMOs. This made me hit skip and at that moment I knew, I am for sure not going to be into this for the story anymore.\n\n\nCombat feels just as shallow. I tried my best to S++++ the first quests. I gained enough ressources to unlock all the skills and bonus plants for the Zyra person Rosetta. Up until it was locked by \"continue mainquest for more of this skilltree\". I can't judge if the below makes it any more deep, but what I have currently is just mashing 3 buttons. Basic attack, combo finisher or gimmick button (plant my seeds) & use skills with high cooldowns. I read before that it’s deep or a lighter Monster Hunter. It’s not. No weight, no real decision-making. Just spamming attack button and occasionally using a big cooldown.\n\nExploration fits in perfectly with the  two main aspects as it's clumsy. Chests and materials are marked on the big map, but there’s no mini-map. So I walk around with this giant overlay stuck on my screen the whole time because I don't want to miss materials I might need to upgrade my gear. I don't see the pretty world much. \n\nI wanted to feel fantasy, I even specifically picked out this game from my pile of shame because I remembered the anime to be easily digestible. I wanted to feel like I make a difference with some cool combat moves. Get some fantasy topping. But I just got awkward and no sense of immersion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game in theory but unplayable solo when you get to proud difficulty multi-boss quests and matchmaking is dead, ok if you just want to play story and then fuck about a bit but don't bother trying to play endgame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This looked like exactly the game I wanted - a game with the strenghts of live service games without their issues. Unfortunately the story or gameplay didn't grip me as much as I hoped. You get a lot of characters to chose from, but not being able to do rotations is crippling, maybe coop would work fine, but having most of the game 3 characters controlled by AI, I am just not sure what I or the enemies are doing, if the party composition is any good etc. Considering the story behind this games development, it is no surprise what this product is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to delete this game due to the use of 3rd party agreements! No game I purchase should ever use these! Please stop adding this to games! Thanks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is fun, i generally struggle to find characters who i can truly connect with in terms of gameplay however this game had multiple and to me that feels like an achievement, the art is great and i like alot of the settings, the combat is fun for the most part but most enemies are very basic and they repeat alot of the enemies, i really like the characters, i like the story. now with all that why not recommend it, this game was made to be one for end game content, however their end game content is battling the enemies you fought before and that is so incredibly lame, there is a system to use tickets to get more loot but it is multiplayer only and there is no one online. there are some people who said they made the game and that was good enough however it is clear that in reality it is unfinished and has clear lacking elements. if you want to play a game for 20 hours you will probably like this game, but if you are looking for a game that is worth the price, this is not it unless you get it on offer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "High fidelity Genshin Impact complete with reskinned content and recycled endgame. Played with Midnight's Overhaul and exclusively in coop after the main story. It was fun while it lasted, but ultimately didn't reach the final endgame boss because of how repetitive every encounter got.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I initially thought this game focused on single-player, but it’s actually online co-op similar to Monster Hunter. Unfortunately, the story mode is short and not that engaging, and most online raids or dungeons are already empty (you can party with AI). The game relies heavily on grinding — weapons, characters, and materials — which can feel repetitive.\n\nStill, the combat system is excellent and the art style looks vibrant and unique. If you like MMO-style grinding or MH gameplay, you might enjoy it — but don’t expect a deep story or long single-player experience",
      "voted_up": false,
      "votes_helpful": 99
    },
    {
      "review": "In short: A technical and artistic marvel with fairly typical but tight action-JRPG combat, held back by some tedious boss design, RNG, and grind.\n\nThe graphics, and technical implementation are truly awesome. It puts most other modern games to shame, running 120fps easily on several generation old desktop hardware. It looks great, even for being an \"anime game\". My one graphical complaint is the ridiculous number of attack effects all over the screen, particularly on harder difficulties and some bosses. Makes it almost impossible to tell when/if you should dodge and attack because of the visual noise.\n\nIts not a bad game, in fact is pretty good for the first 15-20 hours or so. The combat is nice and tight, even if not particularly deep. The number of characters is impressive and most of them feel pretty unique. But you'll have seen (almost) all the same bosses the game has to offer before you're even halfway through the difficulty level grind. \n\nIts similar to Monster Hunter on a surface level, but relying on traditional leveling AND weapon leveling, and the absence of armor sets means you are really RNG dependent on getting sigils to attach to your character for builds that work at higher difficulty. Having to grind up each character separately is... a choice. Not one I like. \n\nOverall, unless you want a really grindy action-JRPG with some light hints of Monster Hunter style farming, this is a pass at the normal price, and a soft recommend on a deep sale. \n\nNote: Some features of this game don't work without being able to join multiplayer. Since there is such an obscene amount of difficulties to grind through before the final one, you basically won't find a match until the very endgame at this stage of the games lifecycle.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "While the game overall looks great, its main story is incredibly short and the post game content is relatively boring and repetitive. Post game content is also for you to get better gear, which... what's the point if the main story is over? Definitely can't recommend getting this game at full price. Probably can do while its on sale.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h2] A gorgeous game hidden beneath a mountain of UI [/h2] \n\nInitial impressions were decent. Game felt smooth, graphics and art style are excellent and the character controls well. Dialogue was sappy but tolerable. \n\nHowever, two aspects killed the experience for me before it properly even began. \n\nFirstly, the limited customization for controls. I always rebind dodge to the B / Circle button on a controller, and the default binding for dodge in this game is RT. No big deal, just change it to a different button, right? Wrong. There are three preset options for controls, and if I wanted dodge on B, it convoluted the skill casting controls (to a clunky combination of Y+Shoulder buttons instead of RB + Face buttons) and attacks were moved to shoulder buttons as well. I could have perhaps gotten used to this if it wasn't for the second point that made me ALT + F4 after beating the first boss of the game. \n\nWithout a hint of exaggeration, this game has the worst UI bloat I have ever seen before. And the only customization given to you is the option to disable the map.. that's it, nothing else. When the party members joined in during the boss battle, I knew I couldn't play this game further. \n\nIn no particular order you have: \n[olist]\n    [*]Boss healthbar on the top of the screen. Not even at the very top, it's offset from the edge of the screen in a way that leaves around 10% empty space at the top of it, leaving less room for the actual game and making things feel more cluttered for no reason. \n    [*]Permanent quest objective displayed at all times at the top right of the screen, again placed at an annoying offset that leaves wasted space above it. \n    [*]Enormous, glowing percentage number on the middle right of the screen that says \"LINK X%\", embellished with sparkles and unnecessary art around it. Directly below it are lists of team members whom it can be used with, further cluttering the screen. \n    [*]Hideously massive list of controls on the bottom right of the screen, showing you a permanent tutorial on how to attack, jump, dodge and so on. Even sprinting and pause menu is permanently visible for some reason. This is something that you can not turn off, and it takes a significant chunk of an already cluttered screen. \n    [*]An indicator directly next to your character, showing some kind of a level that your skill has reached. This font is big enough that it's 15-20% as big as your character is, with zero transparency to it. I have never seen a more obnoxious UI element in a game before, so that's cool. \n    [*]Mandatory damage numbers that of course can not be edited or turned off.\n    [*]Even the lock-on icon is a massive circle instead of a relatively innocuous dot or a similar icon like most games use. \n    [*]On the bottom-left there's further instructions on how to guard and lock-on. Of course offset about 10% from the side so as to constrict everything nice and tight. Next to it is a permanent, glowing list of consumables for your viewing convenience. \n    [*]And the absolute worst offender of them all, the teammate list. This takes up the top-left of the screen, stretching down vertically all the way to the middle of the screen. It lists out every single team member's health, buffs, icon, element type and some kind of an orange bar. It is extremely distracting and annoying to look at. It even lists out the blue-haired girl as \"GUEST\" at the very bottom because apparently that's important information for us to see during battle. \n[/olist] \n\nI'm willing to tolerate annoying UI elements to a degree, but this game goes above and beyond with its incessant UI bloat. People make fun of ubisoft games for obnoxious UI, but at least in those games you can turn off most UI elements as you please. There is such a beautiful, fun game here but unfortunately the developers have done their very best to hide as much of it as humanly possible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself isn't that great or that bad but it does have it's bland moments as some reviews have said the Likeness of monster hunter world's Guild like hunt instances where you take on quest just to grind for materials to upgrade - uncap your weapon levels as you can't even craft actual equipment (no weapons or armor) A huge disappointment and pretty stupid seeing how much this game went for back then. I got it for less than around twenty bucks.  \n\nThe storyline is short just as described 12hrs worth of doing nothing but being the hero.. much like a certain few games on the PS1 - PS3 where you are just going out on a all out rescue mission.\n\nThe battles are somewhat.. like star ocean in a slight way where you are using chain combo attacks (There was a mobile version that had the very same concept of chain weapon skills)\n\nI can see why this game's online community died out.. The game itself has no true content or progression or anything that would suggest there is any kind of reason why anyone would put in more than over one thousand hours into the game seeing how limited and little the dev's gave consideration to expanding the game's upgrading system and allowing the player to roam and explore freely in a more open world. \n\nIf you want a more better Mix of MHW - star ocean and maybe some Final fantasy... I would say to play the actual monster hunter world and other games as you would experience more than just music and cut scene reels.. that is all this game is basically. And also they used the same name for Fei's alter ego (ID) for one of the enemies you will face... This just tells me the Dev's ran out of idea's and figured they would mix it up because they didn't want to focus on the games overall potential.. So they just added this from that game and this from that game etc so they can try and hide the games lackluster content and all..\n\nBut it is still a playable and enjoyable game in it's own way if you don't mind the limitations and unfilled portions that could have made this game stand out more. I just don't like the fact they took some FF - Xeno gears - Star ocean, And tossed it into a mixing bowl and felt it would be enough.. unfortunately not the case.\n\nUnable to freely roam around in a open world - fly the airship to any location you want or walk around explore and battle randomly encountered monsters of all types or even bandits etc. None of that..\nPoor crafting system where you just trade in  merits to get pre made weapons where you don't actually do any kind of actual crafting. -3 lackluster lazy dev's did not want to create a better system of crafting weapons and gear using different materials you can hunt down.\n\nPoor battle system, This is a lot like Star ocean. The old Mobile app store version that was shut down over 10+ years ago I believe. The link - comb chain system is the exact same. The evasion and how you execute skills are very poorly done.  You can tell this game was a port over.. and given no TLC at all.\nYou are put into the battle right off the back. No exploring or anything but engage into a battle.  \n\nThey added a cheap rip off version of Monster hunter's quest NPC style.. this is a cheap filler they created to fill in the gaps of none existence of being able to exit a area and travel outside for a free roam experience. -3 yet another lazy and lackluster job by the dev's\n\nShort storyline 12hrs worth of game time which means anyone depending on what kind of time they have to play maybe 2 - 4hrs. Which doesn't seem like its worth the current reduced price tag. 12.99 - 14 would be the target price.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has great combat. There almost every character is viable until the end game even the starting characters. The one thing that sucks about this game: drop rates. Thne end game weapons have an abysmallly low drop rate. And the materials to unlock their final potential is way too low. For example any drop for weapons takes on average 50 runs of the same boss and each run takes 4 to 7 minutes each. There are over 13 characters. Do the math; thats way too many hundreds of hours to get them. In addition, the upgrade materials required to upgrade them to full potential i.e. Horn of Bahamut and Lunar Cell, drop 1 in 20 runs. Each run takes 4 to 7 minutes and you requier 3 of each to unlock the full potential of every proto bahamut weapon. In essence, If the devs want a good review, increase the drop rates. They are abysmally low. If you don't want to run the same dungeons hundreds of times to get nothing, don't play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's something good here but its overshadowed by a horrible cluttered UI, basic game QOL (camera distance from character) no ultrawide support releasing in 2024 and some of the most \"campy\" writing and character dialogue iv heard in years. Two or three characters will exclaim pointless things every few seconds \"HAHA YEA!!!, WE CAN DO IT\" or \"HEH, they wont see this coming!\" -like anime tropes makes moving through areas pretty annoying. The game has some interesting vistas and such but there is no incentive to explore because every item and chest in the areas is displayed on the map. The game is extremely linear to the point that it felt \"on the rails\".",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game isn't awful, but there's enough mediocrity here that I think it deserves a \"don't recommend\".\r\n\r\nThe combat system is pretty fun, if a bit mindless at its core. I tried a few characters and they all ended up boiling down to the same fundamentals: repeat the 'best' combo chain for your character's gimmick until your resource is full, then dump all your damage, then repeat. On its own it does get boring pretty fast, and the swarm encounters in this game get very repetitive as a result. The boss fights though, are generally quite fun and well designed. There are a few nitpicks here too, an awkward forced camera angle on some attacks or the occasional poorly-telegraphed move, but they are really the highlight of this game and are overall pretty fun.\r\n\r\nThat's pretty much all the game has going for it though. As someone who wasn't familiar with the characters before playing this game, they seem bland and utterly one-dimensional. In 15 hours playing I never felt like I got to know any of them or really understand the dynamics between them. The story is also aggressively safe; I understand there's an audience for cozy and family friendly games but I feel this game drifts well past that into 'totally uninspired' territory. I cannot overstate how uninteresting the characters, story and wider world are.\r\n\r\nProgression is also uninteresting. Since you can avoid pretty much all damage just by dodging correctly, optimization tends towards the classic 'more damage gooder'. Just max out your damage tree till you hit the cap for your current progression state, then put any extra points into defense till you hit the next section of the tree, repeat. None of the stats synergize in a way that's interesting either, they pretty much all function in a straightforward manner that works exactly like you would think at first glance. I wouldn't expect a game like this to have deep or meaningful build creation, but its worth noting how little is on offer here.\r\n\r\nMaps in missions are also not interesting to navigate. As I said earlier, all the 'swarm' encounters are pretty boring and every map is filled to the brim with little treasures containing near-worthless pennies for you to run around and pick up. It really feels deeply unrewarding and chore-like.\r\n\r\nIn summary: If you don't care about the story, or already have a connection with the characters and world from other games, and are looking for a fast-paced third-person brawler this game is a fine pickup if you can get it on sale. Otherwise, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lucilius is dogshit. Sour taste at the end of a by all means a decent game. Do not buy unless it is on a sale, at which point maybe consider it. Somewhat short.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}