{
  "positive": [
    {
      "review": "I might be one of the few people I know that don't like this game that much.Every other list of \"best Resident Evil games\" will have RE2R ranked very close to the top, if not in the first place, and I totally disagree, really. RE3R rightfully receives a lot of critics for cutting a lot of content from the OG RE3: Nemesis, but I barely hear people complaining about the fact that RE2R cut almost all the differences the original game had between a playthrough A and B. \n\nThe TLDR review is: Resident Evil 2 (1998) is better. Much better. I would recommend playing the original versions of RE2 and RE3 before (or even instead of) the remakes. You can find them on GOG for a fair price. But I understand most people nowadays may not be inclined to deal with tank controls and PS1 graphics, and, if you are one of those, just enjoy RE2R and RE3R for what they are. \n\nFrom now on, the review will have SPOILERS:\n\nIn RE2, you run through scenario A with Claire or Leon and then you go through scenario B with the other character (the canon way is Claire A, Leon B by the way). In the 1998 game this will lead you to different boss encounters during each run. \n\nG-Creature, for example, is always the first boss for scenario A, no matter wich character you chose, and that boss fight is not reutilized in scenario B. The same goes for the giant crocodile: it is the second boss for scenario A, but doesn't appear in scenario B. The final boss fight for scenario A is always the 4th form of Birkin (which is also exclusive to scenario A). In scenario B, the first boss will always be the 1st form of Birkin, you'll have to deal with Mr. X and the final boss is the 5th form of Birkin. All of those encounters exclusive to scenario B.\n\nYou can see they made an effort to distinguish scenario A and B. Not only the characters have exclusive weapons, but they also interact with different characters throughout the campaign and have to beat different bosses. By the other hand, in RE2R you'll deal with some bosses in your scenario A and then you'll have to beat the exact same bossfight (same arena, same everything) in scenario B. This happens for the first, second and third encounter with Birkin. It's mind-boggling, really. I cannot believe this game is praised as much as it is when it is a clear downgrade from the original in some aspects. The most outrageous change in my opinion is that Mr. X now appears in both scenarios, and that was a BIG difference in the OG where he just appears in scenario B. It really made that B run feel special.\n\nTo be honest, I don't really care that much about the story in RE games... that's not exactly why we like Capcom games, so I would be a little more inclined to ignore these incoherencies in the narrative if the gameplay was good enough, but I don't think it is. I think the atmosphere in RE2R is just fantastic through and through, but from all the over the shoulder games in the numbered series (with Revelations included) that's probably the worst the combat ever felt, no joke, I HATE the combat in this game. Guns feel very underpowered and even if the dismemberment is the best in the franchise (better than RE3R or even RE4R btw), I did not enjoy encountering zombies in this one. The RNG is through the roof, I bet you the original game from 1998 had more reliable patterns than the remake.\n\nI remember entering the cafeteria near the reception of NEST in my first playthrough (on normal difficulty) and putting 7 bullets to the forehead of a zombie for him to finally fall, and I got so pissed I had to load the save to try it again. It took me 1 shot with the exact same weapon, and the zombie's head exploded. My average experience was much more akin to the first encounter with that zombie: a bunch of bullets and nothing happens. Maybe I'm the unluckiest guy in the world with RE2R RNG, that would explain why people love it so much while I would rather replay RE3R any day of the week than it, and it did not get better when I decided to replay the game earlier this year to get all the achievements (and I got them all, by the way). I genuinely think the combat in this game is worse than it was in the original game, so the only thing that was actually improved were the graphics.\n\nI would still recommend, I guess... being one of the worst games in a franchise where most games are GOATed is not exactly the end of the world, but I actually think RE2R is as \"bad\" as RE6, if not worse. At least in RE6 you can play with some friend and still have some silly fun.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ 9 / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "+ Story, atmosphere, environment, enemies\n+ Smooth gameplay\n+ Very good overview of further actions: rooms change color on the map when all items are found there, checkpoints that require an item from elsewhere are marked on the map\n+ Items are marked when it is safe to throw them away\n+ Resources management, you need all these bullets and healthy plants\n+ Sometimes you just have to run because Mr. X is here\n+ Different playthroughs for Leon Kennedy and Claire Redfield (Chris Redfield's sister from RE1)\n\n- Greenhouse puzzles are quite complicated",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Resident Evil 2 Remake is a great horror experience — tense but never frustrating. The gameplay feels smooth and easy to enjoy at your own pace, with rewarding exploration and puzzles that encourage calm and curiosity. Backtracking through areas feels natural and satisfying. Ada’s mysterious presence adds a perfect touch of intrigue. A truly enjoyable and well-made remake.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Resident evil 2 is deff in top 10 games of all time for me, and second best resident evil in franchise after village,\neverything in game is top notch: story, voice acting, atmosphe.... \n-Story- One of the best stories ever told, everything in game is well written. You start at Racoon city which is overflod with deadly virus and u are one of the few that didnt infected. Troughout the game u meet famous character Ada Wong, who will help u later in game and u are after something called G- serum a mutagenic virus. 10/10.\n-Gameplay- Well classic re expirience\n-Atmosphere- Going trough dark places with different types of infected, zombies lickers, Mutants, oh and lets not forget mr X.Even  when u all alone in some palces u will feel like something is still there and music add to it very much. 10/10\n-Graphics -10/10 easily \nI just wish i can play this game for the first time is it that good? yeah it is that good.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Genuinely my FAVOURITE Game/Resident Evil game. It hits every aspect where other games fall short and is a perfect remake of the original Resident Evil 2. I absolutely love the UI and would choose it over any other. The story is beautiful, the combat feels balanced, and it’s not scary at all. The only downside is the difficult achievements, but I honestly don't mind that. I wouldn’t recommend the DLCs since I didn’t really use them, but I bought them anyway to support the developers.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "good game but it gave me highly unrealistic misconception about men and body dysmorphia",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Leon's run ended. I have noticed that a few things from the OG game have been cut up. I really hope that this choice it's just for the first run only! \nCannot wait to keep playing and unlock more things! \n\nEDIT: posting this after a few more hours and a few more games cleared. The 2nd run have the chance to give some extra contents to the main stories, but honestly, it feels a bit weird and confusing if you are playing it for the first time and you have no idea which run is the canon one. In general, I am having so much fun, this game is giving me good times, nice gameplay and interesting puzzles. \nThe only request I have is to add the configuration with the PlayStation layout: or it's me that I need to add some external mod and I don't know, or there is some option to toggle. Just do the same thing has been done for Resident Evil 4 Remake, that's it.\n\nAlso, the OG is my fav RE game ever, this one is valid as well - the characters have been developed a bit with some extra dialogues and thoughts.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The story is enjoyable and easy to understand, well written and both Leon and Claire's stories come together in the end. Gameplay wise and this is biased I'm not really a fan of (not a fan of survivor horror in general). Hardcore difficulty is probably by far one of the most actually hard difficulties you'll see out there, imagine Dark souls but without any rewards for beating ANYTHING.\r\nGraphically it's really good looking however there are some missing stuff from liquid textures.\r\n8/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I LOVE IT I LOVE IT I LOVE IT LOVE IT\nThere's zombies in my zombie game?! Sadly this was my first singleplayer horror game ever so I sucked ass deadass, but I LOVE ITTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTTT!!!!!!!!! SHERRY BIRKIN AND CLAIRE YOU ROCK",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Masterpiece of a remake, amazing atmosphere, dark and gritty raccoon city and the RPD vibe is immaculate. Great graphics for 2019, satisfying combat, challenging bosses, amazing puzzles. i truly recommend this game for RE enthusiast. I finished everything, 100% all collectibles and challenges. S hardcore all campaign. what a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love this game so much!!!!! the puzzles and general zombie-related death avoiding gameplay loop are super simple but the level design is superb and this game is begging to be replayed again and again and again!! get lost in perfecting the balance of resources and time efficiency, challenge yourself however much you want!! kill six billion zombies!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After playing this game several times and managing to get all achievements, I just looove Mr. X",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An amazing remake that perfectly captures the spirit of the original. The atmosphere, visuals, and sound design are top-notch every moment keeps you on edge. The gameplay is smooth, tense, and rewarding. Mr. X adds pure panic in the best way possible. Both Leon and Claire’s stories are worth experiencing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I THOUGHT I WAS BRAVE …THEN THE TYRANT SHOWED UP  WHILE I WAS LOOTING \n\nHours Played: 25 hrs\nRating: ★★★★★ – S.T.A.R.S. approved! \n\nI didn’t know if I could face this game again, it was a childhood nightmare. But part of me needed to, and I’m glad I did. Playing for 25 hours, I can honestly say the Tyrant still makes my heart pound like crazy. I really thought I wouldn’t finish it, but it’s so addicting that I just had to keep going.\n\nThe horror feels just as intense as I remembered. Now I also appreciate how polished the gameplay, story, and puzzles are. Steam Deck plays it smoothly, though I wish the new missions were clickable. It’s a minor issue, but worth mentioning.\n\nThe discounted price makes this an absolute steal. It’s packed with content, multiple scenarios, and hours of gameplay that make it feel like full value.\n\n✅ Nostalgic\n✅ Terrifying\n✅ Addicting\n✅ Worth every penny",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game, but tbh i expected a bit more. First, I'll talk about the game's cons because there are fewer of them. \n-The horror part isn't bad, but you expect more from a game like this.\n-The plot, worse than i expected.\nIn more details, when you play as Leon, it's not bad at all, nothing special, but not bad anyway.\nBut I don't see the point of Claire's company, her model is cool, I don't argue, but running around solving the same puzzles is a bit repetitive. It seems that the developers simply couldn't think of anything more interesting and just stuck with it. But still not that bad, but to call it good is out of the question.\n-There are serious problems with zombie hitboxes, but that's a minus and funny thing in the same time. On the other hand, there are moments where they just fly off the map(what is funny thing indeed), but it's still more of a minus (because it's a triple-A project afterall).\nLet's now go through the advantages of the game.\n-The atmosphere in the game is there and it is maintained quite well.The tension in the game with the same Tyrant is very good - really makes you nervous.\n-Models, my respect, nothing to say, you have to watch.\n-The gameplay is interesting, you have to think a lot about managing ammo and weapons in general, hills, and so on, honestly, they did a great job with this.\n-I want to add a little to the pluses: additional mini-games, in a word, interesting.\nOverall, the game is good, but I can't call it a masterpiece, playing it once was enough for me. \n7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game this was my first time trying resident evil series I really start to like to play the whole games series",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really great RE game, everything about it is great from the sound, the graphics, the gameplay etc. I've played through this game multiple times as both Claire and Leon and really enjoyed it. My only negative is that I wish the puzzles were more like the original game, and also were not as easy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Classic but better, the dev did an awesome job remastering this. If you want a classic feel but modern graphics this is it. A must have in your collection, you wont be disappointed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's amazing. Only issue is that movement especially strafing is a bit janky but otherwise great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, faithful to the original new re fans as well as old will enjoy this title",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun story and scared the hell out of me at times. Visuals are amazing and really add to the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of my favorite combination of survival horror and action games that I've played, nailing a good combination of horror, tension, and action gameplay with great in-game events and cutscenes weaved in. \r\n The one downside about this game is I wish the separate playthroughs of Leon and Claire were more different  That said, I definitely recommend checking this game out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best resident evil game, with amazing performance on the deck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played more of it on my PS5, But still great game, fun to Speed run on!\r\nIf you haven't played any of the RE games, this one is a great one to start off with, or RE7.\r\n\r\nmight be a bit harder for people who only played RE4, RE6/7 and RE8",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely adore this game, it's what got me into survival horror!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended. \nIf you enjoy the Resident Evil saga, this entry will be right up your alley. It’s incredibly immersive and nails the eerie, unsettling atmosphere in all the right ways. The game is packed with clever puzzles, intense action, and plenty of moments that keep you on edge from start to finish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very different game from RE4 but still very fun to play if you like survival horror.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its scary and makes my already high blood pressure even higher, great game no notes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After you play this game you're required to go online and complain about how it's not like the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics, gameplay, and story! What a beautiful remake of a nostalgic game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not play the original so the experience was new. At first I thought it is going to be a jump scare fest that is why I hesitated to pick it up. It’s an interesting concept survival puzzle with limited ammo and crafting. You do not allow yourself to shoot everything you see like in other games because you will run very quickly out of ammo. Saving often was very helpful.\r\nIt is not that scary but often it raises the player’s suspense. The story was very well written my first playthrough with Leon was around 9 hours but it felt like 20 due to the atmosphere it has created,  Although when I got to my playthrough with Claire I already knew how the mechanics work so I finished that in half the amount of time. \r\nOverall great game does not drag playtime more than needed,  took me 19h both campaigns and it has new game plus modes and some extra modes for those who want to keep playing after finishing the main stories. \r\nA good experience I can highly recommend it, since its an older game it’s often discounted so wait for one before picking it up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well optimized for low end laptops/pcs and its hell fun. \n10/10\nits worth getting on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First experience with resident evil ever. For first timer into horror puzzle games, it does feel overwhelming but you will get used to it. Zombies at the RPD is still the scariest even after playing RE2,3&4 Remake, maybe because that the first time I experience realistic zombie game chasing after you and ocassionally giving you jumpscare. I wish it was a bit longer tho. In nutshell, a very good introduction to RE Franchises.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a classic zombie shooter plus the graphic refresh makes it worth re-getting into. I played the original years ago and have forgotten enough that it's like a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not sure that the Resident Evil style of games is my jam. I've got this one (RE2), RE7 Biohazard and RE8 Village. They're fun(ish), but it's lots of go here, go there, find some random item, oh that goes into a spot somewhere else, etc etc.\n\nA few zombies, a bit of shooting etc. Ammo is mostly available, but the lack of controls does get frustrating. A zombie gets you and you get bit - there's no way to fight them off unless you have a weapon. These weapons break easily (knives) or are in short supply (flashbangs) etc.\n\nThe map is handy - it shows you some supplies and indicates whether you've found everything in a room etc. It also shows you the puzzles and objectives.\n\nI looked up the various safe codes etc. It would've done my head in to have to find them all and figure out where to go etc.\n\nBut the graphics are pretty good, it is atmospheric and a bit scary. It's a an actual survival horror game, as opposed to the games that twats call survival horror, like the Metro series and Dying Light. Neither of those game franchises are \"survial horror\", they're FPS games set in a horror scenario.\n\nI'll finish this one off. It's fun enough, but it's not really compelling for me.\n\nEDIT: I'm up to the part with Mr X, and while I get that's a great game mechanic and upps the tension, it's also a complete pain in the ass. I'm on low health, I've got to get from the safe room to the records room, and every time I either get killed by one of those ceiling zombies, or chased and have to go around and around and start the whole journey again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first horror game and its done a really good job of scaring the hell out of me. The puzzle aspect of the game is very rewarding though which keeps bringing me back. Ive been told that for being my first horror game, its definitely a rough one to start with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games of all time, fun and lots of replay value. Only complaint is that 2nd run isn't as fleshed out as the og",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 2 is an incredible experience that perfectly balances action and survival horror. The gameplay feels tight and immersive, keeping you on edge while still delivering satisfying combat. Every encounter feels meaningful, and the atmosphere is dripping with tension and dread.  If you enjoy survival horror or action-packed games with a strong sense of atmosphere, this is a must-play. Highly recommended for fans of the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "made 100% with the last achievement \"no way out\" wich is the hardest and most intense challenge in the game. \r\ni really enjoy it. good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely one of my favorite games to play, so much replay value, especially with all the different mods available makes it so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very highly detailed and replayable game. I have played and beat it many times and I just keep coming back for more. The game consist of a main campaign with two main characters; Leon Kennedy and Claire Redfield. This game is fun and very beginner friendly but can also be quite the challenge to learn. This game is very fun and I am very satisfied with my purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels incredible. Even with the new over-the-shoulder camera, it didn't lose that terrifying survival horror tension at all. My only real gripe is the campaign continuity since the A and B scenarios are a bit of a mess compared to the original. The old game had a proper Zapping System where taking items or killing bosses mattered for the second character, but here you just fight the same bosses and solve the exact same puzzles again. It kind of breaks the immersion. Still, the game is a masterpiece and absolutely essential. 9.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2025 and doesn't features skippable cutscene? Well you lucky it not too long and not too boring for a cutscene.\r\n\r\nAnyway the game is fantastic. From visual, atmosphere, characters, story, gameplay, level design and soundtrack, all top-notch.\r\n\r\nA must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly had my doubts at first because the game terrified me but after playing more and more, it's just getting better and better. Definitely a very good horror game I would recommend to any horror fan, along side the other resident evil games :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only a couple of hours in this game and it's pretty enjoyable so far! Def recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never played the original RE2, so I am playing this entirely for the first time.  I have to say, no other game I have ever played has creeped me out/scared me like this one.  The atmosphere is lonely and eerie.  The jumpscares are respectful (not over-done, not insanely loud, etc.).  And some of those enemies... man.  I had to rip my headphones off and pause the game the first time a Licker was chasing me.  I picked up this and RE3 on sale, and I am loving the experience so far!  I really look forward to what RE3 has in store.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing re-imagining of the original RE2 game, Amazing sound design, Visual, Story, Horror elements. This game lives up to the standards of the first and exceeds it. The engine also plays nice with PC hardware and runs well. at 15USD on sale it's a steal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest remakes of all time. Takes the spirit of the original and transplants it into a new engine with new features, enemies, weapons, paths, and more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best survival horror game I've played next to Parasite Eve 2 and the original Resident Evil and Resident Evil 7 Biohazard. This game is really that good. The environment you're put in makes you feel very on edge. Like at any moment you could be attacked and I feel like that adds so much to the experience of a survival game. That you can never really feel safe unless you're in the save room.\n\nI played as Claire. The game eases you in quickly without really any tutorial needed. Good for immersion. There's very little on the UI to take away from that either. The camera angles are well done and I think they did well to copy that same terror from the original Resident Evil mansion. Hallways are narrow, dark and plenty of windows that can be broken into from outside keep you on your feet.\n\nPacing is good. While there is a sense of urgency to progress the story, I didn't feel rushed playing this game. I took my time to clear out each room and love that there is a color indicator to tell you when a room is cleared or still something you're missing. I only had to consult a guide once for something. This is a huge quality of life feature in the game and without it a lot of other survival horror games miss the point and have you backtracking for days figuring out what you missed.\n\nThe gunplay is satisfying. It'll take more than one headshot to kill most zombies. At times you're better off just running away and saving your ammo. It's a game of resource management and wits. There's not enough ammo here to go crazy like in CoD zombies. You have to be methodical about it but still fairly generous amount of ammo if you rather go in guns blazing.\n\nI have to admit the story really engaged me. As with typical RE games you learn more from reading documents and letters as you progress through different areas. It's like you're a detective piecing together evidence and written testimonials to form a picture of what transpired.\n\nPuzzles are well done. All of them were quite straight forward. The way the game is designed you can't progress without having solved the important ones so there's incentive to go through every area to find what you need to complete the next puzzle.\n\nThe game looks terrific in 4k. Great audio as well. It's like watching a movie but you're in it and you better find a way survive to see how it turns out. Would definitely replay some day with Leon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and scary game. Great action, great story. A must-buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is never the same. each playthrough changes a little, it gets easier as you go, even when you up the difficulty. And the insane weapons you can unlock make it funny at times. The infinite hand-cannon makes it stupidly fun, allowing you to just play a game of pumpkin smasher with their heads. \r\n\r\nand if you prefer a faster playthrough you can dodge and duck your way through to the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal remake. Stays faithful to almost everything that made the original special while bringing it to the modern era. The one major gripe I had was the lack of music. The orginal's music inserted into the new one still fits the mood to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the first one more-- The first half, on a police station, is wonderful, but then it lessen the scale of the levels and feels more linear, while in the re1 that open level structure was present up to ~the final hour of the game. I also feel like more minimalistic storytelling of the previous game was more fitting, here everything looks more cinematic but silly plot twists of 1998 game are still here which makes so strong dissonance. What do you mean Leon fell in love with random girl he found during a zombie apocalypse and known for like 2 hours? Maybe that's because she wears super sexy and ultra impractical outfit, who knows? When he meet Claire on the other side of a like 2 meters high fence maybe their first idea shouldn't be splitting up but rather jumping over that fance and working together? Idk, the original also had dumb moments like this but there they somehow felt more acceptable just because it's a ps1 game so it's probably a complaint about the remake, not the game itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are very beautiful and i really enjoyed this game and i have this game on my ps5 and pc its worth the money. and i recommand this game to people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Positives:\n-Stunning presentation, good atmosphere\n-Complex plot, characters, and setting\n-Multiple campaigns, making replaying the game worth it\n-Good story and gameplay pacing\n-Generally scary\n\nNegatives:\n-None\n\nResident Evil 2 is a remake of a game from 1998, but with this modern version, you wouldn’t be able to tell. This game set a standard back when it originally released, and still does. It’s accessible whether you’ve played no horror games ever, or every other Resident Evil game. It’s tense, punchy, and well-paced. Everything the game does is well done, and what it doesn’t do well, it doesn’t do. It is exactly what it sets out to be; the most refined 3rd-person survival horror game, benchmark for the genre, and a modern representation of a legendary game.\nI don’t think it’s long enough to justify it’s $60 pricetag, but it does come with RE3 and a Dead by Daylight clone named Resident Evil Resistance that I would not recommend you play. I would recommend RE3 though, despite it’s odd legacy. It regularly goes on sale for $10-$15 dollars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you do a TRUE remake. What Capcom did here with RE2 is nothing short of amazing. They took one of the franchise's most beloved classical entries and brought it into the modern era as a polished third person over-the-shoulder survival horror game. If you played the original, the game truly captures the feel of the initial release while still feeling fresh and new. The additional character vignettes for characters like Robert Kendo are also done very well and ass to the overall experience. Of course, the Fourth Survivor with HUNK is an obvious high point as well. I previously 100% this game on console and am enjoying going through it again. Definitely worth getting whether you played the original or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 2 Remake is an absolutely amazing experience from start to finish. The story is incredible, the characters are memorable, and the atmosphere is masterfully crafted. The soundtrack is impeccable, at times nostalgic, at others intensely immersive.\r\n\r\nPlaying as Leon and Claire feels fantastic, and while their campaigns share many similarities, the minor differences in dialogue, encounters, and certain fights keep each playthrough fresh. The game’s gore, sound design, and overall tension are phenomenal, with a constant sense of suspense that really pulls you in.\r\n\r\nThe game can feel punishing with its ammunition, but in my experience, that only made things better. It forces you to think strategically and use your resources wisely, which adds to the survival-horror feel.\r\n\r\nThere are a few story moments that I think could have been explained better, and I would have liked to see more content carried over from the original. Even so, these are minor issues in an otherwise outstanding remake.\r\n\r\nOverall, I absolutely love this game. It’s a masterpiece and a must-play for fans of the series and newcomers alike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, somewhat stressful, dont be afraid to search up stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hunting the achievements makes the campaign more arcadey rather than a horror game lmao.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ждал. Стоила недешево. Когда вышла - посмотрел все обзоры, несколько прохождений. В итоге не уверен был, стоит ли вообще покупать ее: оригинальный RE2 я прежде много раз проходил, а ремейк отсмотрел на ютубе. Купил и не пожалел, потому что игра получилась как из мечты. Представить себе такую графику и детализированность в 2002-2003 году, когда у меня появилась PS1, было невозможно, а мечтать о ней - да. Я не стану перечислять все преимущества этой игры: они и так известны. Для меня в эти мрачные времена RE2R - напоминание о том, что мечты хоть иногда, но все же сбываются.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ถ้าทำเนื้อเรื่อง A B ให้ดีจะเป็นภาค Remake ที่สมบูรณ์แบบมาก",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good game, great replayability and so perfect i love it sm. lovable characters and one of the best locations in all RE games (the RPD)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] 9/10 [/h1]\nI'm not a fan of horrors in fiction and I usually just avoid them by a longshot. However, even with my dislike towards this genre, the first half of this game, exploring through the police station, was one of the best and most authentic gaming experiences I've ever witnessed.\n\n[h2] PROS: [/h2]\n[b] + Visual Design [/b]\nOverall astonishing graphics for even deper immersion, especially the amazing lighting.\n\n[b] + Breathtaking Atmosphere [/b]\nPerfectly set up tense atmosphere to keep you engaged and immersed. The fear is created through visual aspects and audio, not some cheap jumpscares.\n\n[b] + Survival Aspects [/b]\nAmmunition and other useful items are scarce. The player is forced to make decisions when to use ammo, because if used recklessly, it will run out very soon. Thanks to the limited amount of available resources, the exploration is recommended and therefore even more rewarding.\n\n[b] + Audio Design [/b]\nFirst time I've had a shiver ran down my spine upon hearing someone's footsteps.\n\n[b] + Exploration/Puzzles [/b]\nExploration is incorporated into the main story. You have to find stuff to progress further.\nThere are a lot of optional rooms and other interactions waiting to be found with useful treasures.\nPuzzles are decent, requiring at least slight brain usage.\n\n[b] + Detailed Gore [/b]\nThe damage done on zombies is visually very detailed. Only near the end of the game, I realised I can shoot off their limbs to cripple them, potentionally saving ammunition that would have been wasted on an unnecessary kill.\n\n[b] + Mr. X [/b]\nI love him.\n\n[h2] CONS: [/h2]\n[b] - Abrupt Ending [/b]\nI respect that the ending is trying to stay faithful to the original game, nevertheless it still ruined my overall experience and satisfaction from the ending. You have to complete the game multiple times to achieve the \"true\" ending, which is fine, but I feel like it should've been available even in the first run. The game isn't that different when played from the perspective of the other character, at least to me it's not worth a whole replay, just to get an extra scene or two at the end.\n\n[b] - Boss Fights [/b]\nThe boss fights aren't as creative as they could have been.\n\n[b] - Slight Loss of Atmosphere Towards the End [/b]\nThe pacing got way faster at the cost of a great horror atmosphere.\n\n[b] - Mr. X [/b]\nI hate him.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started the game, the visuals and story are great so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ammo count is getting on my nerves, but playable. Enjoyed it! Another great Resident Evil story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, but way too overhyped. Don't understand why some people say this is the best survival horror game. Best part is by far Mr. X, but he doesn't really add anything in terms of horror, just suspense and pressure. Looks phenomenal, runs well, and is overall a good time. Just gets boring during second playthrough. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 2 RE:make is an incredible love letter to the original Resident Evil 2 from 1998. It takes a lot of inspiration from the original design and reimagines it to make for a much more modern and great experience for both new and returning audiences. While not everything this game does is \"perfect\", I can accept the flaws this game has as the pros heavily outweigh the cons. Which is something I cannot say the same about my ex-wife...\n\nThis game has a fair amount of replay value that doesn't feel artificial, as I have manually chose on my own accord that I want to replay THIS remake on several occasions. Leon and Claire's characters were given a bit more personality that I am honestly a fan of. This game doesn't stiff us on any extra content either we are given A & B scenarios (more on that later). We get the Fourth Survivor Hunk minigame, along the Tofu reskins, which I am surprised we got, and we got a \"what-if\" gamemode with the Ghost Suriviors. Which is a fair amount of content for a $60, but I probably would still settle for a cheaper price tag as the game is nearly six years old now (as of writing). But hey, it's still worth a helluva lot more than my ex-wife.\n\nMr. X has gotten a huge upgrade in this game, he has been transformed to a relatively consistent looming threat in both scenarios. He is no longer restricted to scripted events that would basically end as you change loading zones. The heavy footsteps you hear in the RPD is genuinely freaky, and sometimes encountering him can force you to reroute which is awesome. Chief Irons is painted to be a massive [CENSORED] and a [CENSORED] in the RE:make. Which is in my opinion better than his original appearance, because screw that guy. Ada is fun, the rest of the side characters don't deviate much from the original material so that is good.\n\nI did mention not everything is perfect about this experience. And most of that boils down to how certain things in this RE:make versus the 1998 release. My main two gripes are the beginning voyage to the RPD, and the A&B scenario system. In the 1998 release, the player is required to outrun hoards of zombies to make it to the RPD, with a lot of content and environments to explore before even arriving to the game's main set-piece. The \"voyage\" in the RE:make is following a linear path that doesn't deviate and doesn't have different affecting outcomes depending on which routes you take. Which is very similar to the arguments with my ex-wife, no matter what approach I took, it would still lead to the same hellish outcomes. Even worse, the B scenario doesn't have that voyage at all, you start within the confines within the RPD. This linear routing does have some effects inside the RPD; however, it is much more tame and I will not dock it there. The second issue being that the A & B scenarios don't carry weight on each other in the RE:make. It's kind of hard to explain, but the original worked on two disks. One for the A scenario, and one for the B scenario. Some of the items you took from A scenario would directly affect the player when playing the B scenario, as they wouldn't be there. That doesn't exist here, it is a similar story where the beats all still hit, just at different points. But again, the pros of this RE:make are much greater than the cons.\n\nAll in all, Resident Evil 2 RE:make is an experience I can recommend to both new and original players. And in most situations I would probably recommend the RE:make over the original, and they can play the original afterwards if it interests them. RE2make presents fewer, but still equally fun puzzles and games within it's confines, unlike my ex-wife as she dealt in a greater amount manipulative games which are not very fun. For players that have never played Resident Evil, RE2make is a great starting point and introduction to the series, aside from RE1, RE1 Remake and mayyyyyybeee RE7.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but dont bother playing the extra missions. unbeatble not because hard but because unfair",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident evil 2 remake vam je kao prvi seks (koji jos nisam imao jer sam govno retardirano nevino) igrica znaci kida ono brate matori tebra torima jebote sto je dobra u picku materinu. Znaci kad bi morao da biram dal da jebem emu radujko ili da ponovo iskusim ovu magicnu igricu jebo bi emu radujko ko jebe ovo govno.\nKRLE PISAM TI U USTA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great remake, and a great game on its own.\nFun to replay, and the free extra mode as DLC is a nice addition.\n\nI hate those freaking plant-shaped guys, burn em with fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i would like to recommend this game is fun only in the 18 rated catorgory  great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well, its a streamlined resident evil 2 reimagining. its a good game with a great atmosphere but it falls short when compared to its predecessor, go try and emulate the original Resident evil 2 its a wonderful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, took me on an emotional roller coaster throughout Leon's story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, good puzzles and fun gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the few remakes that are better than the original. Capcom really rebuilt the 1998 survival horror from the ground up, delivering a game that feels nostalgic and new. Resident evil 2's visuals are perfect, creating an eerie feel. Not to mention the sounds designs also create that feeling. Re2 is kind of two games in one, one with Leon, and the other with Claire. Both story modes are similar and different at the same time (Both are good). To summarize this, this game is worth buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, cool to do a second playthrough from the other character's perspective with some different weapons and boss fights.  The game is more about survival, resource management, and puzzle-solving over pure combat, but there is plenty of action too.  The Sherry level is probably the most intense and terrifying part of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 2 Remake delivers with its tense, atmospheric survival horror experience. The story is straightforward, we have a standard zombie apocalypse setup, I was engaged, and the atmosphere always succeeded at scaring me. The sounds in the game were also intimidating, Mr. X's footsteps always had me on edge, and the sudden banging of zombies on windows or doors added to those panic moments.\n\nMr. X is easily the most intimidating presence in the game. From the moment he appears, he just hunts you and keeps that tension alive. Regular zombies were fine, but I did dislike how many headshots it sometimes took to take one down, and even then they could stand back up. I've seen online people complaining about ammo management, but I personally never had any issues. I always felt like I had enough ammo and I was able to kill almost every zombie I saw coming my way. Shotgun shells were a bit scarce, which does make sense since it is a stronger weapon.\n\nGameplay was solid, though movement felt weird early on, and I did sometimes question Leon when the dude is barely jogging in intense situations, like when being chased. Puzzles were generally good, but backtracking sometimes felt tedious and slowed the game's momentum for me. After finishing Leon's story, I decided not to play as Claire just yet. I don't think I can go through with it knowing I need to solve the same puzzles and run around in the same places, but I will revisit that later.\n\nWhile the game did feel a bit on the shorter side, overall, I think this game offers a great atmosphere, mix of tension, solid gameplay, and it's worth to play at least once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game i had fun only confusing you must play both characters to fully get the game\nWell a blast in the past check it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak i love it. the graphics are good, the gameplay is fun, and the ghost survivors is very good too. 10/10 rework of a resident evil game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever since I was a kid I dreamed about having the ultimate Resident Evil experience. I think this is it, simply the best game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun for a single player shooter with some puzzles thrown in. Could give guy a bit more ammo though XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great! Almost same feeling as 20 years ago :). But unlocking unlimited weapons is totally useless. If I can speedrun and finish game on hardcore without them then I don't need them at all. It's not like this game is very replayable countless times and there would be some point from these unlimited weapons. Old version had better system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The original is one of my favourites ever, played it countless times. The only thing missing to make a perfect round remake is the variety in the pathways A and B. Other than that, impeccable and absolutely outstanding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if your looking for something where there is fuck all ammo and your character cant run properly. also if you make it to the end when the big guy drags his claws along the floor your supposed to shoot him, not run around like a spastic and die 30 times. cheers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the Best of the best RE Remake, Everything that makes Resident Evil a survival horror game this game has. Lots and Lots of puzzles notes and story lore, combat but not too much, tons of puzzle items and backtracking and the two scenarios are different enough that its worth playing thru with both characters. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 2 Remastered really impressed me with its incredible atmosphere and overall design. The game nails that dark, oppressive feeling that the series is known for, and wandering through the police station or the streets of Raccoon City feels both nostalgic and fresh at the same time. Visually and stylistically, it’s definitely one of the strongest entries in the franchise.\n\nThe story itself is solid — not groundbreaking, but enjoyable enough to carry the experience. Compared to Resident Evil 1 or Zero, it feels a bit more modern and structured, though it doesn’t quite hit the same classic charm for me.\n\nOne thing I wasn’t a huge fan of is the constant pressure from enemies that are always lurking behind you. There’s rarely a moment to just breathe or explore at your own pace, and that took away a bit of the enjoyment for me. Still, despite that, I absolutely loved my first playthrough.\n\nI’m really looking forward to jumping into the second run, aiming for 100%, and continuing on through the series until I eventually reach Requiem.\n\nOverall, Resident Evil 2 Remastered is a fantastic experience, atmospheric, intense, and well-crafted — even if it doesn’t always let you relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good amount of horror, challenge and pretty graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my first mainline Resident Evil game.  I previously played Revelations 1 and 2 but they do not even compare to this game.This game is a classic survival horror. The gameplay is good and graphics are gorgeous. I found the storyline very interesting and intriguing and there is a lot of replayability within the game as you have both Leon's and Claire's campaign and different variations of said campaign.\n\nThe main issue with I had with the game is that Mr X. can kind of getting annoying.\nOther than that i think it is a great pick to start with the Resident Evil Franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was fantastic. Thoroughly enjoyed the game, though i wish there could have been more variety in the different scenarios. Every once in a while I feel like booting this back up and the muscle memory comes back and it feels good to traipse through Raccoon City again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed Resident Evil 2, actually.\nNever played the original from 1998, but I enjoyed this remake quite a bit.\n\nI think it's a missed opportunity that the different campaigns and second playthroughs aren’t really canon and/or connected in any meaningful way. \nOn top of that, some puzzles were simply too hard for my dumb ass and I had to check quick YouTube guides to solve them. Stuff like that always pulls me out of the immersion, but I guess that’s not really the game’s fault.\n\nI don't play horror games that often, and I gotta say this one is a well-rounded mix of shooter, puzzle and horror elements. [spoiler]The first couple of times Mr. X started chasing me, I was genuinely terrified hahaha. [/spoiler]\n\nEven with only low-mid-range hardware, turning the graphics up a bit still made the game look pretty great.\n\n[b]All in all, a solid 7.8/10. A fun and fairly short experience that I can definitely recommend[/b]— but don’t bother playing more than two runs unless you absolutely worship this game. Just watch “the true ending” on YouTube.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic remake, really enjoyed playing this for spooky season.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i wouldn't say its the best remake ever but it has all the cool parts of the og game plus it just good in general",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a remake of one of the best ps1 games of all time and capcom didnt ruin it, what else can u ask for? If u dont have it, buy it and play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic reimagining of re2. There are some things I prefer about the original but overall a more accessible experience than the fixed camera games. Mr. X is extremely annoying tho and isn't even scary enough to make up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the funnest games ive ever played, i replayed this game about 6 times when i was doing achievements and not once did i get bored. the gamplay is just so replayable and good. great remake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thrilling and amazing. A truly great remake to a truly great classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is designed to rage bait you. Kill the same zombie 5 times and he is still alive. You will always be low on heals and ammo. Sewers are shit. + Mr. X following you makes me shit my pants. Absolutely amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Master Piece is an understatement, they did this game absolute justice. This is a game with tons of replay ability and great story line and the graphics are insane. I really have nothing bad to say about this game aside from the fact that you will lose the day playing it because its that good. If you have not played it yet or new to the Resident Evil Series, Don't think, Just buy and play and you wont be sorry. All in all 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though this game scares the p*ss out of me, I had a great time experiencing Leon's story. Currently working on Claire's 2nd run and am eager to see hers! Game looks and plays beautifully. Getting this on sale was all the better!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So i finished this game after playing RE7, RE8, RE4R and i have to say that visuals look good, sounds great, and nails the moody Raccoon City vibe. The problem is, once you get past the atmosphere, the game design starts fighting you. Zombies take half a magazine to kill, and even then, they might “wake up” later because of the game’s cold-spawn system. You’re punished for engaging zombies in a zombie game.\n\nExploration, one of the series’ best traits, becomes a chore. The RPD is basically a maze of same-looking corridors and offices that all blur together after a while. Most rooms exist only to host a single key item or puzzle piece, then never matter again. There’s no sense of discovery — just checklist progression. Worse, Mr. X and the respawning zombies turn exploration into stress management instead of curiosity. You’re not exploring because you want to, you’re just trying to survive long enough to grab the next key. Compare that to RE4R, where every area feels handcrafted — treasure, secrets, combat routes, new enemies — the map itself rewards you for looking around. In RE2R, it’s just find item, unlock door, repeat.\n\nCombat is almost entirely unrewarding. Killing enemies drains scarce ammo and gives you nothing in return. Compare that with RE4 Remake’s elegant loop of fight -> loot -> upgrade — RE2 Remake just leaves you weaker after every encounter so It encourages speedrunning instead of exploration, which is bad, boring design.\n\nTechnically, it’s polished, and the atmosphere is strong. But as a game, it’s shallow. The enemy roster is tiny — zombies, lickers, sewer monsters, plant zombies —that's all XD. The campaign feels more like a museum tour of 1998 than a modern survival-horror experience.\n\nI don't wanna even start with Clair B scenario - 1/10 - just awful as it's almost identical as Leon first scenario. 90% same areas, same puzzles, exactly same boss fights except one at the end. \n\nIn short:\nGreat presentation. Weak gameplay loop. More nostalgia than substance.\n\nScore: 6 / 10 — Looks like survival horror, plays like inventory management with bad RNG.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bati pornoto sha padne ako q nabaram taq claire ti kaam tapravo tolkova sha q pora napravo sha sa chue v severna korea i toq leon bate bati chichkata kvo mi pravi v policiqta sa e zapisal malkoto lape da spasqva hora abe toq za kuv sa misli be az pred bloka ako go vida sha mu tura edin sha mu chupa zubite na toq baluk nqkuv izpadnal tuka pu i toq gospodin hiks bate deeba muhala kvo ma godi kat nqkuv isterik bahti lainenceto sha ma goni toq ei sq kat go hvana tolkova silno she go iznasilq che sha go skusam na dve i tiq nasrani zombita nqkvi vcherashtni guzeta na kvi sa praat i te ne znam tuka sa zeli grada nqkvi doktori tam si pravat virus v laboratorii za kitaici sa mislqt tiq klushari i taq ada kat doidi da go spasqva toq leon bate az ti kaam toq nqkuv twink ne znae kude se namira pa sha go spasqvat to toq iskat da go pegvat 20 chasa ot denq pone e jena ne znam za kuv sa e trugnal da sa misli toq leshper i sq toq s gramadnata ruka i okoto to rukata mu e tolkoz golqma shot mnoo si go bie toq az nali gi poznavam tiq misli sa za strashen toq nqkuv star bate nqma telefon mi e igral ne se surdi pedofilche kat e bil maluk starshi sigurno si misli kat gleda porno na televizora che e nqkuv portal kudeto na jivo nqkvi muje se ebat bahti igrata chovek pone claire moga da i skusam traktorite",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes constantly the only thing good about this game is the good looks of the characters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jedan od najgorih resident evil igrica, kombat sranje, muvment sranje, serem se po ovoj igrici jedino dobro je adina bulja i sise od kler, cakicu serem ti se u usta bolji je resident evil 3 remake!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible buggy mess, haven't even started playing the game and it dousnt even open anymore, pirated version run better than this lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was really excited to play this game as ive enjoyed other resident evil games however it felt insanely repetitive and annoying constantly walking through the same rooms over and over again steam should refund me this shit is fking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring, boring, boring and an extremely annoying, invincible enemy. Even though it’s easily doable, it’s just not fun. I preferred RE7 by far.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just a remake of original very linear zero replayability, is a light years away from RE 4 which is a very good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is actually the first game I've ever given a negative review on. The overall game just feels unfair. Mr. X removes any curiousity for exploration. The gameplay has you emptying half a mag on a zombie and it really just makes you ammoless for anything. each RE zombie takes like 5 bullets, 3 headshots, and sometimes they come back to life, ive seen this basically drain all my bullets and have nothing. you have no way to dodge or punch or parry zombies. your knife which should be your last solution is noninfinite and if you get attacked by a zombie, you lose that knife because its embedded into the skin of the zombie.\r\n\r\nRE4 has a knife, and RE3 has a dodge/dash/punch. in my opinion, ive had a lot better experience playing RE3's raccoon city than RE2's. Re2 feels a lot more drawn out, lengthy, it took 3 hours just to leave the police station, dear god, terrible pacing, \r\n\r\nthe only thing the RE series has up their sleeve from TLOU is the ability to craft ammo which honeslty is good for them and im glad RE2 really solified that\r\n\r\nLeon (RE2) has NO melee options if you lose your knife and have no ammo.\r\n\r\nand the worst part about this game? Mr. X. \r\n\r\nthis immovable force is big, massive, unkillable, and is the perfect enemy the game throws at you when it thinks you dont already have enough zombies on your tail.\r\n\r\nAt least with Nemesis, if you see him, youre like (oh boy we're going to fight him)\r\nsure there are some sections where you dont and youre running away from him but the attention is on him and its fun\r\nWith Tryant, there is NO cutscene, you got a big dude that can oneshot you, chases after you, no dodging. its like if they turned the Rat King Chase Scene from TLOU2 into a full game.\r\n\r\nBuy the game if you want, its not that different from RE3 except for the combat. I think this game has a good knife selection system (LB to switch to your side arm).\r\n\r\nim prob not replaying this as claire",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring, slow, annoying... I can't explain the positive reviews other than a nostalgia, the game is outdated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "мне правда не стоило покупать эту игру , она  понравиться тем кто любит задротить одну карту на протяжений половины игры , лично  я такое не люблю очееень душно было",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the game, but it only took me 10 hours to complete it. The last game I played took 12 hours. Why should I pay so much for 10-12 hours of gameplay? If Resident Evil 9 also takes 12 hours, then go away, greedy Japanese!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not my favorite out of the whole remastered series 3 and 4 def better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Turns out 4K visuals don’t magically fix 1998-level pacing and layout. The “legendary atmosphere” everyone keeps preaching about? Mostly jump scares and zombies screaming behind you like a bad Halloween attraction - subtle as a brick.\n\nHalf the game is deciding which enemies you’re meant to kill versus which ones you’re supposed to awkwardly sidestep while conserving ammo like you’re budgeting for the apocalypse. Very immersive. And for reasons known only to Capcom, the remake proudly keeps the PS1-era design: the same building, the same narrow corridors, the same tiny rooms you’ll revisit so many times you might as well start paying rent.\n\nLooks great no doubt, but under the shiny coat of paint, it’s still classic 1998 chaos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "downgraded every aspect of the original but the graphics. its boring and unfun to have Volgin chase you down while exploring the building. they also removed the zapping mechanic because god knows why. Kamiya pulled it off in 1998 but we lost the technology in 2019 sorry. they also made Ada much more annoying than she already was and not in a good way. a lot of things you will question but will never get answers in this game if you've played the original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thought I give it a try since it was on sale but boy was that a mistake. I have yet to find a game as nonsensical as this one. A police station with a built in escape route predicated on solving a medeival puzzle. Also Sorry Chris, you can’t get your gun until you solve this Victorian Royalty Exhibit Puzzle Box. \r\n\r\nThe Raccoon City Police Station is, frankly, a spatial joke: a police headquarters that functions like a gothic puzzle dungeon where basic movement is impossible without jewels, crests, relief plates, and medieval mechanisms. It asks you to believe trained police officers conducted daily operations in a building where half the rooms are locked by Renaissance escape-room gimmicks. \r\n\r\nThe environment feels like a curated obstacle course rather than a lived-in space, the threat feels constructed instead of emergent. The world feels like a themed attraction, not an actual place undergoing catastrophe.\r\n\r\nThe game’s reliance on arbitrary locks, jewels, and levers to gate progression interrupts narrative flow, constantly reminding reminding you that you're navigating a game rather than surviving in a coherent world.  Those arbitrary obstacles scream “game mechanics first, story second.” You aren’t surviving; you're solving designer-imposed riddles. Such BS can work for fast paced shooters like Doom (Green card to yellow to red), not a horror STORY, that predicates on worldbuilding, characters and motivations to create stakes and TENSION.\r\n\r\nLeon and Claire are but thin sketches, their personalities conveyed more through posture and archetype than meaningful interaction. Supporting characters like Sherry, Ada, and Annette are motivationally inconsistent, shifting behaviors to suit cutscene tension rather than psychological continuity.\r\n\r\nThe tension built by the setting collapses under the weight of these mechanical contrivances, and no amount of moody lighting or zombie groans can mask the cognitive dissonance. RE2 struggles not because it lacks atmosphere, but because it consistently sabotages the very immersion it demands.\r\n\r\nBasically it's a contrived rat maze that you're being pushed through, making \"the plot\" happen. Shut off your brain or forget about any immersion and just slog it till the end, like I did. I tried to play Claire's story after but having to endure the police station ordeal over again made me quit after an hour.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay in general, bosses always suck in the remakes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nesnáším tu mrdku zkurvené hádanky jak pes hara pes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Resident Evil 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "renet not working\r\ngame crash (lost all my game)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring slop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring just buy resident evil biohazard",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worse than the original",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fine I suppose, but it just feels like a downgrade from the original. Sure it looks good, but it's missing so many things that the original had in 1998. A remake should only add to a game, never take away",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So i finished this game after playing RE7, RE8, RE4R and i have to say that visuals look good, sounds great, and nails the moody Raccoon City vibe. The problem is, once you get past the atmosphere, the game design starts fighting you. Zombies take half a magazine to kill, and even then, they might “wake up” later because of the game’s cold-spawn system. You’re punished for engaging zombies in a zombie game.\n\nExploration, one of the series’ best traits, becomes a chore. The RPD is basically a maze of same-looking corridors and offices that all blur together after a while. Most rooms exist only to host a single key item or puzzle piece, then never matter again. There’s no sense of discovery — just checklist progression. Worse, Mr. X and the respawning zombies turn exploration into stress management instead of curiosity. You’re not exploring because you want to, you’re just trying to survive long enough to grab the next key. Compare that to RE4R, where every area feels handcrafted — treasure, secrets, combat routes, new enemies — the map itself rewards you for looking around. In RE2R, it’s just find item, unlock door, repeat.\n\nCombat is almost entirely unrewarding. Killing enemies drains scarce ammo and gives you nothing in return. Compare that with RE4 Remake’s elegant loop of fight -> loot -> upgrade — RE2 Remake just leaves you weaker after every encounter so It encourages speedrunning instead of exploration, which is bad, boring design.\n\nTechnically, it’s polished, and the atmosphere is strong. But as a game, it’s shallow. The enemy roster is tiny — zombies, lickers, sewer monsters, plant zombies —that's all XD. The campaign feels more like a museum tour of 1998 than a modern survival-horror experience.\n\nI don't wanna even start with Clair B scenario - 1/10 - just awful as it's almost identical as Leon first scenario. 90% same areas, same puzzles, exactly same boss fights except one at the end. \n\nIn short:\nGreat presentation. Weak gameplay loop. More nostalgia than substance.\n\nScore: 6 / 10 — Looks like survival horror, plays like inventory management with bad RNG.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What a dreadfully boring game. Cool graphics and it is obviously much better from a mechanical perspective than the original game. However, they failed to update the game design enough to make this a compelling experience for those not blinded by nostalgia.\n\nThe biggest issue with the game is how tanky the zombies are. Shooting zombies 15 or more times in the head before they finally die is not interesting in the slightest. The worst part is they literally show an NPC smash a zombie's head in the first 20 minutes of this game, but Leon and Claire are too stupid to do so themselves. What a joke. The game also pads its length with an absurdly limited inventory that forces joyless backtracking just for the sake of it. Or because it is “scary”. It is not remotely scary. The game has you backtrack to complete what the fans of this awful game call “puzzles”. Finding a corridor that you cannot traverse through and then finding the tool that lets you through it 10 minutes later on the linear path you were already walking on, is not a puzzle in any sense of the word. If you consider these types of game mechanics “puzzles” then I consider you to be retarded. Way way way too much of the game time is taken up with this key hunting nonsense. This was acceptable game design in 1998, but not today in my humble opinion. The player character is also far too susceptible to being unfairly grabbed by zombies. I cannot decide if the game wants me to run past zombies to save ammo or not because of how inconsistent and unfair the zombie lunge and grab game are. It doesn’t help that our “heroes” have a max speed of a healthy 4mph shamble. They are literally BARELY faster than the base zombies when \"running\". It is pathetic and cheap as a game mechanic. \n\nAlso, the writing is really bad and it is disappointing how 90s Japan jank it seems. And the voice acting sucks. It does a really good job of reminding everyone how cringe the 90s game culture was and how bad the writing was at the beginning of disc based games. I guess most games are still poorly written, as demonstrated here. \n\nSo, the game mechanics are polished and the graphics are great, but the core gameplay loop is just awful with the zombies being absolutely obnoxious and the movement speed being absolutely pathetic. The original RE4 is better and I think that game has aged very very poorly. The RE4 remake is WAYY better than this trash. Stay away from this nostalgia bait garbage.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Everything about this Mr X f**ker is horrible, and boss fights are horrendous, no dodge just walk around while a huge meat pile launches at you full speed, managable but not fun at all.\r\nOther than that pretty solid, but its a ruined experience for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The story is ok but the gameplay gets pretty stale very quick. Most of the enemies take way too many hits to die and the game is very stingy on ammo until the final boss. And if you run out of it, you can even punch or do anything. You basically get soft locked and forced to restart the whole game which I had to do once on Claire's chapter. Go play another resident evil game like 4 or 5 cause this one was just god awful gameplay. 4 out of 10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bati pornoto sha padne ako q nabaram taq claire ti kaam tapravo tolkova sha q pora napravo sha sa chue v severna korea i toq leon bate bati chichkata kvo mi pravi v policiqta sa e zapisal malkoto lape da spasqva hora abe toq za kuv sa misli be az pred bloka ako go vida sha mu tura edin sha mu chupa zubite na toq baluk nqkuv izpadnal tuka pu i toq gospodin hiks bate deeba muhala kvo ma godi kat nqkuv isterik bahti lainenceto sha ma goni toq ei sq kat go hvana tolkova silno she go iznasilq che sha go skusam na dve i tiq nasrani zombita nqkvi vcherashtni guzeta na kvi sa praat i te ne znam tuka sa zeli grada nqkvi doktori tam si pravat virus v laboratorii za kitaici sa mislqt tiq klushari i taq ada kat doidi da go spasqva toq leon bate az ti kaam toq nqkuv twink ne znae kude se namira pa sha go spasqvat to toq iskat da go pegvat 20 chasa ot denq pone e jena ne znam za kuv sa e trugnal da sa misli toq leshper i sq toq s gramadnata ruka i okoto to rukata mu e tolkoz golqma shot mnoo si go bie toq az nali gi poznavam tiq misli sa za strashen toq nqkuv star bate nqma telefon mi e igral ne se surdi pedofilche kat e bil maluk starshi sigurno si misli kat gleda porno na televizora che e nqkuv portal kudeto na jivo nqkvi muje se ebat bahti igrata chovek pone claire moga da i skusam traktorite",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Jedan od najgorih resident evil igrica, kombat sranje, muvment sranje, serem se po ovoj igrici jedino dobro je adina bulja i sise od kler, cakicu serem ti se u usta bolji je resident evil 3 remake!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i liked the game but for some reason when i started to play as claire the game decided it doesnt want to work anymore and its just crashing as soon as i meet an enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible buggy mess, haven't even started playing the game and it dousnt even open anymore, pirated version run better than this lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "amazing game if you want to run circles constantly, do tedious puzzles, and watch youtube playthroughs just to know where to go more than half the time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring, slow, annoying... I can't explain the positive reviews other than a nostalgia, the game is outdated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "мне правда не стоило покупать эту игру , она  понравиться тем кто любит задротить одну карту на протяжений половины игры , лично  я такое не люблю очееень душно было",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is actually the first game I've ever given a negative review on. The overall game just feels unfair. Mr. X removes any curiousity for exploration. The gameplay has you emptying half a mag on a zombie and it really just makes you ammoless for anything. each RE zombie takes like 5 bullets, 3 headshots, and sometimes they come back to life, ive seen this basically drain all my bullets and have nothing. you have no way to dodge or punch or parry zombies. your knife which should be your last solution is noninfinite and if you get attacked by a zombie, you lose that knife because its embedded into the skin of the zombie.\r\n\r\nRE4 has a knife, and RE3 has a dodge/dash/punch. in my opinion, ive had a lot better experience playing RE3's raccoon city than RE2's. Re2 feels a lot more drawn out, lengthy, it took 3 hours just to leave the police station, dear god, terrible pacing, \r\n\r\nthe only thing the RE series has up their sleeve from TLOU is the ability to craft ammo which honeslty is good for them and im glad RE2 really solified that\r\n\r\nLeon (RE2) has NO melee options if you lose your knife and have no ammo.\r\n\r\nand the worst part about this game? Mr. X. \r\n\r\nthis immovable force is big, massive, unkillable, and is the perfect enemy the game throws at you when it thinks you dont already have enough zombies on your tail.\r\n\r\nAt least with Nemesis, if you see him, youre like (oh boy we're going to fight him)\r\nsure there are some sections where you dont and youre running away from him but the attention is on him and its fun\r\nWith Tryant, there is NO cutscene, you got a big dude that can oneshot you, chases after you, no dodging. its like if they turned the Rat King Chase Scene from TLOU2 into a full game.\r\n\r\nBuy the game if you want, its not that different from RE3 except for the combat. I think this game has a good knife selection system (LB to switch to your side arm).\r\n\r\nim prob not replaying this as claire",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked the game, but it only took me 10 hours to complete it. The last game I played took 12 hours. Why should I pay so much for 10-12 hours of gameplay? If Resident Evil 9 also takes 12 hours, then go away, greedy Japanese!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks. What is point of a game with finite ammo, enemies that die of RNG, regenerate, and you cant even doge tor shit? Fuck this game. Seriously what a terrible miserable pain in the ass joyless experience. Worse than a movie. Its like playing a movie where the only control you have is a burden. Massive failure, would fight the devs if i ever met them. Offensively miserable to play.\n\nRevising this review after beating Leons story. This game is dog crap. Truly miserable in every way. Ruined the franchise. After village was terrible and this is terrible, i will not be buying another RE game on less than an 80% discount ever again.\n\nPlease jsut do waht you did on re7 again. This is so bad. God I pray the re4 remake is not as miserable an experience as this. MISERABLE.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thought I give it a try since it was on sale but boy was that a mistake. I have yet to find a game as nonsensical as this one. A police station with a built in escape route predicated on solving a medeival puzzle. Also Sorry Chris, you can’t get your gun until you solve this Victorian Royalty Exhibit Puzzle Box. \r\n\r\nThe Raccoon City Police Station is, frankly, a spatial joke: a police headquarters that functions like a gothic puzzle dungeon where basic movement is impossible without jewels, crests, relief plates, and medieval mechanisms. It asks you to believe trained police officers conducted daily operations in a building where half the rooms are locked by Renaissance escape-room gimmicks. \r\n\r\nThe environment feels like a curated obstacle course rather than a lived-in space, the threat feels constructed instead of emergent. The world feels like a themed attraction, not an actual place undergoing catastrophe.\r\n\r\nThe game’s reliance on arbitrary locks, jewels, and levers to gate progression interrupts narrative flow, constantly reminding reminding you that you're navigating a game rather than surviving in a coherent world.  Those arbitrary obstacles scream “game mechanics first, story second.” You aren’t surviving; you're solving designer-imposed riddles. Such BS can work for fast paced shooters like Doom (Green card to yellow to red), not a horror STORY, that predicates on worldbuilding, characters and motivations to create stakes and TENSION.\r\n\r\nLeon and Claire are but thin sketches, their personalities conveyed more through posture and archetype than meaningful interaction. Supporting characters like Sherry, Ada, and Annette are motivationally inconsistent, shifting behaviors to suit cutscene tension rather than psychological continuity.\r\n\r\nThe tension built by the setting collapses under the weight of these mechanical contrivances, and no amount of moody lighting or zombie groans can mask the cognitive dissonance. RE2 struggles not because it lacks atmosphere, but because it consistently sabotages the very immersion it demands.\r\n\r\nBasically it's a contrived rat maze that you're being pushed through, making \"the plot\" happen. Shut off your brain or forget about any immersion and just slog it till the end, like I did. I tried to play Claire's story after but having to endure the police station ordeal over again made me quit after an hour.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay in general, bosses always suck in the remakes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nesnáším tu mrdku zkurvené hádanky jak pes hara pes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "renet not working\r\ngame crash (lost all my game)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring just buy resident evil biohazard",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worse than the original",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sewers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's fine I suppose, but it just feels like a downgrade from the original. Sure it looks good, but it's missing so many things that the original had in 1998. A remake should only add to a game, never take away",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "What a dreadfully boring game. Cool graphics and it is obviously much better from a mechanical perspective than the original game. However, they failed to update the game design enough to make this a compelling experience for those not blinded by nostalgia.\n\nThe biggest issue with the game is how tanky the zombies are. Shooting zombies 15 or more times in the head before they finally die is not interesting in the slightest. The worst part is they literally show an NPC smash a zombie's head in the first 20 minutes of this game, but Leon and Claire are too stupid to do so themselves. What a joke. The game also pads its length with an absurdly limited inventory that forces joyless backtracking just for the sake of it. Or because it is “scary”. It is not remotely scary. The game has you backtrack to complete what the fans of this awful game call “puzzles”. Finding a corridor that you cannot traverse through and then finding the tool that lets you through it 10 minutes later on the linear path you were already walking on, is not a puzzle in any sense of the word. If you consider these types of game mechanics “puzzles” then I consider you to be retarded. Way way way too much of the game time is taken up with this key hunting nonsense. This was acceptable game design in 1998, but not today in my humble opinion. The player character is also far too susceptible to being unfairly grabbed by zombies. I cannot decide if the game wants me to run past zombies to save ammo or not because of how inconsistent and unfair the zombie lunge and grab game are. It doesn’t help that our “heroes” have a max speed of a healthy 4mph shamble. They are literally BARELY faster than the base zombies when \"running\". It is pathetic and cheap as a game mechanic. \n\nAlso, the writing is really bad and it is disappointing how 90s Japan jank it seems. And the voice acting sucks. It does a really good job of reminding everyone how cringe the 90s game culture was and how bad the writing was at the beginning of disc based games. I guess most games are still poorly written, as demonstrated here. \n\nSo, the game mechanics are polished and the graphics are great, but the core gameplay loop is just awful with the zombies being absolutely obnoxious and the movement speed being absolutely pathetic. The original RE4 is better and I think that game has aged very very poorly. The RE4 remake is WAYY better than this trash. Stay away from this nostalgia bait garbage.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Everything about this Mr X f**ker is horrible, and boss fights are horrendous, no dodge just walk around while a huge meat pile launches at you full speed, managable but not fun at all.\r\nOther than that pretty solid, but its a ruined experience for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So i finished this game after playing RE7, RE8, RE4R and i have to say that visuals look good, sounds great, and nails the moody Raccoon City vibe. The problem is, once you get past the atmosphere, the game design starts fighting you. Zombies take half a magazine to kill, and even then, they might “wake up” later because of the game’s cold-spawn system. You’re punished for engaging zombies in a zombie game.\n\nExploration, one of the series’ best traits, becomes a chore. The RPD is basically a maze of same-looking corridors and offices that all blur together after a while. Most rooms exist only to host a single key item or puzzle piece, then never matter again. There’s no sense of discovery — just checklist progression. Worse, Mr. X and the respawning zombies turn exploration into stress management instead of curiosity. You’re not exploring because you want to, you’re just trying to survive long enough to grab the next key. Compare that to RE4R, where every area feels handcrafted — treasure, secrets, combat routes, new enemies — the map itself rewards you for looking around. In RE2R, it’s just find item, unlock door, repeat.\n\nCombat is almost entirely unrewarding. Killing enemies drains scarce ammo and gives you nothing in return. Compare that with RE4 Remake’s elegant loop of fight -> loot -> upgrade — RE2 Remake just leaves you weaker after every encounter so It encourages speedrunning instead of exploration, which is bad, boring design.\n\nTechnically, it’s polished, and the atmosphere is strong. But as a game, it’s shallow. The enemy roster is tiny — zombies, lickers, sewer monsters, plant zombies —that's all XD. The campaign feels more like a museum tour of 1998 than a modern survival-horror experience.\n\nI don't wanna even start with Clair B scenario - 1/10 - just awful as it's almost identical as Leon first scenario. 90% same areas, same puzzles, exactly same boss fights except one at the end. \n\nIn short:\nGreat presentation. Weak gameplay loop. More nostalgia than substance.\n\nScore: 6 / 10 — Looks like survival horror, plays like inventory management with bad RNG.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bati pornoto sha padne ako q nabaram taq claire ti kaam tapravo tolkova sha q pora napravo sha sa chue v severna korea i toq leon bate bati chichkata kvo mi pravi v policiqta sa e zapisal malkoto lape da spasqva hora abe toq za kuv sa misli be az pred bloka ako go vida sha mu tura edin sha mu chupa zubite na toq baluk nqkuv izpadnal tuka pu i toq gospodin hiks bate deeba muhala kvo ma godi kat nqkuv isterik bahti lainenceto sha ma goni toq ei sq kat go hvana tolkova silno she go iznasilq che sha go skusam na dve i tiq nasrani zombita nqkvi vcherashtni guzeta na kvi sa praat i te ne znam tuka sa zeli grada nqkvi doktori tam si pravat virus v laboratorii za kitaici sa mislqt tiq klushari i taq ada kat doidi da go spasqva toq leon bate az ti kaam toq nqkuv twink ne znae kude se namira pa sha go spasqvat to toq iskat da go pegvat 20 chasa ot denq pone e jena ne znam za kuv sa e trugnal da sa misli toq leshper i sq toq s gramadnata ruka i okoto to rukata mu e tolkoz golqma shot mnoo si go bie toq az nali gi poznavam tiq misli sa za strashen toq nqkuv star bate nqma telefon mi e igral ne se surdi pedofilche kat e bil maluk starshi sigurno si misli kat gleda porno na televizora che e nqkuv portal kudeto na jivo nqkvi muje se ebat bahti igrata chovek pone claire moga da i skusam traktorite",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes constantly the only thing good about this game is the good looks of the characters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jedan od najgorih resident evil igrica, kombat sranje, muvment sranje, serem se po ovoj igrici jedino dobro je adina bulja i sise od kler, cakicu serem ti se u usta bolji je resident evil 3 remake!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible buggy mess, haven't even started playing the game and it dousnt even open anymore, pirated version run better than this lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was really excited to play this game as ive enjoyed other resident evil games however it felt insanely repetitive and annoying constantly walking through the same rooms over and over again steam should refund me this shit is fking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring, boring, boring and an extremely annoying, invincible enemy. Even though it’s easily doable, it’s just not fun. I preferred RE7 by far.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just a remake of original very linear zero replayability, is a light years away from RE 4 which is a very good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is actually the first game I've ever given a negative review on. The overall game just feels unfair. Mr. X removes any curiousity for exploration. The gameplay has you emptying half a mag on a zombie and it really just makes you ammoless for anything. each RE zombie takes like 5 bullets, 3 headshots, and sometimes they come back to life, ive seen this basically drain all my bullets and have nothing. you have no way to dodge or punch or parry zombies. your knife which should be your last solution is noninfinite and if you get attacked by a zombie, you lose that knife because its embedded into the skin of the zombie.\r\n\r\nRE4 has a knife, and RE3 has a dodge/dash/punch. in my opinion, ive had a lot better experience playing RE3's raccoon city than RE2's. Re2 feels a lot more drawn out, lengthy, it took 3 hours just to leave the police station, dear god, terrible pacing, \r\n\r\nthe only thing the RE series has up their sleeve from TLOU is the ability to craft ammo which honeslty is good for them and im glad RE2 really solified that\r\n\r\nLeon (RE2) has NO melee options if you lose your knife and have no ammo.\r\n\r\nand the worst part about this game? Mr. X. \r\n\r\nthis immovable force is big, massive, unkillable, and is the perfect enemy the game throws at you when it thinks you dont already have enough zombies on your tail.\r\n\r\nAt least with Nemesis, if you see him, youre like (oh boy we're going to fight him)\r\nsure there are some sections where you dont and youre running away from him but the attention is on him and its fun\r\nWith Tryant, there is NO cutscene, you got a big dude that can oneshot you, chases after you, no dodging. its like if they turned the Rat King Chase Scene from TLOU2 into a full game.\r\n\r\nBuy the game if you want, its not that different from RE3 except for the combat. I think this game has a good knife selection system (LB to switch to your side arm).\r\n\r\nim prob not replaying this as claire",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring, slow, annoying... I can't explain the positive reviews other than a nostalgia, the game is outdated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "мне правда не стоило покупать эту игру , она  понравиться тем кто любит задротить одну карту на протяжений половины игры , лично  я такое не люблю очееень душно было",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the game, but it only took me 10 hours to complete it. The last game I played took 12 hours. Why should I pay so much for 10-12 hours of gameplay? If Resident Evil 9 also takes 12 hours, then go away, greedy Japanese!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not my favorite out of the whole remastered series 3 and 4 def better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Turns out 4K visuals don’t magically fix 1998-level pacing and layout. The “legendary atmosphere” everyone keeps preaching about? Mostly jump scares and zombies screaming behind you like a bad Halloween attraction - subtle as a brick.\n\nHalf the game is deciding which enemies you’re meant to kill versus which ones you’re supposed to awkwardly sidestep while conserving ammo like you’re budgeting for the apocalypse. Very immersive. And for reasons known only to Capcom, the remake proudly keeps the PS1-era design: the same building, the same narrow corridors, the same tiny rooms you’ll revisit so many times you might as well start paying rent.\n\nLooks great no doubt, but under the shiny coat of paint, it’s still classic 1998 chaos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "downgraded every aspect of the original but the graphics. its boring and unfun to have Volgin chase you down while exploring the building. they also removed the zapping mechanic because god knows why. Kamiya pulled it off in 1998 but we lost the technology in 2019 sorry. they also made Ada much more annoying than she already was and not in a good way. a lot of things you will question but will never get answers in this game if you've played the original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thought I give it a try since it was on sale but boy was that a mistake. I have yet to find a game as nonsensical as this one. A police station with a built in escape route predicated on solving a medeival puzzle. Also Sorry Chris, you can’t get your gun until you solve this Victorian Royalty Exhibit Puzzle Box. \r\n\r\nThe Raccoon City Police Station is, frankly, a spatial joke: a police headquarters that functions like a gothic puzzle dungeon where basic movement is impossible without jewels, crests, relief plates, and medieval mechanisms. It asks you to believe trained police officers conducted daily operations in a building where half the rooms are locked by Renaissance escape-room gimmicks. \r\n\r\nThe environment feels like a curated obstacle course rather than a lived-in space, the threat feels constructed instead of emergent. The world feels like a themed attraction, not an actual place undergoing catastrophe.\r\n\r\nThe game’s reliance on arbitrary locks, jewels, and levers to gate progression interrupts narrative flow, constantly reminding reminding you that you're navigating a game rather than surviving in a coherent world.  Those arbitrary obstacles scream “game mechanics first, story second.” You aren’t surviving; you're solving designer-imposed riddles. Such BS can work for fast paced shooters like Doom (Green card to yellow to red), not a horror STORY, that predicates on worldbuilding, characters and motivations to create stakes and TENSION.\r\n\r\nLeon and Claire are but thin sketches, their personalities conveyed more through posture and archetype than meaningful interaction. Supporting characters like Sherry, Ada, and Annette are motivationally inconsistent, shifting behaviors to suit cutscene tension rather than psychological continuity.\r\n\r\nThe tension built by the setting collapses under the weight of these mechanical contrivances, and no amount of moody lighting or zombie groans can mask the cognitive dissonance. RE2 struggles not because it lacks atmosphere, but because it consistently sabotages the very immersion it demands.\r\n\r\nBasically it's a contrived rat maze that you're being pushed through, making \"the plot\" happen. Shut off your brain or forget about any immersion and just slog it till the end, like I did. I tried to play Claire's story after but having to endure the police station ordeal over again made me quit after an hour.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay in general, bosses always suck in the remakes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nesnáším tu mrdku zkurvené hádanky jak pes hara pes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Resident Evil 2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "renet not working\r\ngame crash (lost all my game)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring slop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring just buy resident evil biohazard",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worse than the original",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}