{
  "positive": [
    {
      "review": "Absorbing game. Remaster has extra features and better graphics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Enjoyable game, played the original many years ago. few bits i feel need improving such as the AI and command of units, you can lose a unit pretty easily due to it not following your command due to one person being stuck in combat.\n\noverall though i would recommend when its on sale at least.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the classic game-my only complaint is the small lettering and font on information panels. sometimes can barely read or feel like I need a magnifying glass. there needs to be an option to increase size of letters numbers and words to make more readable.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have played Total War: Medieval for a decent amount of time. I have to say that it is pretty accessible, doesn't have as many bugs as it used to before and runs well.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great remake of a great game. campaign map is fun and battle mechanics are a great rock, paper, scissors game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for middle of the road, occasional players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worth the money especially if you like the base game from the much improved performance, amazing modding, and ability to toggle what you like and dont like about the base game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a classic for a reason, well balanced, with plenty of play options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great strategy game with awesome direct control in battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better then Rome II. But would you imagine that it crashes an average of 2 times per hour. Else. great timeline, mediocre game for it and only game on the market for such timeline (Hannibal era). Closest you are going to get to Medieval II with all these new Total-ly Soulless games. It does have personality, and the only one since Empire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the mods that make it amazing! the base game was once one of a kind! but now there are newer total war games to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grand strategy and military/economic development",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gods... I love Gauls. My grandfather loved them too, even before he read the Asterix comics  with his eyes. Did you think I'd be out here on the frontier without good reason? Yes, Rome needs a strong frontier. Yes, Rome does need unwashed barbarians at her gates! So, that's why I'm here, the leader of the Julii: to bring Roman friendship to pleasant  Gauls. Befriending others? That'd be good too. This relationship with the Gauls will last long, and when it's done, I've got plans. This is all about friendship, chums in Rome. Going down that road means dealing with all my future friends : the Senate, the Greeks, those Carthaginian elephant-riders, the Scipii and the Brutii families too. After all, the man who's friends with Rome befriends the world...and one day, I will be their buddies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like the original only better.  Bots much better, not sure i like micromanaging Merchants, I have people to handle that crap.  ;  )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest turn based strategy game of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fantastic remaster. Any chance of more remasters? Perhaps an Empire remaster?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing only wished ai is bit more agressiv with wars against other factions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice beer and pretzels game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun and worth the money for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game been playing the original for many years, now loving this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "imi place e putin diferit fata de original dar e frumos de jucat acesta",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelent, this is my favorite strategy game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Veni, Vidi, Vici!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "enjoyed it more after turning the advisor off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic and awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure as yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very mind bending",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stratagy game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blast from the past",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge fan since TW Rome original release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best total war of all!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bello come l'originale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ROME FOR EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE GOAT IN HD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":D!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "og",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ξυρ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "123 abc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A faithful remaster of the original and better in every way apart from the UI. If you can stomach the UI redesign, the remaster is the same game with better options, graphics, and stability. Feral did a great job, and I wish other legacy games got this sort of treatment. Only wish we had Multiplayer campaign here.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "A remaster of the greatest game ever made… What is not to love? \nThis Remaster is (mostly) very dutiful to the original but is updated to run on modern computers with some extra tweaks. Just as a remaster should be.\n\nIf you never played the original, then this is an excellent game that I would heartily recommend. However, if you did play the original then the picture becomes more complicated as they both have their merits and both have their downsides. It is worth noting that since the release of the Remaster, you can no longer buy the original. If you can find an old disk set then you can still play of course.\n\n+ The most important positive of the remaster is that the original is so old that many modern computers simply can’t run the game at a playable framerate. The remaster runs smoothly on a modern system and if you were struggling with this then the remaster is a godsend!\n+ Several small unit tweaks have been made to improve the game balance (such as the Armenian infantry morale)\n+ Plenty of features have been added and can be toggled on/off. Even if you disagree with changing the population mechanic, you can simply toggle this off. That choice is great (although some choices do get out together which can be frustrating).\n+ Most of the original unplayable factions are now accessible.\n+ Mod options are significantly expanded.\n+ Significant quality of life improvements, including excellent maps on the campaign.\n +/-  Graphics have been updated. I personally prefer the original style and think it has aged quite gracefully.\n \nThere are plenty of positives so why do I play the original 90% of the time?  \n- The original loads much, much quicker\n- The UI is much better on the original. This is the one area where they did not dutifully remaster the original. They remade it, and made it worse. It is far clearer and more user friendly in the original and this is the biggest factor by far from me when choosing to play the original.\n- There are some weird tweaks seem to have happened like the Phalanx formation - which became significantly more flimsy in the remaster. Seeing a phalanx beaten by a frontal charge of light Greek cavalry is just wrong.\n- Similarly, the music doesn’t pause as the battle is paused. This is a small personal gripe but it does impact the sensation of the battle and some suspense is lost as a result of this change (and this is not something you can toggle on/off).\n- The Remastered added some new things like Merchants that feel fairly pointless and whilst you can just toggle this off, it doesn’t feel true to the original and it becomes grating that they add new features to the game but chose not to improve some of the key issues with the original such as city pathfinding.\n\n\nIt is worth mentioning the DLC. Barbarian Invasion is excellent and provides a similar amount of playtime potential to the main game. This comes with some extra tweaks: Most notably, it included making the emergent factions playable as and when they emerge - this is amazing and probably my favourite thing about the remaster.\n\nThe Alexander DLC was always a rushed title with significantly more potential. The remaster missed many opportunities to fix its many problems. This was not remastered at all. You can’t polish a turd and this game needed some significant changes. They just added polish and resold it. Shame.\n\nAt £30. You are getting a great game, 1 excellent DLC and a second DLC that they might as well have ignored seeing as they remastered nothing. This price is OK, but considering a significant amount of buyers probably have/had the original, I don’t feel it is worth it unless the original game does not run on your modern computer. \n\nIn the end, I will select Recommended here because at its core this is Rome Total War - to me, the best game ever made. But if you have the original and it runs fine on your pc then I personally don’t think it is worth the money.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Great remaster with workshop support that lets you tweak the game to however you feel. I like opting for a HD version of the original version's graphics.\n\nI've seen many people complain about the UI, and I found it very awkward to use at first. After a couple of hours though it's completely fine. There's still some things I wish I could tweak about it, but nothing major.\n\nThe AI and balancing improvements are a welcome addition. Being able to use night battles in the base game is great. Merchants are an interesting unit in theory, but I find them lackluster in practice.\n\nGreat stuff. Arguably the best way to play the original Rome now, considering the original's heavy incompatibility with modern hardware.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Enjoyable game, played the original many years ago. few bits i feel need improving such as the AI and command of units, you can lose a unit pretty easily due to it not following your command due to one person being stuck in combat.\n\noverall though i would recommend when its on sale at least.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absorbing game. Remaster has extra features and better graphics.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great update to the old classic. Been playing since the original came out. Still a fun historical game. My son now plays.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "UI concerns aside (though honestly, it never really bothered me), I actually love this remaster. The one thing I didn't like about the original RTW—and I'll admit I'm spoiled by modern Total War—was the camera controls.\nThe remaster fixes this masterfully. Makes gameplay feel fluid and smooth.\nLots of good mods on the workshop, too.\nDefinitely recommend.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've played Total War: Rome II before, but never tried the first one, so I gave it a go, and it was pretty awesome. I'm loving the nostalgic music in the background.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "worth the money especially if you like the base game from the much improved performance, amazing modding, and ability to toggle what you like and dont like about the base game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the classic game-my only complaint is the small lettering and font on information panels. sometimes can barely read or feel like I need a magnifying glass. there needs to be an option to increase size of letters numbers and words to make more readable.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great remake of a great game. campaign map is fun and battle mechanics are a great rock, paper, scissors game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played Total War: Medieval for a decent amount of time. I have to say that it is pretty accessible, doesn't have as many bugs as it used to before and runs well.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its not necessarily better than the original but its good, easily moddable and works on modern hardware",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels more like a modern re-release than a remaster. Basically the same game as the original, including the same issues the original had as well. The only real changes are the visuals, UI, and that it runs better on modern systems. Still a positive review only because the gameplay is as good as the original.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Classic. Got the same old bugs that I knew as a kid, but the updated UI, factions, and AI behaviors are great to see!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible nostalgia, unit details, and a killer soundtrack. This is the upgrade the original needed to free up some of your imagination by drawing out the details in the graphics and game play smoothness. Now you can hop in and fully immerse yourself in a bloody clash for your survival!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun as I remembered the original.  CA did a good job with this remastered version.  Would like to see a remastered version of Medieval 2 and Fall of the Samurai.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Replaying an improved classic game. \r\nOne of the best of all time. \r\nI loved Shogun 1, Rome Total War, Shogun 2, and Three Kingdoms. \r\nThe others not so much.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Rome Total War was a classic and this remaster faithfully brings RTW into the modern era of graphics and user interface.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some changes take a bit of getting used to but overall I feel this was a step in the right direction - finding it has a great degree of replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up playing this game and its amazing to still be able to play it in a remastered edition. So nostalgic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My husband gifted me this game and then got mad when I played it for 10 hours straight. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The remastered edition of the original Rome: Total War is exceptional. I love being able to pick and choose various elements to enhance gameplay or simply revert to the OG style of play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for middle of the road, occasional players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a classic for a reason, well balanced, with plenty of play options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If CA stuck to this style, and refine the games instead of dumbing them down in future iterations....they wouldn't be stuck in the rut they are today. No School like Old School.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Roma may have impacted the world as we know it just as much as any people known by history so i consider this game a learning experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!! I played the original with a disk many years ago!! Loved it! Spent many, many hours on this game. I can even remember the first few times i went to start a battle and would listen to the general hype up his army before the battle. Awesome stuff!!  Love the Total war series!! I played shogun and Medieval before this game as well. Loved them also!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very playable, though there are still various bugs in the game. One was quite funny to me as a general of mine and his entire expensive army dissapeared in my Romano-British campaign. I chalked this up to him cooking the books a bit and pocketing the wages :') Decent enough remaster, though they will need to do better if they do a Medieval 2 one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besieged a turdetani settlement and the governor was BIGGUS DICKUS. 10/10 for monty python references in the mods. I still like the OG campaign map art style this one still looks a bit more moba but I'll take it. Nostalgia hits quite hard and I'm thankful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its big game, i from rome total war first version \r\nits my lovely game after 10+ years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've still never fully gotten used to the ui change from original rome1, and I think its just worse, but the battles look great, ai options are more interesting, and the mods... the mods make this so worth it there's tons of great ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rome: Total War was my introduction into all the Total Wars, and remains by far my favorite. The remastered version is prettier and I expect I will continue playing for quite a while. Hoplites are addictive, I guess. At its core, this is what I always wished the Civilizations  games (or really pick your 4X game) would be, and I think Rome moreso than the other Total War games I've played really nailed it for me - overall strategy and building your cities and general spreadsheet shenanigans, but then tactical battles where you control the units and ultimate outcome. You can get into the nitty gritty of city management as much as you want and tailor the experience to your taste. Master of Orion 2 (and the \"new\" Master of Orion) nailed it similarly in the sci-fi genre. Did I mention hoplites? I love me some polearm-wielding tanks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rome Total War was one of my favourite games growing up. This remaster not only offers that experience in a better package but it grounds the experience. Playing the original game can be a bit clumsy with the UI glitching out at times especially during battles when you speed up time. Here with the modernized unit and camera controls not to mention the better performance it is simply a joy to play not to mention a gorgeous looking game. The UI can take a bit of getting used to, and I wish that they had kept the original layout of the game, however that is a tradeoff I will make to experience the game in a stable and better looking package. For fans of the era or grand strategy fans in general this is an easy game to recommend, the perfect mix of fun and a rewarding challenge. The battles in this game are quite similar to Medieval II in that if done right you can accomplish incredibly fun victories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really only get this if you want to play Rome 1 and Alexander or you want to mod Rome: Remastered itself. Other than that, just get Rome II. It's better, has better mods and DLCs, and has better mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In a perfect world, remasters work out because a change to baseline code or a new engine -what have you. Love the game, and I still hate it. The constant glitches wiping out entire units or immortal cavalry slow-marching through a formation with MTG deathtouch, missile weapons being useless, and morale as fragile as a Prince Rupert's tail. \n\nAnd the coffin nail is the pathfinding. Units just refusing orders, standing there like deer in the headlights because one soldier is halfway across the battlefield fighting... something.\n\nBut I get to sack Rome as the Gauls, and THAT's what truly matters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic strategy game with lots of fun mods. The outdated UI is worth getting used to as its very unique compared to the other games in the series. Very grounded in realty with economic managing and every lost man in an army being a careful risk taken due to the no free replenishment offered by the other games. Worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this  game! Gives me the nostalgia of the original with a little more polish whilst still being recognisable! Recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The UI is far for being perfect but it provides a lot of useful information that wasn't shown in the original game (faction reputation,  map overlays...)\nThe wiki doesn't open as expected but you can find it in a folder on your disk: SteamLibrary/steamapps/common/Total War ROME REMASTERED/Contents/Resources/Data/manual\nPathfinding is still problematic (particularly during sieges)\nI had some crashes (2-3 in 60+ hours of gameplay)\nOvervall I think it's a bit pricy considering the improvements but I sill recommended it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came has bug in it sad has not been fix.\r\n\r\nGerard McAuley (Feral Interactive)\r\n\r\nSep 5, 2025, 12:17 GMT+1\r\n\r\nHi Jack,\r\n\r\nWe are aware of an issue where the in-game wiki is not appearing. The issue is related to a problem with the way the Steam overlay functions, and we notified Valve to see if it can be resolved. Unfortunately the issue still occurs.\r\n\r\nIn the meantime, you will be able to access the wiki by opening the index.html file via a browser. This is found in the following location:\r\n\r\n~/.local/share/Steam/steamapps/common/Total War ROME REMASTERED/share/data/manual/en/index.html\r\n\r\nThis will open the wiki in your browser.\r\n\r\nWe hope this helps. Please let us know if you require any further assistance.\r\n\r\nBest regards,\r\n\r\nGerard McAuley\r\nFeral Interactive Support\r\nhttp://support.feralinteractive.com",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great strategy game with awesome direct control in battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better then Rome II. But would you imagine that it crashes an average of 2 times per hour. Else. great timeline, mediocre game for it and only game on the market for such timeline (Hannibal era). Closest you are going to get to Medieval II with all these new Total-ly Soulless games. It does have personality, and the only one since Empire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the mods that make it amazing! the base game was once one of a kind! but now there are newer total war games to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gods... I love Gauls. My grandfather loved them too, even before he read the Asterix comics  with his eyes. Did you think I'd be out here on the frontier without good reason? Yes, Rome needs a strong frontier. Yes, Rome does need unwashed barbarians at her gates! So, that's why I'm here, the leader of the Julii: to bring Roman friendship to pleasant  Gauls. Befriending others? That'd be good too. This relationship with the Gauls will last long, and when it's done, I've got plans. This is all about friendship, chums in Rome. Going down that road means dealing with all my future friends : the Senate, the Greeks, those Carthaginian elephant-riders, the Scipii and the Brutii families too. After all, the man who's friends with Rome befriends the world...and one day, I will be their buddies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like the original only better.  Bots much better, not sure i like micromanaging Merchants, I have people to handle that crap.  ;  )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strategic and tactical with finance and politics thrown in for good measure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good modernised version of a great classic.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Game does not work with Windows 11 even though it only came out 5 months before it was Windows 11 was released.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Don't fix it if it ain't broken. The UI changes  just make no sense managing settlements and army's takes a few extra click every time compared to the original game. The AI has defently been improved a little but I can't bring my self to play this when I can just play the original or medieval II. Over all the game is fine its Rome but the UI is just a absolute letdown. Would recommend to skip this one.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Sadly...this game is so buggy it's practically uplayable at times.\r\nIt constantly crashes randomly.\r\nSometimes you can play for hours without problems, then suddenly it crashes back to the desktop. \r\nOthertimes it crashes after five minutes.\r\nI've even had one case where the game freezes. I can move the mouse and hear the menu's but can't see them and can't click on anything.\r\nWhen it works...it's a great game... but it crashes WAY TOO MUCH to be able to recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "computer freezes during loading. looked at the forum. it existed a year ago. refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rome Total War Remastered, a game released in year 2021, feels like a product carried almost entirely by nostalgia rather than genuine quality. Most people who bought it seem to have done so out of affection for the original game, out of frustration with Creative Assembly’s recent titles, or simply because a few popular YouTubers heavily praised it. But once the initial hype settled, the reality became hard to ignore.\n\nThe original Rome: Total War — a 20-year-old game — still has almost the same number of active players as this Remastered version. And Rome II, a game that many of us initially disliked at launch due to its problems, is today the second most-played Total War title by a large margin. Meanwhile, this Remastered edition struggles to maintain a meaningful player base despite being reviewed as if it were some kind of triumphant return. The numbers tell a very different story.\n\nOn a technical level, the game simply isn’t an upgrade. The interface, HUD, and camera controls feel worse than the original. The realistic textures placed on top of outdated, low-quality models often stretch, glitch, or warp, creating a visual result that feels less immersive and more cartoonish compared to the 2004 game. For something marketed as a visual improvement, the graphics frequently end up looking worse.\n\nEven the modding scene was far stronger in the original. Mods like Rome Surrectum II and Europa Barbarorum were ambitious, polished, and genuinely transformative. The current mod offerings for the Remastered version don’t come close to what the community achieved on the original engine.\n\nIn short, Rome Total War Remastered is treated far more positively than it deserves. If you want the true Rome experience, the original game — with its far superior mods and more coherent visual style — still offers more depth and charm than this overpriced remaster.\n\n73 GB of game against the 6 GB of the original game too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work properly.\nLinux version Crashes regulary and Proton version cant load battles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do all wives have the same picture?\nIn the original they had different pictures. \n1/10 lazy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LISTEN: DO NOT BUY THIS MONEY GRAB PIECE OF JUNK\n\nIf you have any interest in total war, let alone historical total war, you would buy the original Rome: Total War. That game has everything you need. Not to say that the remastered version is the exact same, but I'll put it this way: if you want crappy AI that's easily manipulatable and simple to defeat, you'd buy the original Rome: Total War. If you want crappy AI that's easily manipulatable and simple to defeat but has a bunch of BS buffs to arbitrarily make the game more difficult, you'll buy the remastered version. I'm tired of paying for reskinned junk. I'll stick to the games CA made 20 years ago when it was a decent company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IMHO Creative Assembly rival Bethesda in their hate for their fans and player base. CA seems to love going out of their way to break their own games and leave players high and dry. They’ll never get any more money from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't fix it if it ain't broken. The UI changes  just make no sense managing settlements and army's takes a few extra click every time compared to the original game. The AI has defently been improved a little but I can't bring my self to play this when I can just play the original or medieval II. Over all the game is fine its Rome but the UI is just a absolute letdown. Would recommend to skip this one.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The question rises: who asked for this overpriced cash grab? It’s a barely functional coat of paint over a 20-year-old game. While the original's core strategic brilliance is still faintly visible, the remaster manages to smother it with poor design choices. The new UI is an atrocious, clunky mess that is somehow less intuitive than the original's 2004 interface, making the management of provinces a chore rather than a pleasure. Of course, the infamous unit pathfinding issues are still present, leading to units freezing mid-battle or running in confused circles, completely ruining the immersion, and even on the campaign map sometimes the AI gets stuck. Add persistent, frustrating crashes, especially in the late game, and what you're left with is a disappointingly buggy and cumbersome experience. If you still own the original, stick to it.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Pretty much the same game as the original, with updated graphics but downgraded UI. \n\nHowever, they completely missed the mark on the single-most important issue that caused all of us Roman Emperors, to stop playing that game each time after a while: Squalor!!\n\nThe (not so) good ol' days, where you had to abandon your own hard-fought settlements just to re-invade them to quelch the unrest, are still very much alive. And as I used to do about 20 years ago, I have now yet again uninstalled this otherwise favorite game of mine. :/\n\nPutting a new coat of paint on an old game doesn't make it worthy of being sold as a new game. That's normally called a patch, or at best a DLC, and offered as such.\n\nIf they could only add a feature allowing us to put down a riot from within using the troops you already have in the territory, just like today's Trump and without the need to vacate and re-invade your own nation, that would \"Make Rome Great Again\"!!!\n\nUntil then: Veni, Vidi, Uninstalli !",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Game does not work with Windows 11 even though it only came out 5 months before it was Windows 11 was released.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Whenever I got into battle my game crashes. Apparently there's no fix to that either so I am essentially locked out of the RTS battles in my campaign. Also the wiki doesn't work either so thanks for nothing. I am going back to the original because that works atleast",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Absolutely garbage in comparison to the old original version the Devs were lazy and imported the trashy mobile game UI which is both lazy and foolish behaviour, the original UI was amazing and intuitive, this one makes zero sense to a true blue total war gamer, to the Devs I advise you to un hard code the UI so that modders can make it better OR blooming just stop being lazy and actively work on implementing the old UI with better graphics, oh and return the old faction symbols into the game these redskins are absolutely horrible if you want to make a game great, you can be lazy and put things in that cause confusion or inconvenience for players especially those who have been playing since the original, also perhaps bringing back the original would be a good idea because if you don't fix this people will start demanding the original may you choose wisely on your next moves",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly...this game is so buggy it's practically uplayable at times.\r\nIt constantly crashes randomly.\r\nSometimes you can play for hours without problems, then suddenly it crashes back to the desktop. \r\nOthertimes it crashes after five minutes.\r\nI've even had one case where the game freezes. I can move the mouse and hear the menu's but can't see them and can't click on anything.\r\nWhen it works...it's a great game... but it crashes WAY TOO MUCH to be able to recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had hopes for this, but turns out to be a classic demaster. The UI is so terrible it is difficult to fathom. Go play the original. Refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime i alt+tab to switch to another windows the game freezes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it has game breaking bugs, only got up to the 3rd turn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, decent remaster. However with the constant crashes every 15 turns or so, i can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would usually love to recommend this game, but due to the excessive crashing for no reason, it's made this game unplayable. Even with my PC being WAY over the required stats.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont recommend the game, it is a very laggy game and CA simply doesn't care about it !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would be great if the fucking input actually worked like in every other normal game. Half of my key presses don't register, because some moron can't remake a working game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "total war rome used to be my go to game well over a decade ago it is a game that has introduced me to the total war series (alongside medieval) and while it is not the weakest instalment (looking at napoleon and empire) it is still pretty dire with the amount of bugs and crashes, If you want total war rome experience I would still go for the original and at this point even total war rome 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd say no, don't get this.\n\nI've heavily enjoyed Medieval 2 Total War in the past and wanted something similar. Rome Total War is only available if you buy this remastered version and then I thought why not play this.\n\nIt's got some fairly good accessibility settings and you can customise your games to be either more like the classic version or the newer remaster which is good.\n\nBut honestly this game fails in a lot of regards.\n\nThe UI in the game is just clunky and inacessible. Maybe I am too used to Medieval 2 which i consider the gold standard of the Total War franchise.  This remaster is just poorly thought out with the UI.\n\nFor example.\n- Stationed troops icons are really small for some reason as well as the box for it.\n- This is the same for the construction tab.\n- You have to read the \"news\" of what's happened before going on to the next turn.\n- Everything is just so small.\n- Changing the UI to be 120% of normal size just makes it fill up half the screen which is annoying.\n\nIn terms of graphics, it just looks plastic as if ancient Europe was wrapped in a plastic texture pack with no grittiness to it.\n\nIt's just really eh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like this game, and i see why old total war fans loved this really old impressive relic.\r\n\r\nI understand after playing this why so many disliked rome 2, at its core i think this is the better game, it does so much with so little. Even thou both have very different strengths and different flaws, rome 1 feels right.\r\n\r\nThou I don't understand why rome 1 lovers complain about the bugs in rome 2 because even thou they share a lot of the same annoying bugs, rome 1 is worse. AI derp, you need to have battle timer, battles will crash game, campaign ai that flips a coin on whether it should attack would be a improvement.\r\n\r\nThe bugs and limitations of this old game is why I would'nt recommend it, \r\nmedieval 2 could use a remaster, rome 1 needed a remake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This \"Remaster\" is a nerf. You can only recruit one unit per city per turn (OG Rome allowed you to build an army if the buildings were advanced enough and you had enough population) and there is a hard coded global until limit of 500. Meaning that once you + all other factions globally have totaled 500 units, you cannot recruit anymore. Even if all you have is 10, if the rest of the factions take up 490, you're out of luck. And it's hard coded. If you try to mod it to increase or remove the cap, the game crashes to desktop when unit 501 is recruited. Also, the WIKI no longer works at all. So you can't go exploring every detail like you could on the OG Rome because this WIKI is hard coded to point to a website that no longer exists. Save your money. And also avoid Rome 2, it's even worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "computer freezes during loading. looked at the forum. it existed a year ago. refunded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rome Total War Remastered, a game released in year 2021, feels like a product carried almost entirely by nostalgia rather than genuine quality. Most people who bought it seem to have done so out of affection for the original game, out of frustration with Creative Assembly’s recent titles, or simply because a few popular YouTubers heavily praised it. But once the initial hype settled, the reality became hard to ignore.\n\nThe original Rome: Total War — a 20-year-old game — still has almost the same number of active players as this Remastered version. And Rome II, a game that many of us initially disliked at launch due to its problems, is today the second most-played Total War title by a large margin. Meanwhile, this Remastered edition struggles to maintain a meaningful player base despite being reviewed as if it were some kind of triumphant return. The numbers tell a very different story.\n\nOn a technical level, the game simply isn’t an upgrade. The interface, HUD, and camera controls feel worse than the original. The realistic textures placed on top of outdated, low-quality models often stretch, glitch, or warp, creating a visual result that feels less immersive and more cartoonish compared to the 2004 game. For something marketed as a visual improvement, the graphics frequently end up looking worse.\n\nEven the modding scene was far stronger in the original. Mods like Rome Surrectum II and Europa Barbarorum were ambitious, polished, and genuinely transformative. The current mod offerings for the Remastered version don’t come close to what the community achieved on the original engine.\n\nIn short, Rome Total War Remastered is treated far more positively than it deserves. If you want the true Rome experience, the original game — with its far superior mods and more coherent visual style — still offers more depth and charm than this overpriced remaster.\n\n73 GB of game against the 6 GB of the original game too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When Total War: Rome first came out back in the early 2000s. I loved it!! Had never played anything like it before and it had instantly made me a fan of the total war braand. Ofcourse I had to get the remastered version. Even if I am not going to play it much, just for completing my TW collection. \n\nThe game was great when it first came out, a trailblazer. But now, when you have so many advanced TW titles, it feels like a chore to play this old game again. I loved Rome Total War, but with so many TW titles around, which have been improved over a couple of decades, doesnt make sense to play this.\n\nI am not saying this game sucks! Its an OG and a awesome game when it came out. Just obsolete now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is a mess, i wanted to give it a try, and i made fool of myself.  I should have a listen to reviews. AI is a mess, diplomacy in a campaign is terrible nonsense , AI spamming armies out of thin air , with no economy or background, constant crashes, and terribel UI , Rome 2 even in it bugged launchign period looks like a gem now. i am sorry i tried to play it longer and cant get a refund, even for a 80 percent discount its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to enjoy the original Rome Total War on a modern system with QoL improvements, but the frequency of crashing makes it borderline unplayable. It is decently enjoyable if you can somehow avoid the crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So in a flash of nostalgia I bought the remaster. \nThere are some good ideas as far as I can see. But why does it take up 46 gb on my hard drive?\nWhy do I have to put the graphic down so much that it looks worse than back in the day when I played it?\nThe user interface is just bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work properly.\nLinux version Crashes regulary and Proton version cant load battles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do all wives have the same picture?\nIn the original they had different pictures. \n1/10 lazy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well I have to put this review because only one think. Game crash quite a lot. Otherways its great remake. I got so frustraded by that, that I just resignate and uninstall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LISTEN: DO NOT BUY THIS MONEY GRAB PIECE OF JUNK\n\nIf you have any interest in total war, let alone historical total war, you would buy the original Rome: Total War. That game has everything you need. Not to say that the remastered version is the exact same, but I'll put it this way: if you want crappy AI that's easily manipulatable and simple to defeat, you'd buy the original Rome: Total War. If you want crappy AI that's easily manipulatable and simple to defeat but has a bunch of BS buffs to arbitrarily make the game more difficult, you'll buy the remastered version. I'm tired of paying for reskinned junk. I'll stick to the games CA made 20 years ago when it was a decent company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's is slightly better old ROME with one of the best soundtracks. But much much better will be option to play ROME II on rules from old ROME. I mean having fun from playing conquering and building cities. Not this crap like can be in new TW series with politics and million options. \n\nSadly the battlefield in old ROME is bad , exploitable and really annoying. This is main reason why I don't recommend to buy it now as remastered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IMHO Creative Assembly rival Bethesda in their hate for their fans and player base. CA seems to love going out of their way to break their own games and leave players high and dry. They’ll never get any more money from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too antiquated for me to enjoy. \n\nI've just gotten too damned annoyed by how sluggish units are to respond, how slow they are to throw their pila, how bad the pathfinding is, how tedious the trade and diplomacy is through agents, how you can only recruit one unit per settlement per turn, how the stupid Senate gives me missions outside of my Roman faction's intended territories to conquer, how you can't move artillery through sparse forests with at least twenty meters of space between the trees because \"reasons,\" nor how you can't move artillery through gates they should clearly be able to fit through, or how you can only make tiny gaps in walls that they should also be able to fit through but can't because \"reasons,\" or how you can only fight in a tiny box in the middle of the mini-map that makes up only about 30-40% of the total landmass shown on the mini map, or how my general's favorite word is \"UNITS!\" and shouts it 81,283,614 times in ten seconds as I'm selecting my troops and giving them orders. \n\nI'm sticking with TW games released after Shogun 2 from now on. Everything older than that game I've tried was just a miserable experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't fix it if it ain't broken. The UI changes  just make no sense managing settlements and army's takes a few extra click every time compared to the original game. The AI has defently been improved a little but I can't bring my self to play this when I can just play the original or medieval II. Over all the game is fine its Rome but the UI is just a absolute letdown. Would recommend to skip this one.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The question rises: who asked for this overpriced cash grab? It’s a barely functional coat of paint over a 20-year-old game. While the original's core strategic brilliance is still faintly visible, the remaster manages to smother it with poor design choices. The new UI is an atrocious, clunky mess that is somehow less intuitive than the original's 2004 interface, making the management of provinces a chore rather than a pleasure. Of course, the infamous unit pathfinding issues are still present, leading to units freezing mid-battle or running in confused circles, completely ruining the immersion, and even on the campaign map sometimes the AI gets stuck. Add persistent, frustrating crashes, especially in the late game, and what you're left with is a disappointingly buggy and cumbersome experience. If you still own the original, stick to it.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Pretty much the same game as the original, with updated graphics but downgraded UI. \n\nHowever, they completely missed the mark on the single-most important issue that caused all of us Roman Emperors, to stop playing that game each time after a while: Squalor!!\n\nThe (not so) good ol' days, where you had to abandon your own hard-fought settlements just to re-invade them to quelch the unrest, are still very much alive. And as I used to do about 20 years ago, I have now yet again uninstalled this otherwise favorite game of mine. :/\n\nPutting a new coat of paint on an old game doesn't make it worthy of being sold as a new game. That's normally called a patch, or at best a DLC, and offered as such.\n\nIf they could only add a feature allowing us to put down a riot from within using the troops you already have in the territory, just like today's Trump and without the need to vacate and re-invade your own nation, that would \"Make Rome Great Again\"!!!\n\nUntil then: Veni, Vidi, Uninstalli !",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Game does not work with Windows 11 even though it only came out 5 months before it was Windows 11 was released.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Whenever I got into battle my game crashes. Apparently there's no fix to that either so I am essentially locked out of the RTS battles in my campaign. Also the wiki doesn't work either so thanks for nothing. I am going back to the original because that works atleast",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Absolutely garbage in comparison to the old original version the Devs were lazy and imported the trashy mobile game UI which is both lazy and foolish behaviour, the original UI was amazing and intuitive, this one makes zero sense to a true blue total war gamer, to the Devs I advise you to un hard code the UI so that modders can make it better OR blooming just stop being lazy and actively work on implementing the old UI with better graphics, oh and return the old faction symbols into the game these redskins are absolutely horrible if you want to make a game great, you can be lazy and put things in that cause confusion or inconvenience for players especially those who have been playing since the original, also perhaps bringing back the original would be a good idea because if you don't fix this people will start demanding the original may you choose wisely on your next moves",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly...this game is so buggy it's practically uplayable at times.\r\nIt constantly crashes randomly.\r\nSometimes you can play for hours without problems, then suddenly it crashes back to the desktop. \r\nOthertimes it crashes after five minutes.\r\nI've even had one case where the game freezes. I can move the mouse and hear the menu's but can't see them and can't click on anything.\r\nWhen it works...it's a great game... but it crashes WAY TOO MUCH to be able to recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had hopes for this, but turns out to be a classic demaster. The UI is so terrible it is difficult to fathom. Go play the original. Refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime i alt+tab to switch to another windows the game freezes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it has game breaking bugs, only got up to the 3rd turn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, decent remaster. However with the constant crashes every 15 turns or so, i can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would usually love to recommend this game, but due to the excessive crashing for no reason, it's made this game unplayable. Even with my PC being WAY over the required stats.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont recommend the game, it is a very laggy game and CA simply doesn't care about it !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would be great if the fucking input actually worked like in every other normal game. Half of my key presses don't register, because some moron can't remake a working game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "total war rome used to be my go to game well over a decade ago it is a game that has introduced me to the total war series (alongside medieval) and while it is not the weakest instalment (looking at napoleon and empire) it is still pretty dire with the amount of bugs and crashes, If you want total war rome experience I would still go for the original and at this point even total war rome 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd say no, don't get this.\n\nI've heavily enjoyed Medieval 2 Total War in the past and wanted something similar. Rome Total War is only available if you buy this remastered version and then I thought why not play this.\n\nIt's got some fairly good accessibility settings and you can customise your games to be either more like the classic version or the newer remaster which is good.\n\nBut honestly this game fails in a lot of regards.\n\nThe UI in the game is just clunky and inacessible. Maybe I am too used to Medieval 2 which i consider the gold standard of the Total War franchise.  This remaster is just poorly thought out with the UI.\n\nFor example.\n- Stationed troops icons are really small for some reason as well as the box for it.\n- This is the same for the construction tab.\n- You have to read the \"news\" of what's happened before going on to the next turn.\n- Everything is just so small.\n- Changing the UI to be 120% of normal size just makes it fill up half the screen which is annoying.\n\nIn terms of graphics, it just looks plastic as if ancient Europe was wrapped in a plastic texture pack with no grittiness to it.\n\nIt's just really eh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like this game, and i see why old total war fans loved this really old impressive relic.\r\n\r\nI understand after playing this why so many disliked rome 2, at its core i think this is the better game, it does so much with so little. Even thou both have very different strengths and different flaws, rome 1 feels right.\r\n\r\nThou I don't understand why rome 1 lovers complain about the bugs in rome 2 because even thou they share a lot of the same annoying bugs, rome 1 is worse. AI derp, you need to have battle timer, battles will crash game, campaign ai that flips a coin on whether it should attack would be a improvement.\r\n\r\nThe bugs and limitations of this old game is why I would'nt recommend it, \r\nmedieval 2 could use a remaster, rome 1 needed a remake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This \"Remaster\" is a nerf. You can only recruit one unit per city per turn (OG Rome allowed you to build an army if the buildings were advanced enough and you had enough population) and there is a hard coded global until limit of 500. Meaning that once you + all other factions globally have totaled 500 units, you cannot recruit anymore. Even if all you have is 10, if the rest of the factions take up 490, you're out of luck. And it's hard coded. If you try to mod it to increase or remove the cap, the game crashes to desktop when unit 501 is recruited. Also, the WIKI no longer works at all. So you can't go exploring every detail like you could on the OG Rome because this WIKI is hard coded to point to a website that no longer exists. Save your money. And also avoid Rome 2, it's even worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "computer freezes during loading. looked at the forum. it existed a year ago. refunded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rome Total War Remastered, a game released in year 2021, feels like a product carried almost entirely by nostalgia rather than genuine quality. Most people who bought it seem to have done so out of affection for the original game, out of frustration with Creative Assembly’s recent titles, or simply because a few popular YouTubers heavily praised it. But once the initial hype settled, the reality became hard to ignore.\n\nThe original Rome: Total War — a 20-year-old game — still has almost the same number of active players as this Remastered version. And Rome II, a game that many of us initially disliked at launch due to its problems, is today the second most-played Total War title by a large margin. Meanwhile, this Remastered edition struggles to maintain a meaningful player base despite being reviewed as if it were some kind of triumphant return. The numbers tell a very different story.\n\nOn a technical level, the game simply isn’t an upgrade. The interface, HUD, and camera controls feel worse than the original. The realistic textures placed on top of outdated, low-quality models often stretch, glitch, or warp, creating a visual result that feels less immersive and more cartoonish compared to the 2004 game. For something marketed as a visual improvement, the graphics frequently end up looking worse.\n\nEven the modding scene was far stronger in the original. Mods like Rome Surrectum II and Europa Barbarorum were ambitious, polished, and genuinely transformative. The current mod offerings for the Remastered version don’t come close to what the community achieved on the original engine.\n\nIn short, Rome Total War Remastered is treated far more positively than it deserves. If you want the true Rome experience, the original game — with its far superior mods and more coherent visual style — still offers more depth and charm than this overpriced remaster.\n\n73 GB of game against the 6 GB of the original game too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When Total War: Rome first came out back in the early 2000s. I loved it!! Had never played anything like it before and it had instantly made me a fan of the total war braand. Ofcourse I had to get the remastered version. Even if I am not going to play it much, just for completing my TW collection. \n\nThe game was great when it first came out, a trailblazer. But now, when you have so many advanced TW titles, it feels like a chore to play this old game again. I loved Rome Total War, but with so many TW titles around, which have been improved over a couple of decades, doesnt make sense to play this.\n\nI am not saying this game sucks! Its an OG and a awesome game when it came out. Just obsolete now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is a mess, i wanted to give it a try, and i made fool of myself.  I should have a listen to reviews. AI is a mess, diplomacy in a campaign is terrible nonsense , AI spamming armies out of thin air , with no economy or background, constant crashes, and terribel UI , Rome 2 even in it bugged launchign period looks like a gem now. i am sorry i tried to play it longer and cant get a refund, even for a 80 percent discount its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to enjoy the original Rome Total War on a modern system with QoL improvements, but the frequency of crashing makes it borderline unplayable. It is decently enjoyable if you can somehow avoid the crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So in a flash of nostalgia I bought the remaster. \nThere are some good ideas as far as I can see. But why does it take up 46 gb on my hard drive?\nWhy do I have to put the graphic down so much that it looks worse than back in the day when I played it?\nThe user interface is just bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work properly.\nLinux version Crashes regulary and Proton version cant load battles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do all wives have the same picture?\nIn the original they had different pictures. \n1/10 lazy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well I have to put this review because only one think. Game crash quite a lot. Otherways its great remake. I got so frustraded by that, that I just resignate and uninstall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LISTEN: DO NOT BUY THIS MONEY GRAB PIECE OF JUNK\n\nIf you have any interest in total war, let alone historical total war, you would buy the original Rome: Total War. That game has everything you need. Not to say that the remastered version is the exact same, but I'll put it this way: if you want crappy AI that's easily manipulatable and simple to defeat, you'd buy the original Rome: Total War. If you want crappy AI that's easily manipulatable and simple to defeat but has a bunch of BS buffs to arbitrarily make the game more difficult, you'll buy the remastered version. I'm tired of paying for reskinned junk. I'll stick to the games CA made 20 years ago when it was a decent company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's is slightly better old ROME with one of the best soundtracks. But much much better will be option to play ROME II on rules from old ROME. I mean having fun from playing conquering and building cities. Not this crap like can be in new TW series with politics and million options. \n\nSadly the battlefield in old ROME is bad , exploitable and really annoying. This is main reason why I don't recommend to buy it now as remastered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IMHO Creative Assembly rival Bethesda in their hate for their fans and player base. CA seems to love going out of their way to break their own games and leave players high and dry. They’ll never get any more money from me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too antiquated for me to enjoy. \n\nI've just gotten too damned annoyed by how sluggish units are to respond, how slow they are to throw their pila, how bad the pathfinding is, how tedious the trade and diplomacy is through agents, how you can only recruit one unit per settlement per turn, how the stupid Senate gives me missions outside of my Roman faction's intended territories to conquer, how you can't move artillery through sparse forests with at least twenty meters of space between the trees because \"reasons,\" nor how you can't move artillery through gates they should clearly be able to fit through, or how you can only make tiny gaps in walls that they should also be able to fit through but can't because \"reasons,\" or how you can only fight in a tiny box in the middle of the mini-map that makes up only about 30-40% of the total landmass shown on the mini map, or how my general's favorite word is \"UNITS!\" and shouts it 81,283,614 times in ten seconds as I'm selecting my troops and giving them orders. \n\nI'm sticking with TW games released after Shogun 2 from now on. Everything older than that game I've tried was just a miserable experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't fix it if it ain't broken. The UI changes  just make no sense managing settlements and army's takes a few extra click every time compared to the original game. The AI has defently been improved a little but I can't bring my self to play this when I can just play the original or medieval II. Over all the game is fine its Rome but the UI is just a absolute letdown. Would recommend to skip this one.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "The question rises: who asked for this overpriced cash grab? It’s a barely functional coat of paint over a 20-year-old game. While the original's core strategic brilliance is still faintly visible, the remaster manages to smother it with poor design choices. The new UI is an atrocious, clunky mess that is somehow less intuitive than the original's 2004 interface, making the management of provinces a chore rather than a pleasure. Of course, the infamous unit pathfinding issues are still present, leading to units freezing mid-battle or running in confused circles, completely ruining the immersion, and even on the campaign map sometimes the AI gets stuck. Add persistent, frustrating crashes, especially in the late game, and what you're left with is a disappointingly buggy and cumbersome experience. If you still own the original, stick to it.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Pretty much the same game as the original, with updated graphics but downgraded UI. \n\nHowever, they completely missed the mark on the single-most important issue that caused all of us Roman Emperors, to stop playing that game each time after a while: Squalor!!\n\nThe (not so) good ol' days, where you had to abandon your own hard-fought settlements just to re-invade them to quelch the unrest, are still very much alive. And as I used to do about 20 years ago, I have now yet again uninstalled this otherwise favorite game of mine. :/\n\nPutting a new coat of paint on an old game doesn't make it worthy of being sold as a new game. That's normally called a patch, or at best a DLC, and offered as such.\n\nIf they could only add a feature allowing us to put down a riot from within using the troops you already have in the territory, just like today's Trump and without the need to vacate and re-invade your own nation, that would \"Make Rome Great Again\"!!!\n\nUntil then: Veni, Vidi, Uninstalli !",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Game does not work with Windows 11 even though it only came out 5 months before it was Windows 11 was released.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Whenever I got into battle my game crashes. Apparently there's no fix to that either so I am essentially locked out of the RTS battles in my campaign. Also the wiki doesn't work either so thanks for nothing. I am going back to the original because that works atleast",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Absolutely garbage in comparison to the old original version the Devs were lazy and imported the trashy mobile game UI which is both lazy and foolish behaviour, the original UI was amazing and intuitive, this one makes zero sense to a true blue total war gamer, to the Devs I advise you to un hard code the UI so that modders can make it better OR blooming just stop being lazy and actively work on implementing the old UI with better graphics, oh and return the old faction symbols into the game these redskins are absolutely horrible if you want to make a game great, you can be lazy and put things in that cause confusion or inconvenience for players especially those who have been playing since the original, also perhaps bringing back the original would be a good idea because if you don't fix this people will start demanding the original may you choose wisely on your next moves",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly...this game is so buggy it's practically uplayable at times.\r\nIt constantly crashes randomly.\r\nSometimes you can play for hours without problems, then suddenly it crashes back to the desktop. \r\nOthertimes it crashes after five minutes.\r\nI've even had one case where the game freezes. I can move the mouse and hear the menu's but can't see them and can't click on anything.\r\nWhen it works...it's a great game... but it crashes WAY TOO MUCH to be able to recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had hopes for this, but turns out to be a classic demaster. The UI is so terrible it is difficult to fathom. Go play the original. Refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everytime i alt+tab to switch to another windows the game freezes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it has game breaking bugs, only got up to the 3rd turn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, decent remaster. However with the constant crashes every 15 turns or so, i can't recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would usually love to recommend this game, but due to the excessive crashing for no reason, it's made this game unplayable. Even with my PC being WAY over the required stats.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont recommend the game, it is a very laggy game and CA simply doesn't care about it !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would be great if the fucking input actually worked like in every other normal game. Half of my key presses don't register, because some moron can't remake a working game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "total war rome used to be my go to game well over a decade ago it is a game that has introduced me to the total war series (alongside medieval) and while it is not the weakest instalment (looking at napoleon and empire) it is still pretty dire with the amount of bugs and crashes, If you want total war rome experience I would still go for the original and at this point even total war rome 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd say no, don't get this.\n\nI've heavily enjoyed Medieval 2 Total War in the past and wanted something similar. Rome Total War is only available if you buy this remastered version and then I thought why not play this.\n\nIt's got some fairly good accessibility settings and you can customise your games to be either more like the classic version or the newer remaster which is good.\n\nBut honestly this game fails in a lot of regards.\n\nThe UI in the game is just clunky and inacessible. Maybe I am too used to Medieval 2 which i consider the gold standard of the Total War franchise.  This remaster is just poorly thought out with the UI.\n\nFor example.\n- Stationed troops icons are really small for some reason as well as the box for it.\n- This is the same for the construction tab.\n- You have to read the \"news\" of what's happened before going on to the next turn.\n- Everything is just so small.\n- Changing the UI to be 120% of normal size just makes it fill up half the screen which is annoying.\n\nIn terms of graphics, it just looks plastic as if ancient Europe was wrapped in a plastic texture pack with no grittiness to it.\n\nIt's just really eh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like this game, and i see why old total war fans loved this really old impressive relic.\r\n\r\nI understand after playing this why so many disliked rome 2, at its core i think this is the better game, it does so much with so little. Even thou both have very different strengths and different flaws, rome 1 feels right.\r\n\r\nThou I don't understand why rome 1 lovers complain about the bugs in rome 2 because even thou they share a lot of the same annoying bugs, rome 1 is worse. AI derp, you need to have battle timer, battles will crash game, campaign ai that flips a coin on whether it should attack would be a improvement.\r\n\r\nThe bugs and limitations of this old game is why I would'nt recommend it, \r\nmedieval 2 could use a remaster, rome 1 needed a remake.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This \"Remaster\" is a nerf. You can only recruit one unit per city per turn (OG Rome allowed you to build an army if the buildings were advanced enough and you had enough population) and there is a hard coded global until limit of 500. Meaning that once you + all other factions globally have totaled 500 units, you cannot recruit anymore. Even if all you have is 10, if the rest of the factions take up 490, you're out of luck. And it's hard coded. If you try to mod it to increase or remove the cap, the game crashes to desktop when unit 501 is recruited. Also, the WIKI no longer works at all. So you can't go exploring every detail like you could on the OG Rome because this WIKI is hard coded to point to a website that no longer exists. Save your money. And also avoid Rome 2, it's even worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "computer freezes during loading. looked at the forum. it existed a year ago. refunded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rome Total War Remastered, a game released in year 2021, feels like a product carried almost entirely by nostalgia rather than genuine quality. Most people who bought it seem to have done so out of affection for the original game, out of frustration with Creative Assembly’s recent titles, or simply because a few popular YouTubers heavily praised it. But once the initial hype settled, the reality became hard to ignore.\n\nThe original Rome: Total War — a 20-year-old game — still has almost the same number of active players as this Remastered version. And Rome II, a game that many of us initially disliked at launch due to its problems, is today the second most-played Total War title by a large margin. Meanwhile, this Remastered edition struggles to maintain a meaningful player base despite being reviewed as if it were some kind of triumphant return. The numbers tell a very different story.\n\nOn a technical level, the game simply isn’t an upgrade. The interface, HUD, and camera controls feel worse than the original. The realistic textures placed on top of outdated, low-quality models often stretch, glitch, or warp, creating a visual result that feels less immersive and more cartoonish compared to the 2004 game. For something marketed as a visual improvement, the graphics frequently end up looking worse.\n\nEven the modding scene was far stronger in the original. Mods like Rome Surrectum II and Europa Barbarorum were ambitious, polished, and genuinely transformative. The current mod offerings for the Remastered version don’t come close to what the community achieved on the original engine.\n\nIn short, Rome Total War Remastered is treated far more positively than it deserves. If you want the true Rome experience, the original game — with its far superior mods and more coherent visual style — still offers more depth and charm than this overpriced remaster.\n\n73 GB of game against the 6 GB of the original game too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When Total War: Rome first came out back in the early 2000s. I loved it!! Had never played anything like it before and it had instantly made me a fan of the total war braand. Ofcourse I had to get the remastered version. Even if I am not going to play it much, just for completing my TW collection. \n\nThe game was great when it first came out, a trailblazer. But now, when you have so many advanced TW titles, it feels like a chore to play this old game again. I loved Rome Total War, but with so many TW titles around, which have been improved over a couple of decades, doesnt make sense to play this.\n\nI am not saying this game sucks! Its an OG and a awesome game when it came out. Just obsolete now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is a mess, i wanted to give it a try, and i made fool of myself.  I should have a listen to reviews. AI is a mess, diplomacy in a campaign is terrible nonsense , AI spamming armies out of thin air , with no economy or background, constant crashes, and terribel UI , Rome 2 even in it bugged launchign period looks like a gem now. i am sorry i tried to play it longer and cant get a refund, even for a 80 percent discount its not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to enjoy the original Rome Total War on a modern system with QoL improvements, but the frequency of crashing makes it borderline unplayable. It is decently enjoyable if you can somehow avoid the crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So in a flash of nostalgia I bought the remaster. \nThere are some good ideas as far as I can see. But why does it take up 46 gb on my hard drive?\nWhy do I have to put the graphic down so much that it looks worse than back in the day when I played it?\nThe user interface is just bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work properly.\nLinux version Crashes regulary and Proton version cant load battles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do all wives have the same picture?\nIn the original they had different pictures. \n1/10 lazy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well I have to put this review because only one think. Game crash quite a lot. Otherways its great remake. I got so frustraded by that, that I just resignate and uninstall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LISTEN: DO NOT BUY THIS MONEY GRAB PIECE OF JUNK\n\nIf you have any interest in total war, let alone historical total war, you would buy the original Rome: Total War. That game has everything you need. Not to say that the remastered version is the exact same, but I'll put it this way: if you want crappy AI that's easily manipulatable and simple to defeat, you'd buy the original Rome: Total War. If you want crappy AI that's easily manipulatable and simple to defeat but has a bunch of BS buffs to arbitrarily make the game more difficult, you'll buy the remastered version. I'm tired of paying for reskinned junk. I'll stick to the games CA made 20 years ago when it was a decent company.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's is slightly better old ROME with one of the best soundtracks. But much much better will be option to play ROME II on rules from old ROME. I mean having fun from playing conquering and building cities. Not this crap like can be in new TW series with politics and million options. \n\nSadly the battlefield in old ROME is bad , exploitable and really annoying. This is main reason why I don't recommend to buy it now as remastered.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}