{
  "positive": [
    {
      "review": "build and defend, explore and gather, improve and experiment\r\nThis game could be described as Viking-afterlife-themed Minecraft.\r\nI've logged nearly 4,000 hours already, and I'm not finished with it.",
      "voted_up": true,
      "votes_helpful": 62
    },
    {
      "review": "I have been accused of overselling the game, rather trying irritate people into playing the game so this is a totally unbiased review.\n\nIf you buy this game, then you can live a second life away from civilization, where you can eat, kill build, explore, swim, sail and what not. Also progress the bosses for a while maybe, but the game is a different experience when playing with friends. I just want it to blow up and people opening crazy online servers like they did with GTA. A man can dream.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Valheim nails that rare magic where exploration, survival, and creativity melt together into something unforgettable. Every misty forest, stormy sea, and glowing meadow feels handcrafted for discovery and building your own Viking longhouse or sprawling fortress never stops being satisfying. Whether adventuring solo or with friends, the sense of progression and atmosphere is so good it’s almost meditative. A masterpiece of cozy survival with epic soul.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "9/10 – A cozy survival game with tons of charm and memorable moments. The game has a special \"feeling\" to it.\n\nGood:\n- Great atmosphere\n- Building feels creative\n- Exploration always leads to surprises\n- Progression is steady\n- Relaxing music and sound design\n- It really has a special \"feeling\"\n- SAILING!\n\nBad:\n- No story\n- Clunky combat\n- Enemies are too repetitive\n- Inventory gets messy fast\n- Map has big empty stretches\n- Meh late-game content",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "great game, just dont sail off the edge of the map thinking its a globe",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Wonderful game, wonderful art, almost had a panic attack first time I saw a troll and more recently when I discovered my first bear.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "[b]10/100[/b]\nSkyrim with Dark Souls difficulty in viking setting. I luv it! \n\nI warmly recommend it to everyone who loves real Viking open world games and loves to suffer :D",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "After playing more of the game and seeing the effort they put into accessibility and customisation of gameplay experience I can whole heartedly say any small bugs or irritations with the combat system are completely forgiven. We need more game devs like these people.\n\nHowever. The fact you cant rebind the dodge to something other than the most awkward combination possible is criminal. I wouldn't recommend playing this game for the combat. Ruins the wonderful survival craft experience almost entirely. Once they fix that then this is almost the perfect survival craft",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game will forever be remembered as the best single player sandbox I could have ever found myself playing - and that could be claimed through the level of dev support alone. Imagine Minecraft mixed with Norse myth and boom, you've got a little vikingr guy who busts down trees, builds homes, and defeats bosses. With friends, it becomes a tedious fighting tale of who can stay alive long enough for the other one to get back into the fight - or a grand slam of grinding for hours just to upgrade a weapon.\r\nHere's my breakdown (and the game's not completed yet!)\r\nGrindy = 12/10 (you might not love grinding but the satisfaction of completion is Massively worth it)\r\nBuilding = 11/10 (there is creative mode!)\r\nMechanics = 9/10\r\nLore = 8/10 (to be continued with updates though!)\r\nBrutality = 10/10 \r\nFun = 100/10 \r\n\r\nThis game will teach you that working hard in one biome will almost definitely be worth it going into the next - but that you have to earn the next one with just as much if not more difficulty. Super satisfying atmosphere for creative folks and also super satisfying if you love hoarding (I see you Skyrim players). Additionally, they have revolutionized the starvation aspect of games with hunger stats and they introduced tacking to a sandbox game (fantastic weather stuff going on in here guys).\r\nI started the game back in initial release and I could not say louder that playing games while they're being developed and fine-tuned is a fantastic experience. \r\nStill don't know where the end will lead in Valheim, but I do know that it gave me a massive amount of respect for developers out there who continue to push their updates and lead with the community.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great with friends! Consistent updates! Many free mods to enjoy. It's a \"forever game\" with many hours of playtime. There's always something to do; friends culminating the gathering of various resources for a goal. Building a house, crafting station, and more. Your friends can separately target a resource as an objective, or craft their own things alongside each other's. One may mine for ore, the other will chop wood, or hunt for food. You may terraform the world together, and pass each other's implements of being.\r\n\r\nValheim is one of the only \"survival\" games which makes tree-cutting, fun. There's a sense of purpose to your goals, rather than it feeling like a mindless chore. And it is all-so rewarding viewing the fruits of your efforts, in co-op or solo. However, at first, it can be quite daunting, not knowing what to do, where to go. You get a 'tutorial bird' to teach you about the world upon starting. It's easier to start playing with an experienced friend.\r\n\r\nEach biome is a new world to explore. Bringing along new enemies, which use their own niche way of combat. The new elements to be found, will allow for creating better armour, weapons, and building materials. It works like a tier system; you will go from Biome A, to B, to C, each one preparing you for the next. There's even Merchants to be found!\r\n\r\nThe enemies are weaker to specific weapon damage, e.g from piercing, or blunt weaponry. Plan ahead, but all is viable! There's daggers, blades, hammers, bows. The worn armour can carry distinct passive skill bonuses, such as being able to stealth more quietly, or tank more damage.\r\n\r\nSailing; Luckily, you can create a portal system early on, so if your character dies whilst on another island, you can use a portal to get back your lost gear! This is important, because building a boat takes resources, which may not be found again in your starting biome.\r\n\r\nThe bosses drop unique buffs, which you can use one of at a time, in your singular skill slot. The importance of the skill you bring with you, is up to you. If you sail often, you may want to use the skill which provides wind direction. Skills have variable cooldowns to balance their strengths.\r\n\r\nThe world is randomly generated. World seeds are optional, of which can be used to generate specific worlds.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "10/10. One of my top 10 games in the past 25 years. Absolutely fun and difficult survival. Go at your own pace or go ham, give it a try you won't regret it. IMO better to play with 2+ players but also tons of fun solo.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love getting lost and scared in the swamps",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ainda tenho muito a explorar nesse jogo, mas o pouco que joguei já foi o suficiente pra perceber o quão bom ele é, além de me fazer querer aprender mais sobre ele\n\npra quem gosta de jogos de sobrevivência com chefões desafiadores vale a pena dar uma chance",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "At first the pacing and controls and lack of direction infuriated me. Sometimes it still does, but beyond that this is a wonderful game of exploration and adventure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Nordic Urge to build a shack in the woods to keep the rain out, with a firepit and workshop alongside your upstairs bedroom with balcony. \r\n\r\nIt has a \"Comfy\" status condition. Makes sense to me.\r\n\r\n(Difficulty settings change this from hardcore survival grind game to casual building sim, and mostly granular between)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim is one of my most favorite games. Already finished available content couple of times and never get bored of it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fantastic game, with over 200 hours on this I can easily say that this is my most played, and favorite game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim is one of the most enjoyable and well-crafted survival games I’ve ever played. From the very first minutes, the Nordic atmosphere pulls you in completely — the music, the world, and the environment all work together perfectly. The game masterfully balances peaceful exploration and base building with intense fights against bosses and the dangers of the world.\nThe sense of progression is excellent — from a simple shelter to massive Viking fortresses, from a wooden axe to epic weapons. Every new biome feels like a small event and motivates you to keep going. The optimization is great, the graphics have a unique style, and the soundtrack is nothing short of magical.\nBut the greatest strength of Valheim is that even after hundreds of hours, you still want to play more. Whether with friends or solo, the experience is always unique. For me personally, it’s one of the best games ever.\nI highly recommend it to anyone who enjoys survival, crafting, or Nordic mythology. Valheim is simply a masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game satisfies the ARK itch in my brain with base building and grinding.\nAnd swamp ptsd.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim may drown in the pool or Survival Sandbox games but it does provide intrigue and unique things that others dont offer. Although it may not look the prettiest and may be more difficult that the rest, it has a charm to it and it's fun to build nomad huts and make giant stone mounds in front of your friends base.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great survival game with nice aesthetics and cool building features",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I fucking love this game. Basically minecraft but more complicated. I am a builder, and the shit you can build is jaw dropping. The creativity and range this game gives you is amazing. The vibes, views, everything is a 10/10. Anyone who says otherwise has no taste and no patience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game i remember when it released\n\nIts worlds are generated randomly Its always fun to explore in a new World of it\n\nIts Ost is very nice\n\nGame has alot of replayability\n\nBuilding is nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] Valheim – A True Gem [/h1]\n\n🌟 Valheim is an incredible, deeply immersive game that I first discovered through the Xbox PC catalog, before recently transitioning my saves to Steam. From the very beginning, it captivated me with its demanding yet rewarding progression. The first days and nights are fierce, but watching your base and character gradually evolve is profoundly gratifying.\n\n⚔️ And let’s be honest: prepare to die, repeatedly, whether you want to or not. It’s not a bug, it’s the curve of learning—and it will humble you with every troll, draugr, or boss fight until you finally rise victorious.\n\n🏹 The opportunities are endless: whether you become a renowned builder or a modest craftsman, a proud frontline warrior, a strategically placed archer, or a powerful mage; an explorer across land, saddle, and sea—the Marco Polo of Valheim; a grand orchestrator of teleportation portals, a coordinator of boss assaults, a farmer, an interior decorator, a Jarl, or even a wandering vagabond. The game offers countless paths, each shaping your own destiny.\n\n🛡️ It is your adventure alone, and only you can guide your fate. Perhaps, with triumph, you may one day push open the Great Gate to the mythological banquet of Valhalla.\n\n🔥 Valheim is a treasure I cherish. It is worth every moment, and while it shines even brighter with friends, it remains equally enjoyable solo. A masterpiece—10/10.\n\n\n[h1] Valheim – Une véritable pépite [/h1]\n\n🌟 Valheim est un jeu incroyable, extrêmement prenant, que j’ai eu le plaisir de découvrir via le catalogue Xbox PC avant de transférer récemment mes sauvegardes sur Steam. Dès les premières heures, il m’a captivé par son exigence et sa progression gratifiante. Les premiers jours et nuits sont rudes, mais contempler sa base et son personnage se développer graduellement est une expérience unique.\n\n⚔️ Et soyons clairs : préparez-vous à mourir à maintes reprises, que vous le vouliez ou non. Cela fait partie intégrante de la courbe d’apprentissage, et chaque troll, draugr ou boss viendra vous rappeler que la survie se mérite.\n\n🏹 Les opportunités sont innombrables : que vous soyez bâtisseur de renom ou modeste artisan, fier combattant de première ligne, archer stratégiquement placé ou puissant mage ; explorateur sur terre, à cheval ou en mer—le Marco Polo de Valheim ; grand orchestrateur de portails téléporteurs, coordinateur d’assauts de boss, fermier, décorateur d’intérieur, Jarl ou encore vagabond. Les possibilités ne manquent pas et chacune façonne votre propre destinée.\n\n🛡️ C’est votre aventure, et seul vous pouvez guider votre chemin. Peut-être qu’un jour, avec triomphe, vous pousserez la Grande Porte du mythologique banquet de Valhalla.\n\n🔥 Valheim est une pépite que je chéris. Ce jeu vaut le détour, d’autant plus appréciable avec des amis, mais pas uniquement. Un chef-d’œuvre—10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Performance or gameplay surpasses the passing mark and stands out from the average.\nProvides a high level of quality and enjoyable gameplay.\nStrongly Recommended - ✔✔\n\n\n\nIntuitive Controls - Easy to use.\n☐ Very Difficult \n☐ Difficult \n☐ Moderate\n☑ Easy \n☐ Very Easy \n\n\nBalanced Gameplay - Fair and equal.\n☐ Poorly Balanced\n☐ Somewhat Balanced \n☐ Moderately Balanced \n☑ Well Balanced\n☐ Perfectly Balanced \n\n\nPlayer Engagement - Involving and captivating.\n☐ Not at all \n☐ Slightly \n☐ Moderately \n☐ Very \n☑ Extremely \n\n\nDecision Relevance - Meaningful choices.\n☐ Meaningless \n☑ Not Meaningful \n☐ Somewhat Meaningful \n☐ Quite Meaningful \n☐ Highly Meaningful \n\n\nRewarding Progression - Satisfying advancement.\n☐ Very Unsatisfying \n☐ Unsatisfying \n☐ Neutral\n☐ Satisfying \n☑ Very Satisfying \n\n\nCompelling Storyline - Engaging narrative.\n☐ Not Interesting \n☑ Slightly Interesting \n☐ Moderately Interesting \n☐ Very Interesting \n☐ Extremely Interesting \n\n\nImmersive Atmosphere - Captivating environment.\n☐ Not Immersive \n☐ Slightly Immersive\n☐ Moderately Immersive \n☐ Very Immersive \n☑ Completely Immersive \n\n\nVisual Aesthetics - Stunning graphics.\n☐ Not Appealing \n☐ Slightly Appealing \n☐ Moderately Appealing \n☐ Very Appealing \n☑ Extremely Appealing \n\n\nAudio Quality - High-quality sound.\n☐ Not Engaging \n☐ Slightly Engaging \n☐ Moderately Engaging \n☑ Very Engaging \n☐ Extremely Engaging \n\n\nPolished HUD - Clean and functional interface.\n☐ Very Unfriendly \n☐ Unfriendly \n☐ Neutral \n☑ Friendly \n☐ Very Friendly \n\n\nGame Design - Well-crafted mechanics.\n☐ Poorly Designed \n☐ Somewhat Designed \n☐ Moderately Designed \n☑ Well Designed\n☐ Excellently Designed \n\n\nContent Quality - Rich and diverse.\n☐ Poor Content \n☐ Limited Content \n☐ Moderate Content \n☐ Extensive Content \n☑ Abundant Content \n\n\nAI Behavior - Intelligent and realistic.\n☐ Very Poor \n☐ Poor \n☑ Average \n☐ Good \n☐ Excellent \n\n\nSettings - Flexible and customizable.\n☐ Very Limited \n☐ Limited \n☐ Moderate \n☑ Flexible \n☐ Highly Flexible \n\n\nTechnical Issues - Minimal or no problems.\n☐ Numerous \n☐ Moderate \n☐ Limited \n☐ Minor \n☑ None \n\n\nOverall Satisfaction - General enjoyment level.\n☐ Very Dissatisfied \n☐ Dissatisfied \n☐ Neutral \n☐ Satisfied \n☑ Very Satisfied \n\nMicrotransactions - In-game purchases.\n☐ Extensive \n☐ Substantial \n☐ Moderate \n☐ Minimal \n☑ None \n\n\nReplay Value - Longevity and replayability.\n☐ Very Low \n☐ Low \n☐ Moderate \n☐ High \n☑ Very High \n\n\nCost-to-Play Ratio - Money spent vs hours played.\n☐ Overpriced \n☐ Poor Value\n☐ Fair Value \n☐ Good Value \n☑ Excellent Value \n\n\nRecommendation.\n☐ No \n☑ Yes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best survival games on steam hands-down. loved this game's atmosphere and unique playstyle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Truly a game. This game is a game that lets you punch trees, eat roasted deer meat, and drink ale. I was not expecting the Ashland's to be cyber heck, but I am happy to rip and tear, doom style. I like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy Minecraft but always wished it were more challenging, then this is THE game for you! The combat is more intense and the game itself is very difficult. Close to Dark Souls level. I actually have to play on a lower difficulty setting for it to be enjoyable, but that just means more options for you! \nI really appreciate the progression system. Every time you enter a new biome, you have to be careful. It's not possible to be overpowered going into a new biome. You have to earn it each and every time. It keeps exploration fresh and fun.\n\nMy only wish is that they would add Steam Achievements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will always have a special place in my library as one of the best games to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game. Can't believe it took me this long to find it. Haven't found a game like it since my first time playing minecraft. Definitely recommend for anyone looking for a new game that you can't wait to play every chance you get. I hope this game continues to get updates and expand the world more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, supports many different playstyles for different players. caters to your farmers, your builders, your fighters, your explorers, etc. Something truly out there for just about everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim – A Game That Captures the True Spirit of Viking Life\n\nOn paper, Valheim looks like a typical early-access survival game, but in practice it is much more than that. The game has a strange kind of soul. Its atmosphere pulls you in and you suddenly realize you keep saying “just one more run” even when you planned to quit an hour ago.\n\nAtmosphere and World Design\n\nValheim shines not because of fancy graphics but because of the mood it creates. It is honestly surprising how expressive a world can be with low-poly visuals. The forests feel peaceful. Rain feels heavy. Mist drifting in the distance feels like another creature watching you.\n\nThis is not a pretty postcard world. It feels alive.\n\nCombat System\n\nThe combat is simple but satisfying. There is a sense of weight similar to Dark Souls. Timing your blocks, drawing your bow, closing in for melee hits… everything feels grounded.\n\nBoss fights are especially well designed. Each boss has its own identity and mechanics, and the game demands that you prepare properly before you face them. That cycle of “get stronger for the next boss” becomes one of the most addictive parts of the experience.\n\nBuilding System\n\nThe building system is surprisingly deep. Because the structures follow physical rules, a roof will collapse if it has no support. You are not just decorating a house. You are basically doing engineering work.\n\nIt gives you the real feeling of creating your own village from nothing.\n\nCo-op Experience\n\nThe game is enjoyable alone, but with friends it becomes something completely different. Sharing tasks, improving your base, hunting bosses together… Valheim’s true essence is in doing Viking life as a group.\n\nPlaying with others does not make the game twice as fun. It makes it ten times more fun.\n\nMusic and Atmosphere\n\nThe soundtrack is minimalist but perfectly placed. The gentle notes you hear while walking in the forest at night, the wind brushing past your building, the calming sound of rain… These are not just background effects. They are part of the emotional backbone of the game.\n\nStrengths\n\nAmazing atmosphere\nSatisfying and balanced combat\nPhysics-based building system\nEpic co-op experience\nLight system requirements\nEndless sense of exploration\n\nWeaknesses\n\nContent updates can be slow\nPlaying alone can sometimes feel grindy\nThe huge map can overwhelm new players, although some people see this as a plus\n\nFinal Thoughts\n\nValheim is one of the rare games that manages to be both meditative and exciting. One moment you are relaxing at a campfire. The next moment you are fighting a massive creature with your heart racing.\n\nIt does not just use the Viking theme. It carries the spirit of it.\n\nIf you like this genre, do not skip it.\nEven if you normally do not enjoy survival games, Valheim is one of the few that can change your mind.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A bajillion years and hours later, I still really like this game. I just keep coming back to new worlds and building new bases over and over again. Highly recommend with friends. The only early access game I'll recommend to be honest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eşiniz, dostunuz, arkadaşınız belki ileride çocuklarınız ile oynayabileceğiniz güzel vakit geçireceğiniz bir oyun, aşk ile oynuyoruz..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim is an awesome mix of chill exploration and hilarious chaos. It’s fun solo, but playing with friends makes it unforgettable. Progression feels smooth, resources are easy to gather, and building bases is insanely satisfying.\n\nYou start with nothing, survive the wilds, build your Viking home, fight epic bosses, and eventually sail into danger you didn’t ask for. The atmosphere is perfect cozy fires, dangerous nights, and moments where everyone yells “RUN!” together.\n\nShort version: Great vibes, great co-op, great adventure. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite all the dislike of survival games, i wanna say that the game found itself nice, atmospheric, and addictive. But u have to choose ur mates for the session properly to avoid situations when all will be at sixes and sevens. :-)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's a sort of peacefulness when launching this game after a busy work day. Chilling, exploring, building or slaying monsters with friends is always fun. We may die a few times but come back stronger, lol. Love the soundtrack and visuals of each biome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "UNLIMITED gameplay bro but don't play this game alone. Play duo for best experience. Amazing visuals but doesn't overwhelm you with complex stuff. Absolutely recommended 10/10 peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to play with friends or simply solo. Very adjustable game style and difficulty towards how much time a player has. Combat system is decent and the building part of the game is super fun, but that's just a preference.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "games good and rlly addicting, combats mad unique and hella content",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed it even when playing solo, but its way better with a friend. We have already beaten two bosses. If you’re into survival, crafting, and battling, you’ll definitely love it!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vikings Minecraft with widely adjustable difficulty ... some mechanics and stuff are confusing tho ... first 5 hours of playing went by fast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A big part of Valheim’s appeal is how fully it allows players to control the pace of the game. In most survival games, your situation constantly deteriorates: you go hungry, your food spoils, crops wither, and tools and buildings break and require repairs. You need to constantly do things to keep progressing, and it can feel stressful. In Valheim, you can’t die of hunger, repairs are free, food is imperishable, and crops and animals will wait for you forever. Aside from the occasional raid (which is usually easy to fend off), you can spend 50 hours just decorating your cozy base without consuming any extra resources.\r\n\r\nThis makes it easy to accommodate different playstyles. You can go as fast or as slow as you want. If you get bored building your castle, you can go out exploring. And when you want to take a reprieve from the intensity and danger of Valheim’s many biomes, you can return to some chill crafting or building project. That’s why I think it’s such a popular co-op game: people can do the things they enjoy and don’t feel like they’re not contributing. So if you’re looking for a “first survival game to try the genre” or a “survival game that can be played with non-hardcore friends,” Valheim is a great place to start.\r\n\r\nIf it gets too grindy for your taste, you can enable 2x resource gain in the world options at any time. You can also make combat easier (or harder) and change death penalties. I recommend keeping the default option of not allowing metals through portals — a lot of the fun logistical challenge goes out the window if you allow ores to be teleported.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "太好玩了。主要是有一群哇哇叫的朋友一起开荒，一个人玩不敢想象有多难。\nUnsurpassed.Everyone in the world should experience this masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A really great game, and even though is has been a long time of waiting for this game to be 'Finished' I think it will be worth the wait.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best survival game so far, outstanding in multiplayer",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Such an addictive game. Definitely worth playing with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy Valheim even though it's incredibly underbaked and desperately needs a lot of Quality of Life features, e.g. a \"Sort Inventory\" button, a lot more server options like adjusting rain structural damage, the efficiency of food, the abilityy to harpoon your tamed animals, the option to make the youngling pets follow you like their parents do, expanding the stacking limitation, having a lot more options to building anything other than square houses (if some players spend their free hours building pretty houses with such limited tools it doesn't mean, sadly, that all the other players are able to use them as efficently, will talk about that down below*) and all that, and a lot, a LOT more, but at the same time...\nThis game has the charm, the soul, the heart, whatever you might want to call it. It is good and the devs are on a slow (not as, say, Project Zomboid slow) and steady pace to improve the game and make it better and better, which is really sweet to see. I never would have thought this game, with it's specific, weird and odd mechanics, might hook me, but it did.\nMe and my friends are at the halfway point, exploring the Plains. I am cautious about the balancing of the game, might update the review later if the balance is broken.\n* [spoiler] I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs I hate building roofs [/spoiler]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A pretty good game, which is not taking a lot of space!\nIncluding a huge map full of beautiful places and zones which are ready to be Explored.\nA wide variety of creatures!\nA wide variety of Building materials!\nA Beautiful Nature, sky, sunset & sunrise!\n\nYou can have fun with your friends meanwhile building, exploring, thinking of the best base position/strategy etc.\n\nIn my opinion, the only Negative sides which I see are that:\n1)  weapons got disarmed, when you fall deeply into the water;\n2) stamina expires really fast.\n\nIt would be great if Developers add potatoes and strawberries all together with some recepies.\n\nOverall it is a 10/10 game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim is so much fun with friends. Yeah, we've kinda done everything there is to do for now, and the updates take forever. But honestly, just starting a new world every six months or so is a blast. There's just something about building a little Viking cabin with the boys that never gets old.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed this game! I'm currently playing on an online server with just my husband, and it has become the game we spend time playing together. I like the building and crafting portion of the game, but combat is a little annoying. Also you lose all item on death that you have to run back to get, and sometimes i die maybe 3 times just trying to run away from the enemies to equip my armor again. I will keep playing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice ambience, nice graphics, nice soundtrack. Good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never thought i would play this game for this long with friends. What seemed like a good game for a weekend turned out to be a game for months of creative building, fighting, farming, gathering and everything that makes Valheim - Valheim. Easily one of the best survival games as it has really good scaling with loot, you won't be overpowered or underpowered if you do everything right, has a consistant need to upgrade base, to farm crops, to hunt, to gather everything into one place and expand and seek adventures, there are plenty of biomes such as Meadows, Black Forest, Swamp, Snowy Mountain, Plains, Mistlands, Ashwood, and every each one of them you will need to search for on the procedurely genereted map to progress, on each of them there are enemy's that drop loot that will be used either in crafting or cooking, nothing really goes to waste. To travel long distances you will use ships, from small ones to the REALLY big ones, or carts to transport cargo such as metals, dragon eggs, chests (special ones) and other stuff i have yet to see. So yeah, if you want a game for you and your friends to have a long lasting fun - this game is absolutely worth every $ you pay for it. Recommended 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games i've ever played, gave me that feeling as a kid playing minecraft going on a crazy journey. Everything is great, the crafting, the farming, the combat, levelling up skills, it's all done in a way that feels so satisfying, you can be cutting down trees for an hour and wont care, everything down to the last detail was cared about and you can feel it. The one thing I applaud above everything else is that the game is unforgiving and is actually hard, especially in the beginning. I've had it with devs treating players like they're humunculis.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Build a boat, go for swim in night and get eaten by big fish.\nGood game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My better half and I love this game and have played it a lot. She loves the cozy feel and honestly, so do I. We built a cabin that slowly evolved to eventually becoming a looming castle on a waterside in the meadows. We've had friends over at various worlds and built things that we very well have forgotten about but we have so many screenshots and memories of this game that I have to say this game is both simple, extraordinary, cozy, exciting, thrilling and just filled with a warmth that other games do not have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Brutal game if you don't know what to expect but fun extremely fun when you get the mechanics of the game. A beautiful game with one of the best building systems I have seen I videogames.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Makes my wife and I call each other names while fighting trolls and farming. Very good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super cool gameplay, good crafting mechanics. Rough graphics, but in a good way. Neally nice audio and music :) 10 hours in the game I feel i'm gonna have to be careful about not abandoning my social life :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came to Valheim by looking for a new survival/sandbox/adventure game. I found the best at this day ! \nYou red the comments about graphisms, but after roaming a bit and killing the 1st boss, the game will keep you in permanent extasy with crafting, exploring, and beating more monsters...\nCongratulation to the developpers for such clever integration of food and building in the gameplay. \nThe game could be performed at 1, 2, 3 or more ! with max fun and balance ! Even if you go far in solo, it will be a real new experience to do it with teammates.\nIf you do not play yet to VALHEIM, you are lucky because you are going to discover a real good game ! Kill, die, trick, yell Odin's name, succede and have fun !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Aw man what to say first, well i guess ill start with building its the most rewarding and least rewarding thing ever, rewarding in a pride sense no rewarding in a worth it sense. number 2, the bugs there are some minor game breaking bugs but nothing thats ever made me stop loving this game. 3 the creatures will fuck you up. And those are the main points hope this helped.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is amazing. Not even fully released yet and I have played the early access multiple times for 200 hours now. I cannot recommend it enough if you are a survival game fan and it is a very unique system compared to what I have experienced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid survival gameplay, very enjoyable at the start and then you hit bronze. we dont talk about bronze. overall though absolute peak so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "High replay value, it's just the runbacks are excruciating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally one of the best survival game i tried out, its super fun with friends. The vanilla adventure is already spectacular even though its a grindy process to reach the next Age but dude i tell ya its crazy! Oh and one more thing...Don't advance too fast or there will be very serious repercussion and for this make sure to pre-planned a lot there on your base, foods, materials and many more for the new players!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's really not much I can say that hasn't already been said about this game in other reviews. So let me say this: when I look back on my time having played this game--mind you, as one of my first survival crafting games--I can say that it will always stick with me as an enjoyable experience. The music, ambiance, and gameplay all craft a charming experience that I'll always fondly remember. My only gripe was that sailing was tedious and cumbersome. If you're a fan of survival crafters, you need to pick this one up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the artstyle and building system, rest of things not so much but it is up to taste - in general very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exploration is great, game progression and each zone is unique and rewarding.  The crafting system and materials from all areas remain relevant regardless of your zone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Valheim is by far the best co-op game I have played hands down. I cant recommend this game enough. out of all multiplayer games i have played with freinds valheim is one of the most memorable. really hoping the devs keep updating the game for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun, + I think the ashlands animation on the store page is pretty cool :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Needs an update to character models to give us actual enormous dump trucks that borderline lag our game even further than whats already possible. You cant tell me Odin doesnt want his selected heroes to shake the 9 realms with every footstep. Once this is added, Goonheim will be a complete game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<built a boat\r\n<Travel down a river\r\n<See a troll\r\n<ohh shit\r\n<killed killed loose everything\r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Valheim has been my go-to idle and chill game ever since I got immersed in it last December. It wasn’t fun at first because I didn’t know anything and I had no one to play with. But when I started again in December, I finally learned how to play and what I needed to do. Now, I play it solo or with friends — and I like it a lot. I'm just waiting for the Deep North to come. So while I do that, I will be exploring more! (´▽`ʃ♡ƪ)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, wish it had more hype then it does, such a hidden gem with me and my friends, we replay it all the time, so excited for 1.0. So happy to see how far this game has come and would 100% recommend it to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very fun, has an easy enough entry into it's mechanics and what you'll be doing throughout the game, then curves the difficulty fairly quickly once you've got a handle on it. I like the health and stamina system, they feel novel to me as far as the survival genre goes. The physics in the game are a hoot as well, and sailing feels really nice one you aren't on a raft.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely incredible game I probably spent 500 plus hours on this game between the Xbox version and this one on the PC. I've played this in a group with my adult mates, i've played this with my 8 year old daughter, i've played this on my own solo.\r\n\r\nif you're OK with the style of graphics and you enjoy the survival / build mechanic thats familiar with the genre - this ones a pretty robust setup. Of course it helps if you're into Viking aesthetics as well\r\n\r\nthis is one of my favourite games to enjoy and I regularly sit down to play it even when I've taken breaks from the game I still come back to it. well worth the asking price for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic co-op game with great gameplay and survival mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a brutal survival game  with challenging enemies and environmental conditions . You are called by Odin to help vanquish his enemies. Getting yourself clothed, housed, fed, making armor and making weapons in this realm is the heart of the game. If you like building structures and crafting from resources you can gather, then you might like this world. It has several modes you can play on, from a creative mode with passive enemies and plentiful resources, to a brutal slog to get anything done while being attacked by everything that moves, including raids on your base camp, and mass events that come after you defeat a boss, and other game modes & modifiers between the extremes. Brutal, but loads of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I might say it's a good game, looking at the hours I've spent in it :b\r\nYeah, definitely a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recently jumped back into Valheim and I must say it has been so much fun! The game has always looked amazing and played well but this time it just seems better. The combat is fun, the farming is satisfying, although I could do with more recipes and uses for certain foods. We have a pig village where we harvest boar meat pretty consistently.\r\n\r\nBuilding and landscaping is satisfying and easy to understand. I do wish the beams had a version that was about half the thickness though. And I would like to see different fence types as well. Those are just preferences though.\r\n\r\nTravelling to the biomes and exploring, fighting enemies, and discovering new items is everything a viking needs and wants to feel accomplished.\r\n\r\nIf you are on the fence about the game, get it! It's a great time with a small group of friends or solo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Valheim is a really fun, beautiful and amazing co-op survival game with good progression system throughout various  biomes the game present, each ending with a boss fight. I hope magic system will get some implementation in early game because Mistlands is a far journey for a new player and it's a waste not putting in earlier in some kind of form.\n\nGreylings can go to a bottomless hole for being such a nuisance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game solo of with friends, so well designed, and lots of fun mods for replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! However, the soundtrack, dangerous monsters, and lack of friendly NPCs all add up the game giving users extreme loneliness. Additionally, the great sea, powerful enemies, weather, and fear of losing your items (it can be made so that items are kept on death) can make the user feel rather frightened and tense. Conversely, It is fun to grow and develop your character and his abilities--altogether, an enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At least 200h of enjoyment in 20$ is an absolute steal. Still 1 (2 with 1.0 drop) Biomes to go. Building is peak and prgression very nice designed. But it for sure gets significantly more grindy over time.\n\nOnly thing missing is a good Creative Mode (without mods), that includes:\n\nAll Materials instant without any station by default\nGod mode by default\nNo Material or Item dmg by default\nFlying by default",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I was a child I used to cower in terror in the corner of our kitchen as my mother beat my sister with an enormous wooden spoon. I do not use the word \"enormous\" lightly, it was the sort of implement you would expect one to stir a witches cauldron with, or perhaps to scrape out the innards of a large mammalian carcass. I digress, this game is how I cope with my secondhand big spoon trauma.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful world to build, explore, and die in!\n\nMy favorite part is building. The structural support requirements are unique, intuitive, and fairly realistic without getting overly complicated. Those rules present good challenges to designing homes, bridges, towers, chutes to drop ore down a mountain, or whatever else you might imagine.\n\nIts core gameplay elements aren't anything novel (collect resources, craft items, kill monsters, level up your skills...), but they are all well-executed and combined in a satisfying and engaging way.\n\nI like that fast-travel (teleportation) is possible except for ore and some other important items. It means you still have to think about establishing routes and means of transportation across the map without making you have to traverse the map so much that you get bored.\n\nI've found it unfortunately difficult to learn everything on my own. This turned me off from singleplayer for a while, since it wasn't clear to me what I should do to progress. There is a wiki online and a wiki built into the game, both of which can help with this, but I just don't find it very fun to have to read them so much.\n\nMultiplayer has been especially fun though. Along with creating fun moments between players, playing with a friend who already knows the basics and can guide you via word of mouth has significantly helped remove the roadblocks on the learning curve for me.\n\nOverall, 8/10, recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is my absolute new favourite game, my boyfriend showed it to me and it is so fun ! I hate the raids but thats because i am not good at them yet hahah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. It's a little grindy, but very complex, and lots to do which makes it a hard and enjoyable game to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I find my self always coming back.\r\nIts a sense of nostalgia mixed with great gameplay i think.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing tests your resilience and patience like building a peaceful Viking longhouse, mini farm and apiary and then having it flattened by trolls before you can build the world's strongest wall with a hoe. \nThe new weapons slap, the new enemies slap harder. \nFantastic game. Better with friends who can entertain you by dancing on the ship while you do all the sailing work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best survival builder.  No other game even holds a candle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game can be pretty unforgiving, upgrades are essential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Valheim is a great game - sort of. I would recommend giving it a try, mostly because there are a lot of engaging mechanics that are worth experiencing. Building the perfect hall is very satisfying, especially considering how difficult it can be to gather resources. Combat feels good and weighty. Though the worlds are randomly generated, they feel believable and are fun to explore. Inventory management and stamina management bring the game down overall, unfortunately, and progression through the different tiers feels a little too stretched out for my liking. It does make hitting the next bit of the game feel a little more accomplished, I suppose. I would also say that combat is too frequent - while fighting can feel fun, there's just too much of it. I would rather there be fewer, more interesting combat encounters than the constant wave of enemies there are currently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play for 30 minutes die spend 2 - 3 hours trying to get back your stuff, \nretrieve your stuff and repeat 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and always finding different places of the map:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, very punishing, with an amazing universe. The only downside is playing solo, which is naturally less enjoyable than playing with others and requires much more time to craft and build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics can be very minimalistic which might turn a few people off, but getting past that, this is an amazing game. Whether you're roughing it solo or playing with friends, I cannot recommend this gem of a game enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never beat the game before, but I've loved playing this game. It's fun to play with friends, but most of the time I play alone. I like it because at least in the Meadows biome, it feels very cozy and warm. I like to play it when I'm feeling lonely or overwhelmed with the world, and I feel calmer after playing for a while. Also, the music is absolutely perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay-\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Okay\n☐ Bad\n\nGraphics-\n☑ Masterpiece\n☐ Beautiful\n☐ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio\n☐ Amazing\n☐ Very good\n☑ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n\nAudience\n☐ Kids\n☐ Teens\n☐ Adults\n☑ Everyone\n\nStory-\n☐ Lovely\n☐ Good\n☑ Average\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☐ Easy\n☐ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☑ Dark Souls\n\nGrind-\n☐ Nothing\n☐ Only if you care about leader boards or ranks\n☐ Isn't necessary to progress\n☐ A bit grindy sometimes\n☐ Average grind level\n☐ Too much grind\n☑ You will only play this game for the rest of your life\n\nGame Time-\n☐ Short\n☐ Average\n☑ Long\n☐ Depends on you\n☐ Endless\n\nPrice\n☐ Free\n☑ Just buy it\n☐ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Not recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, it started a new genre among the of survival games. Yet it is the first of it's kind. Beautiful, Smart design, great combat, just enough building elements so you don't feel overwhelmed but still can make everything you desire and more, keeps you engaged all the way until the end, never got boring. It thinks every box for me",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "4.5/10, would be neutral.\r\nPros:\r\n- Lots of content\r\n- Creatures seem varied\r\n- Combat is kinda fun\r\n- Maybe lots of build variety but... (see cons)\r\nCons:\r\n- Building is way over-complicated\r\n- Early tutorial not very informative\r\n- Constantly being under attack while trying to do literally anything\r\n- Time to collect basic resources doesn't value player time much\r\n\r\ntl;dr maybe worth a try but not for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game suffers from \"I want to be hard but i dont know how\" So it spams enemys when you turn your screen and has mobs from other biomes randomly push you while your nowhere near said biome. The \"random events\" tend to just spam you every night, and if you combine that with the annoying stamina and health system relying on food it becomes a nightmare. If you get overran because you went afk in a pause screen for  5 minutes in a server that was still running even though your friends left an hour ago you might aswell kiss your save goodbye. Their are 1000 different ways to go about making a game difficult hard challenging whatever you want to call it. This game just says eh whatever do this and hopefully they like it. And we do not like it. If i could refund this game i would but since i bought it early access before half of these annoyances were a thing i cant. If you want to have a running simulator where u run for 30-40 minutes to get to a new biome, barely survive and on ur way out get jumped by another more powerful biomes enemies while that biome is no where near and die, then run back to ur body 2 seperate times causing an hour and a half to be wasted by the time its said and done, then this is your game, if not just skip it and keep it moving. ive had 20 hours on a playthrough and only 7-10 of those are actually playing without having to runback to a body.\n\nSteam wants me to revise my review after 9 more hours and it gets worst. Its almost like the game knows what direction you want to go by boat and only gives you a head wind. On top of that finally get to bonemass and instead of being greeted by a bossfight you see in the videos all i get is enemy spam. 5 abominations 9 drauhgers 10 skeletons leeches and 2-3 of the spectre things. I had 0 opportunity to fight the boss. If i by the grace of god killed all the enemy spam his next 3 moves were just spawning more that were too far to spawn kill, and then adding the random spawns because i turn my screen making it a terrible experience. Nothing about this is appealing in a bossfight when i spend 2 hours fighting everything but the boss. And if you think this is a joke I walked out with 30 skeleton trophies 2 and a half stacks of bones, a half box of ooze, a stack and some of entrails, and 41 blood sacks. This is not a fun or normal experience. I wish i could refund this. I encourage no one to buy this",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So, having reached the ashen lands, I can say that this game is a piece of foking garbage that requires many hours of grinding and a large group of players to actually complete it.\nIf you don't enable metal teleportation, be prepared to spend 50 hours more in the game than necessary. Is it fun? No. Is it interesting? No.\nAre you playing solo or even with a friend and have reached the ashen lands? Be prepared to suffer, because the number of enemies is designed for the same army of players.\nDon't take it at the current price, the developers have been slowly going crazy all the time of development\n\nCan you sign my petition? >:0\n\nhttps://c.org/MJphF5RJhL",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game is fun up until the Ashlands where the experience changes completly and becomes the worst game you've ever played.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fun for the first 200hrs. Boring as can be afterwards. Even more so if you play alone. Going on 5 years into EA. Hopefully 1 day Valve changes that policy and forces these developers to actually make changes that matter and create a full game within a reasonable time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fun game to play with friends until you get to the ashlands it makes no sense the spawnrate of enemies no breaks is unfuc king playable for a casual player or even  a darksouls player is no fun to play the endgame all your armour is underlevel by a lot and magic becomes useless  , is fun till the end is really frustrating is not ment to be played by small group of friends, also the faming one by one by hand, add a hoe or smthing .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Este juego es EXCELENTE. Mucho contenido, caracteristicas realistas, jugabilidad bella... En fin, es divertidísimo al jugar con amigos; es muy difícil y tardado debido al sistema de progresión e inventario muy limitado. En cuanto los desarrolladores añadan integración con Steam Workshop, le daré mi aprobación absoluta y una reseña positiva detallada.\r\nHasta entonces.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be one of my favorite games, but I've lost confidence that the devs are actually putting in any real work anymore. They're drip feeding us meaningless updates months apart while selling board games, plushies, and candles. Literally everything BUT finishing the game. What a shame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "With the pace that this game updates, maybe my nephew in the 2200 will have the possibility to play it \n\nPatch 0.221.4 in 13/11/25",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Игра без модов ДУШНЫЙ, НЕОПТИМИЗИРОВАННЫЙ, НЕИНТЕРЕСНЫЙ кусок е.банного кала, не стоит ни своих денег, ни потраченного времени на бесконечный фарм. Убил босса - идёшь фармить 10 часов но новую броню и оружку, перешёл на новый биом - идёшь фармить 10 часов, закончилась еда - идёшь фармить 10 часов.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game will never be released. The developers do nothing but spread the news about the \"Best construction of the week\" and the fact that you can buy new items dedicated to the game for real money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "people can say the game is just \"hard\" but that isnt an excuse for terrible game design. The game was never \"hard\" its just overly tedious, ridiculous, and terribly made\nplease never play this game unless you are the most patient person on earth because EVERYTHING in this game is like watching paint dry, even the combat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played  for very long just to realize i didnt enjoy the game and spent a long time wondering why i ever realy playey it to begin with, enemys suck, farming sucks, looting sucks, friends suck, plains biome sucks, swamp biome sucks, worlds suck. hmm what else idk maybe that every new place you go you do tame 3 things. 1. mine ores 2. craft better gear 3. fight boss 3a. repeat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't play this game if you hate mosquitoes.\nYou must be a certain kind of psychopath to add these annoying little shits to your game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've spent a lotta hours trying to enjoy this game but it does such a good job at making sure everything feels as bad as possible. They desperately don't want you to enjoy the fun parts of the game. Crafting, Building, Fighting, and Exploring all seem to be as tedious as they could conceptually think to make it. It's not even realistic, it's just a nuisance. \"Can't build/craft without a roof,\" \"Can't sleep without a nearby fire,\" etc. are all mechanics that serve no purpose than to create an unprecedented barrier to a simple task.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "How many years has it been, and the progress is at a glacial pace. Just another example of a dev team taking money for EA then having literally zero desire to even release things at a reasonable pace. Look at Enshrouded, came out after this game, has had bigger updates, and is arguably a better game with more features and will probably release before these guys get off their butts.\n\nWhat a joke.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While I have gotten good enjoyment out of this game, I cannot recommend it overall.\n\nThe further one progresses into the game, the less fun it becomes.\nCombined with being way to grindy with default/recommended settings, this leads me to the downvote.\n\nThe game progresses via diffeent biome, with clear, strong equipment steps.\nEach biome has it's own unique ressources, which are required for crafting equipment like armor, weapons and food (buffs).\nOne can only progress into the next biome if one has farmed enough material for the biome-specific equipment, and if one has upgraded it at least to some degree. \nIn addition, one need to defeat a biome boss to gain key equipment opening up the next biome.\n\nThis progression system works excellently for the first five biomes (meadows, black forest, swamp, mountain, plains).\nThese five biomes are designed well - they each are uniquely fun to progress through, with their own unique challenges and design.\nEven though, already in these biomes, there is an overly strong element of grinding - and made additionally grindly/cumbersome/slow by deliberate design choices like not being able to transport key elements through portals, if using default settings.\n\nThen there are biomes six and seven - Mistlands and Ashlands.\nWith the Mistland, the grid becomes more cumbersome (you don't have to grind more materials - instead, the grinding itelf becomes more cumbersome), and some Mistland design choices do not mesh well with the games technical strengths and weaknesses (Valheim has issues with combat/hitboxes if there are elevation differences - and Mistland is all sudden elevation changes).\n\nThe game stops being fun, and is becoming a chore - a chore that feels entirely unneccessary, and seems to be down alone to specific, intentional design choices.\n\nTHUS, OVERALL, I DO NOT RECOMMEND THIS GAME.\n\nThere are some good points that I want to mention, as well:\n- Combat is always engaging, fun and challenging (only exception is the mentioned hitbox issues).\n- Excellent music and sound\n- Game runs smoothly and is very stable (no crashes)\n- First five biomes are LOTS of fun, if turning off portal item restrictions.\n- If playing carefully, the rather stark death penalty (skill reduction) is ok. And the penalty can be reduced for a more causal play style.\n- Fun both single-player as well as coop mutli-player with friends (host your own server).\n- Dedicated Linux server is very stable\n- Good selection of mods, if one is so inclined (I STRONGLY recommend the \"DodgeShortcut\" mod if playing with mouse and keyboard)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The penalty of dropping all of your gear due to dying is too much for this to be an enjoyable game for a casual player.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Early access for half a decade and updates so rarely it's embarrassing. \n\nAnd still basic things are still missing. \n\nIt's like Dark Souls for crafting survival, where it's \"hardcore\". Would have loved it in 2000's when I also cared about it being hardcore. But now it's just ridicilous that you enter a new biome with maxed items and get 2 shotted. Potions are once every 2 minutes, you can't dodge if you are lacking stamina. \n\nDeath runs are punishing. Everything is punishing. \n\nSo very \"hardcore\", IF you are such a person sure go ahead. If you want to spend 2 hours just getting ores back to make new items that still get you 2 shotted in a new biome. Oh you also have to spend another 2 hours to get more back to upgrade since the requirements are so high in comparison to how much you can carry. \n\nNext carry upgrade is lucky if you run into it, but basically you have to run 3-4 times back and forth to get your gear in line for the current bione. Which is at least 2-3 gaming sessions since the travel is fucking stupid. And your ship level 1-2 can't carry shit unless you bug it with a built cart ontop of it. \n\nI highly recommend lowering the difficulty, if you have a job that is. And install mods. This game is pretty bland without mods. We had 11 and we kept it to a minimum. \n\nWould not recommend unless you are a \"hardcore\" person. If you are looking for a great coop game play Enshrouded early access or Grounded instead. \n\nMake sure you get your modding ready, can recommend this game with some more mods and lowering the difficuly if you have a job and don't want to spend 20 minutes on a single fight to regenerate stamina and dodge + 1 hit. And that is with maxed out buffs and armour + weapons in the \"next biome\". To build anything make sure you enable 1.5+ drop rate or 2+ drop rate otherwise you'll spend most of your time pulling home wood or stone. \n\nInsanely basic taming features which is just so sad too see. \n\nThis game think you have 5 hours to play each day, or thinks you have all the time in the world. Basically it's very disrespectful with your time and imagines you to know thing beforehand since the tutorial system is prb the most basic I've experienced in the last 10 years. \n\nFirst ship sucks, second ship sucks, the third ship enables you to pull home ore but at that time you are so sick of spending time to get ore back you've already enabled \"take ore through portals\", since the developers sincerely thought you'd spend all of those tens of hours to get to the next level of crafting. Or already know exactly what to do like make forward crafting bases. \n\nWhich is just silly. \n\nVery hardcore indeed. Me at 16 when I thought it was cool to be good at games would prb make something like this. Instead of respect peoples time spent in your game and make it as fun as possible instead of as frustrating as possible to keep it \"hardcore\". \n\nIf you are playing with your partner/wife play Enshrouded or Grounded instead, this game is fucking stupid.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A great atmosphere and overall visual aesthetic absolutely tanked by dogshit gameplay. The game looks like it has never been played by anyone, not even the developer team. Dogshit UI, stamina system, Mistlands is a bloody joke, permanent stamina drain in Swamps, the list goes on. There are no quality of life features that make playing the game bearable. If you want to just enable console commands and build, it is a great creativity outlet but dear god the gameplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Food mechanic in this game isn't that great. The fact that you depend on food and base health and armor don't change through the entire game is a little ridiculous. Also having to eat after every death is absurd. Progression isn't clear. MOB dead city in the last area is overwhelming. Stealth mechanics aren't that great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game does a lot of things very well, but also does a few things so poorly that it ruins the entire experience. My main issues are the building and the inventory. The game does not give you slots for armor or a shield, you have to right click them in your inventory to equip them instead. This would normally be just a pet peeve and not really a big issue, but the shield unequips itself after basically any action. Swimming, using a bow, etc. Then when you're done with that action, the shield does not re-equip itself. Despite mainly using a knife, a one handed weapon, I found myself not bothering to even carry a shield because having to re-equip it every few seconds isn't worth the extra weight. The other, more pressing issue, is the building. This games building system is just flat out horrible. It is confusing, has unnecessary limitations, and discourages itself. In order to build at all, there needs to be a crafting station within a few feet of you, and you need to be holding a hammer. I built a simple wooden bridge and it took me like two hours because the hammer unequips itself in water. I needed to place several crafting stations down in the area because the radius around them that lets you build is so tiny. Building is normally my favorite part of survival games, but Valheim makes it as tedious as possible. Using pretty much any placed structure has limitations too, like crafting stations requiring a roof, and beds needing both a roof and a nearby campfire (by nearby, I mean it has to be right next to. It being in the other room is too far). These limitations do not introduce any challenge or depth to building, they just make it tedious and limit what you can build. The combat and food systems are very good, and the game overall is very close to being great, but until these issues are fixed, I can't recommend buying the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is legitimately pretty fun for the first 20 or so hours, especially if you have friends. Once you pass the 20 hour mark though, you start to notice the problems.\r\n\r\nThe game is split up into different areas that are randomly generated across the map. You move in a linear fashion through each area, starting with the meadows, then black forest, etc. In each area, you find new resources, unlock new recipes, fight new, stronger enemies, and summon a boss at the end that, when defeated, gives you the means to unlock the resources in the next area. Straight forward, right?\r\n\r\nHere's the problem. The amount of resources you need is... excessive, especially if you're playing solo. It is rewarding being able to summon the bosses and unlock the next area, but by the time you reach the swamp biome, you realize that you're basically doing the exact same thing you were doing in the meadows, just now your equipment is made of iron instead of flint. I have never gotten past the mountain biome (the fourth area), so maybe it gets more interesting late game, but I don't have the patience to find out.\r\n\r\nIf the heavy grinding doesn't bother you, you have friends to play with, and you only plan on getting 20-30 hours out of it, then you'll probably enjoy this game just fine. If not, I'd say look elsewhere.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been here from the beginning and most things were great, but after the bears being released I can't even manage to get copper the new items are amazing but... playing as it is now sucks. I do love the game but progressing went from challenging and fun to just awful. Bears are tough but not impossible but half the time my bow didn't out last the bears hp and well knifed it to death only to then have to deal with thegreybeard hordes that spawn since i was sitting there for a while dodging and fighting the bear and well usually that brings trolls. no imagine if there were no copper deposits near you and you had you sail. The bear will litterally swim after you longer than it should and pretty much destroy the raft no issue then your drowning because you where sailing away from the bear. I'm not sure if the devs are actually thinking things through anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this game does a lot of things right. So far, the building is very fun and allows for a lot of creativity with the land. I also like getting to explore the HUGE map and finding the cool biomes sprinkled around the world. And don't get me started on the soundtrack; the OST of this game is really immersive. Even down to the textures, there isn't one that even feels remotely out of place. This game gives off the biggest early 2000s RPG energy and I'm all for it!\r\n\r\nI've been playing with a group of three consistently and it is fun, but they are the only reason I've continued to play because this game is so damn slow. A map this size would be okay since to return from your 30 minute journey to the sourthern side of the map, you can create portals, meaning you're able to teleport to that location whenever you want once placed. The bad game design comes from the fact that you cannot transport metals through the portal, meaning that the most essential resources that gatekeep you from progressing (bronze, iron, etc.) must be transported via boat, the slowest and most aggravating vehicle in this game due to the speed determined by the current winds. Not to mention the fact that you already used said boat to sail that path, and you're coming back home with only 120 bars of iron after two hours of evading beasts, assuming you didn't die. To put that into perspective, you can't even make a quarter of the things you'd want with that much. The only reason why I only needed to do three trips for iron was because I'm playing with a group, so we have more weight capacity, but that still means we had spent well over an hour sailing a boat back and forth just to need more metal. This is only covering the Swamp portion of the game because it's the first time you'll need to use a boat, and you're guaranteed to be exploring with a boat much more after that due to over half of the map being ocean. \r\n\r\nIn this group I have been playing in, we have faced issues with the difficulty. We found Normal to be way too easy, as death never proposed itself as an issue, even the bears. That's when we switched the difficulty to Hard, and let me be the person to tell you that there is a balancing problem in this game. Admittedly it was fun around the Bronze Age, since bears took a real effort to kill in our group, and even one mistake from a troll could send a player to their demise. The first cracks formed when fighting the second boss of the game, The Elder. We were dying constantly during the fight because a troll spawned mid fight and wrecked us, and even Druids spawned in that could heal him! That happened for 15+ minutes until he decided to stop functioning and idle in place until we killed him with our bows. That boss was a warning, because upon reaching the Iron Age, the spawnrate had got way too annoying. Even with level 3 Troll Armor and the heartiest of meals, I still ended up being two shot by Draugrs, which there usually multiple of. This isn't even noting the fact that poison in Valheim is the worst debuff in a game I've seen in a while. The first poisonous enemy, the Greydwarf Druid, already melts over half of your health if he manages to hit you. By the time you reach the swamp, a single hit from a Blob or Leech is basically death unless you had consumed a brew. Personally, I do not enjoy games forcing you to use a specific brew just to negate an effect, hence why the Mountains are so far my least favorite area in the game, the Swamp being a close second. That wasn't even the Hard difficulty's doing either, as the jump is just as jarring if you were playing on Normal mode from those two points. There needs to be a rework to the difficulty spikes in this game, because nothing here feels gradual. I never feel like I'm actually getting more powerful, and instead feel as though the game is punishing me for progressing. The only thing Very Hard difficulty can do at that point is make every ranged enemy one shot you.\r\n\r\nWhile this game is much better with friends, the problem is that ANYTHING is better with friends. That can't be used as an argument for the game being more tolerable when that's just a universal constant for any game with multiplayer functionality. Valheim was fun at the beginning but it quite quickly becomes a slow, tedious game of watching the death screen for hours and throwing yourself at the same heaps of enemies until you obtain your stuff again. I've even tried doing things like sneaking to my items, which never works, because there are way too many enemies, and sneaking is way too slow and is just as energy demanding as running! I really hope the developers acknowledge the huge difficulty spike beginning from the second boss onwards, because the current loop is travel, die, repeat until you progress. 4/10 for now, but under the right circumstances, I'd possibly pick it up and give it another try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game devs spent more money and effort selling us products to a game than actually updating the game. Might as well be 7 days to die levels of waiting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the games of all time.\n\nSeriously though, whoever came up with the mistlands (flying enemies that infinitely spawn adds, enemies that can two shot you, bad terrain that uses all your stamina, and the long corpse run every time you die) has a long promising career ahead of them making other peoples life worse... Maybe a CEO or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is just silly. I can't kill one bear, so the game throws adds at me while I am trying to get away. The materials I need to fight bears are guarded by bears. I'm tired of dying over and over.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone who’s spent 183 hours in this game, I can confidently say it’s the biggest piece of shit I’ve ever played.\n\nLet’s start from the beginning: most of the game can be beaten using exploits that the devs never bothered to patch, because they clearly haven’t given a fuck since 2024. The Queen boss is a mix of the dumbest mechanics imaginable and endless left-click spam. Most of the time, you and your friends just farm resources so you can get screwed over in the next location.\nAnd don’t even get me started on how the devs decided to cover one of the most beautiful areas in the entire game with a wall of fucking fog. Amazing design choice.\nI could go on and on, but honestly — you won’t get any happiness from beating this game and if you don't believe me just try it and prove me that i'm wrong.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs are taking an excessively long time to finish the game. New content is incredibly sparse and far between. The new stuff they add is always harder, more tedious and LESS FUN than the previous.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game's patch notes consist of the devs showing off the horses they bought, funding a kickstarter valheim themed board game, plushies, and scented candles. legit this game will never be finished",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When it first launched it was fantastic, one of the best games ever. But it only launched with the first 5 biomes and the devs said it will be finished soon with the rest of the biomes. But 5 years later and only mistlands and ashlands have been completed and in my opinion the devs waaay overdid them. Mistlands was terrible to explore since it was very rocky and vertical and you can't see 5 feet in front of you, also they made a whole new magic aspect of the game which fundamentally changed it. And the Ashlands biome is even worse and not fun in the slightest.\nPromising game that I wish they would have just finished the last few biomes quickly instead of ruining the game by overdoing them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Linux/Steam Deck support is misleading. The game barely runs on these platforms.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game used to be ok until they rebalanced it and the damage is so ridiculous a casual player can't even make progress on lowest difficulties settings... modding the server now is the only way to make this enjoyable.   You've lost a player over it - horrible updates!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "good game but been in development for a LONG time and no clear finish in sight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I believe I have given it a fair shot but I fail to see the point of this game. \r\nOK, I know it's early access but the way it plays , it's just not fun. \r\n- It makes you grind enemies that you struggle to find on the map ( mostly because there aren't enough but also it's hard to get around with low stamina you have at the beginning of the game). \r\n- Combat is clunky and boring. Basically you just attack and dodge until your stamina runs out , then you die..... If you have to fight a strong enemy , there is usually no way to avoid pulling in at leas one extra small one and at that point stamina management becomes impossible.\r\n- I have no problem with dying and retrying, but the corpse run so incredibly BOOORING...  it just takes up an incredible amount of my time that I'm just not willing spend.\r\n- Your goal is not explained particularly well. \r\n- The building system is a little weird. With this I mean everything around it: general clunkyness ( but this is to be expected), the limitation of only building around a workbench, controls.\r\n- Not a huge fan of the art style. I mean... I can understand the low poly direction but right now everything looks like a placeholder ( which .. it might actually be true, idk) \r\n\r\nThe only positive thing I have to say is that I liked how sailing is affected by the wind direction.\r\n\r\nTL;DR: I'ts a cool concept but to me it looks and feels ages away from being finished and I find it simply not fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just Can't... Just feels like roblox to me.  No weighty feel, sound design. \n\nI like the world, I'll watch you play. But it's a NO for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Affordable Game, Horrible merchandise practices.\n\nYour Candles may burn long, but my faith in your company just went up in smoke if that's your approach for merchandising. Think again, we're not all made of money, choose better sources, or keep wasting your time catering to those with more money than brains.\n\nNot recommending, for the fact they took no consideration in their user base at all, and acted on a bad whim without any true consultation or fact checking. No one wants to support a game or company, with overpriced merchandise. NO ONE DOES.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Once upon a time I would have said this is a great framework with a lot of potential.\n\n5 years later I'm still saying the same thing because quite simply this game has not developed in the past 5 years of development.\n\nWorse than that, when the devs actually deign to drop a significant piece of content, it's usually an unsatisfying mess of procedurally generated jank or mistakes tedium and frustration for \"challenging\".\n\nWhile games like Enshrouded are presenting complete biomes,  quality of life features, voxel based building and fully simulated water physics, Valheim devs... tilted two roof pieces and are trying to hock 3 candles for 100 bucks...\n\nFor. Shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Font is unreadably small and can't be increased. Mods have been made for years now to allow users to increase the font size but the game updates continue to break the mods.\n\nWould like to play the game more but it's just killing my eyes. This can't be a difficult fix for the developers. 115% UI scaling is just not sufficient.\n\nI requested a refund for this reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got this game to play with my family (who like the Elden Ring kind of challenge).  They liked it.  We assumed I would like the base building mechanics.  The base building mechanics are weak, and I don't think they can be fixed.  So, I will likely not play again.  Good game for precision fighting.  Not a good game for casual base building.  Not my cup of tea.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very unbalanced. Neat building and crafting system. Once you get into the swamps or later it becomes a slog.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Impossible to proceed wont let me fight the first boss. I hate this game the more I play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor graphics, poor guidance, tons of glitches. Buy a similar game to this style and you will be much happier, there are far better options.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Use to be my main co-op game back in 2022.\r\nSure it was a litel grindy and clunky but it was fun.\r\nDown the line tho i get less and less fun and ultimately we decide to stop playing.\r\n\r\nhaven't touched the game since then, it might have gotten better since then, i whould not know.\r\nIf i ever return to it i'll update this review accordingly.\r\n\r\nNot necessarily a bad game, it just not something i whould recommend thats all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is a running around map simulator\r\n\r\n- Devs implement portals because ... running around the map is boring.\r\n- Devs implement ores as one of the most important resources in game\r\n- Devs forbid to use portals when having ores in inventory\r\n???\r\n\r\nMy pinkie hurts after 1h of gameplay from pushing down the shift button for sprinting",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "fun game but these are the slowest workers in history. if you want one update a year you might get it (its just outfits)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OMG this game is bad... like combine annoying plus tedious predictability and you have a China android app with fake ads that's twice as good as this garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Combat is just as janky as it was on the initial release. zero improvement in several years. Played it for all the content in 2022 and uninstalled. reinstalled hoping to find something- anything new. Nope. The exact same beta feeling gameplay.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I personally can't really recommend this game if you are coming from other survival games like V Rising and here's why:\n\nThe building system, while intuitive, can be obnoxiously buggy sometimes. It's meant to be able to clip but pieces dont always snap together like you want them to. You do get 100% of your resources back though.\n\nThe combat is slow and feels very clunky and unpolished. The stamina system feels VERY unbalanced and half-baked. This makes the boss fights arbitrarily difficult and largely not fun. \n\nThe progression, while similar to V Rising (I'm sorry i keep comparing them) in that key techs are locked to bosses being defeated, just doesnt feel rewarding. For example, the first boss can make sense in that you need to kill the storm deer to harvest its horns to gather copper and tin for bronze to get metal tools. This allows you to upgrade for the next boss, but after the first boss, every single one after just isn't that fun to fight. It feels like they stopped trying to make fun fights and just pack content in.\n\nNow, the multiplayer issue. Every boss you defeat will add spawns of the biome that boss is in to appear at night. In single player this is fine. But if you are playing with friends on a server and you need to take a hiatus due to life and they keep playing, you are going to come back to impossible to defeat mobs and raids. This increasing night spawn difficulty is weird and makes playing with others, especially if you have family or a career, not worthwhile. \n\nFinally, the inventory system. It is antiquated and makes zero sense in the modern age of gaming. For a release of 2021, this system is just aweful. You are severely limited in what you can carry. Sure, the game lets you build carts for inventory, and your boat have inventory too, but combine limited space with a carry limit, resource gathering is a chore. You have NO way to increase your item slots, but you can get a special belt to increase carry weight. That is hardly enough however, in the later stages of the game when you a TON of resources to upgrade or build anything. \n\nTL;DR - Combat is slow and stamina system is half-baked, progression is weird and nonsensical, multiplayer impossible if you have a life, inventory is poorly thought out",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A beautifully crafted, good looking TIMESINK. This game insists on wasting so much of your time it's not even funny. The balancing is laughable as most new enemies and giants just oneshot you, sending you back hours away. You have to deal with both limited inventory slots AND a weight based inventory which is just so annoying especially when you can essentially only carry one stack of raw metal. You can make a cart to haul goods but the more metal in the cart the slower you move so it pretty much is the same as carrying it all while encumbered. Bosses are really boring often just having 3 very simple attacks and way too much health. This year we've got Bog witch and Call to arms as our updates. 2 updates with less content than either ashlands or mistlands and honestly just feel like I downloaded a mod. I've never asked a Dev to rip off or copy another game but jesus take a page out of Terraria and tone down the grind and make the world smaller. Give us better progression and options for where we want to go and fight. There is no need for a world as big as valheim as it would probably take you many hours just to get to one side to the other even with late game gear. Please just stop wasting our time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game seems like a scam... No important updates \nto the devs: if you want to know what to put in your game, research the mods that have been made. 99% are just QoL improvements. Please rebalance your game instead of updating it with 'building events' or random blogs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is unpolished and grindy, with questionable combat balance and some technical issues.  It's possible to make multiplayer work, but my friends and I (several of whom are IT professionals) found it more difficult than it needed to be.  It's a huge open world--which I like--but I found myself not wanting to explore it, both because the game punishes you with having to retrieve your body when you die, and because it didn't feel like an interesting world.  There are settings you can tweak to change how the game works, but I couldn't find a combination that made the game fun for me.  Some people like this kind of game for its unpolished charm, but I'm not one of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unity crashes causing your entire inventory to disappear seems like a fatal game flaw,  no?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve sunk many hours into Valheim, so it might seem strange that I’m writing a negative review. The truth is, my frustration comes from loving what this game could be, and watching that potential get sidelined by what appears to be a deeply passive development process. Think about it, they've made millions, yet from what I can tell, the coding team only grew from one person to two. That probably explains why new content arrives so damn slow. What’s harder to ignore, especially after all this time, is the multiplayer. 4 or 5 years later, it’s still the same laggy, desync-prone experience. This is only made worse by the lack of official mod support, which forces the community to use workarounds that can destabilize the game further. I know some will say, \"You played for 1,400 hours and you're complaining?\" But that's the whole point. I've been there through every update, hoping things would get better, and it’s disappointing to see such a brilliant concept languish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game still in early access after multiple years and still releasing \"updates\" that are really just physical merch drops and the most miniscule minor changes that are basically purpose built to drag out and take as long as possible to actually finish the game. bought it to play with a friend, then we both moved on to enshrouded when it became obvious Ironscam studios got their bag and ran, they never plan to actually finish the game until forced to.\n\nSadly, Valheim ruined my trust in the \"early access\" tag on steam and I never plan to get another game with it in there. Good job guys, you ruined it for all the other actual earnest developers. Hope you're happy with your money and your half-made game after 5 years.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuine waste of money. This game wants to be Terraria so bad but doesn't allow the players to have creative builds and accessories like how Terraria does. I would only recommend this game if you're a masochist who likes to watch paint dry for progression. Give me my money back Gabe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The worst 15 dollars I've spent on steam. This game is boring, and the character animations are laughably bad. I hope I save someone their hard earned money with this review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "From what I played and read and seen online, the game is just overrated linear \"open world\" trash that people claim to like because it's \"difficult/trendy\" when it came out. Even then the mass majority of the people seem to play it with mods since the base game is pretty lame. Don't mind difficulty in games and grinding but the game devs don't just use that as a crutch but as it's entire foundation.\n\nNot surprise this triggered the mentally slow playerbase that \"enjoy\" this slop. Keep giving me more clown awards you insecure drones.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too many questionable moments and no real sense of progress. On the plus side, the game looks pretty cool and lets you build beautiful houses. Other than that, this isn’t a game — it's a piece of dog crap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a single player experience it's a no. The survival mechanics lack depth and the combat is mundane.\r\n\r\nBuilding is the highlight.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]🚫 Frustration in the Fog: A Review of Valheim[/h1]\n\n[b]Overall Rating: 1/10 (Not Recommended)[/b]\n\n[i]Summary:[/i] While Valheim boasts an atmospheric world and engaging aesthetic, the core gameplay loop is crippled by [b]excessive, unnecessary tedium[/b], opaque mechanics, and frustrating quality-of-life oversights designed only to drag out playtime. I would refund it if I could, but giving the game a fair chance required sinking more than the two-hour limit.\n\n[hr][/hr]\n\n[h2]😩 The Grind Never Ends[/h2]\n\nMy main reason for not recommending this game is its overwhelming and constant tedium. I expect a slow start in survival games, with early progression focused on gradually moving faster, building more, and expanding possibilities. [b]Valheim rarely delivers this feeling of progress.[/b]\n\n[h3]I. The Opaque and Punishing Progression[/h3]\n\nThe game introduces you to a beautiful world, but the accompanying hints from the Raven are often [b]frustratingly vague[/b]:\n\n* [b]Vague Directions:[/b] Instructions like \"You can find this specific item in a very dark place\" are nearly useless. The location is an obscure dungeon entrance that looks identical to surrounding rocks, forcing the player to guess that \"dark place\" means the Black Forest and then rely on [b]blind luck[/b] to spot the entrance.\n* [b]Boss Summoning Opacity:[/b] The game fails to communicate basic requirements for essential progression steps. The altar for the first boss gives [b]no indication[/b] of what sacrificial item is needed, nor does it tell you that you need [b]two[/b] of them. This forces players to either spend hours running around guessing or, more likely, consult an online guide.\n\n[h3]II. The Crippling Material Loop[/h3]\n\nThe time sink surrounding metal acquisition is the most [b]egregious flaw[/b]:\n\n* [b]Finding Ore is a Chore:[/b] Crucial materials like Copper Ore are visually indistinguishable from hundreds of normal rocks in a dense, enemy-filled biome.\n* [b]Smelting Bottlenecks:[/b] After finding the required item in a dungeon, you often only have enough Surtling Cores for [i]one[/i] of the necessary buildings (the Smelter or the Kiln). Without a Kiln for Coal, the player is forced to spend valuable time [b]gathering food to burn for fuel[/b], drastically slowing the process.\n* [b]Inventory Management Nightmare:[/b] Even if you succeed in gathering the raw materials, the weight restrictions are too punitive. Hauling enough Copper and Tin Ore to craft the first handful of Bronze Bars instantly [b]over-encumbers[/b] the player. You're also not allowed to use teleporters with ore in the inventory. Which means, you have to walk the whole distance (or use a ship) for no other reason than stretching the playtime and making it tedious. Sometimes the walk alone is several minutes. We are talking about a 20 Minutes Minutes session of which 10min are just walking.\n* [b]No QoL Features:[/b] Compounding the weight issue, there is [b]no \"Craft from Nearby Chests\"[/b] feature. To craft even a small batch of 10 Bronze Bars, you must tediously move materials from a chest to your personal inventory, craft, and [b]repeat several times[/b].\n* [b]Unecessary Big World:[/b] There is no reason for the world to be as big as it is. Walking is a chore. A horrible, tedious and boring chore. There is nothing to explore, no variety within the bioms, nothing unique to stumble across. The only reason to actually travel on the map is to fight a boss or do another tedious task; Getting resources. I've been watching valheim gameplay while playing the game and there are several youtubers which have 30 Minute long episodes of them just sitting half-afk in a boat, traveling to a boss. \n\nAfter defeating the first boss and unlocking the Pickaxe, it took me [b]three full hours[/b] of brain-dead gathering, smelting, and chopping just to get the Bronze Bars required for the [b]Axe upgrade alone[/b]. Upgrading the rest of the basic gear would easily require another three hours of this repetitive, joyless cycle.\n\n[h3]III. UI and Combat Gripes[/h3]\n\n* [b]Cluttered Crafting Menu:[/b] The crafting interface is an unsorted list without a search or sort function. To make matters worse, it constantly resets after checking an item's requirements, forcing you to [b]hunt for the same item repeatedly[/b].\n* [b]Counter-Intuitive Combat:[/b] The dodge mechanic is poorly designed. It requires the player to be [b]blocking[/b] to execute a dodge roll, which defies the purpose of dodging as an alternative to blocking. Why spend stamina on an unnecessary block input when you could simply tank the hit or dodge directly?\n\n[h2]Conclusion[/h2]\n\nIf i had to compare this game with another one; It would be Terraria. Both are games with a focus on gathering resources and fight bosses to progress. But somehow, it doesn#t feel tedious to gather resources in Terraria. Why is that? Because there is barelyx any downtime. There is no \"sitting on a boat for 20min to fight a boss\". There is no \"walking back for 5min, after picking up 15 ores. The weight limit alone, makes the whole process unbelievable horrible. While increasing item drop rates might slightly ease the pain, because you have less downtime while gather the resources, it doesn't fix the fundamental problems of the downtime when getting from and to the base and other issues. Valheim's game design is [b]garbage on multiple levels[/b], prioritizing tedious resource gathering, traveling unecessary distances and obfuscated mechanics over meaningful survival or building gameplay. Unless you enjoy self-punishment, this is not a game to recommend.\n\nTo highlight how tedious the game really is: The current worldrecord speedrun for killing all bosses is over 13hrs long. 13 hours, for a speedrunner, for 7 bosses. SEVEN BOSSES, 13 HOURS! And none of that is exciting gameplay... most of the 13hrs are tedious tasks.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Game looks like it came out in 2010, and not in the fun nostalgic way. Patches are few and far between with changes that a modder and 100 hours could do. Has confusing systems for difficulty ramping. Building is cool for the first little bit of the game, but gets old fast when you realize its mostly cosmetic. Combat...exists (best thing I can say about it). \n\nFor a game that had such an amazing splash when it first showed up, its done little to build itself up after that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "another case of developers getting the bag and becoming incredibly lazy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game *could* be amazing, but its held back by a legion of small annoyances, and an entire biome.\r\n\r\nYou cant attack while in water, enemies can. \r\nYou suffer a movement debuff in water, enemies don't. \r\nMaterial requirements can be obnoxious (require resources from one biome, but require a workbench only craftable 2 biomes later). \r\nLevel Ground doesn't actually level the ground.\r\nGreydwarves have the aggro range of the whole freaking map. \r\nTaming takes 30 irl minutes, during which you have to stay close to them, but not so close they aggro onto you. If they aggro on you, they take several irl minutes to calm down, while attacking everything nearby, *including you*.\r\nYou have so little stamina that running for 10 seconds uses all of it, meaning you cant attack because attacking *also* uses stamina. \r\nSwimming is even worse because you take damage when you swim with no stamina remaining, but it eats your stamina faster than anything else in the game.\r\nand many, *MANY* more\r\n\r\n\r\nand, finally, the Mistlands, an entire biome permanently shrouded in fog so thick you cant see anything. The boss of the previous biome drops an item that can be crafted in a light that lets you see a whole 5ft around you. Meanwhile, the whole of the Mistlands is mountains with sharp drop-offs and is swarming with enemies that can fly, zoom in to your location, and then bap you off a cliff to your death. There is no way to see further than 5ft around you in the Mistlands beyond console commands (placing the special  torches doesnt count cuz they each give 3ft around them.)\r\n\r\nAll in all, it could be great, but its held back by some absolutely baffling design choices and needs a TON of QoL improvements before its worth playing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I tried to play this crap, but the graphics are too awful and i didn't saw anything unique in there. Honestly, i have no idea where the hype for this game was coming from.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stamina mechanic is so awful, takes a ton to do anything with the bow leaving you with nothing to escape with. Bow projectiles also come out of the top for some reason, causing half of my shots not to go where intended.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pressing the left mouse button for 10 minutes to mine copper to be able to craft a single weapon or armor piece is not my idea of fun. Pair that with a super small inventory and carry weight that hasn't changed in over 25 hours I've played, and you have the most tedious task of mining a tiny bit of ore and then running large distances back and forth to smelt it in a smelter that doesn't even show what it is currently smelting or its progress.\nIn my 25+ hours, the only semi interesting thing that exploration has lead to is the discovery of burial chambers that have all been basically the same and troll caves which are not interesting at all. \nThe only way I see myself continuing with this game is if I heavily mod it to fix it but I don't know if I'm going to do that when Enshrouded exists.\nIt's a bit shocking to me that this game has a very positive rating and it has to be that people were really bored during covid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible combat, very repetitive, food system is not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game with shit ton of awful design choices",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "meh, played it once with friends and never touched it again. Just not my cup of tea",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the devs have done everything in the world but release the finished game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game. However, it is broken to being unplayable. After some recent patch some of my friends stopped being able to connect to my dedicated server I host out of my house. Wasn't a firewall issue, because some could connect and other couldn't. Only by installing networking mods were we able to all connect again, but the game became unplayable. Constant desyncs, chests and doors not opening, player rubber banding, items disappearing. It was one of my worst experiences gaming. Server is running on a proxmox hypervisor with skylake era dual xeons. The VM has 8 cores, 16 gb of ram, and is on a PCIe 4 nvme SSD (on a NAS with 10Gbps networking) and a 2 Gbps up/down fiber connection out of the house. It's not my hardware, it's the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stamina runs out faster finnish people when theres free buckets",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely think Valheim as a game has alot of potential, and could grow into a great game.\r\n\r\nCurrently, it isn't. The combat is probably some of the worst I've ever played, and I've played some awful games. While I'd love to talk about how great the other mechanics are and recommend the game, the fact that to progress to those mechanics you have to suffer through fighting the various bosses is just too heavy a price to pay.\r\n\r\nIn terms of mechanical balancing for the game, I hope you like hammers. Don't bother wielding anything else, it's genuinely a waste of time. From torches being the first use of fire damage, to Frostner being mechanically a perfect counter to Bonemass, you're just going to be using hammers. The game also expects that you prepare every arena to be perfectly flat, so that your shield parries can register, and so that you can repeatedly perfect parry the boss for 10-20 minutes straight. \r\n\r\nOverall, to avoid just harping on the game, the gameplay HEAVILY favors a single specific set of weapons, and punishes you for using others. The combat is not fluid enough to handle the mass horde situations that it constantly puts you in, and overall it needs a massive overhaul before I'd be willing to say that the combat is anything other than tedious. Hopefully the devs reworks the stamina values on weapons, improve the hitboxes, and rework the bosses to allow for the massive number of pierce weapons to no longer be resisted by every boss and late game enemy.\r\n\r\nOh and an after thought as I'm writing this. Why the fuck can't I plant berry bushes or mushrooms? That's just overkill.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unplayable for me with the new updates. It disconnects and reconnects my mouse and keyboard on a loop. Could be a Unity Engine bug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is great until ashlands. the lag with friends (and thats how I play) makes the game unplayable.\n\nwhen they fix this i will happily change my review. i am very disappointed as a person who has put hundreds of hours into something that is (and if you read the reddit/steam forums) and has been a problem for years. \n\nmods aren't an answer as I play with xboxers and thus we cant mod",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is not a game. It's an exercise in frustration tolerance. I loathe every moment I play Valheim, and I only continue so the game does not beat me. Don't buy it. You'll regret it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As much as I want to both enjoy and recommend this game, I just can't. I've done multiple playthroughs of the entire content since it came out in early access, and it just seems like it hasn't grown in the right direction.\r\n\r\nThe Good\r\n- The atmosphere is truly amazing, whether you are boating on wavy waters or walking through a snowy mountain, it really is one of the best aspects of the game.\r\n- The building is also pretty good, as the modules fit together pretty well, and the structural support system forces you to build semi-realistic buildings.\r\n\r\nThe Bad\r\n- The grinding in this game is sometimes brutal. The amount of ores/materials you need for a single/multiple sets of gear is insane.\r\n- The difficulty is very inconsistent, and it seems like it's kinda just the way it was designed. You enter a new biome, and all the enemies are difficult to the point of un-enjoyable. Once you are finally able to hold your own, you beat the boss, then you move onto the next biome. Rinse and repeat.\r\n\r\nThe Ugly\r\n- I have done playthoughs both with teleporting ores and without teleporting ores. I cannot imagine being forced to not teleport ores/related items long term. It feels like while it was meant to push for ocean exploration/travel, it only created an needless, obnoxious, and frustratingly long grind.\r\n- The inventory management has slowly become a disaster over the updates. In games, there are two (main) ways of limiting inventory. Weight, or room. This game has done both. Your armor/weapons also take up the same inventory slots that any other item would take up. So by the end of the game, after you have ~5 pieces of armor, ~3 weapons, ~4 tools, and other food and needed materials like wood and stuff, you have about 9 actual slots for items to loot. Don't even get me started on trinkets.\r\n\r\nThis all combined, the best way I can put the gameplay loop is just \"frustrating\".",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game up until mistlands is a 9/10 experience.\nMistlands is a 7/10.\nAshlands is a 1-2/10.\nAshlands is genuinely the most miserable experience ive ever had the displeasure of playing in a crafting survival game and honestly brings the game down as a whole. i have to leave a bad review in the hopes it prevents some poor victim from experiencing ashlands.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "frequent crashes not being looked at by the devs seems like issue will persist forever many reddit posts and community players have struggled with this i have tried multiple solutions and keeps happening",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like it, but I just can't. Building is cool, farming is alright, the vibes are there, but Combat is so bad that it takes away from everything else. The enemies have too much health and fighting is a slog, rain comes from nowhere and nerfs your stamina regen.\r\n\r\n The best armor you can craft for an area barely keeps you alive for a couple of hits (2-3) and the \"balancing\" of your food between stamina and health seems like a nice twist, but even with the best in area food you are 3-4 hits from dying.\r\n\r\n Enemies spawn in 2's and 3's from about 30m away and make no noise on the approach meaning that partway through combat with a mob you will almost always get backstabbed for a majority of your health pool, by a new mob. \r\n\r\nThe devs keep updating it, but no more fun comes from those updates for me due to the sheer aggravation of most of the games core mechanincs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Found the game cool at first but the grind gets annoying later on and building is cool but actually not incredibly diverse. Combat is meh at best. Only fun with friends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "4 years, almost 0 progress, 5m in sales first few months? pretty much abandomware",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tedious time-waster walking sim wrapped in a perpetual 'Early Access' scam.  Avoid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'll put more effort into this review when the devs come back from vacation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, even better with friends!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "friends keep trying to get me to like it its just not my cup of tea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Early access since 2 Feb, 2021. That's close to 5 years now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nerf archers and starred enemies",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shit game never play, died to greydwarf.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is the most misery-inducing survival game i have ever played",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "building and terrain manipulation suck",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They'll never finish this game, Don't buy this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "what a shit fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"it's not a bug, it's a feature\" the devs say",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Combat is just plain bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game i ever played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuking mosquitos",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}