{
  "positive": [
    {
      "review": "More build complexity than Diablo, without requiring a PhD in the game like PoE1, or being designed for masochists like PoE 2.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i think i like it. the game is pretty freeform and lets you experiment and tweak a lot of decisions. i think the itemization is pretty average - you try and stack specific damage types and some of them just seem a lot more scalable. slightly frustrated, but slightly OK.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing Hack n' Slash, best I've played since Diablo 2 Remaster.\nPay no attention to the malcontents who enjoyed the game for two years, and then suddenly decided they don't like it anymore after its game studio was bought by Krafton.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[[ TLDR ]]\nIs it worth $35? Yes, absolutely. \n\nIs it worth your time? Yes, you can easily get hundreds of hours of enjoyment from this game due to immense customization of your character, skills, and subclasses.\n\nNothing negative has born fruit in LE from 1.0 to now despite what you might see in review bombs. Get it and enjoy it.\n\nI'm shocked I haven't given this game a review already! Probably because I've been having fun with it! I'm doing so now because of the review bombing that's going.\n\nThere are genuine concerns by the players such as EHG being bought by Krafton as Krafton is an 'AI-first' company which brings forth 'AI-slop' fears and bad reputation due to the Subnautica drama. That's said, it's a fear by players with both rational and irrational reasoning. Let's highlight something important here: The outcry by players is so loud because they're passionate about the game because, well, it's that damn good!\n\nSince launch until now and -- with regards to recent announcements of future paid classes -- nothing negative has changed with the game. Get it, play it, love it!\n\nIn my opinion, the game's asking price is $35 which is an asking price too low for the quality of content you get. The game's low asking price is offset by the game's MTX shop which include new skill VFXs, pets, and armors. Part of what fuels the player outcry is the Kickstarter promise to never charge for future content after the KS or a $35 asking price. Honestly, I was always suspect of that because it's a 'too good to be true' sort of promise. \n\n+Vast customization options\n+You level up skills individually by using them\n+Very customizable skill behaviors from changing elements, AOE vs single target vs DOT, and anything you can think of\n+Each class is fun to play\n+Each class's mastery (sub-class) plays dramatically differently \n+You can mix your class with various skills from different masteries\n+Good graphics\n+Good SFX\n+Good VFX\n+Good music\n+Interesting story\n+Diverse biomes (eras) you can time travel to\n+Loot filter\n+No mandatory vendor shilling like you see in D4\n+Very good crafting and the ability to customize your legendaries or other gear with affixes\n+Several mechanics to target farm legendaries or uniques, or crafting material to even craft them\n+End game monoliths and corruption similar to Rifts from D3\n+Keys to empower and target farm with specific dungeons in mind\n+Good music\n+Catchy main menu music that'll get stuck in your head lol\n+Very customizable movement controls\n+Includes WASD movement or classic click to move\n\n-Incomplete story that leaves you with a big cliffhanger. Like what?",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the better ARPG's i've played.\nBuilds are fun and can be adjusted to your own playstyle, also enough classes to go around and experiment.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Why play Last Epoch?\n• The game has a varied skill system: every skill can be used in different ways. Each class has dozens of these skills. Imagine variety. \n• If you do the math right, you can destroy enemies in the blink of an eye — especially noticeable during subsequent playthroughs. Very satisfying.\n\nWhat else is good?\n• Probably one of the best item-crafting systems. Easy to understand, easy to use, with very little grind required.\n• Five distinct classes with different spells.\n• Loot filter is awesome and can be used by casual gamers.\n• You can play \"hardcore\" without extreme risk - just challenge yourself for fun.\n• The design of locations across different eras is awesome!\n\nWhat’s bad?\n• The story isn’t finished in the released game. How is this acceptable for a released title?\n• After the story cuts, there’s endless monster-killing content, but I didn’t enjoy those generated areas much.\n• Dont see a lot of sense in online feature. Only slows down new areas loading.\n• Developers promised no paid gameplay features. They lied.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i know alot of ppl are review bombing this game due to the devs making Paid dlc and after they said they would not do that to this game. my own view on this after playing the game and reading the reason why they are doing this gave me this decision where i dont like paid dlc the company which is a small dev team in comparison to other ARPG devs need to make a living pay bills, eat and live like us humans do. making a game cost money after all and then keeping the game running for us also cost money. the devs have said currently they are not making any money on the cosmetics so the decision to make paid dlc is justified if ppl want to keep this game going so please cut the devs a little slack here and enjoy the game and support the devs this game is way better than diablo still afterall",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is fun if you would rather play a game instead of spend 10 hours staring at spreadsheets while everyone around you screams \"ThE GaMe DoEsNt StArT UntiL EndGaMe.\" Also it has an OFFLINE mode which some people don't like because they were dropped on their head as a baby too many times",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent ARPG. A real shame they've sold themselves to Krafton. Like many reviews here have stated, this will tank the IP. \n\nIt's worth playing, but don't get too attached. Corporate greed will ruin any chance it has of really thriving unfortunately.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Decent game for a bit of fun, if you can deal with some bugs and jank. Good alternative to a D3 and in the same milieu of playstyle, but with lots of different classes/skills to try out. Campaign is pretty mid and endgame is a bit grindy, but fun to run through for the different class options/styles, especially if you like crafting or a bit more of a relaxed solo/self-found play. Looks like it is getting review bombed a bit because of Krafton buyout and possible future p2w classes (of which we know nothing about), but the game is decent now and even if in the future becomes p2w or unsupported, it still doesn't affect solo play/experience, so who cares.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Each season keeps making the game better. Trying out a different build each season keeps it interesting. The end game still needs work, more variety, but the journey to end game is still fun.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I have played this game for quite awhile now and put in a lot of hours.  It definitely gave me what I was lacking from Diablo 4 and I hope it continues to remain the passion project it started out as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great hack-n-slash aRPG. My previous favorite was Grim Dawn, but since I've discovered Last Epoch, it quickly rose to the top of my \"most-played games\" list. New free content is released every season and hero classes are reworked from time to time, but I wish they would add a new class (or two) at some point in future. \nUPDATE: It seems they will add new classes after all, otherwise why would they announce Paradox Classes coming with Season 4 as a paid DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better ARPGs I've played in awhile, I've been juggling this on and off with POE2.\n\nDefinitely recommend this one.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Last Epoch is the ARPG that feels like it was made by someone who loves Diablo II, hates PoE, yet secretly plays both at 3 a.m. It gives you a bunch of deep systems but with this friendly vibe of “don’t worry, you don’t need a spreadsheet to play” — the kind of reassuring promise whispered by a game that clearly knows you’ve spent years tormenting yourself with passive trees, breakpoints, loot filters, and questionable build decisions at ungodly hours. It wraps its complexity in a warm, nostalgic glow, like an old-school ARPG trying to act casual while absolutely knowing it’s about to consume your entire weekend.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "[b]Pro's:[/b]\n[LIST][*] Trade or Solo Factions - there's the Merchant's Guild that provides an auction house for players to trade items with others or the Circle of Fortune that doesn't allow for trade but boosts items drops substantially to compensate, allowing players to play how they want\n[*] Class Identity - every mastery class does play differently, once you've unlocked their full set of skills\n[*] Skill System - each skill has a robust skill tree of ~30 nodes that generically or substantially change it\n[*] Crafting - generally easy to understand but has some advanced options available that allow you to create very powerful items somewhat easily\n[*] Endgame - while not varied to the levels of PoE, what is available in the Monolith of Fate is fun to do for many hours (more for some and less for others) with factions to progress that improve items drops and alter the content you engage with\n[*] Progression - character power has noticeable growth during the first ~75 levels, but slows as you progress closer to level 100, making building many characters a fun overall experience\n[*] Loot Filter - very easy to understand and robust loot filter that is built into the game\n[*] WASD, Controller, and Kb&M Support - I play with controller and it's been fairly good and continues to get better\n[*] Full Offline Mode - if you don't want to connect to the internet then there's a launch option that provides this, but just know that offline saves are stored on your computer and can't be used online while online saves are stored on EHG servers and can't be used offline\n[*] Easy to Learn - built in Game Guide that explains nearly every aspect of the game\n[*] QoL Features - items drop identified, 200 unlockable stash tabs, materials have their own storage and drop in bunches that are picked up with a single click, etc.[/LIST]\n\n[b]Mid:[/b]\n[LIST][*] The Campaign - it's very on rails with little exploration throughout, lacking significant challenges until the endgame\n[*] Animations - they're okay, and they've said they're working on improving them so hopefully they get better\n[*] Sound - can vary from good to bad, depending on the skill, area, etc. \n[*] Combat Feel - definitely not to the standards of Diablo or PoE2, but passable for most\n[*] Arena & Dungeons - these endgame activites are not fleshed out or varied enough to entertain one for very long\n[*] Itemization - if the endgame didn't generally devolve into Legendary items in every slot I'd list itemization in the pro's as there's technically a lot of options at your disposal, just none that are as good as Legendaries in most situations[/LIST]\n\n[b]Con's:[/b]\n[LIST][*] Incomplete Story - 10 of 12 story chapters are currently in-game\n[*] Incomplete Skills - not all base/mastery classes have their full set of skills (Rogue, Bladedancer, Paladin, and Shaman), though this list does typically shrink with each season\n[*] Missing 3D Item Art - some equippable items, generally Unique rarity body armours, helmets, boots and gloves, don't have 3D art to match their 2D art, which impacts the power fantasy of equipping cool looking items only to find they don't match\n[*] Paradox Classes - future paid DLC, the first likely arriving in Q4 2026, that was recently announced...so not all future content will be free[/LIST]",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "good graphics good content nice story",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "⭐ Total Score: 73/100 → 7.3 / 10 (Modest Recommendation)\n・ It's worth playing for ARPG fans if the change of the parent company doesn't put them off.\n・ Despite some questionable decisions from the devs, the game can be enjoyed casually.\n\n🕹️ Core Mechanics & Design: 8/10\n+ Build variety is strong and diverse.\n+ Progress through skill and ability trees feels satisfying.\n+ Skills are highly responsive and lack a \"floaty\" feeling.\n+ Loot filtering system is extensive and highly functional.\n\n- Picking up items and gold can be a pain in the ass. Devs argue pets picking up stuff would be a p2w advantage, but it's a silly argument since they could allow players to acquire a free pet through a quest in the early game and then make in-store pets look visually cooler ... this is a seriously lame decision from the devs considering that pets exist in the game but are functionally useless.\n- Itemization system is oddly designed.\n- Many Unique items are trash like in D3 and only a select few are worth equipping for their unique effects. Unlike other rarities, you can't upgrade or reroll affixes on Uniques, so you might get a Unique with the effect you want, but the affixes could be garbage.\n- Unique items cannot be salvaged for materials.\n- Salvaging non-Unique items is unnecessarily expensive.\n- Upgrading non-Uniques is a pain in the ass and you'll often run out of forging potential (each attempt to upgrade can potentially decay an item's forging potential down to zero).\n- Affix ranges are extremely wide (e.g., 20 to 150), adding further to an already RNG heavy experience.\n\n🔄 Gameplay Loop, Replayability & Longevity: 9/10\n+ The endgame grind is well-designed with additional factions and progression systems.\n+ Points earned can be invested to effectively improve the hunt for items and gold.\n+ Players can grind in a wide variety of endgame content (echoes/Rifts, arenas, MP dungeons etc.).\n+ Developers are actively updating the game with each new Season.\n\n🖼️ Graphics and art style: 9/10\n+ Graphics are excellent, especially for an indie ARPG title.\n+ The visual style matches the game.\n\n🎧 Sound & Music: 8/10\n+ Audio quality is good enough for an indie ARPG.\n+ The character loading screen music is memorable.\n\n📖 Story: 5/10\n- The story is incomplete, bland, and often cringy.\n- The narrative serves only to add flavor to the gameplay focus.\n\n🌍 Setting & Lore: 7/10\n+ The concept of different timelines, eras, and regions is implemented decently.\n- The depth is barebones, existing primarily to provide basic flavor, similar to the story.\n\n🎭 Characters & Dialogue: 4/10\n- Characters are uninteresting and often cringy.\n- Dialogue is lame and uninspired.\n- Voice acting is highly inconsistent (\"hit or miss,\" potentially AI-generated).\n\n💯 Accessibility & Quality of Life (QoL): 10/10\n+ The game is easy to pick up for ARPG players compared to games like PoE.\n+ Keybind flexibility is good, with the option for WASD vs mouse and keyboard movement.\n+ The stash can be expanded considerably, and inventory management is easy.\n\n📢 Developer Communication & Future Outlook: 5/10\n- Major updates typically take 6+ months since they're limited to the release of a new Season.\n- The change in the parent company is a significant negative factor for the game's future outlook.\n\n⚙️ Performance, Optimization & Bugs: 8/10\n+ No major performance issues encountered on an upper mid-tier PC rig.\n+ Some bugs are present, but nothing encountered so far has been game-breaking.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "More accessible than PoE2, but still with a very engaging level of complexity and options.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Don't let reviews scare you away, this game is the goat, it got review bombed for the parent company of eleventh hour, not for the game itself",
      "voted_up": true,
      "votes_helpful": 66
    },
    {
      "review": "if you want a game to have fun, a developer who listens to their players, to play without even worrying about your build. then here's the game for you. every penny you'll spend on this game is worth it. PLAY, SUPPORT, and then PLAY again!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great middle ground as far as ARPGs go. Not too slow, but not too fast. \n\nIf you want a casual game where you can just blast and turn off your brain like D4, this game is for you. Good endgame content and climbing corruption to test the usefulness of a build is a really fun thing to do. \n\nNice and complex building. All skills have skill trees which can make builds really fun.\n\nAll of the negative reviews come from people who are surprised that Krafton did what they always do. None of what they are doing will impact the way that the game plays. The game is really fun and the dev team behind it loves the game and are active in global chat often.\n\nIf you want a really fun ARPG that doesn't take a century to finish like POE2 & Grim Dawn, I highly recommend LE\nIf you want an ARPG where you can blast and turn off your brain with really well crafted builds, play LE.\n\nMost of the negative reviews right now come from empty headed goobers that think the model LE has had for a while was sustainable while they were actively bleeding money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!  This blends the best of POE2 and D4 in my opinion, and you don't need a doctorate to devise your build - what a steal for $34 bucks",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "An ARPG that is fun, challenging and full of character at half the price of Diablo. Who would of thought? If you want a good middle ground and find POE a bit to complex and Diablo a bit too shallow, Last Epoch fits in perfectly. You can spends dozens, or even hundreds of hours grinding and leveling in this beautiful game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "great graphics, great gameplay, a lot of build diversity",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun gameplay so far.  If you're looking for a diablo alternative you might enjoy this.  You can customize skills in a lot more ways than Diablo.  More complex but not too complex, also the game runs really well and looks great in 2025",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A great game! More complex then Diablo 3 but without having a PHD in Path of exile.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Game is awesome ! but also to be perfect would really need Lan on pc . Make offline mode possible to play Lan , that would make all the difference !",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game has great build diversity, reaches a middle ground between complexity and simplicity. Totally get chrono trigger vibes from playing it. Wholeheartedly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game which I have hundreds of hours in.  For me, I don't mind if they monetize by selling some new content.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "its still a really fun game despite whats been going on. personally id still rather play this then PoE2 (im just... not the biggest fan of PoE2 pesonally)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really shows its worth almost immediately, For the scattered and casual team that this crew started with. Last Epoch usually bleeds polish.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Not very far into this game yet but so far its beautiful, engaging and runs well on the Steam Deck. i plan on sinking many hours into this as i relax after work and kids are tucked in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Last Epoch is so far a good ARPG! It offers interesting mechanics and ideas while pairing them with a neat feeling combat. Its endgame is improving :). It's a simpler PoE2 with other ideas and classes instead of skill gems. \n\nLE cannot fully compete with a giant such as PoE2 that just has a higher production quality: PoE2 has better graphics, higher quality animations, sounds and so on. Nonetheless, LE has some systems that work splendidly. Its crafting is top notch. A few ideas of their endgame mechanic would suit PoE2 really well.. And their passive skill trees are cool!\n\nThe game is a lot of fun and sold at a very fair price!\n\n**A few bad things:**\nThe campaign is still not complete, even if it is not in EA anymore. \n\nContent drops in poorly communicated intervals. \n\nThe recent communications woes are worrying as well. First, EHG played a mystery around whether the expac will be paid or not paid.Now, we know that there will be a dlc class without having clear communication how much it will cost. (Ignoring the fact that they promised not selling content.) \n\nThe microtransaction strategy of EHG so far was fair but their mtx content is largely not compelling. They should cut off a few slices of PoE1 and PoE2 who sell really cool mtx next to their stash tabs. \n\nAs a result from the monetization problems, the takeover through Krafton is worrying. It's hard to say where this game will be going. In its current state, it's very well worth the 33.99€ (or your regional equivalent).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Идеальный баланс лаконичности и комплексности; без тяжелого перегруза игровых элементов, древ умений и т.п.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is getting a lot of hate recently due to the announcement of a paid new class. In my opinion this is an infinitely better option than having the new expansion be paid. Take Diablo 4 as an example, the base game was only okay and now years later people seems to like the game more. For me to even try the game in its current state I would need to buy the new expansion, which I don't want to do if I may not enjoy the game still. I understand the devs had originally said there would be no future paid content but the game and the company have changed a lot since then.\n\nThe other complaint I see is that the devs were bought by Krafton, a known scummy mobile game company who recently announced their focus on using AI tools for development. However, EHG have said multiple times that their development cycle was not affected. I don't understand why people are review bombing the game before anything bad has even happened. If the quality of the game moving forward declines, then negative reviews are warranted.\n\nLast epoch is not a perfect game by any means but I have enjoyed it greatly. It has enough complexity to keep me engaged but not get lost (like with poe). I'm excited for what the future will hold for game and wish EHG the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great ARPG, up there as one of my favorites, especially for its ease of doing SSF without needing to know extremely niche crafting methods or spending thousands of rare currency. It's also quite nice to be able to do a full respec of my class and even chosen mastery now, with very little cost, so you can do it a lot.\n\nBuild variance is also great with being able to heavily modify every skill in the game with their own trees, allowing for some weird combos that still work to push into endgame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most dedicated players in this game probably. AMAZING game. Ignore all the review bombing ragers who want to play a 35 dollar live service game for eternity with not ever spending another dollar. This isnt POE you dont have to buy new stash tabs all the time, theyre all free in LE. will probably spend 15-20 dollars a year on xpac and 10 dollars? on 1 or 2 new classes (if you want) a year. Will gladly pay that for a game that is better than all other ARPGs imo. Sorry EHG have to deal with such a toxic fanbase.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is a great game. Currently at 2600+ hours played. I'm well aware of the recent news regarding seasons 4,5 and the expansion but I still love the game and will continue playing.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Has more depth than Diablo 4 by ten fold, but easier to grasp for a newer player to the genre than Path of Exile. It will only get better by the year with every new league release.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game is a nice middle ground between Diablo and POE. Solid amount of build variation and plenty to do in the end game. Looking forward to what is to come in the future. I don't mind one bit about paying for future expansions or new classes as long as the game continues to progress and is enjoyable.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yes this game studio was bought by Krafton, maybe it is a bad thing.\nYes they also are going to sell a EXPERIMENTAL class system as a paid dlc.\nYes they also promise that they wont be selling any non-cosmetic dlc for the game, when they were just like 7 devs.\nBUT i need to say that most of these reviews are miss information. They are talking about not making enough money for some time now, and in a recent interview the CEO told the Following:\n\"We had 4 choices:\n1- Let the company die in some months\n2- Wait and see if for some miracle we can receive enough money to allow us to keep the game going\n3- Sell the company to another company that said that they will want to dismantle EHG and control everything about Last Epoch\n4- Sell the company to Krafton that promise give then time to become profitable\"\n\nThey went with the 4th choice, which make you think about it, Krafton ISN'T trying to milk then, like some people are saying, because if this is the case why the f they would give EHG more money to create the expansion?\nThey ARE breaking their promise because is the caso of breaking it or killing the studio and the game\nThey are releasing classes in a paid dlc BECAUSE it is a desperate state\nThey also are know for making the classes very well balanced, there is always a Meta but you can make almost ANY build/character viable with the current balancing of the game, and i doubt they will be making the new content op to sell more, since even with launches of reworks and new skills we didn't see the new things in the meta, if you want a example see \"Heartseeker\" a new bow skill that was used by everyone because it is incredible fun, but it NEVER reach Meta level.\n\nSaying that i need to suggest you to give it a try, see for your self the game, it isn't perfect but it is fun, mainly if you like to create your own build, since this game, differ from other of the same style, don't need a degree to understand and don't have the necessity to follow builds.\nI have in this moment 781 hours of gameplay, i have only be playing since 1.0, and i will be coming back of more in the next year with the new season.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is excellent - The \"recent reviews\" starting November 25, 2025 being negative is around a very small minority (count the recent negative reviews vs the overall... it's ~500 at the time of this writing... <0.5%). The extremely small (but loud) minority of people angrily writing their negative review are only complaining that they'll have to pay some nominal fee for expansion classes. \n\nThe expansion itself, mind you, is completely free. Imagine crying about having a huge free content release because they didn't get MORE free content. These people who are effectively saying the game is bad (because that's what a negative review equates to) have hundreds of hours playtime and have previously reviewed the GAME (i.e., not the non-gameplay-related announcement they're crying about) as being excellent. These people think the game is excellent and that's part of why they're upset... they can't afford the $10 to play content additional to the already massive free content release in the excellent game they love. I for one, am glad that the lying/misleading riff raff are taking themselves out of the community if their threats to walk all 0.5% of themselves out the door are genuine. Thank you for cleaning up our community!\n\nGive it a few weeks and these off-topic (i.e., not related to quality of the game), non-gameplay reviews will be excluded from the overall reviews as all periods of off-topic reviews always are. This game is 100% worth the money, do not be mislead by the negative review crybabies.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is a great game made by people who love and understand the genre. It is well worth the purchase price. At present (Late 2025) the game is being review bombed because the team once said that they would never charge more than the base price of the game, but reality has stepped in and they had to go back on that regarding charging for future content. The game is great and everyone who is review bombing also thinks the game is great, they are just angry about the reversal on sales model. That's it. \n\nSo is the game worth it? Yes. Absolutely yes. Don't let some angry review bombers stop you from enjoying this gem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I thought I liked PoE, until I tried this game! This is such a fun, graphically and mechanically beautiful game as compared to PoE and others like it. It doesn't require you to give up your life in order to enjoy it and progress through the game. Also, while seeing the new content in Beneath Ancient Skies I couldn't help but be amazed by the visuals and interactions in the game. I'd 100% recommend to anyone having a busier life, wanting to destress and enjoy an action RPG!",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Great game that is fun and deserves support.\nI didn't play super long but I enjoyed it greatly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best ARPG crafting system in recent years. Also, it has a playable Paladin class which, believe it or not, is a class some big titles in the genre just can't manage to implement.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome. Its a great middle ground between Diablo 2 and Path of Exile. Complex enough to keep it interesting but also not overly bloated. The gameplay feels great and all the characters have alot of variety. All abilities feel good to press. I enjoy the crafting system for letting me really fine tune the item I want for my build. Graphically everything looks great and the systems are fun. Basically nothing but good things to say about this game after 350+ hours.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "On a scale of simple to complex (Diablo to Path of Exile, if you will)  this game is a good middle ground.\n\nCrafting system is very nice, and the game has an offline mode.\n\nWorth a shot if you enjoy ARPGs.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A good game, has the best stash implemented in ARPG. The best game mode depends on how you want to play Trade or SSF. The best implementation of the loot filter.  And yes I will buy the expansion because in ALL games I bought something besides the base game. I recommend this game!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is fun, you have so many build options when it comes to gear, skills, and the type of elements the skills can use. The game is very reasonable to play with when it comes to your own theory crafting and testing out different non-meta builds. It doesn't punish you for trying to think outside of the box and away from the online meta, though some of the bigger enemy or boss fights might be a struggle, but that's why they have the party option. You feel rewarded for your time playing with the gear drop rate even id you don't use most of the gear that drops right away. You can still sell or salvage it and use its affix to forge onto a better piece of equipment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just adding my opinion to the sea of negativity and people jumping to conclusions like they usually do. \n\nLast Epoch is a really good ARPG and is moving in the right direction in my opinion. Yes, their publisher sucks, BUT, so far, at least, I don't really see this affecting Last Epoch in a major way. Yes, we're getting paid content, BUT the upcoming expansion is FREE. You only have to buy the class alongside it. This is a big nothing burger IMO. People love to abuse the review system of Steam to voice their political, anti AI, and other BS messages that has absolutely nothing to do with the game at hand. \n\nLast Epoch itself isn't the best ARPG out there, but it's still a really good time and you can easily kill a few hundred horus in it if you come back every season. It has good gameplay, great classes, and a fun end game too. If you're a fan of the genre I highly recommend it because there's enough here for you to enjoy without ever having to spend a cent on the upcoming class.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I dont know why this game has gotten some bad comments recently, i think its a great game, definitly one of the best hack and slashes available now. I really enjoyed playing multiple characters in this game, I dont know about the bad sides of the game but on the good side I can say its great that the game doesnt have a character limit unlike most mmorpgs, which makes you able to try every class after launching the game, i really like the fact thats its not a pay to win game like for example diablo where you have to pay to unlock some basic stuff and you can easily beat other players if you spent enough money on the game. Some of the best parts here are that you can enjoy playing it without stress online or offline and you dont need to repeat certains quests with every character you can just go and explore and grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of people throwing fits over paid DLC but people who bought the game already will be getting it for free , the class will still need to be paid for.  I can't wait to see what the class is or is like to play. I restarted  playing today as a Mage and have had a blast. I only have about 19 hours in and plan on playing more. This game is a really good ARPG so far and with good graphics and plenty of content to experience from what I see online. People need to understand to add content to the game and keep going they need revenue. Review Bombing when they have kept their promise for years is childish behavior and a insult to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just to make the negative nancys even more mad as a new player I'm going to buy this game just to get them to mald more. \n\nPeople who're thinking on buying this game and trying it out DO NOT listen to the negative nancies. These people are only negative due to KRAFTON. They don't MENTION NOTHING about any of the other games where you buy classes as well, they're only negative about EHG's Last Epoch because Judd sold to Krafton just to get the FUNDS to continue bringing out content. \n\nPlay the game and just see what happens better to pay the 38.50$ now instead of waiting to pay more once the expansion comes out they'll most likely increase the price to 45$.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Your game really fun looking forward what is to come. Life is not free there got make there money to keep putting together this great game such is life roll with it this negatively is crazy. Keep the good work up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Two more free seasons before a paid DLC is reasonable. I've had a lot of fun with this game and will continue for a long time still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Y'all review bombing a great game with passionate devs because they made a hard choice to save their game but had to break some promises. EHG has earned enough good will to keep my trust.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Do not listen to those review bombing I'd***s. The game is fine and it's getting better and better each season, offers one of the best implementations of in game features and qniue content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There is a lot to learn.  If I hadn't watched a beginner guide before I started i would have had a bad start.  as it stands now, i had to create a new character because i chose a Mastery I didn't want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not better the POE but its Fun AF and better than D4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow its now one of the top 2 games in arpg genre that you can actually play offline.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great combat and loot system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent arpg wiht constant QOL changes and updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a work in progress, needs some fine-tuning, but if you like ARPG's, give this one a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like diablo or diablo styled games like P.O.E you'll love this game. this game makes diablo look lazy in comparison, classes are super in depth and alot of different ways to make your build and can build what you want instead of following a meta. just check it out its starts off a little slow but the skills become more flashy and you realize the amount of detail put into this game when you hit the 50% mark.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun ARPG.  Good class design and each spec feels unique.  Campaign is well fun and engaging albeit a bit on the easy side once you know what you are doing.  End game is somewhat lackluster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Last Epoch is a fun game that will give you hundreds of hours of enjoyment. Maybe even thousands of hours if you're into that. \n\nThere's plenty of build variety, item variety, and crafting opportunities that give the player many choices in how they want to play the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than PoE2 at the moment, everyone in Gchat was spamming that a month ago but now Gchat is mad cause of Ai and paid classes but the game itself hasn't changed since. The game is generally player focused, devs give the players what they want and avoids painful systems. Relatively easy to get into, fun but complex enough (not enough content for full-time gaymers but almost no game does).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPG's out right now. Very well made and killer graphics. Yes there's still some bugs. Yes the campaign isn't finished yet. Yeah they got bought out. Yeah we are going to have to pay for DLC content. I'll Gladly pay for the DLC for this game. I've had a ton of fun with this game and will continue to support it. Everyone bitching because they have to buy a DLC coming out because they said they wouldn't charge anything. This was before they were bought. Now that decision is out of their hands. Stop Giving bad reviews for this game just because of that. This is a fantastic game and everyone needs to give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, ive got more than my monies worth out of this game and all the bad reviews by a lot of entitled bitches decided to downvote because they need to have a good cry and get their nerd rage out XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore these ridiculous haters. Last Epoch is a great game, already well worth the price in terms of $/hr. Games aren't cheap to make - if you want great games you need to pay for them, otherwise the studio goes under and you don't get any more game. If you're an ARPG fan Last Epoch is an innovative take on the genre, well worth your time and money with or without any DLC and you shouldn't concern yourself with the opinion of whiny entitled reddit trolls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great ARPG which has a great potential, but for me it lacks immersive feeling like Diablo 4 game has. Endgame doesn't feel rewarding, but rather a chore",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "have played the base game for many hours and it is very worth the price even in offline mode. am going to buy the dlc character because i understand games need money to run and am excited to support having bought many of the support packages trying to support the game i love already. the base game is around 500 hours of play just completing main characters through campain and reaching the main boss monlolith. Even with the other prices I feel the base game is more than worth 35 dollars and is a great buy to add to an arpg collection. offers a crafting system that is simpler and more addaptavie like no other.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game but I kinda miss achievements/collections or some sort of long term motivation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game finished it once with nec build was pretty fun! Not usually my type of game ao it says a lot!\n\nWould recommend buying for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of fun for someone who really doesn't have the opportunity to play these kinds of games, and as someone who comes from diablo 3 it is a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the 11hr team really spend their effort on building the game for the better . A year ago when the game just release there was a lot of memories leaks in the game , that they actully spend their time on fixing it . The texture of the game , and envirnment in the game they did a lot of improvement over time . Since the day the game was released. The team is putting the money they made back to their game , which is a game worthy to put money in to support the 11hr team .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, and expecting a game like this to not have paid content was always a losing bet.\n\nI'll take paid classes over paid expansions any day of the week.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Last Epoch is an enjoyable ARPG with an intuitive crafting system and fast, responsive combat. It’s easy to dive into, yet offers enough depth to keep you hooked with different builds and progression options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game. It's always getting updates and isn't sweaty af. You can play at the speed you want and still get a great build out of it. You don't need to dedicate your life to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an ARPG and you can brick your equipment if not careful via the forge, This is a game where you can sink hours into theory crafting and get to Monoliths before changing entirely. 187 hours in and I look forward to each season!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, but now that it's under Krafton, you should be wary of what it could become in the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a good in between with diablo and Poe. Fit me the best and put the most time of the three in this game. Currant model is not working for the company and i think they deserve the benefit of the doubt. Keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tons of different builds for any type of play style and tons of content for hours of gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the skill build of the game, it is how it should be, you create your build and then you improve your gear based on it and not the Vice Versa like diablo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing ARPG, brings complexity and costumization but doesn't turn the game into an excel spreadsheet (POE) and has amazing combat and sound engenieering like Diablo, best of both worlds if you are not making this game your full time job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 100 hours playing online I thought the Base game is great, end game isn't fun or rewarding, overuse of RNG.\nPlayed it due to lack of a better option in 2025 not because it is what I wanted.\n\n After it was gifted to me and i played 100+ hours I found out the company sold out and became \"AI First\" I can't support that without more information.\n\nLeveling ,gearing up and Trying out different builds is the best part of this game. That ends at about level 55-60 then it becomes a slow Grind with very few rewards and a lot of RNG disappointment to 100.\n\nDiablo II ,Torchlite and Grim Dawn, Marvel Heroe Omega on the (Tahiti) private server were all more enjoyable with less DEI.\n The price was right but bad decisions killed it.\nIt is worth $35 of gametime, but I still can't recommend it.\n I  changed my mind after i figured out how to play offline and edit save files, it makes the game vastly more enjoyable than the needlessly slow grind online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is everything i wanted out of an ARPG, around 25 hours to complete the campaign (so far) completely solo, and I am hoping they continue releasing updates and complete the story. \n\nCons: Game does have some lag/stability issues here and there even in offline mode. Played on steam deck and on my PC. Game is also currently unfinished as far as the story goes.\n\nPros: Combat is great, standard ARPG stuff, kill mass hordes and occasional boss or elite mobs, get loot, get stronger. The big plus i find is in the loot filter system, crafting systems, and the skill trees. \n - Crafting in this is done where you can add and upgrade affixes on certain items, by using shards that you can get via random drops, or by deconstructing loot you find. \n - Loot filter lets you see only loot you may want for your build or for deconstructing. No more seeing 50 items on screen and having to filter through to maybe find one that is good for you.\n - skill trees let you specialize in up to 5 of any of your classes learned skills. Each skill has its own tree you can customize, and each class has a level up tree as well to raise character specific passives, and as you sink points into each of the mastery sub-classes you also unlock related class specific skills. \n\nOverall there is a great deal of character customization available in the game for your playstyle, but i am waiting to see the story fully fleshed out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game and developers! Keep up the good work despite all the bad reviews.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games so good , top notch combat ,campaign was good and long. end game is unique and fun.gear is awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LIke POE and Diablo had a baby, crazy build flexibility, neat setting, looks and plays great. Well worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Last Epoch does an excellent job providing a unique ARPG experience with, maybe hundreds, of skill combinations. \r\n\r\nThe game really allows creativity for different builds and the progression feels rewarding and not overly grindy.\r\n\r\nI really hope they keep updating the game and we get some endgame variety at long last.\r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and addictive gameplay. Best crafting system in a ARPG in my opinion. In depth endgame with target farming. \nIf you find POE too complicated and Diablo too basic. Last Epoch is the perfect middle ground. \nAmazing Controller support with dynamic switch to KBM on the fly  (I like to use Controller for combat and KBM for inventory management).\nSupport for Super Ultra Wide Resolution. (5120x1440)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A delight to come back to each season. I'm really looking forward to a meaty end game patch. Could easily take this game game from an 8/10 to a 10/10. We'll see!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More complex than D4, kind of fun, lots of options, not that complex as poe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You click and watch numbers explode on the screen; what more could you ask for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NICE GAME, fun, not too serious, only problem is lack of linear históry that make it a tad confuse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOW DARE THEY NOT UPDATE A GAME FOR FREE FOREVER THAT I PAID 12 DOLLARS FOR!!!!!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Game peopl;e need to stop complaining so much.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Since at least 2018, the developers of this game have claimed there will never be paid content added to the game, that once you purchase the base game, all updates are free forever.\n\nToday, they have broken that promise and are now going to introduce paid DLC classes. This is while many spells and passive points with existing classes are bugged and do not function properly, or at all.\n\nAvoid buying this game and go play Path of Exile instead.",
      "voted_up": false,
      "votes_helpful": 814
    },
    {
      "review": "A year ago i would have wholeheartedly recommended this game. It was one of the best ARPG's I've ever played and ive found it endlessly entertaining. However, the game has just been bought by Krafton who is disgustingly proud of being an \"AI first\" company. I cannot support such a move. I have stopped playing the game and will not recommend anyone buy or play it. The game is sure to take a nosedive in quality with this new ownership and i refuse to watch it happen. You should do the same",
      "voted_up": false,
      "votes_helpful": 400
    },
    {
      "review": "This game is great. However due to recent business decisions and practices I can not recommend this game. Go play Path of Exile instead.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "> Zero Pay-To-Win\nLast Epoch will never offer gameplay advantages by being able to spend real money. We believe in creating a fair environment for all players.\n\n> Also Adds paid DLC classes",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "-Be Krafton\n\n-Buys game's studio\n\n-Sees its main competitor, that's winning by a quite a margin, doesn't charge for anything gameplay-related in their game\n\n-\"Lets charge players for the new class lolololololol\"",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Paid classes is a pretty bad joke. Bought the game and even spent some more to support, really shitty way to treat your customers.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I hate to leave this review but after all the crap going on lately I cannot in good faith recommend this game. Paid dlc classes after being told since the early days that that would not happen, on top of the Krafton BS, I just can't support this anymore.\n\nIf the devs are going to lie about promises made then why should anyone believe anything said or promised.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Last epoch sold out to Krafton, a company notorious for ruining things they touch (I think subnautica 2 and KSP 2?). Now the game has done a 180 on pay model and charging money for a class DLC? Absolutely disaster and I wish i could get a refund.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Will be introducing paid classes and expansions to an unfinished and already pay to play game. Just go play path of exile 1 or 2 instead.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "For years, the developers promised all updates would always be free. Now they’re adding paid DLC classes.\n\nGo play Path of Exile instead; the game and its updates are free, or play Path of Exile 2, which requires buying early access but will be free afterward.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "It had the perfect crafting system. The exact right amount of build depth to simplicity ratio. Many fun unique items that enabled interesting builds. I had the most enjoyment out of this among all the modern Diablo clones since Titan Quest/Grim Dawn. Unfortunately, it seems that their decision to sell out turned the game itself into a predatory cash cow as well. It is nothing short of an insult to all the players that supported this product to get it to where it was financially. I DID NOT tolerate this nonsense of selling classes when Blizzard did it with Diablo 3. And I will not tolerate it here either, I don't care how small your studio is in comparison. Free to play mobile game monetization model has no place in a buy to play game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It's over guys, another ARPG with great potential down the drain. Planned DLC where you pay to get access to new classes. I played before 1.0 and had some fun up until last season. I won't be supporting this game anymore.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Great Diablo-like game! \n\nSadly Eleventh Hour Games is now owned by Krafton who are massive tools pushing for AI and screwing over their dev studios, so until Last Epoch splits from Krafton this is a strict DO NOT BUY.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The creators of this game betrayed their player base and sold out to Krafton, one of the scummiest publishers around. There is no positive future for for the game now. \n\nIf you want to keep your integrity intact, do not purchase this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "They added paid classes after promising only cosmetics. They lied to the community. \n\nPlay Path of exile instead.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The devs promised to never add paid dlc aside from cosmetics. Now they are adding paid dlc classes. It will also be unlikely that offline players can access the paid classes. \n\nThis game was meant to be a ARPG made by fans of the genre, for fans of the genre. They have become the very thing they hate by lying and pursuing greed.\n\nPlay Grim Dawn or Path of Exile instead.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Before getting to the review, please consider reading this segment taken from the game's Kickstarter page:\n\n\"The only form of real money microtransactions Last Epoch will ever have are cosmetic, our currency for such is even named Cosmetic Points (CP) to emphasize this point. We will continually add in new exciting armor skins, skill effects, companion pets, and whatever else we dream up that can make your character visually more awesome and unique. No experience speed items, stat boost items, character boosts, or any other source of player power will be purchasable with real money. We do not believe in pay-to-win models.\"\n\nI had a fun time playing the game within the time I had with it and within the expectations set by the promises of a non p2w model. It is saddening to see the devs backtrack from that model within two years of the game's release. At the moment, the only negative is in the future release of a paid to play class, with the potential to release more. Although do remember that the slope from good game to a sludge of p2w mess is a very slippery one.\n\nIf you do not intend to touch the game store at the moment, you can still have a great time.\n\nThat said, I cannot trust that my statement will remain accurate for very long, as the in-game store now has the potential to intrude in the quality of the player experience to the point where the game would become worth disregarding.\n\nI do thank you for reading or even hovering over this review. Have a wonderful day.\n\n\nPS: Upon further investigation, I had just found out the following:\n\n-A few months ago, the devs made another statement declaring that the game would have no paid content;\n-The announcement for a new paid class came at around a time where the current game is still in an unpolished (not a problem had the pay for cosmetics model remained, imo);\n-Eleventh Hour Games have been acquired by Krafton, a publisher company that came out as going \"AI first\", and for allegedly attempting to illegally/unethically break out of a promise of bonuses to the devs behind Subnautica 2.\n\nMake what you will with those points and consider doing the research yourself on the issues that may arise, prior to making any commitments with Last Epoch or any games that fall under the purview of Krafton.\n\n\nGame is still great at the moment of the review's submission. The previously mentioned metaphorical slope just got coated with WD-40, to my chagrin.\n\nStill, do have a wonderful day.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Out of Diablo, PoE2 and this, I enjoyed Last Epoch the most.\nBut now, greed has killed yet another very promising game. \n\nYou lied to your kickstarter backers.\nFuck you.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Great game, but now owned by Krafton, who was already a grimy publisher to begin with but is now advertising itself as an \"AI-first\" company. Don't give them a single cent.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Charging for future classes.\nAnnouncing an expansion when the base story isn't even complete.\nYou already have microtransactions. I'm not going to get nickel and dimed by another developer.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The main story isn't even done yet, and instead they are going to create paid DLC classes... Not recommended in any way. Totally unfinished - still they will try to milk you even though we supported them. Wish i could refund.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "GG, devs sold their asses for kraftons money and screwed up all of their players. Now this game will become p2w dogshit as multiple other arpgs. Good thing we still have poe. Dont play it, dont pay for it, dont give your money to this dogs.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Paid classes. Knew this would happen when they sell it to Krafton.\nSadly this game will go down the hill from now on, and i can not longer recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "For the one-time upfront cost of the game EHG promised a complete Last Epoch experience in their kickstarter without having to spend more on the game. This promise was broken today by the announcement of paid classes.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game was on a good path. Sad to see it was sold out, but there are others out there.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Paid classes in a paid game, despite the promise of Pay2Play 🤡\nI regret buying this junk :с",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "A paid class? Really? I guess selling basic gameplay now counts as ‘innovation’. Amazing how fast a great ARPG can pivot into a cash register. Truly groundbreaking stuff. Shame that what used to be a promising ARPG is now testing how far players will tolerate monetizing fundamentals.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This started as a game with great intent and potential. While it was not as polished as AAA titles, developers really worked with the community to build a game that was good for them, including the promise to never charge for extra content and let the game just be a one-off purchase. Now the game has been taken over by an AI driven company who are just keen to use it as a cash cow and have just anounced paid for DLCs and classes. You're far better off having a look at Path of Exile 2, that's where I'm at anyway",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Guys, what are we doing? the game has been a way better diablo, with way better build system and somewhat of an endgame, its already got a 34.99 price tag, and you are going to punish people who buy the game after its release, to have to buy DLC expansions? then on top of it you are showing everyone that you will also not add any Classes, when the game is already lacking BUILD diversity?????? POE does it better, is essentially STILL cheaper, once you buy the stash tabs more or less required to play decently into endgame, and continues to release FREE expansions, and content, and has infinite build possibilities, its no from me from now on, won't play a game where something would bring me back to play on a new season, but id have to even drop another cent to even test it out, to find out how broken and strong it is, which it most likely will be we all know how that goes.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Prepare for the game (like the company) to become infested with AI trash, better yet don't buy this game.\n\nOther games: Grim Dawn; Torchlight 2; Path of Exile; earlier Diablos; Titan Quest series.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "They decided to sell paid characters instead of fixing the issues in the game. Avoid.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Sad to see Last Epoch go in this direction. It started off so strong and I genuinely believed it would rival Path of Exile. I appreciated what the devs were doing, but now that Krafton took over and started implementing paid DLC and paid class unlocks before some of the basic parts of this game were ironed out (campaign story unfinished, bugs, balancing, trade), it indicates to me the future of this game is not bright and I frankly have no desire to return to it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game isnt even finished yet, has paid MTX (and shitty ones), but devs tried to announce a paid expansion, players were outraged, and now devs respond by announcing paid... classes. Really? Is this an out of season aprils fools joke? Game itself is alright, but its clear that devs have no idea what to do next or how to interact with community. Faith lost.\n\nEven all these things aside, I had way more time spent and fun in PoE2 last season. LE lacks on many fronts, needs much work, and devs instead throw shady promises that do nothing but enrage the fans.\n\nSo better stay away from it for a while.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Remember buying this game early accessing and loved following it's development. Thanks Krafton for ruining everything.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I would've endlessly recommended LE until the end of time but fucking Krafton has to get their greedy pig fuck hands into everything I guess. They are already torpedoing this game for profit, which will drive it into the dirt. Thank you devs, you guys built a fantastic game, sorry the suits screwed you over",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I tend to prefer to be positive. I loved the hours that I played this game for, except a bit of the repetitivness of the lategame. But as of now the company making the game was bought by Krafton, made a boring new \"season\" if it can be called that, and plans on making paid DLC for a game that is a whole playable experiences, but is by no means finished. (Literal missing chapters in the campaign).\r\n\r\nSo sadly, I have to review it negatively as what you will play might be a worse experience than what I played through.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Can't recommend this game now that the head of the studio announced it's focus on AI. Go support Grim Dawn instead.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Was happy the direction the game was going, but with the recent announcement of them going \"Ai First\" puts a bad taste in my mouth. Gg's it was fun while it lasted.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Fun game with interesting ideas, even though its a very rough game.\r\n\r\nnow with that being said, it was bought my Krafton and now they are going to implement aggressive monetization like paid classes. big no no for me. if that doesnt bother you, suit yourself",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Could recommend this game 6-12 months ago. Cannot anymore. Content has been sparse and communication with the playerbase has been odd, to say the least. Announcing a paid dlc class is just bullshit. Go play Path of Exile instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "wait wait wait, i bought the game, now i have to buy the classes i use to play the game.  what is this dystopian BS.  should be grounds for refunds.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Good game, but future does not look good.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is/was really good. It recently got bad reviews due to it being sold to Krafton. Their team has just announced PAID CLASSES.\n\nRemember that having paid classes before finishing the campaign was an actual choice they made.\n\nThis garbage will bleed players and die out. Screw Krafton and greedy executives. The games industry has been making a hard comeback in 2025 with the Indie titles, and things will blow up in 2026. \n\nI promise we will see the fall of C-level driven games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A game that spent 10 years in a paid beta. The developers promised free expansions, new classes, and more… and now we see the “excellent” work of Krafton, who bought the game and completely ruined it. They managed to kill an already bug-ridden mess full of dupes and glitches. Absolutely disappointing.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "p2w classes coming in the next update, right after the game was bought by Krafton, a company who is currently replacing their workers with AI. Garbage game!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Already going pay to win after the krafton buy out. So much for a game made by fans for fans",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Buy to play with cash shop and you have the audacity to ask people to pay for DLC.\nAll that while the game is still buggy and incredibly laggy.\nNo.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I bought into this with the promise of a competitor to PoE, we were lied to about the scope of the game, delivery of updates/content went from constant delays to just whenever the devs feel like it AND to top it all off, despite the promise of \"buy once, no paid DLC, only cosmetic MTX\" we now have an announcement for paid for classes.\n\nIm not mad, just disappointed.. The promise of a viable alternative for people who love the genre turned into over promising and under delivery and now they are trying to milk its corpse for a bit of quick cash on the way out. Shame on you EHG for all your blowhard bollocks about \"passion for the ARPG genre\" \n\nAs others have said, just go play PoE, diablo... whatever your favourite flavour of arpg is, don't give these guys a penny",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I cannot recommend or support companies that feel that employees are not needed and that all the money should just go to management. AI based programming should NEVER replace human coding and employment.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "If you are a fan of ARPG games, you will enjoy it hands down. The recent negativity it political as us early fans feel back stabbed by the developers for selling the game off. If you are finding this in 2025 and haven't played the game before I'd say at least give it a shot. But know the game is probably on the down slope from here on out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lack of transparency, no communication with players and sudently broken promises. Some classes have passives and sometime entire skills that dont work as well as items that are completely unusable, and now they are releasing something they said they never would, content behind paywall.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The early days of this game were really promising, the devs promised that the only thing you'd be potentially buying after purchasing the game would be cosmetics... Fast forward to reality and they're talking about PAID CLASSES being released in S4. And what's not to say that said classes will be miles stronger than anything else. Half baked skills and items for the existing classes have never been fixed, tooltips LITERALLY LIE TO YOU in some cases.\n\nUpdates take MONTHS to drop for the smallest of content. And not to mention them advocating the use of AI over REAL humans to make their game? \n\nThe campaign still is half finished and leaves quite a bad taste in my mouth where it ends off. I CANNOT in my right mind suggest this failure of a game to any arpg gamers. Try POE2, Hellclock, TL2, hell even Fate!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game contracted the industrie's equivalent of HIV: A s*itty publisher (Krafton), now no one want's to get near it.\nLet this be a warning to future game devs: You get in bed with satan, the players will leave you.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Had the potential to be a very competent ARPG, but unfortunately, greed always wins",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Last Epoch was a promising game that was finding a space in the genre. Unfortunately, they submitted to corporate overlords and have regressed. Sad to see.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After selling out to Krafton it just took 6ish months to start seeing the fall... Paid classes??? in an arpg??? Sad, but hey, PoE2 druid LOG IN!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Coming from Path of Exile, I did like this game and clocked in a fair number of hours making it to the beginning of end game.  In it's current iteration, it's unplayable for me entirely. I've signed in at various times in the last two days and only got twenty minutes where I wasn't rubber banding across the maps, having enemies melee me off screen because the game just couldn't decide where my character actually was. Even connecting to different servers didn't fix this issue. I seemingly have no packet loss, nor high ping and the issues are consistent across all graphics settings.\n\nI did wish to support the developer early on when it was in early access, but honestly the skins sold in the shop are bland. The alternate effect for skills are sparse at best and unimaginative. Perhaps the shop art you might see and appreciate the most is the portal effects. Unfortunately in this game the portal is effectively pointless.\nHonestly the people who like this game might actually see some solidly good skins to use in game if the company does move forward with employing AI. They couldn't be bothered to employ artists to make shop items for the roughly five years it was in early access and things seem no less bleak for the year and half it's been in official release.\nIf the company couldn't shove decent skins out when giant PoE and diablo streamers were playing this game and bringing tens of thousands of new players in, they were never going to do so when the game is slowly dying.\n\nI don't know how you have a genre leader like PoE to see and fumble this hard.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Welp so it came to this. Unfinished game, promises of only paid cosmetics (now you have to buy dlc for a new class). People should have known that this game turned to shit after being bought by Krafton. Anyway don't spend money on this, buy Grim Dawn instead. You get way more bang for your buck.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Ouch. Got back into the game and ran into a few class issues off the bat. Nothing crazy I know it’ll get fixed but now they want to have paid DLC classes. Very confused. Play PoE instead for now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was an interesting game during EA, and things started going down hill since 1.0, and it turned into a total garbage after s3, don't bother wasting your money and time on this garbage.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "In the beginning, I really liked how EHG Devs handled Last Epoch, and I had great faith in them. However, the recent news about paid character DLC is a bad move. I already feel that there is a lack of build variation compared to Path of Exile (PoE). Now, the only hope for more build variety is gated by a paywall. Right now, it's only one character, but what if they create a new character and ask us to pay again? This is not a free-to-play game; we already paid for the base game. With the lack of content in the endgame, I can't recommend this game at all.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Had to delete this game once I found out it uses third party agreements to play a game I purchase. No thank you. All corpo bots stop adding this to games!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Had high hopes for this game. Then Krafton happened. Now we're supposed to pay for classes and other things before the game is even finished. RIP LE.\n\nI sincerely hope Krafton shuts down and no one in their management finds employment again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "No thank you, the company lied. Said they will never charge for gameplay like characters, seasons etc. \nShut down this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Can no longer recommend this game after their announcements because of the Krafton Purchase. Go play PoE 1 or PoE 2 at this point.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't support releasing paid content for an unfinished game, this is not a winning concept in 2025.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Used to love the game was a lot of fun. Now they're going back on the never having paid dlc. Yikes man big yikes, they already have a massive \"skin store\" and to tell everyone that you'll never have to pay for content after the first purchase then turn around and ask your customers to pay for content when you can't even fix what you already have. Good luck, don't buy this game super shady.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was an original Kickstarter and I can no longer support a game that embraces AI.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I've been an avid supporter of this game, but I can't anymore after the broken promises. They're focusing on paid content when half of the unique weapons and armor don't even have proper models yet. If you want a quality, offline ARPG, please check out The Slormancer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Before this game launched and even up until the 1.0 release the devs were saying no paywall locked content and updates would be free forever. Now after being picked up by Krafton there is announced paid DLC classes. This game had potential but now its becoming clear it will be another cash grab.\n\nGo play Path of Exile 1&2 instead where the time you have to spend money is if you want cosmetics or stash space.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Incomplete campaign, lacking endgame content, and now paid DLC.  Would not recommend this game to anyone really.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "EHG sold out to Krafton. Now they are adding paid content outside cosmetics, which they promised not to do. Would have played this game a lot longer had these two things not happened. Really unfortunate with the potential the game had.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game had potential but with recent news of selling classes? Yea its downhill from here.. Introduce many great mechanics to the genre that forced other games like PoE to adapt too. You have pretty much set yourself up for failure by making new classes for things you have to pay for. All it takes is one OP paid class for the avalanche of shit storm to follow and forever be labeled \"p2w\" . Good luck EHG but I wasn't surprise as soon as I saw the Kraftton news.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Paywall'ing Elite \"Paradox\" classes is a hard pass for a game i already paid for to begin with, and a dev team that said that would not happen to early backers.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Developers went back on key promisses that made me support them in the first place, and i regret every euro i spent on it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Promised the game would never have paid expansion, classes, or power. Said fuck that and implemented them anyway. Dead game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Last Epoch is a great game! Unfortunately after the sale to Krafton, you no longer get the full game for the purchase price, with for-purchase DLCs and classes now part of the 'full package'. This pushes it far into \"not worth the purchase price\" for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game was bought by Krafton which is a horrible publisher. Most of the coming content will be made by AI. The problem with AI is it's going to take so many jobs. Whose actually going to be paying for content when nobody is working?\n\nCorporate greed is out of control. \n\nThey want 30 employees and 50 million customers. \n\nVote with your wallet to stop this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Payed ontent after they promised they woudnt.\r\nOn a half finished game.\r\nShould be illiegal.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've been playing this game since it hit early access years ago.  I've had my fun with it but not sure if I can support it any more. It does a lot of things well but the endgame isn't there. There is just nothing in the endgame that keeps me hooked for long.  An incomplete campaign after all this time is a little unsettling as well. The fact that the devs have been endlessly posting job opportunities on social media is also disturbing, it tells you that some people have probably jumped ship already. Hard to say.  I understand  you have to make money but paid classes just doesn't seem to be the way.  I will keep an eye on this game and I hope they figure it out but until then I'm probably going to uninstall.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Glad i never wasted too much time on this game that is apparently becoming more AI-infused trash thanks to Krafton and charging for a class when originally bragging about never doing so. Diablo 4 seasonal char grinds seem more appealing than this half-baked mess.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Changed their model to p2w after selling out to AI focused devs. Game over, play PoE instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Another decent game that was slowly building into something great selling out to the detriment of the fans that supported its rise. Play poe instead, it's free and a more complete game than this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Enjoyed playing this every now and then but won't continue playing this game if the recent news about paid classes goes live.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Enjoyed playing this but won't continue playing this game if the recent news about paid classes goes live.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought this game on the promise that content would be free, with revenue coming from cosmetics. I have enjoyed it, and even enjoyed the paid cosmetics, due to the developer's clear passion.\n\nIt's now clear that management has decided to pivot to paid content, and undoubtedly this is likely to be a trend going forward.\n\nMy disappointment is immeasurable, and my day is ruined.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It was great while it lasted, I guess. Apparently they sold out to Krafton, a 'AI first' company and will release paid classes even though repeating over and over that no non-cosmetic content would ever be for purchaseable after the initial purchase of the game (lmao).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game half broken, performance randomly drops depending on the patch, gameplay feel clanky, campaign isnt even finished, paid game and cosmetic support bundle + in game cash shop and now a paid dlc + class? Not recommended",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game was bought up by Krafton and devs abandoned their initial promise in 2018 of all future updates being free.  DLC Classes? Come on. The class updates since launch have been pretty uninspired overall, so why should I have any confidence in buying a new class?  Also, the previous season was fairly weak, so have no reason to spend any money on this game when the devs haven't shown they can deliver consistently good updates. \n\nI had a lot of hope during early access, but since release it's been really up and down and then when Krafton came along I was even more worried  - and now it's really hard to not be a doomer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h2]So long, farewell, Auf Wiedersehen, goodbye Krapfton ![/h2]\n\nFrom this :\n\" Q: [i]Will there be paid expansions, new eras, area and maps? This should be accounted.[/i]\nA: [i]We want to continually update the game with small and large content patches. These will never be paid for.[/i] \"\n\nTo This :\n\"[i] I’m excited to announce that we’re introducing something genuinely new to Last Epoch, a fully alternate playable class built on systems that work differently from anything else in the game. We’re calling this new category Paradox Classes, and the first one will debut alongside the upcoming expansion as paid DLC[/i] \"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Sad to see Eleventh Hour Games suffer under their publisher's Krafton's underhanded and greed choices. \n\nBut bottom line is - we were promised that there will never be paid content, now they have been forced to implement exactly that, paid character classes. \n\nDo better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sold out to the Korean gamekiller Krafton that essentially has a mandate to shove as much AI into games as humanly possible.\n\nDamn shame. Least it was fun while it lasted.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Krafton AI sellout. Paid classes while so much of the game is an unfinished mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No... just... no. After so many years instead of getting better LA just gets worse and worse. And now classes locked behind paywall contradicting the promises made during the KS... no thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Loved the game, bought years ago. But after the last announce about paid ingame classes - no thank you. You have lost my interest in the game and i believe for many others. So sad that is has come to this...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Спасибо разрабам, которые накормили меня пенисами. Только косметика говорили они, а по итогу платный класс в платной игре... Добавить контент - нет, стать гнилой компанией - да. Eleventh Hour Games добавлен в список поноса.\n\nThanks to the devs who fed me with diсks. They said it would only be cosmetics, but in the end it’s a paid class in a paid game… Adding content – no. Becoming a rotten company – yes. Eleventh Hour Games has been added to the sht|ist.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pretty decent game to play between POE 1 and 2 leagues.\nWould be a great recommendation if it wasn't for the recent announcement that they're implementing paid classes.\nNow, I may or may not have misread the announcement but until then it's a no reco for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Krafton ruined another game.  \nCampaign isn't even concluded 6 years after early access and they wanna sneak in paid classes.  \nShame on you, clowns... I'm never playing this again for even a second.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Before Krafton aquired this project, I'd say: Yes go try it.\nBut now? Just don't, wait for PoE2 (or buy EA access if you want), or play PoE1.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even a Year ago I would have recommended the game, if only for  the well thought out crafting system for a game of this genre ....\n\nBut now, with the devs selling out to Krafton and anouncing PAID CLASSES when the main story is still not done, its clear the direction of the game shifted into \"Milk the playerbase for all its worth\".\n\nDO NOT PAY a cent to play this game.\nIf you want a game of this genre, I can recommend Path of Exile (free), get the Early access to Path of Exile 2, or wait Path of Exile 2's Full release. And beyond PoE, I'm sure there are other A-RPGs that are worth your time and money more than Last epoch would now.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}