{
  "positive": [
    {
      "review": "Addictive like good old CIV days...\r\nJust one more round, one more thing to do and... how is it 3am??\r\nCute animations, the sandbox style is addictive...",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "With all of its DLCs an absolute masterpiece full of the best mechanics and most well implemented setting Anno has had to date.\n\nThis and Factorio is all you need for a couple of years on a deserted island.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Super confusing, but it made the game stay interesting until the end.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Overall, it’s a great game. A classic city builder with an engaging story!\r\nHowever, like most games of this genre, by the 13th hour it starts to feel repetitive as everything turns into resource management.\r\n\r\nThe main downside is that the management processes are very slow, so you often play at maximum speed just to move things along. That ruins the vibe a bit since it’s hard to enjoy your beautiful city when everyone runs around too fast.\r\n\r\nStill, the game is fantastic. If you are unsure, wait for a 90% discount, buy the base game first, test it, and then decide about the DLCs. The atmosphere is captivating and the visuals are beautiful.\r\n\r\nI bought it with a 90% discount, had a good time, but don’t plan to return soon simply because it got a bit boring. Still, it left a strong impression and that’s what matters.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is an attack on your lifetime, you want to to only one more thing and after that it's 3 in the morning. Best game in the series, I played every other Anno but this one nailed it. You don't need to buy the DLCs upfront (except Bright Harvest, get Bright Harvest), you don't need them the first 60 hours or so, after that you will buy them anyway ;-)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Among the rut of many ubisuck games, this one is amazing. Very cozy, deep, engaging and goes for a looong time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Anno 1800 is propably the best city building game on the market. Its gaming content vast and you are going to build and uncountable hours. Be prepared to be sucked into this game!\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I feel sad I discovered the Anno series only in 2025. It's such an amazing city builder with great production chains and different classes of citizens that all have their own needs. The campaign has a little story that gives you time to learn the game. The planning and strategic placement of some buildings is what makes this less of a \"X needs Y so place some Y to make X happy\" as in other city builders. I can absolutely recommend this game to anyone who loves strategic thinking and city builders. The time frame is also something more unique as most city builders are placed in current time. The Anno series does this very good!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really great game! love it! very addictive, very engaging, and just the right amount of challenging. \r\n\r\nUbisoft side of it really unfortunate though.. sometimes it can't connect to their servers  and you can't play even single player, just wont startup.. Keeps suggesting i turn on their overlay too.. like a nagging partner...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "🎭 Bantering Bard’s Review\n- Gameplay – 10/10\n- Graphics – 9/10\n- Story – 4/10\n- Content – 10/10\n- Multiplayer Experience – 7/10\n\nThis is an elite city builder, second only to Frostpunk in my opinion—though Frostpunk is far more unforgiving. The graphics hold up impressively for its time, gameplay is top‑tier, and content is rich and rewarding. The story, however, is annoying as hell and drags the experience down. The biggest downside comes when playing multiplayer with friends: for the love of all that is Gaben, turn the notifications off entirely! They ruin the flow of an otherwise excellent game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super Spiel. Wirklich. Als kleines Kind mit Anno aufgewachsen, jetzt endlich wieder mal gespielt und total Nostalgie-feeling. Frisst leider extrem viel Zeit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. Think city skylines but more survival and, well, 1800s aesthetic. War is really engaging and rival nations are hard to beat if you don't dominate them early",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Very Addictive. Time spender.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so immersive and there is always something new to learn or try. The DLC's just make the game even better; adding hours of content and so many new ways to play the game. A must have for any city builder lover",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came here after writing a review for Manor Lords to re-appreciate this game for accompanying me through MONTHS of daily play. The depth is incredible.\n\nYour entire world can collapse in a second, yet you still have a chance to survive if you step back, breathe, and allocate better. One of the best in the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot of what I want and misses a few things that I always like to have.  It is a great town builder, you get multiply chances to build towns that trade with each other and help your towns/cities thrive as you take what each isle has and trade it to those islands that are lacking that product.  You never find that isle that has everything you want, so you have to make sure you have trade routes set up; which means you have to protect your ships that go out to sea from pirates and enemy factions.  \r\n\r\nThe part I am not overly fond of is that you can never build that huge spread out city.  The islands limited space means you have to be precise in your buildings in order to get everything you need to fit on an island; that usually means many changes and building relocation as you realize you no longer have the room for later buildings, or that you have to make more houses to get to the upgrades that you need to make more building on a specific isle.  I love keeping track of the production lines and what I need to trade where, but honestly I would love to have one isle that I could spread things out a bit more as i am not a big fan of clustering everything so tightly together to make rooms for items i needed later in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game with an excellent polished theme. Love the complexity of the industrial workflows. I like that there's a mix of efficient layouts and enough flexibility to fill in every nook.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy city building, economy management, and long-term strategy, Anno 1800 is a must-play. I have already spent over 200 hours — and I’m still excited to keep playing. This game is not just fun… it’s addictive in the best way.\n\nIs It Worth Getting the DLCs?\nAnno 1800 without DLCs is great — but with most of the DLCs, it becomes a complete experience. The late game feels smoother, more strategic, and more creative. Docklands, New World Rising, and Land of Lions are especially game-changing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a really great game in terms of strategy, trading, governance, and forming alliances with various NPCs. The game is very well-designed and enjoyable to play for long sessions. It’s especially fun for players who like thinking and strategic decision-making.\r\n\r\nHowever, I wish there were land-based battles on islands as well. Since we already manage naval combat, it wouldn’t be bad to also have the option to go ashore and fight on land. (Just my personal opinion.)\r\n\r\nThank you for creating and presenting such a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it!  Very much enjoyable game to play.\n\nI would like to thank the devs for the wonderful Linux support as well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 6000+ hours I felt obliged to recommend this game. I only picked up some of the DLC´s. Many seems not worth it / cosmetic. \r\nThe game is good, lot´s to do and you can set up at start what kind of game you like. Peaceful or have enemies. How plentiful resources are etc. \r\nI am not sure if I ever completed the single player story campaign. I mainly set up a free game with the options I like for the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you're into these types of city builder/supply chain/management things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fantastic city building game. There's so much here! It really drew me in, Have to force myself to stop playing. It's a lot of fun. No issues at all so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a beautiful game with massive scope, just make sure Anno 117: Pax Romana is out so you can get this masterpiece at dollar store value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like details - its incredible. Many city management options, automatics... I can easily stuck in game for hours )))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anno 1800 is one of the best and by far the highest quality city builder/management games out there. Set in a beautiful 19th century setting with light steampunk elements, it's absolutely one of my favorite historical settings. It lets you play in various locations. The base game has both an Old World and New World, where you have to create intercontinental trade routes and logistics systems. You build some genuine complex production chains for a city builder/management game.\r\n\r\nThis does lead to the main negative. All these complicated logistics are difficult to follow when you have really complex settlements, as the menus can be hard to understand. But luckily the game isn't too punishing, and a production chain not running smoothly won't immediately bankrupt you.\r\n\r\nThe game also has a full campaign/story mode, but I personally stick to sandbox because that’s where the game really shines for me. altought even in sandbox there a verious missions you can do. On top of that, there are four seasons of DLC that add even more content, extra production chains, new mechanics, and whole new regions like the Arctic and an Africa-inspired map.\r\n\r\nOverall, Anno 1800 is one of the great city-builder/management games of all time.\r\nIf you love the setting and want a polished, deep, and beautiful strategy game, it’s absolutely worth trying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played for 125 hours and still going, such an incredible game. Simple to learn, hard to master - this game carries the mechanics of SimCity and Tropico which were classics back in my early gaming days. Highly recommended to lovers of city builders and mild strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playing on ultra noob mode (easy difficulty, easy AI, pirates disabled) cause i'm an ultra noob and need to get used to the system\r\nbente jorgensen took a really big island in the new world full of oil that i really wanted\r\ni was in vc and i audibly went \"YOU BITCH\", proceeded to obsessively buy out shares of the island until it was mine\r\nshe has the audacity to ask for an alliance with me\r\nmy next target is the one island near my main one in the old world that has nitre deposits (cause i don't have any)\r\nthat island happens to be bente jorgensen's\r\nbente jorgensen, your ass is MINE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well rounded and fun resource management game masquerading as a city builder. Instead of managing traffic, you manage land use and shipping routes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ANNO has always been a nice game despite under UBISH*T management. Thank God that they not messing with this franchise like the other major titles. ANNO 1800 is overall the best one in ANNO Series, though its not entirely perfect there's some annoying UI design and stupid quest pop up, also not able to 'pause' to review in game situation which a huge bummer in management game. judging the game in its all fullness its a PEAK ANNO experience. I'd recommend to buy it while on sale with all the DLC.\r\n\r\nI don't mind with the UBISH*T launcher, its annoying YES and really unnecessary to use but, what choice do i have? \r\n\r\nI wish they update the UI to the same level with ANNO 117 PAX Romana.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the first game of its type that I played so I can't compare it to other campaign games but I enjoyed playing it. It can feel overwhelming at times, but I guess it's normal. I finished the campaign but the story seems to go on and I feel a plot twist coming!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very involved but good and worth it. Kinda Addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly Ubisoft came through with a game that's fun and isn't woke garbage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as other city builders like Cities Skiylines but a good game in it's own way. Quests are fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun city builder with increasing complexity as your city grows. The highlight of this industrial age setting is the beautiful buildings and the lovely attention to ambient inhabitants bringing the city to life. The trade, war and quest mechanics are fine though you may find them a distraction from all the building  - they are meant to be. This is the first of the Anno series I've played. I will be giving Rome a go soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but very hard. You have to jugle lots of tasks and getting up in tiers is slow but rewarding process. I think co op helps a ton because you can split focus on tasks. It a marathon game not a sprint but you can make a great looking cities and empire in this age. Would recommend if you have time to sink into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game, beautiful, minutely detailed and very relaxing. \r\n\r\nI find the micromanagement a little overwhelming once you have to manage multiple maps but that's more of a me problem. \r\n\r\nIf you like this kind of game.... you already own it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sheer scope of the game means that you can keep coming back to the same save over hundreds of hours for years and never run out of things to work on in your world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would say that Anno 1800 is the best city-building game ever. And it's not even really a city builder. \nIt's just incredible. Play it! it's worth full price anytime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anno 1800 is an incredibly addictive city-building strategy game that masterfully combines economic depth, stunning visuals, and intricate production chains. The satisfaction of optimizing trade routes and balancing workforce across islands keeps you hooked for hours. Its rich detail and dynamic world make every decision impactful. The only drawback is the tutorial—it’s not always clear what to do next, especially for newcomers. But once you get past that, the game unfolds into a deeply rewarding experience that challenges both your planning and creativity. A must-play for fans of complex strategy and beautiful world-building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it!! It's relaxing, fun and there's alot of stuff to do! And i like that i can play with friends :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a fun game to play with a friend or partner. My husband did all the tasks for the land portion, and I was in charge of our ships. We found this to be the best way to manage our little piece of the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this on sale for 40€ its worth that much... it will keep you busy for quite a long time...\n(130€ for the complete version, holy moly...,)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never I have seen a game that it's tutorial is confusing and a nightmare to pass because of lack of essential information but nonetheless, the game is so enjoyable and unique that even exceeded my expectation despite playing similar games such as CIV5, Revival, and the likes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is such a sit and let it run for hours and watch your island grow however the late game can become a huge spread sheet and can be a bit over whelming if you aren't ready for that kind of Microsoft Excel sheet gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "优秀的模拟建造，上手难度较高。第一次玩被破产劝退了，第二次时隔两年再次打开，玩懂供需和供应链之后才发现这游戏是真好玩",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game if you like complexity. There is a lot going on and a lot to manage. You are likely to find some of the advice online very useful if you do not want to get completely frustrated. \r\nIf you want a simple game, don't look here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. takes a little to get the hang of it but its great so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing city builder where you have to manage production chains. DLC are worth it if you enjoy the Standard game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game - First time experiencing the Anno universe and will be looking forward to Pax Romana. Add ons do make this quite pricey and I would recommend waiting for a steam sale or bundle sale for the  major content pieces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good well thought game! Game bends your mind to quickly identify and resolve problems, have a future sight & vision in everything you do. Quite fun to play:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good building game and resource collection, took me a full day to work everything out while playing, well worth it , ty Anno.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If an island settler, city builder, trade empire founder, with plenty of side quests is what you looking for then you have found it.  It isn't as easy as they make it look on YouTube but it is loads of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and good graphics...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely an amazing game, I found myself so invested that I missed my own marriage, the birth of my children, and my funeral. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun game! A little bit of everything. Sorry it took me so long to purchase it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game and lots of strategic city building and battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The strategy and trade involved with this game is amazing. Would like to see some more combat in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is incredible how a game as good as this can be locked behind a terrible Steam-Uplay integration. \n\nI hear the main menu music while I type this but, remarkably, the game hasn't launched. It taunts.\n\nTruly baffles the mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a bit of a steep learning curve at first, but once you spend a couple of hours figuring out the mechanics it is highly engaging!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anno 1800 takes players to the dawn of the Industrial Age, combining the classic city-building charm of earlier Anno games with deep economic systems, trade, and diplomacy. You start with a small farming settlement and grow it into a sprawling industrial empire — balancing labor, pollution, trade routes, and the happiness of your citizens.\n\nThe core gameplay revolves around urban planning, production chains, and resource management. Every product depends on others — for instance, soap requires tallow, which comes from pigs, which in turn need grain farms.\n\nYou’ll also manage:\n\nMultiple islands to access different resources\n\nTrade routes across the Old and New Worlds\n\nNaval combat and exploration\n\nDiplomacy with AI factions\n\nThe pacing is satisfying: early hours focus on agriculture and logistics, while later stages introduce electricity, skyscrapers, and tourism.\n\n🧭 Strengths\n\n✅ Stunning visuals – Cities feel alive, with detailed animations and vibrant atmospheres.\n✅ Deep economic simulation – Complex production chains make optimization rewarding.\n✅ Replayability – Procedurally generated maps and different strategies.\n✅ Expansions & DLC – The “Season Passes” add tons of content like the Arctic, Africa, and skyscraper construction.\n✅ Music & ambiance – A rich orchestral score that perfectly fits the industrial tone.\n\n⚖️ Weaknesses\n\n❌ Steep learning curve – Managing multiple islands and supply lines can overwhelm newcomers.\n❌ Performance issues – Large cities can strain even powerful PCs.\n❌ DLC model – Some players find the amount of paid DLC excessive.\n❌ Limited combat depth – Naval battles feel secondary compared to the economic gameplay.\n\n🌍 Verdict\n\nAnno 1800 is one of the best city-building games ever made — a beautiful, complex, and endlessly rewarding simulation of the Industrial Revolution. It demands patience and planning, but the payoff is immense when you watch your cities bustle with life.\n\n⭐ Score: 9/10\n🎮 Best for: Fans of deep strategy, management, and city-building games like Cities: Skylines or Tropico.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely loving it, recommend buying dlc, makes managing game even better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anno 1800 is just brilliant. The more I play, the more I’m blown away by how polished and addictive it is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game overall, just don't like that a ubisoft account is needed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can only say that you'll have endless hours of fun. I'm still in my 2nd playthrough, tho I take it pretty slow. Don't try lady margeret on your first game, she will make you question life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played the previous parts before, this one is real fun and not to hard for Anno Beginners",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good. Had some crashing issues with Directx12 but that got resolved once I switched away from that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Right now I like 1800 better than 117, but only because 1800 got multiple years worth of DLC and free content updates. 117 in comparison feels like a large step backwards. The one thing I want with 117 right now is the sandbox mode where everything is free and the economy doesnt matter, its just there to make pretty looking cities. That was a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my absolute favorite games I always go back to for chill relaxed time. I'm so sad the new Anno 117 PAX Rome sh** the bed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "little hard to find out how to play. seems to be no tutorial in multiplayer, but now we think we have it figured out and its pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes they made a great job, is gonna keep you stick to the screen for hour without even realise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Proper stuff, left for one minute and George Smith declared war on me. Would buy £80 of DLC one day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love my little colony sims, yet I hate Imperialism with a passion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME ADDICTIVE BUT MAKES YOU VERRY MAD AT THE SAME TIME,,  WAY TO MUCH GOING ON LATE GAME AND WAY OVERLY COMLICATED FROM THE START BUT FUN AT THE SAME TIME I REC IF YOU DONT MIND RESTARTING 60 TIMES TO GET HANG OF IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good world building game.\r\nAI gets annoying at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anno 1800 is the only game where I can feel like a genius industrial tycoon and a complete idiot at the same time. One moment I’m building elegant trade routes and managing global supply chains, the next my citizens are rioting because I forgot to produce sausages. The graphics make me feel like I’m running the world’s fanciest history documentary, but in reality I’m just juggling beer, soap, and endless demands for canned food. It’s a city‑builder, an economy simulator, and a stress test for anyone who thinks they’re organized. 11/10, would accidentally bankrupt my empire with too many hats again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't describe the feeling when you lay down your first town and see the little people go about. Addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Last good Anno now that we know what the new ones are like this is a must play since its likely the last one 9.5/10 imo for this type of game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most complete city builder and production manager",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ANNO PLS... I NEED TO SLEEP.  #YOUVE BEEN PLAYING FOR TWELVE HOURS,,, GET OFF THE GAME#\n\nANOTHER CITY HAS BROKEN OUT WITH THE PLAGUE- RESIDENTS ARE RIOTING\nOle biscuit lady and big hat woman have declared war again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, \"pg\" version of colony is dark an funny af if you get the jokes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome. But holy Cow ... there is much to do. And I only have the base game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game if you like city builders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, wish it wasnt made by Ubisoft.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good entry to the anno series. Maybe the best one to date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes up a LOT of time, but great game none the less",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ANNO ever. A ton better than ANNO 117 too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard but interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The King of classic RTS style games, IMHO.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, shame it took me so long to find it :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very well made. excellent mod support",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Great game, city building at its best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fulfilling if you love management games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get the full edition. Its good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Needless to say, better than Anno117",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gold standard of City builders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A.k.a Picky Citizen Simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't stop. When do you stop lol. So much to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, shame it's from Ubisoft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good would play forever",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game is fun and I would recommend it if you didn't have to have a ubisoft account to play.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Great game, no doubt.\nI really don't like to be forced to use another launcher to play my f'king game though.\nThank you.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "See the rest of the reviews.\n\nUbisoft Connect.\nDenuvo DRM.\nRandom unable to connect means unable to play.\nAlso, DLC is way pricy, and the game is bare without it.\n\nIf you can stomach all that, and willing to buy into the $130 game?   It's one of the better ANNOs, and you won't find the same medieval setting without going three gens back to 1404 or so.   At least, the last two were scifi.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Third ever review, second ever refund request. (edited for technical correctness)\n\nDLC in this day in age is hot garbage. Ubisoft and Steam cannot or will not bundle content in an intelligent way. Both Efficiency Masters Bundle and Industrial Immersion Bundle does not contain all playable, non-cosmetic DLC. Buying the Year 5 Gold Edition or the Definitive Annoversary edition does not refund the cost of the base game which is already owned. Adding all DLC to cat is $378.65.\n\nThis is toxic behavior perpetuated by Ubisoft and / or Steam. I am not sure who is at fault here and I do not care. If Ubisoft calls the shots, Steam should not enable such deplorable behavior. I thought these bundles would complete my collection. They do not. This was unclear at best and deliberately misleading at worst.\n\nTL;DR: Corporate greed forced a refund request on my favorite city building franchise going back decades. I just want the full collection at a reasonable price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mandatory online ruined performance in game with significant fps drop after around 1 hr playing. And UBISOFT never fixed it or even bother to add offline support.\n\nIt's suggested to block the game accessing Internet in Windows Firewall for your life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is the only Ubisoft game that I own ( because I HATE Ubisoft and hope they go bankrupt ). I am considering uninstalling this as I don't see the need to have a Ubisoft account in order to play a game I purchased on Steam.\n\nOf all the Anno series, this is by far the best of them... but i  don't recommend it - because UBISOFT SUCK.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It would be nice if I could really play this game and leave a review, but Ubisoft Connect makes this game completely unplayable. My 7 hours ticked when the launcher running for the night. An guess what happened? Nothing )\r\nI may give a game another try another place another time, but for now - bye bye Ubisoft, do not expect me to buy your games again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The actual game is 12/10. Ubisoft connect requirement ruins this game. Expect to spend 10+ minutes to get it to connect every time you try to play....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is my favorite Anno, the game itself is great, but Ubisoft breaks it. If their services are down you cannot play even though this is an offline game. I own this game, but end up just playing the pirated version out of convenience",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you ever get a new pc and you try to play this game it will ask you for the CD key which is not provided by steam anymore and you wont be able to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Have had to interact with Ubisoft account support for multiple reasons since purchasing, every time they were slow & ineffective. No surprise that wanting to hop on for a couple of hours on a rare day off, I'm instead stuck waiting for them again. This is why I no longer buy Ubisoft titles. If you want to play, look for another way.\n\nE: Now completely locked out of the launcher, cannot activate product. Typical Ubisoft DRM preventing access to a single player game. Definitely avoid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is extremely hard to get anything done. Ive never been able to get stuff done beyond act 2. It seems that the other characters in the game end up getting things done much faster than a player can. Completly disappointed. What game requires a business degree to play it?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could I would give it a mixed review. love the concept but the controls of the game felt very clumsly and counterintuitive .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought at release, played a few hours, wasn't too impressed.  Came back to see if I should give this more of a shot.  $350 for all the DLC.  Seriously?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ive played the game for about 20+ hours now.  I didn't mind having to register and the game loads ok. The reason I cannot give this game a good review is there is no manual and the in game guide isn't detailed enough. It tells you what to do but not how to do it.  I first  ran out of workers then wood and then money. Messages came through thick and fast but as I didn't know how to do these things I became less and less  impressed with the game and eventually after everything came to a grinding halt I gave up. It looks pretty but I will go back to playing my other 20+ games that are much more enjoyable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried coming back to this on and off because this is in the realm of the games I prefer but this is absolutely one of the worst games I have ever played. It is extremely buggy and what does work tends to not make sense. in the 9 hours recorded, I have spent half of that paused and searching online how to fix the bugs. I'm done with it now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So much content locked behind a pay wall. \r\nUbisoft, you are scum.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty ... sure.     As someone that just started playing, it's not clear what and when you can upgrade something.  Doesn't really explain a lot of the chain that you're planning on following (which as someone that supposedly has an \"empire\" already built by his parents might understand what's necessary.  2 hours into playing the first time it already crashed.   I play on a top end machine with 64GB of ram, an Intel I9 14900 and a RTX 4080.  There's no reason this game should have crashed.  On top of that, it's forced online and forces you to create a UBI soft account, load their software, and have it running anytime you're in the game.  If you saw \"SINGLE PLAYER\" and was thinking, oh, I'll just play it like I play civilization.   NOPE.  You have to be connected to the internet.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Way to complicated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I almost enjoyed it. Shallow and shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't get that cd key, they so make me hard to just playing this game :(",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cROSS PLATFORM IS A LIE IT WILL NOT PLAY WITH XBOX FROM PC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant even play the game i bought!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not friendly for new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring finnicky no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "me no likey",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hi everyone,\n\nThis is actually my first time leaving a comment about a game I bought. I’ve played Anno 1800 for 392 hours—yes, almost 400 hours—and from a technical standpoint, the game is great. Usually, I never leave reviews, even if I loved a game or hated it, but Ubisoft has really given me the courage to do so this time… mostly out of pure frustration 😅.\n\nHere’s the crazy part: I bought the game on Steam, but when I tried to play it, Steam automatically linked it to a Ubisoft account that is not mine (masked email j***g@outlook.com). According to Ubisoft Support, I cannot transfer the game to my account, and the only way to play is to recover this mysterious account that I never created. So apparently, my Steam purchase now belongs to a stranger in cyberspace… yay? 🤷♂️\n\nI just wanted to share this story because it seems to be a very unique and hilariously frustrating case, and maybe to warn anyone who wants to link Steam games with Ubisoft accounts: check twice, or you might end up gifting your game to a ghost account! 👻",
      "voted_up": false,
      "votes_helpful": 485
    },
    {
      "review": "Ubisoft game that requires logging into their platform. Once you connect the game to their platform, you have to maintain access to that account. I had an email deactivated, so I couldn't get into my account, and Ubisoft wouldn't even attempt to verify my identity, so I've lost access to the game.",
      "voted_up": false,
      "votes_helpful": 336
    },
    {
      "review": "Have bought the game with DLCs, enjoyed it quite a bit.\nBut then I had to move to another country and after that Ubisoft has stolen the game from me, can not play anymore despite the game being legitimately purchased.\nI call this the backwards piracy.\nNope.",
      "voted_up": false,
      "votes_helpful": 221
    },
    {
      "review": "I loved this game and owned it on steam, playing the 160 hrs. Once they forced the ubisoft loader into the equation I can  no longer access my account or this game. Don't buy this wonderful game, fly the high seas. Ubisoft can eat its own ass.",
      "voted_up": false,
      "votes_helpful": 174
    },
    {
      "review": "Sure, this game has it's quirks, mostly UI and gameplay related (the grid layout hurts my brain) \n\nBut Ubisoft connect turns a good review to a bad one. \n\nWant to play Anno 1800? Guess what, Ubisoft Connect is down... and you can't.\n\nWhy wouldn't this game use Steam services for downloads/multiplayer etc? Because Ubisoft. Whatever title is slightly enjoyable from this studio is tainted and ruined by thier garbage online services (Black Flag Kenways Fleet anyone?).",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Can't play the game without creating a mandatory ubisoft account and install Ubisoft Connect. There is no point on that. Shame on you",
      "voted_up": false,
      "votes_helpful": 88
    },
    {
      "review": "Imagine a company preventing you from playing a game you purchased because it's selfish enough to force a parasitic login system onto players, but too incompetent to create a functional account creation application.\r\n\r\nI eagerly await the day when Ubisoft finally collapses under its rotten management.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "I was looking forward to trying this game out however I am stuck burning through my 2hr refund window trying to create an ubisoft account through their terrible launcher.  \r\n\r\nThis is a horrible horrible experience, please avoid purchasing at all costs.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Step 1: Buy Anno 1800 on Steam.\nStep 2: Install the game via Steam.\nStep 3: Launch the game via Steam.\nStep 4: Game forces you to install Ubisoft Connect.\nStep 5: Create a Ubisoft account.\nStep 6: Log into the Ubisoft account.\nStep 7: Finally launch the game you already launched from the platform you bought it on.\n\nIt's a great feature for anyone who feels like their gaming experience is just too streamlined and convenient. The game itself might be good, but I wouldn't know, I was too busy setting up the account I never wanted in the first place.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "The game is fun and I would recommend it if you didn't have to have a ubisoft account to play.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Was trying to play with my girlfriend. Bought it for her and she launched it from my computer on her steam account. It linked to my ubisoft account/email, meaning that she was not able to launch the game at all. Spent like an hour trying to troubleshoot. We had to refund. This is a problem that has existed for over a year and has been reported by other users.\n\nhttps://www.reddit.com/r/anno/comments/1gg5b8f/wrong_ubisoft_account/",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game is awesome, but it feels like Ubisoft doesn’t actually want us to play it. The launcher is a complete train wreck: it only works about half the time. I constantly have to reboot my PC, reopen the Ubisoft launcher, and restart the connection. Why do I even need two launchers just to open the game? Honestly, I really enjoy my time with the game itself, but Ubisoft seems incapable of delivering a smooth player experience. At this point, it almost feels intentional.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fun game to play when it works but requires connection to a ubisoft account and their system constantly breaks and requests updates every time you try to play that make playing this game too much of a headache to be worth it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Eh, the atmosphere is immersive. But if you look at how the cities are designed they end up looking almost the same and the gameplay ends up being the same. I have all the dlc and my review is unaffected as it just seems like normal stuff that should be in the base game anyway.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "DO NOT BUY - especially if you use VPN\n\nit will force you to load their absolutely horrendous Ubisoft Launcher...not only is it an absolute bloatware but it also forces you to reset your password if you use VPN as it has some kind of a fit whenever VPN is used (Thats right - log into your email & reset password almost everytime you play your game with VPN). Ubisoft Launcher is an absolute disaster, which is a shame because the actual game is rather good.\n\nI recommend you avoid ALL Ubisoft games until they stop forcing their crappy launcher on you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Requires Ubisoft Account setup. Filed for refund, but not before locking my account up because their web and game client don't seem to sync properly after doing a password change.\n\n0/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "First time I’ve ever refunded a Steam game just ’cause Ubisoft asked for a CD key. I bought it on Steam, then Ubisoft told me to make a new account on their app. Made the account, logged in, still couldn’t play. Nice job, Ubisoft, you just helped me save my money",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Great game, no doubt.\nI really don't like to be forced to use another launcher to play my f'king game though.\nThank you.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "See the rest of the reviews.\n\nUbisoft Connect.\nDenuvo DRM.\nRandom unable to connect means unable to play.\nAlso, DLC is way pricy, and the game is bare without it.\n\nIf you can stomach all that, and willing to buy into the $130 game?   It's one of the better ANNOs, and you won't find the same medieval setting without going three gens back to 1404 or so.   At least, the last two were scifi.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Third ever review, second ever refund request. (edited for technical correctness)\n\nDLC in this day in age is hot garbage. Ubisoft and Steam cannot or will not bundle content in an intelligent way. Both Efficiency Masters Bundle and Industrial Immersion Bundle does not contain all playable, non-cosmetic DLC. Buying the Year 5 Gold Edition or the Definitive Annoversary edition does not refund the cost of the base game which is already owned. Adding all DLC to cat is $378.65.\n\nThis is toxic behavior perpetuated by Ubisoft and / or Steam. I am not sure who is at fault here and I do not care. If Ubisoft calls the shots, Steam should not enable such deplorable behavior. I thought these bundles would complete my collection. They do not. This was unclear at best and deliberately misleading at worst.\n\nTL;DR: Corporate greed forced a refund request on my favorite city building franchise going back decades. I just want the full collection at a reasonable price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mandatory online ruined performance in game with significant fps drop after around 1 hr playing. And UBISOFT never fixed it or even bother to add offline support.\n\nIt's suggested to block the game accessing Internet in Windows Firewall for your life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is the only Ubisoft game that I own ( because I HATE Ubisoft and hope they go bankrupt ). I am considering uninstalling this as I don't see the need to have a Ubisoft account in order to play a game I purchased on Steam.\n\nOf all the Anno series, this is by far the best of them... but i  don't recommend it - because UBISOFT SUCK.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have to install a trash called \"Ubisoft Connect\" and register an account there without the option to opt out to just launch a single player mode in an already purchased game? Excuse me?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was fun , until i couldn't log into my ubisoft account and now i'm locked out of my own account until Ubisoft decides I can have access to the game I paid for on a totally different platform (Steam) . Don't strong arm your customers into using a platform that NOBODY wants to use. Shame on you Ubisoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a bad game, but  Ubisoft connect blocks you from starting the game every second or third attempt to re-re-re-re-re-re-re-check the product key. \r\n\r\nFFS. Just trust me bro, I've done nothing but give you my money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game 4/5, Ubisoft launcher 0/5. A lot of times I want to play the game but refrain because of the stupid launcher that wont work half the time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game may be great but ubisoft wouldn't let me reset my password as i have forgotten it from long ago. So basically im screwed unless i want to use another email account. thanks ubisoft\n\nbtw i requested to change it, the email never arrives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've really tried to like this game, but I have so many issues with the gameplay that have made this more stressful to play than enjoyable.\n\nFirstly, despite selecting the tutorial version, I did not actually receive much information about how to play the actual game. I could not work out how to make money consistently, and the game never told me. I eventually looked up how to make money online, as the game was so unclear about it. This made the early part of the game extremely difficult to play.\n\nMy other big issue is the juggling of multiple islands. I understand that you are meant to create trade routes and share your resources (again, the game did not tell me this, Google did) but it was very complex to manage, especially once you get to the New World. I was constantly swapping between the Old World and the New World, trying to keep up with pirate attacks, fires and time sensitive missions, and it very quickly became too much. \n\nOverall, this seemed like it should have been an excellent game, but it had too many moving parts to make it a pleasant experience. I found myself getting stressed that I couldn't keep up, which is a shame because I initially really liked the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ubisoft launcher sucks this is a single player game dont make me log into anything i hope ubisoft bankrupts",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Anno 1800 is a great, fantastic game. The problem is Ubisoft Connect. Other reviews have noted similar account issues (asking for a CD key, account linking issues, etc.), some of which I experienced. I felt compelled to write a review because I am having a different issue. I am unable to connect to Ubisoft's cloud service, which stalls out after the 5th retry and the service then refuses to launch the game if it can't connect.\n\nWhen you are able to get to the main menu, the game doesn't save your progress. Every time you launch the game, all of your progress is missing, all the first time playing pop-ups come back and all my setting modifications are gone. Every launch is like launching the game for the first time and I have to start over. \n\nThere may be a solution to this out there somewhere through a mod or some reddit post, but I shouldn't have to spend hours of my time trying to find a workaround for a major publisher's game platform.\n\nAnd of course you won't realize this until you've been playing the game for a few hours, and can't get the game refunded. So unless you plan on leaving your computer on for days at a time with the game running to be able to finish a game, you will have to start over every single time you play. Never buy Ubisoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have missed the part where I will need to have separate ubisoft launcher for this game...\nF ubisoft, I would return the game if it wasn't 5Euros in discount.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just like many of the other reviews here. Ubisofts greed to have your data and force you to use thier platform has caused me to refund the game. I purchased this during the sale, went to launch it and the game has linked itself to some random email that appears to be similar to my own (according to the support team) but they aren't able to rectify the issue apparently so screw Ubisoft and screw Steam for even allowing this account linking bs.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It would be nice if I could really play this game and leave a review, but Ubisoft Connect makes this game completely unplayable. My 7 hours ticked when the launcher running for the night. An guess what happened? Nothing )\r\nI may give a game another try another place another time, but for now - bye bye Ubisoft, do not expect me to buy your games again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game but the forced Ubisoft connect won´t let me play it, why does this company still exist OML",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Too much micromanagement, housing blocks completely separated from production chains, warfare is not fun on a scale larger than two ships, constantly changing requirements/optimalizations in mid/late game, constant distractions. No macro possible (I haven't found any way at least).\r\n\r\nI want to like the game, but there's just too many \"ooh, shiny\" things going on, and while you can ignore most of them, some are required.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is my first review, but would not recommend it.\n\nReasons:\n1) I bought the game on Steam. Before playing the game, you need to make an Ubisoft account and Requires you to have its platform. (Which they do not tell you, if you've never bought an Ubisoft game before.)\n2) The Ubisoft game requires logging into their platform EVERY TIME. Once you connect the game to their platform, you have to maintain access to that account. No exceptions.\n3) Its Tutorial is not good. For someone completely new to the game, it doesn't give assistance or clues that help further along the game. And Easy-mode is not easy.\n4) It takes up Way too much space.\n5) RIDICULOUSLY EXPENSIVE for the hassle it puts you through to install it. Even on sale.\n\nNow, don't get me wrong, the graphics are utterly gorgeous and the story is decent, but, would not recommend it to friends honestly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've just had a bad experience with Ubisoft support related to Steam and a Ubisoft Connect issue. All I'm getting is AI responses. I'm disappointed as someone who has over 800+ hours logged across 20+ Ubisoft games on console and PC. I won't be purchasing from Ubisoft anymore. They were one of my favorite game companies. But I'm just so tired of companies failing to act like caring humans anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game seems fun. I did some research and decided to play it, but the company seems to make it very user unfriendly at the beginning.\n\nWe have to download Ubisoft after launching the game, and I had to search online to know that we should \"cancel\" the CD key requested by Ubisoft and relaunch the game to actually get my game started. (Which I also found out the company Ubisoft has a bad reputation for cheesy designs and is hated by many gamers. Wonder why they still exist.)\n\nThen there's the 3 simple step intro that took me 2 hours to get through after going into my first campaign game:\n\nGetting dynamite from the lighthouse: you have to move to a certain angle (on the right side of the lighthouse) to be able to pick up dynamite.\n\nPicking up fish: took me quite a bit of time to know that my boat has to be on top of the fish and have them within my boat’s circle range to claim them.\n\nDeliver the fish: I'm still stuck on this step. I can’t get my boat near the home enough to deliver my fish, no matter which angle I try.\n\nAll these steps had no instructions, and it really shows the lack of care about your users when you can’t even guide them through trivial steps like this. Just came here from Wuthering Waves and felt a huge gap between user care. \n\nAt this point, I don’t even care about the money I spent, came in excited and left completely disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was a fun game until i changed my internet providers and i'm getting the run around from ubisoft to change my email address. for some reason i'm not getting the verfication emails they are sending out. Their customer service is a complete disservice to those that purchase their games. I would strongly advice people to not buy ubisoft products until they change their ways.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is pretty awful. Has horrible mechanics, finicky and just down right bad developing. Half the time you can't get roads built properly to connect to harbor. No units to control. Just bad. Hate hearing the lady talk all the time about bad stuff happening. Not clear on where your resources are going, so you are losing items, population growth is inconsistent. You build more houses and all needs are met but then still shortage on workers. You try to clear ruins, but if you have a shortage on workers it will pause the clearing but still cost you workers unless you physically go in and pause yourself, your workers will just be used to do absolutely nothing. Apparently. Horrible design. Boring, pathetic game. Waste of my time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is okay.\n\nBut its Ubisoft Connect launcher is pain in *. Before it's Uplay and now it's Ubisoft Connect? Losing my saving without any sync error alarm? OMG. This erring launcher just destroyed my interest in this game. \n\nI'm glad Ubisoft is facing bankruptcy. So many good IPs ruined in its hand.\n\n**2025/10/20 UPDATE** \nAfter 6 more hours game play, I LOST MY 2ND GAME SAVE. Thank you Ubisoft!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The actual game is 12/10. Ubisoft connect requirement ruins this game. Expect to spend 10+ minutes to get it to connect every time you try to play....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is my favorite Anno, the game itself is great, but Ubisoft breaks it. If their services are down you cannot play even though this is an offline game. I own this game, but end up just playing the pirated version out of convenience",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game doesn't work due to Ubisoft forcing their own, always-online launcher on us. \n\nRemove Ubisoft Connect.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It is pointless that Ubisoft force online access for you to just boot up the game...\n\nLove being forced to hotspot my phone just so I can play Anno at the airport while I wait for my flight.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "UBISOFT CONNECT is absolute trash. I cant start the game up... sad because I was enjoying it... if it wont start up I might just uninstall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At start, I was forced to create a third party account and to use some shitty launcher. That launcher also gave me a BSOD. And then on next start, it told me that I need an activation key code. I have no clue how someone can be as incompetent as these guys. I feel guilty for giving them any money. Also the launcher stays active even after closing the game, its icon is in the system tray.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has too much happening that needs to be micromanaged, the economy is brutal, and I cba to look up optimal building placement when I just want to build something that looks nice. I played the game vanilla with no DLC since I'm new to the franchise and wanted to learn. \n\nI feel punished for producing more resources than I need when trying to plan for a future population by penalising my economy since my own pop aren't buying enough of it, which leads to two issues. First, they trade for little and only sporadically passively with the AI and if I set up trade routes to those buying, there's good chance it will later not be wanted anymore. Second, when I do need more resources, I normally find out when I suddenly have less pop since, without telling me that I need to build more, I get penalised again since the people are unhappy and moving out reducing pop and leaving buildings empty of workers. \nThe graphs for pop and resource balance are wholly unexplained and as a new player to the franchise make no sense. I'm not sure if it's telling me I can support more pop or not, or if I'm overproducing/underproducing resources. My economy is either minorly stable or massively fluctuating when I unlock the next tier and begin upgrading and then I have the whole balancing act again. There's an interesting mechanic for the time it takes for buildings to produce outputs which was the only enjoyable thing I liked to manage. \n\nThen there's multi island + world management where it all becomes neglected for ages while I try sorting one of them out. \n\nIf you want to micro manage and look up optimal ways of layout building this might be the game for you. There is little QOL to help manage it all. I also hate that  buildings are hidden+locked until I tier up, then I need to rearrange everything each time. \n\nPlayed the game both in single and multiplayer with a friend. Both of us would not recommend unless you want to play a long and slow campaign instead. The newspaper occurs rarely in multiplayer too which is annoying if you have a negative article lasting for the entire time till the next one. Also, this is primarily not a combat driven game, though there are pirates and the need for some escorting you can get away with just some harbour mounted guns which are multiple times stronger.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you ever get a new pc and you try to play this game it will ask you for the CD key which is not provided by steam anymore and you wont be able to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was unable to actually get the game to boot, as Ubisoft connect couldn't get the CD Key. after an hour and a half of troubleshooting, I've gone to find something that doesn't run terrible Ubisoft DRM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My fucking game doesn't have an activation code. Where can I access it? I tried logging in and out of Ubisoft, but it didn't work. I tried logging in and out of Steam, but it didn't work. I tried deleting and reinstalling, but it didn't work. Since the activation code won't come to me with Vahi, fuck the mother and sister of such a system.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Have had to interact with Ubisoft account support for multiple reasons since purchasing, every time they were slow & ineffective. No surprise that wanting to hop on for a couple of hours on a rare day off, I'm instead stuck waiting for them again. This is why I no longer buy Ubisoft titles. If you want to play, look for another way.\n\nE: Now completely locked out of the launcher, cannot activate product. Typical Ubisoft DRM preventing access to a single player game. Definitely avoid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is extremely hard to get anything done. Ive never been able to get stuff done beyond act 2. It seems that the other characters in the game end up getting things done much faster than a player can. Completly disappointed. What game requires a business degree to play it?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I could I would give it a mixed review. love the concept but the controls of the game felt very clumsly and counterintuitive .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought at release, played a few hours, wasn't too impressed.  Came back to see if I should give this more of a shot.  $350 for all the DLC.  Seriously?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ive played the game for about 20+ hours now.  I didn't mind having to register and the game loads ok. The reason I cannot give this game a good review is there is no manual and the in game guide isn't detailed enough. It tells you what to do but not how to do it.  I first  ran out of workers then wood and then money. Messages came through thick and fast but as I didn't know how to do these things I became less and less  impressed with the game and eventually after everything came to a grinding halt I gave up. It looks pretty but I will go back to playing my other 20+ games that are much more enjoyable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried coming back to this on and off because this is in the realm of the games I prefer but this is absolutely one of the worst games I have ever played. It is extremely buggy and what does work tends to not make sense. in the 9 hours recorded, I have spent half of that paused and searching online how to fix the bugs. I'm done with it now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So much content locked behind a pay wall. \r\nUbisoft, you are scum.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty ... sure.     As someone that just started playing, it's not clear what and when you can upgrade something.  Doesn't really explain a lot of the chain that you're planning on following (which as someone that supposedly has an \"empire\" already built by his parents might understand what's necessary.  2 hours into playing the first time it already crashed.   I play on a top end machine with 64GB of ram, an Intel I9 14900 and a RTX 4080.  There's no reason this game should have crashed.  On top of that, it's forced online and forces you to create a UBI soft account, load their software, and have it running anytime you're in the game.  If you saw \"SINGLE PLAYER\" and was thinking, oh, I'll just play it like I play civilization.   NOPE.  You have to be connected to the internet.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Way to complicated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I almost enjoyed it. Shallow and shit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't get that cd key, they so make me hard to just playing this game :(",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cROSS PLATFORM IS A LIE IT WILL NOT PLAY WITH XBOX FROM PC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant even play the game i bought!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not friendly for new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring finnicky no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "me no likey",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hi everyone,\n\nThis is actually my first time leaving a comment about a game I bought. I’ve played Anno 1800 for 392 hours—yes, almost 400 hours—and from a technical standpoint, the game is great. Usually, I never leave reviews, even if I loved a game or hated it, but Ubisoft has really given me the courage to do so this time… mostly out of pure frustration 😅.\n\nHere’s the crazy part: I bought the game on Steam, but when I tried to play it, Steam automatically linked it to a Ubisoft account that is not mine (masked email j***g@outlook.com). According to Ubisoft Support, I cannot transfer the game to my account, and the only way to play is to recover this mysterious account that I never created. So apparently, my Steam purchase now belongs to a stranger in cyberspace… yay? 🤷♂️\n\nI just wanted to share this story because it seems to be a very unique and hilariously frustrating case, and maybe to warn anyone who wants to link Steam games with Ubisoft accounts: check twice, or you might end up gifting your game to a ghost account! 👻",
      "voted_up": false,
      "votes_helpful": 485
    },
    {
      "review": "Ubisoft game that requires logging into their platform. Once you connect the game to their platform, you have to maintain access to that account. I had an email deactivated, so I couldn't get into my account, and Ubisoft wouldn't even attempt to verify my identity, so I've lost access to the game.",
      "voted_up": false,
      "votes_helpful": 336
    },
    {
      "review": "Have bought the game with DLCs, enjoyed it quite a bit.\nBut then I had to move to another country and after that Ubisoft has stolen the game from me, can not play anymore despite the game being legitimately purchased.\nI call this the backwards piracy.\nNope.",
      "voted_up": false,
      "votes_helpful": 221
    },
    {
      "review": "I loved this game and owned it on steam, playing the 160 hrs. Once they forced the ubisoft loader into the equation I can  no longer access my account or this game. Don't buy this wonderful game, fly the high seas. Ubisoft can eat its own ass.",
      "voted_up": false,
      "votes_helpful": 174
    },
    {
      "review": "Sure, this game has it's quirks, mostly UI and gameplay related (the grid layout hurts my brain) \n\nBut Ubisoft connect turns a good review to a bad one. \n\nWant to play Anno 1800? Guess what, Ubisoft Connect is down... and you can't.\n\nWhy wouldn't this game use Steam services for downloads/multiplayer etc? Because Ubisoft. Whatever title is slightly enjoyable from this studio is tainted and ruined by thier garbage online services (Black Flag Kenways Fleet anyone?).",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Can't play the game without creating a mandatory ubisoft account and install Ubisoft Connect. There is no point on that. Shame on you",
      "voted_up": false,
      "votes_helpful": 88
    },
    {
      "review": "Imagine a company preventing you from playing a game you purchased because it's selfish enough to force a parasitic login system onto players, but too incompetent to create a functional account creation application.\r\n\r\nI eagerly await the day when Ubisoft finally collapses under its rotten management.",
      "voted_up": false,
      "votes_helpful": 55
    }
  ]
}