{
  "positive": [
    {
      "review": "Age of Empires III was a very different experience for me. I came into it with years of love for the older titles, especially AOE II, so the shift in style and mechanics took time to adjust to. The gameplay moves away from the classic medieval setting and introduces a new direction with home cities, shipments, and a more scripted feel. It did not give me the same excitement that the earlier games gave, and some parts just did not connect with me the way I hoped.\r\n\r\nThat said, I still recommend trying it. It is not a bad game at all. It is simply different. Some players enjoy the changes, and some do not. The visuals look great for the time, the animations are smooth, and the setting around the colonial era is interesting. The campaigns are well made and tell good stories. The home city system adds a unique layer of strategy, and if you get into it, the game can be quite addictive.\r\n\r\nThe reason I still recommend it is that AOE III has its own identity. It is not trying to be AOE II or AOE I. It takes the franchise in a new direction. Some people absolutely love that, and some people prefer the classic style. You may or may not enjoy it, but it is definitely worth trying at least once, especially if you are a fan of the series.\r\n\r\nFor me, it sits below AOE II, but it is still a solid entry in the franchise and a game that deserves a fair chance.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "insane learning curve but very fun,attrocius ram requriments",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best rts games there has ever been, I have logged well over 1000 hours on all versions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Players and servers are trash, but its a pretty solid game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Age of Empires III: Definitive Edition is a beautifully restored strategy classic that feels better than ever. updated visuals are vibrant, animations are smooth, and  refined UI makes every match easier to enjoy. Civilisations feel unique and fun to experiment with, and rebalanced gameplay breathes new life into both single-player and multiplayer.\n\nIt’s still the same beloved AoE3 at its core.... now cleaner, sharper, and far more modern. A lovely upgrade that respects the original while fixing its rough edges.\n\nRating: 7.9/10 — A gorgeous, polished revival of a great RTS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game but the oponents are sweating the shit out of they're brains on some people that are playing the game for the first time. Would be cool if voice chat would be added",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I decided to finally play this masterpiece strategy game again, with better graphic.\nWhat can i say, for me , Age of Empires series if one of the best . \nEvery time i come back to this, always lighting up my heart and bring back my childhood memories.\nThe newer version have more game modes, factions , challenges . \nDefinitely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The classic bones of age of empires that make it one of the best RTSs. Despite the major differences with the rest in a great series, its one of my favorite games of all time. Despite the recent neglect from the developers, the community develops new metas and keeps the game fresh in matchups online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a good game back in the day, its nice to see the Age Of Empires franchise still receiving updates after all these years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story line, strategic, will be playing the expansions history set next, cant wait, big fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for an RTS with a recent setting which also has modern graphics, this is the one for you. Action packed, with rarely any dull moments. Loads of depth if you want to get into specific builds, with the novel shipment mechanic adding a fun layer of unpredictability to your gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Age Of Empires to this day I love how its based around the colonial imperial empire era and is just a absolute blast to play everyone who likes strategy games needs to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game... Well worth a go if you are a classic RTS fan...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is so fun and the first game I ever got addicted to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a solid game, I love the improvement over the original but I was hoping to see more campaign content. HIstorical battles are all paywalled by DLC as well which sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is my all time favorite rts, great music and game play. i highly recommend playing if you like rts games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only Age of Empires game to shut down future development, yet it is the best one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic to enjoy with a group session. This game will bring the best or the worst out of each other. still prefer number 2 overall but this is still worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good remastered so you can play this game multiplayer with matchmaking and ranking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have so much fun playing this game with friends, everyone should get it. you can find it for only a couple bucks as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game back when it was the Asian Dynasties. I was addicted to it helplessly and i've decided to return to that timeless masterpiece after quite some time. I love the stuff that was added over the years and the fact that AoE3 has finaly gotten the attention it deserves. Even if, currently it's getting neglected. \n\nSome advices:\n\nIf youre a AoE2 player, expect the game to differ from what you're used to. You'll essentialy have to learn to play AoE from scratch.  Some things such as gathering resources get done by the vils getting their resources instantly without returning to the TC, it has  trade, monopoly plots and natives with which you can form an alliance with, treasures and of course, the infamous home city where you take upgrades and units for free after some time. Of course, not evertything can be covered here. But expect a vastly different experience when playing AoE3. \n\nFor new players, what i advise is to take it slow. AoE3 is a complex game with complex mechanics and flexible strategy, You'll have to explore the map, to find out the cons and pros of each military unit you'll send to the front. How to build your colony correctly, how to manage your economy, etc etc. It takes time, practise with skirmishes and with the campaign mode which the game comes with, finishing the art of war wouldn't hurt as well. it will help you understand the mechanics of the game well enough so you could increase the difficulty of your games and, potentialy win a game or two online. Just know that it will be a long process. \n\nAnd if you're returning after a break like i did? Play some skirmishes and find out the new juicy stuff that was added. You'll come around quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I'm glad it was re-released. I used to play it with gameranger, but it's much more stable now with this update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great rts with active multiplayer +ranked que's. worth it breeeh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is quite good, maps look pretty, physics are good and battles are satisfying. But the lack of new content, the fact that campaign structure can't be compared with AoE2 and woke overhaul that puts DE apart from the original are serious shortcomings.  I wish it had more campaigns structured like in AoE2.  Nevertheless I still recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slightly addictive, good way to lose a few hrs.\r\nCan be tedious after a while so don't play it too much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☑ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☑ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, too bad the developers dropped support without fixing existing bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun! slightly historical.  hard to find important characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can play as the United States and fight Mexico so they won't send drug boats in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love its in-depth history lesson, with its interaction overlay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Superb strategy game, far better than turn-based strategy games. I have been playing this games (older and current versions) since many years. And no game has come to this liking level for longest period of time, Best thing is, the game is playable multiple no of times. \r\nCheat trick: You can activate cheat codes, simple ones and add to level of difficulty and enjoyment of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "אני משחק בAOE מאז שאני בן 10, יש לי את כל הDLC, זה משחק האסטרטגיה היחיד שאני אוהב, יש בו המון אופציות, אבל המשחק מאוזן, ובעצם כל \"מדינה\" יש לך כמה דרכים לשחק את המשחק, וזה עושה עוד יותר מעניין, אני ממליץ בחום",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like playing against the computer, that way I can win more.\r\nPlease Post any other good startegy games with this fearure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My father is a history nerd. Was an officer in the army, would play this shit all day. got me hooked, think its better thn 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What kind of binturong is this? This is a bintulengua from mexico, it is a very strong and has a sharp teeth and smells like  a buttered popcorn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This takes the classic formula of AoE but set in the coolest time in history with guns and swords and ships and samurai and pirates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exciting play but needs more guids to help improved play and enjoyment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a student who constantly studies in his free time now I no longer even studying because of my friend introducing me to this. 10/10 please play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game that still holds up after all these years!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant and one of the best real time strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and good for all levels of play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More things to do than 2 , better than 4. Just underrated  all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just like the previous version that I've been playing when I was young.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My childhood game, and I just love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Return and remade version of this awesome game I've played since my childhood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Спасибо разработчикам за возможность воссоздать нигерский диктат",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but some civs are lame for late game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Always loved it. Played it when it first came out as a kid. As good as always",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thougt it was not for me but actually its more fun than aoe II",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly good AI for an older game.... Have fun!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a classic RTS, what else to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, wish they could come out with more dlc!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE THE MUSIC AND GENERAL VIBES. PLAYED SINCE 07 WITH THE FAM. STILL TOP 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game not age of empire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic fun that you know and love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play whith friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good setting for an age game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its very good and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic as all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It will take ages to finish the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent experience overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me the game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best strategy game trilogy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have played with my 8 friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good experience on battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "where are the monthly explorer skins bruv?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play the game and give it some time you will love it !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my preferred version of Age of Empires.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the classic feel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires III Definitive Edition greets you like a comfy old bear rug that somehow learned new tricks as you build towns, fling armies across maps and watch upgraded visuals sparkle while you pretend you understand economy management. The revamped graphics and smoother controls make classic skirmishes feel fresh and the historical campaigns still charm. The only real gripe is that some balance quirks and occasional AI weirdness pop up but they barely nibble at the fun like a polite cub. A warm pick for anyone who loves classic RTS comfort with modern polish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best AOE game of all time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "old but gold !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool ig I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game baller af",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W FUN GAME COOP WITH FRIENDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the AoE series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its age of empire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best RTS game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "noice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just like i remember same but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game, im so gay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BİR ÖLÜR BİN DİRİLİRİZ🐺🐺🐺",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it alot.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is not the best that Age of Empires III has to offer.\nSure, it looks nicer, it's got some more content than the retail version, but overall, this is not the way to get the true Age of Empires III experience.\n\nCampaigns from the original game were butchered, especially the ones involving John Black and Chayton Black. Mentions of Kanyenke were haphazardly chopped up to reflect his new name of Kanien, instead of bringing actors back to re-record. Mentions of the word \"Iroquois\" and \"Sioux\" were just outright deleted. The entire involvement of Nohnakee in Act II: Ice has been eradicated. Act II: Smoke was almost completely rewritten, removing historical characters and events in favor of even more fantasy.\n\nNew and changed civilizations lack the polish and care that went into the originals. To use an original civ as an example, British units that unlock later in the game speak more-modern English than units unlocked earlier; Ensemble in 2007 actually cared to include this detail to reflect the passage of time.\nBut then look at the United States, where the villagers are voiced by a text-to-speech machine instead of an actual actor. \nOr the revised Iroquois and Sioux, whose villagers (especially female) are voiced by non-actors with terrible delivery that's genuinely painful to listen to. Sure, the dialogue is more accurate to the language, but  \nOr the Italians, whose female villagers use masculine nouns to refer to themselves when assigned to gather resources, because nobody involved in that process cared enough to make any attempt to understand how the Italian language works.\n\nAnd that's before bringing in all the random changes that amount to nothing more than pandering - plantations are now estates, even though most of the civilizations who have access to them did not have the concept of the aristocratic estate. Fire pits became community plazas, but are still used to perform magic and summon units, while villagers tasked to the plaza perform practically no animations. Native civs use tribal marketplaces instead of being able to mine coin directly, but again do not have any substantial animations for working them. Especially egregious is the fact that the Iroquois and Sioux had their voice lines revised entirely, but the Aztecs - a people who no longer exist - were entirely untouched from their original version. Why? Because no Aztecs are alive today to complain, but there are living Iroquois and Sioux.\n\nMany of the changes were dressed up as favoring historical accuracy. \nBut then, why not change the Aztecs?\nWhy is the new flag for the Germans now the flag of the Holy Roman Empire, even though the civ represents the Kingdom of Prussia? Its face is Frederick the Great, Prussian King-Elector, never Holy Roman Emperor.\nWhy is the new flag for the Russians the tricolor? Sure, the double-headed eagle flag they had in 2007 wasn't historically accurate for Ivan the Terrible either, but the tricolor is now even further outside of his time period.\nWhy is the capital of the United States in Washington? The personality for the civ is Washington himself, but the home city is a place that did not exist in his lifetime. Campaign variants of the US correctly portrayed the home city as Philadelphia.\n\nAge of Empires III is a great game for sure. This version is also the only way now to play online multiplayer, now that Ensemble Online is dead. It has a lot of good balance changes, but overall, this is not the best version of the game. The best version of the game, especially for campaign-focused play, will always be the 2007 original.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "Bad game overall, developers doesnt even care with the game anymore. Bugs not fixed, no more patch, bad matchmaking. imagine you are a new player for the multiplayer and always got high rated player as ur opponent",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The more you dig into developement of AoE3DE the more depressing the rabbit hole is.\nNeglectful developement, unfixed problems, pointless changes from original aoe3(2007) including historical censorship or avoiding offending native groups, barely any updates, cancelled DLCs, Hardest AI not being able to use walls and is insanely dogshit on maps where it is separated from player with body of water.\nWhole argument of game \"not being worth upkeeping\" while holding better than Age of Mythology Retold (2024)\n\n[spoiler]...Or straight up failing at removing certain banned words like \"colony\" proving how campaign was completly ignored in DE version expect in paternalizm of 2 native groups and removal of historical characters(Crazy Horse)\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3457231629 \n[/spoiler]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a nice breath of fresh air if you enjoy AOE2/AOE4 and want something a little different. But I'm going to advise people stay away from this. Somehow the DE has bugs and issues that weren't in the original and that haven't been patched despite being reported as far back as 2021. How do you screw up attack move in an RTS?\n\nAnyway the game is abandoned so unless you're into modding the game I don't think it's worth the price point. Get it for like €5 on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really loved the original seen a sale and figured I'd get a upgraded version to play. \r\n\r\nUnfortunately instead of enjoyment I got frustration it crashes in the middle of playing constantly. Its hardly worth playing.\r\n\r\nGraphics are a little better but god how is this game that big???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game but it has some issues. No autosave in single player games meaning when it crashes (and it happens quite often) I lose 30+min of progress. Also, manually saving and loading will disable your XP gain so your home town doesn't level up. In the past you would unlock cards by leveling up but now leveling up is useless, you get all the cards from the start. Other than this, pretty solid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "since two months game is crashing while playing. Please resolve this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting stopped every in middle of the game - cant complete even a single game fully",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot that's very good and very fun about this game (I've played past versions and the original release, a lot more than just the 17hrs on record) but there's something just sort of [i]wrong[/i] with the AI in regular skirmish? It's fun to sit down with the homies and fight a bunch of amped up difficulty AI, but in AOEIII:DE, the AI doesn't really [i]fight[/i] you or your army. They will literally march huge columns of troops right by your own attack forces, often letting you get some free volleys in before they decide they should probably fight but even then 2/3rds of them will continue to make a beeline to your base (Or often, a trading post). They aren't particularly smart or clever like AOEII:DE AI, often just hugging your walls and walking along them not fighting and just letting you blast away.\n\nIf you're not doing mostly vs. AI it's an easy recommendation, especially the campaign/scenarios where the AI [i]will[/i] fight you because they're scripted to do it. But for my use case the AI just doesn't participate in actually fighting, instead beelining at your town center or a trade post (even if it's in your backline) and just letting you whittle down their troops without really doing anything about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is a lot of lag on server multy player dont play online ! you just get suffer from lag",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super lag, these game have a diff power of nation which have to pay to play like American, Mexico,... to another nation. If someone call this game is pay to win I will agree!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This piece of shit game lags like if I was playing cyberpunk 2077 with ray tracing at 8k an error that seems to have decades and Microsoft dont fix it, uninstalling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microsoft really dropped the ball on the menu design of this game. It just doesn't have the aesthetic charm that Ensemble Studios created in 2007. In that version, even the loading bars were ornate. You don't get that in this version. The \"definitive\" aspect is a windows 11 style artwork mixed with high res png textures of fake wood planks for a background. There is other worse things, but this is my main gripe.\nThose that turn cathedrals into cubicles have no share in heaven.\n\nLook how they massacred my boy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for many hours on two PCs, constantly stutters and has crashed a few times on both.\r\n\r\nAnnoying building of bases where walls are difficult to place and can be shot through so are almost pointless to use.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very bad, I have up to 10 seconds lag spikes on a modern pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps crashing on startup",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No matter what CPU you have or what your RAM is, they won't be enough to handle large battles. There are times i get as low as 2 FPS or 10+ seconds of freeze in 4v3 battlefields with a Ryzen 7 5800H and 32GB of RAM. I don't know what they did to original so it became this difficult to handle. This is the sole reason I don't recommend buying it and sticking with the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ahhhh, too different and too ugly compaired to AOE 2. Why couldn't they just keep the style but add all the new features. I may only have 8 minutes of play time, but I cant bare playing any more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhhhhhh, not a fan. AOE 2 just blows this game out of the water.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels dated and doesn't have the same appeal as AOE 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring with game play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this game over 50GB in size?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What is this stuttering ?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New devs owning AoE franchise are ass garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unbalanced af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this the ‘Definitive Edition’ is optimistic. They changed original content (including some native factions), hid native gold mining behind a building that isn’t even called a mine, and the miners themselves don’t animate - they just stare into the void like they’ve seen things. Same deal with the old firepit mechanic: a whole crowd of workers standing still like they’re posing for a Washington Commanders photo shoot. Add to that: new factions, new modes, new features… all sold separately. Definitive? Not really. The definitive edition was the complete collection they recently retired on Steam. This is more like a half-assed remaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abandonware",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "zzzz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the best that Age of Empires III has to offer.\nSure, it looks nicer, it's got some more content than the retail version, but overall, this is not the way to get the true Age of Empires III experience.\n\nCampaigns from the original game were butchered, especially the ones involving John Black and Chayton Black. Mentions of Kanyenke were haphazardly chopped up to reflect his new name of Kanien, instead of bringing actors back to re-record. Mentions of the word \"Iroquois\" and \"Sioux\" were just outright deleted. The entire involvement of Nohnakee in Act II: Ice has been eradicated. Act II: Smoke was almost completely rewritten, removing historical characters and events in favor of even more fantasy.\n\nNew and changed civilizations lack the polish and care that went into the originals. To use an original civ as an example, British units that unlock later in the game speak more-modern English than units unlocked earlier; Ensemble in 2007 actually cared to include this detail to reflect the passage of time.\nBut then look at the United States, where the villagers are voiced by a text-to-speech machine instead of an actual actor. \nOr the revised Iroquois and Sioux, whose villagers (especially female) are voiced by non-actors with terrible delivery that's genuinely painful to listen to. Sure, the dialogue is more accurate to the language, but  \nOr the Italians, whose female villagers use masculine nouns to refer to themselves when assigned to gather resources, because nobody involved in that process cared enough to make any attempt to understand how the Italian language works.\n\nAnd that's before bringing in all the random changes that amount to nothing more than pandering - plantations are now estates, even though most of the civilizations who have access to them did not have the concept of the aristocratic estate. Fire pits became community plazas, but are still used to perform magic and summon units, while villagers tasked to the plaza perform practically no animations. Native civs use tribal marketplaces instead of being able to mine coin directly, but again do not have any substantial animations for working them. Especially egregious is the fact that the Iroquois and Sioux had their voice lines revised entirely, but the Aztecs - a people who no longer exist - were entirely untouched from their original version. Why? Because no Aztecs are alive today to complain, but there are living Iroquois and Sioux.\n\nMany of the changes were dressed up as favoring historical accuracy. \nBut then, why not change the Aztecs?\nWhy is the new flag for the Germans now the flag of the Holy Roman Empire, even though the civ represents the Kingdom of Prussia? Its face is Frederick the Great, Prussian King-Elector, never Holy Roman Emperor.\nWhy is the new flag for the Russians the tricolor? Sure, the double-headed eagle flag they had in 2007 wasn't historically accurate for Ivan the Terrible either, but the tricolor is now even further outside of his time period.\nWhy is the capital of the United States in Washington? The personality for the civ is Washington himself, but the home city is a place that did not exist in his lifetime. Campaign variants of the US correctly portrayed the home city as Philadelphia.\n\nAge of Empires III is a great game for sure. This version is also the only way now to play online multiplayer, now that Ensemble Online is dead. It has a lot of good balance changes, but overall, this is not the best version of the game. The best version of the game, especially for campaign-focused play, will always be the 2007 original.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "I have mixed feelings about this version.\nThere are graphical improvements and new civilizations, but the game is already sold out.\nThere are very few players in multiplayer. And the developers aren't there, and they're not expected to be.\nIt seems that everything existing and related to the AoE series solely depends on AoE II.\nA shame, really.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game is horribly optimized, i have a decent pc that can push a good graphics and this game with certain maps and civs, it starts to stutter or freeze a lot.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Bad game overall, developers doesnt even care with the game anymore. Bugs not fixed, no more patch, bad matchmaking. imagine you are a new player for the multiplayer and always got high rated player as ur opponent",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "so, i played for about 25hrs...and it was quite good, though there were some missions that were a bit bad or randomly too hard for no reason...then i got to the morristown mission in the 2nd campaign and it started freezing very frequently for 2-5m each time, so like 70-80% of the time i was playing was freezes, then managed to finish that mission and the cards bit froze a couple times too, and then the next mission it kept freezing too...so i stopped playing it altogether as it was too annoying to play, esp after i looked it up and it sounds like i was lucky so far in not having problems, and that it's well known that there's masses of problems in the 2nd and 3rd campaigns!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more you dig into developement of AoE3DE the more depressing the rabbit hole is.\nNeglectful developement, unfixed problems, pointless changes from original aoe3(2007) including historical censorship or avoiding offending native groups, barely any updates, cancelled DLCs, Hardest AI not being able to use walls and is insanely dogshit on maps where it is separated from player with body of water.\nWhole argument of game \"not being worth upkeeping\" while holding better than Age of Mythology Retold (2024)\n\n[spoiler]...Or straight up failing at removing certain banned words like \"colony\" proving how campaign was completly ignored in DE version expect in paternalizm of 2 native groups and removal of historical characters(Crazy Horse)\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3457231629 \n[/spoiler]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a nice breath of fresh air if you enjoy AOE2/AOE4 and want something a little different. But I'm going to advise people stay away from this. Somehow the DE has bugs and issues that weren't in the original and that haven't been patched despite being reported as far back as 2021. How do you screw up attack move in an RTS?\n\nAnyway the game is abandoned so unless you're into modding the game I don't think it's worth the price point. Get it for like €5 on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really loved the original seen a sale and figured I'd get a upgraded version to play. \r\n\r\nUnfortunately instead of enjoyment I got frustration it crashes in the middle of playing constantly. Its hardly worth playing.\r\n\r\nGraphics are a little better but god how is this game that big???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game but it has some issues. No autosave in single player games meaning when it crashes (and it happens quite often) I lose 30+min of progress. Also, manually saving and loading will disable your XP gain so your home town doesn't level up. In the past you would unlock cards by leveling up but now leveling up is useless, you get all the cards from the start. Other than this, pretty solid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "since two months game is crashing while playing. Please resolve this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting stopped every in middle of the game - cant complete even a single game fully",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot that's very good and very fun about this game (I've played past versions and the original release, a lot more than just the 17hrs on record) but there's something just sort of [i]wrong[/i] with the AI in regular skirmish? It's fun to sit down with the homies and fight a bunch of amped up difficulty AI, but in AOEIII:DE, the AI doesn't really [i]fight[/i] you or your army. They will literally march huge columns of troops right by your own attack forces, often letting you get some free volleys in before they decide they should probably fight but even then 2/3rds of them will continue to make a beeline to your base (Or often, a trading post). They aren't particularly smart or clever like AOEII:DE AI, often just hugging your walls and walking along them not fighting and just letting you blast away.\n\nIf you're not doing mostly vs. AI it's an easy recommendation, especially the campaign/scenarios where the AI [i]will[/i] fight you because they're scripted to do it. But for my use case the AI just doesn't participate in actually fighting, instead beelining at your town center or a trade post (even if it's in your backline) and just letting you whittle down their troops without really doing anything about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is a lot of lag on server multy player dont play online ! you just get suffer from lag",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "super lag, these game have a diff power of nation which have to pay to play like American, Mexico,... to another nation. If someone call this game is pay to win I will agree!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This piece of shit game lags like if I was playing cyberpunk 2077 with ray tracing at 8k an error that seems to have decades and Microsoft dont fix it, uninstalling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microsoft really dropped the ball on the menu design of this game. It just doesn't have the aesthetic charm that Ensemble Studios created in 2007. In that version, even the loading bars were ornate. You don't get that in this version. The \"definitive\" aspect is a windows 11 style artwork mixed with high res png textures of fake wood planks for a background. There is other worse things, but this is my main gripe.\nThose that turn cathedrals into cubicles have no share in heaven.\n\nLook how they massacred my boy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for many hours on two PCs, constantly stutters and has crashed a few times on both.\r\n\r\nAnnoying building of bases where walls are difficult to place and can be shot through so are almost pointless to use.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very bad, I have up to 10 seconds lag spikes on a modern pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps crashing on startup",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No matter what CPU you have or what your RAM is, they won't be enough to handle large battles. There are times i get as low as 2 FPS or 10+ seconds of freeze in 4v3 battlefields with a Ryzen 7 5800H and 32GB of RAM. I don't know what they did to original so it become this difficult to handle. This is the sole reason I don't recommend buying it and sticking with the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ahhhh, too different and too ugly compaired to AOE 2. Why couldn't they just keep the style but add all the new features. I may only have 8 minutes of play time, but I cant bare playing any more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhhhhhh, not a fan. AOE 2 just blows this game out of the water.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels dated and doesn't have the same appeal as AOE 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring with game play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this game over 50GB in size?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What is this stuttering ?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New devs owning AoE franchise are ass garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unbalanced af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this the ‘Definitive Edition’ is optimistic. They changed original content (including some native factions), hid native gold mining behind a building that isn’t even called a mine, and the miners themselves don’t animate - they just stare into the void like they’ve seen things. Same deal with the old firepit mechanic: a whole crowd of workers standing still like they’re posing for a Washington Commanders photo shoot. Add to that: new factions, new modes, new features… all sold separately. Definitive? Not really. The definitive edition was the complete collection they recently retired on Steam. This is more like a half-assed remaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "zzzz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the best that Age of Empires III has to offer.\nSure, it looks nicer, it's got some more content than the retail version, but overall, this is not the way to get the true Age of Empires III experience.\n\nCampaigns from the original game were butchered, especially the ones involving John Black and Chayton Black. Mentions of Kanyenke were haphazardly chopped up to reflect his new name of Kanien, instead of bringing actors back to re-record. Mentions of the word \"Iroquois\" and \"Sioux\" were just outright deleted. The entire involvement of Nohnakee in Act II: Ice has been eradicated. Act II: Smoke was almost completely rewritten, removing historical characters and events in favor of even more fantasy.\n\nNew and changed civilizations lack the polish and care that went into the originals. To use an original civ as an example, British units that unlock later in the game speak more-modern English than units unlocked earlier; Ensemble in 2007 actually cared to include this detail to reflect the passage of time.\nBut then look at the United States, where the villagers are voiced by a text-to-speech machine instead of an actual actor. \nOr the revised Iroquois and Sioux, whose villagers (especially female) are voiced by non-actors with terrible delivery that's genuinely painful to listen to. Sure, the dialogue is more accurate to the language, but  \nOr the Italians, whose female villagers use masculine nouns to refer to themselves when assigned to gather resources, because nobody involved in that process cared enough to make any attempt to understand how the Italian language works.\n\nAnd that's before bringing in all the random changes that amount to nothing more than pandering - plantations are now estates, even though most of the civilizations who have access to them did not have the concept of the aristocratic estate. Fire pits became community plazas, but are still used to perform magic and summon units, while villagers tasked to the plaza perform practically no animations. Native civs use tribal marketplaces instead of being able to mine coin directly, but again do not have any substantial animations for working them. Especially egregious is the fact that the Iroquois and Sioux had their voice lines revised entirely, but the Aztecs - a people who no longer exist - were entirely untouched from their original version. Why? Because no Aztecs are alive today to complain, but there are living Iroquois and Sioux.\n\nMany of the changes were dressed up as favoring historical accuracy. \nBut then, why not change the Aztecs?\nWhy is the new flag for the Germans now the flag of the Holy Roman Empire, even though the civ represents the Kingdom of Prussia? Its face is Frederick the Great, Prussian King-Elector, never Holy Roman Emperor.\nWhy is the new flag for the Russians the tricolor? Sure, the double-headed eagle flag they had in 2007 wasn't historically accurate for Ivan the Terrible either, but the tricolor is now even further outside of his time period.\nWhy is the capital of the United States in Washington? The personality for the civ is Washington himself, but the home city is a place that did not exist in his lifetime. Campaign variants of the US correctly portrayed the home city as Philadelphia.\n\nAge of Empires III is a great game for sure. This version is also the only way now to play online multiplayer, now that Ensemble Online is dead. It has a lot of good balance changes, but overall, this is not the best version of the game. The best version of the game, especially for campaign-focused play, will always be the 2007 original.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "I have mixed feelings about this version.\nThere are graphical improvements and new civilizations, but the game is already sold out.\nThere are very few players in multiplayer. And the developers aren't there, and they're not expected to be.\nIt seems that everything existing and related to the AoE series solely depends on AoE II.\nA shame, really.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game is horribly optimized, i have a decent pc that can push a good graphics and this game with certain maps and civs, it starts to stutter or freeze a lot.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Bad game overall, developers doesnt even care with the game anymore. Bugs not fixed, no more patch, bad matchmaking. imagine you are a new player for the multiplayer and always got high rated player as ur opponent",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "so, i played for about 25hrs...and it was quite good, though there were some missions that were a bit bad or randomly too hard for no reason...then i got to the morristown mission in the 2nd campaign and it started freezing very frequently for 2-5m each time, so like 70-80% of the time i was playing was freezes, then managed to finish that mission and the cards bit froze a couple times too, and then the next mission it kept freezing too...so i stopped playing it altogether as it was too annoying to play, esp after i looked it up and it sounds like i was lucky so far in not having problems, and that it's well known that there's masses of problems in the 2nd and 3rd campaigns!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more you dig into developement of AoE3DE the more depressing the rabbit hole is.\nNeglectful developement, unfixed problems, pointless changes from original aoe3(2007) including historical censorship or avoiding offending native groups, barely any updates, cancelled DLCs, Hardest AI not being able to use walls and is insanely dogshit on maps where it is separated from player with body of water.\nWhole argument of game \"not being worth upkeeping\" while holding better than Age of Mythology Retold (2024)\n\n[spoiler]...Or straight up failing at removing certain banned words like \"colony\" proving how campaign was completly ignored in DE version expect in paternalizm of 2 native groups and removal of historical characters(Crazy Horse)\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3457231629 \n[/spoiler]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a nice breath of fresh air if you enjoy AOE2/AOE4 and want something a little different. But I'm going to advise people stay away from this. Somehow the DE has bugs and issues that weren't in the original and that haven't been patched despite being reported as far back as 2021. How do you screw up attack move in an RTS?\n\nAnyway the game is abandoned so unless you're into modding the game I don't think it's worth the price point. Get it for like €5 on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly this game is not optimized for modern hardware, you wont be able to hit 60 fps probably if you have foliage or water set to high, same applies for high end rigs.\nGame is suffering with fps drops and lag. Too bad, i remeber this problem when DE version released and still not fixed (5 years passed)!\nThis game is abandonware. Better play 2007 version aoe3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 3 restarts in campaign mission one, i must say that easy is not easy. Quit is the only option. So i must say, what was a joy downloading, was definately not my time worth. thanks for ruining my experience. gl to yall playing this \"pretty\" bad game .\n- As a child i just played and had fun. as an adult. i felt like a looser. which is why I now choose to delete the game - and i will never play this shit again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game but it has some issues. No autosave in single player games meaning when it crashes (and it happens quite often) I lose 30+min of progress. Also, manually saving and loading will disable your XP gain so your home town doesn't level up. In the past you would unlock cards by leveling up but now leveling up is useless, you get all the cards from the start. Other than this, pretty solid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "since two months game is crashing while playing. Please resolve this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting stopped every in middle of the game - cant complete even a single game fully",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot that's very good and very fun about this game (I've played past versions and the original release, a lot more than just the 17hrs on record) but there's something just sort of [i]wrong[/i] with the AI in regular skirmish? It's fun to sit down with the homies and fight a bunch of amped up difficulty AI, but in AOEIII:DE, the AI doesn't really [i]fight[/i] you or your army. They will literally march huge columns of troops right by your own attack forces, often letting you get some free volleys in before they decide they should probably fight but even then 2/3rds of them will continue to make a beeline to your base (Or often, a trading post). They aren't particularly smart or clever like AOEII:DE AI, often just hugging your walls and walking along them not fighting and just letting you blast away.\n\nIf you're not doing mostly vs. AI it's an easy recommendation, especially the campaign/scenarios where the AI [i]will[/i] fight you because they're scripted to do it. But for my use case the AI just doesn't participate in actually fighting, instead beelining at your town center or a trade post (even if it's in your backline) and just letting you whittle down their troops without really doing anything about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is a lot of lag on server multy player dont play online ! you just get suffer from lag",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the orginal to bits but i just cant suggest people buy this one, its poorly optimsied years later stutter in skirmish modes and freezes in menu such a shame too.\n\nalso the SCUMBAGS made sure you cant refund this game by letting you get the demo and using the base game as dlc so that way steam wont allow you to refund it. scumbags.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "super lag, these game have a diff power of nation which have to pay to play like American, Mexico,... to another nation. If someone call this game is pay to win I will agree!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really loved the original seen a sale and figured I'd get a upgraded version to play. \r\n\r\nUnfortunately instead of enjoyment I got frustration it crashes in the middle of playing constantly. Its hardly worth playing.\r\n\r\nGraphics are a little better but god how is this game that big???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This piece of shit game lags like if I was playing cyberpunk 2077 with ray tracing at 8k an error that seems to have decades and Microsoft dont fix it, uninstalling.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microsoft really dropped the ball on the menu design of this game. It just doesn't have the aesthetic charm that Ensemble Studios created in 2007. In that version, even the loading bars were ornate. You don't get that in this version. The \"definitive\" aspect is a windows 11 style artwork mixed with high res png textures of fake wood planks for a background. There is other worse things, but this is my main gripe.\nThose that turn cathedrals into cubicles have no share in heaven.\n\nLook how they massacred my boy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for many hours on two PCs, constantly stutters and has crashed a few times on both.\r\n\r\nAnnoying building of bases where walls are difficult to place and can be shot through so are almost pointless to use.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They took a classic game and ruined it with stupid \"modern\" gimmicks like \"whats new?\" pop ups and even a weekly pop up nagging you to change your profile picture.  Complaining about it on the official forums for these reasons in a civilized manner got me banned for my opinion.  I don't want pop ups to appear on my web browser and I sure as hell don't want them in the software I use for \"entertainment\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very bad, I have up to 10 seconds lag spikes on a modern pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps crashing on startup",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ahhhh, too different and too ugly compaired to AOE 2. Why couldn't they just keep the style but add all the new features. I may only have 8 minutes of play time, but I cant bare playing any more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No matter what CPU you have or what your RAM is, they won't be enough to handle large battles. There are times i get as low as 2 FPS or 10+ seconds of freeze in 4v3 battlefields with a Ryzen 7 5800H and 32GB of RAM. I don't know what they did to original so it became this difficult to handle. This is the sole reason I don't recommend buying it and sticking with the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehhhhhhh, not a fan. AOE 2 just blows this game out of the water.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels dated and doesn't have the same appeal as AOE 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring with game play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this game over 50GB in size?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What is this stuttering ?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New devs owning AoE franchise are ass garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unbalanced af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Calling this the ‘Definitive Edition’ is optimistic. They changed original content (including some native factions), hid native gold mining behind a building that isn’t even called a mine, and the miners themselves don’t animate - they just stare into the void like they’ve seen things. Same deal with the old firepit mechanic: a whole crowd of workers standing still like they’re posing for a Washington Commanders photo shoot. Add to that: new factions, new modes, new features… all sold separately. Definitive? Not really. The definitive edition was the complete collection they recently retired on Steam. This is more like a half-assed remaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abandonware",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "zzzz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not the best that Age of Empires III has to offer.\nSure, it looks nicer, it's got some more content than the retail version, but overall, this is not the way to get the true Age of Empires III experience.\n\nCampaigns from the original game were butchered, especially the ones involving John Black and Chayton Black. Mentions of Kanyenke were haphazardly chopped up to reflect his new name of Kanien, instead of bringing actors back to re-record. Mentions of the word \"Iroquois\" and \"Sioux\" were just outright deleted. The entire involvement of Nohnakee in Act II: Ice has been eradicated. Act II: Smoke was almost completely rewritten, removing historical characters and events in favor of even more fantasy.\n\nNew and changed civilizations lack the polish and care that went into the originals. To use an original civ as an example, British units that unlock later in the game speak more-modern English than units unlocked earlier; Ensemble in 2007 actually cared to include this detail to reflect the passage of time.\nBut then look at the United States, where the villagers are voiced by a text-to-speech machine instead of an actual actor. \nOr the revised Iroquois and Sioux, whose villagers (especially female) are voiced by non-actors with terrible delivery that's genuinely painful to listen to. Sure, the dialogue is more accurate to the language, but  \nOr the Italians, whose female villagers use masculine nouns to refer to themselves when assigned to gather resources, because nobody involved in that process cared enough to make any attempt to understand how the Italian language works.\n\nAnd that's before bringing in all the random changes that amount to nothing more than pandering - plantations are now estates, even though most of the civilizations who have access to them did not have the concept of the aristocratic estate. Fire pits became community plazas, but are still used to perform magic and summon units, while villagers tasked to the plaza perform practically no animations. Native civs use tribal marketplaces instead of being able to mine coin directly, but again do not have any substantial animations for working them. Especially egregious is the fact that the Iroquois and Sioux had their voice lines revised entirely, but the Aztecs - a people who no longer exist - were entirely untouched from their original version. Why? Because no Aztecs are alive today to complain, but there are living Iroquois and Sioux.\n\nMany of the changes were dressed up as favoring historical accuracy. \nBut then, why not change the Aztecs?\nWhy is the new flag for the Germans now the flag of the Holy Roman Empire, even though the civ represents the Kingdom of Prussia? Its face is Frederick the Great, Prussian King-Elector, never Holy Roman Emperor.\nWhy is the new flag for the Russians the tricolor? Sure, the double-headed eagle flag they had in 2007 wasn't historically accurate for Ivan the Terrible either, but the tricolor is now even further outside of his time period.\nWhy is the capital of the United States in Washington? The personality for the civ is Washington himself, but the home city is a place that did not exist in his lifetime. Campaign variants of the US correctly portrayed the home city as Philadelphia.\n\nAge of Empires III is a great game for sure. This version is also the only way now to play online multiplayer, now that Ensemble Online is dead. It has a lot of good balance changes, but overall, this is not the best version of the game. The best version of the game, especially for campaign-focused play, will always be the 2007 original.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "I have mixed feelings about this version.\nThere are graphical improvements and new civilizations, but the game is already sold out.\nThere are very few players in multiplayer. And the developers aren't there, and they're not expected to be.\nIt seems that everything existing and related to the AoE series solely depends on AoE II.\nA shame, really.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The game is horribly optimized, i have a decent pc that can push a good graphics and this game with certain maps and civs, it starts to stutter or freeze a lot.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Bad game overall, developers doesnt even care with the game anymore. Bugs not fixed, no more patch, bad matchmaking. imagine you are a new player for the multiplayer and always got high rated player as ur opponent",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "so, i played for about 25hrs...and it was quite good, though there were some missions that were a bit bad or randomly too hard for no reason...then i got to the morristown mission in the 2nd campaign and it started freezing very frequently for 2-5m each time, so like 70-80% of the time i was playing was freezes, then managed to finish that mission and the cards bit froze a couple times too, and then the next mission it kept freezing too...so i stopped playing it altogether as it was too annoying to play, esp after i looked it up and it sounds like i was lucky so far in not having problems, and that it's well known that there's masses of problems in the 2nd and 3rd campaigns!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more you dig into developement of AoE3DE the more depressing the rabbit hole is.\nNeglectful developement, unfixed problems, pointless changes from original aoe3(2007) including historical censorship or avoiding offending native groups, barely any updates, cancelled DLCs, Hardest AI not being able to use walls and is insanely dogshit on maps where it is separated from player with body of water.\nWhole argument of game \"not being worth upkeeping\" while holding better than Age of Mythology Retold (2024)\n\n[spoiler]...Or straight up failing at removing certain banned words like \"colony\" proving how campaign was completly ignored in DE version expect in paternalizm of 2 native groups and removal of historical characters(Crazy Horse)\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3457231629 \n[/spoiler]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a nice breath of fresh air if you enjoy AOE2/AOE4 and want something a little different. But I'm going to advise people stay away from this. Somehow the DE has bugs and issues that weren't in the original and that haven't been patched despite being reported as far back as 2021. How do you screw up attack move in an RTS?\n\nAnyway the game is abandoned so unless you're into modding the game I don't think it's worth the price point. Get it for like €5 on sale.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}