{
  "positive": [
    {
      "review": "Is fun game, just ignore the toxic people.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Fun game, community can be toxic at times but thats with every MOBA game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A decent MOBA feeling out its identity. Fun enough to try, with solid combat and good movement, but don’t expect anything groundbreaking. Worth a shot if you enjoy the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most fun MOBAs I have ever played, absolutely gorgeous visually as well. Well worth the 1000 hours",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, i played paragon, back in the day . and this is exactly what I wanted!. \n\nThis game is so fun , been playing this for hours now",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I did not know anything about this game. \nI am more of an ActionRPG / MMO person. This MOBA thing is different, but the game is fun. \nI recommend it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Game has had its ups and downs but the developers are good about listening to feedback and providing updates to keep the game balanced and exciting.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Paragon vibes FTW. Needs to have better consequences for people going AFK or leaving though. Lots of rounds a player just leaves or goes AFK.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Been playing since day 1, Super fun game, very faithful to the OG Paragon and has a super bright future!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is by far the best MOBA game I’ve ever played. With every match, it becomes even more stunning and thrilling. I’ve already recommended it to all my friends, and they’re enjoying it just as much as I am.\n\nA note to the developers: please consider taking action against players who go AFK or intentionally throw matches — they’re really frustrating and ruin the experience.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It can keep you busy for a couple of hours and it's free, which is definitely a good point. I would describe it as similar to Smite, with a hero variety comparable to Heroes of the Storm. However, the game doesn’t really bother developing any lore, so characters can range from magicians and fae creatures to futuristic soldiers with invisibility suits without any real explanation. Some players might not mind this, but others could find it lacking in cohesion.\n\nThis was the first MOBA I played where I noticed that many players insist on playing jungler, sometimes to the point of trolling if they don't get that role. In most other MOBAs I've played, players usually avoid that role instead.\n\nSince it’s a MOBA arriving very late to the genre and doesn’t really bring anything new, I wouldn’t be surprised if its lifespan is limited. So feel free to try it while it’s still around after all, it's free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is a fun time,, skin prices are high as they are in most.. bout 20+ for a skin.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "By far the best MOBA out there. The gameplay is awesome and the community is great!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "If you like Mobas and don't care for the top down LoL or Dota this game is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who used to be a Paragon founder back in the days, my initial thoughts on this game are pretty positive, I think where it shines the most is the huge roster of characters all with their own personalities and animations, it really gives the game some charm. \n\nThe only things I'd like the game to improve are Visual clarity, UI and Sound design.\nIt's hard to tell what I'm shooting at sometimes wether it's a friendly or an enemy, it sort of all get jumbled up especially with alot of minions on the screen, enemies often look like friends because the only difference is their health bar and I find the UI to be overcluttered, some pannels are too small, some are too big for no reason (Example: your healing potion that tells you how much it's charged takes a big chunk of the screen bottom right for absolutely no reason), the game really needs to improve on the Visual clarity because sometimes there's just so much on the screen and it doesn't come together smoothly. I find it hard on the eyes for long play sessions. Improve the UI, Improve the visual clarity to make enemies and minions stand out more naturally and make it so that when your skills are ready to be used there's a sound queue so we can tell without looking down so much. Finally In other MOBAS for example I can see the enemies and there's visual and sound indications that tells you what skills they're about to use, I think it would be nice in this game also.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MOBA in existence by a mile.  Nothing comes close to the graphics in this game and the 3d nature of the game world is so much better than the right click to move top down view all other MOBA's have (I know smite is 3rd person).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like smite than youll definitely enjoy this game. it actually does a lot of stuff better than smite in my opinion. i fear that this is another game that will come and go like the rest of the new mobas.\r\n\r\nDONT SLEEP ON THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice gameplay, graphics, that keeps me playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better and better updates. This has slowly become my main game. New items and loadout builder changes everything. Keep it up team! \n\nAll I really want now is no cutscene for the core explosion. I think your camera in world should force over tot he core and play the animation in engine. Its like this in Dota and makes losing and winning more emotional an experience. \n\nThis isn't some recycled moba, omeda is putting in real efforts here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Deadlock. Could use a bit more verticality/changes in height on the map. Overall a great, fun experience from an obviously passionate team. Also Battle Passes become event passes when they expire which is nice so you don't need to worry about not being able to complete a pass in time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great MOBA (smite alternative) great graphics and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and they have come a long way. Long time smite player here and my whole squad has moved here since smite 2 was ruined.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving the game! great variety of fun + interesting characters! lowkey addicted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun gameplay loop that has a lot of depth and skill expression + the game has balance and content updates/patches more often than any live service game I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing M.O.B.A still needs thing to be improved upon. Ranked matches are unfair and lots of toxic players but the heroes/abilities/items are very fun to use. Optimization can be better as well. Hope to see this 3rd person action M.O.B.A compete one day along aside with League of Legend. Let's go RGSACE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was created through the love of gaming and desire to support the community, something Omeda Studios nailed from the beginning. They are constantly interacting with the players to make sure they are heard. Creative events are rolled out that keep the game fresh! I can always count on this game when I am unsure what I want to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, with a great team behind if. Updates are frequent and well done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Complex but fun Moba, lovely 3d styling and interesting character ideas.\nFast time to kill and loads of items make for creative builds, \nnew loadout builder added in last patch, helps amazingly for new players learning the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Predecessor keeps things fresh and constantly rewards you for learning and adapting.\nIt looks great, plays great, and is backed by passionate devs who regularly drop exciting new content that adds further depth to the game. With its fast action, smart MOBA elements, and steady stream of meaningful updates, it quickly becomes a regular in your gaming rotation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly such a fun twist on the MOBA genre. Visually stunning and the verticality is really interesting. What I really love is how it's also preserving 2 other games (Paragon and Overprime) with content from both while still being so wonderfully and distinctly unique. \n\nIf you love SMITE or played Paragon, give it a go!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Classic Paragon with good upgrades.\nVery intense matches, 30 minutes of pure adrenaline, joy and anger. Very team oriented so yes, if your team  sucks... no matter how good you are, you will all lose. \nGood item and character balance.\n\nIf you intend to play Ranked matches, better be prepared... I thought that I'm good at this game, even with a bad team or 4 vs 5, I managed to win many casual games but ranked... Ranked is completely on another level... One day I lost 7 times in a row... Nobody quit, everyone use to play their roles but still the we lost...\n\nIf you are looking for a casual game just to have for 1-2 hours - probably its good. Very addictive, especially on a more casual game mode. But if you play 2-4 hours a day, this game gets either boring or frustrating... You either win a lot or you lose a lot, especially after you invested 20 intense minutes of your time and some player decided to quit or to stay AFK.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not for all People since it requirement to understand what MOBA is \nNot a Battle royal  not a Shoot  you need to work as a team. or u can work against u team and  u will lose\nu need to invest your time and look for what role u good at or bad at ! \nand find the hero that works for u ! \ni will recommend this game if u willing to learn and adapt can´t come in and get good at with sweating and understanding u mistakes ! \nGood luck !  because u going to need it !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great it plays like a 3D league instead of 3rd person on a league map. I'd describe the verticality as something like Halo. It doesnt mean you're SoL but it does make things hard. \n\nI've been playing on console and recently started on PC after upgrading an old GPU. The Graphics are great especially if your coming from another game that might be beginning to show its age. \n\nGotta say that the cross play aspect is great aswell! Console is at a small disadvantage but it also makes it all just a bit more casual. And most of all, active comms! It's great! I never forget to tell my laners im OMW and they never forget finally plug their mic in and berate me for stealing thier cannon, so we can finally strat it out for a competitve 5v5.\n\nNew heros are being added fequently and balance updates are numerous enough to feel like they get it just right, right in time for them to nerf you favorite hero. \n\nIf you enjoy the usual Moba shit. This shit right here, this is THE shit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "«Predecessor» — психологический хоррор с глубоким сюжетом и атмосферой тревоги. Вы играете за человека, возвращающегося в прошлое, чтобы изменить свою судьбу. Игра сочетает головоломки, исследование и напряжённую атмосферу. Механика времени и выборов добавляет сложности, но иногда кажется излишне запутанной. Графика и музыка создают мрачное настроение, а сюжет заставляет задуматься о последствиях решений. Несмотря на некоторые технические недочёты, «Predecessor» оставляет яркое впечатление благодаря оригинальному сценарию и погружению в психологическую драму.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like competing, but you don't care of League of Legends. Fun way to kill a couple hours for free.\n\nBUT...\n\nYou're probably gonna have slower matchmaking than you're used to at off times (weekdays before 5pm)...and a couple times I've played against some real sweats, but I feel like that's any game. At least I feel like I'm having fun even if I lose a match!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bring back Paragons Legacy map permanently, as well as dunking. Come on man",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "in the right direction good moba just unlocking new champ cost too much amber and not much given per match. Also y does eden have a penis design team what were you thinking?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing like being level 16 and getting annihilated by minions because you don't have armor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they picked up the ball where epic dropped it amazing dev team ty for bringing back the bauty of paragon for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "attractive, but hopefully can create a lot more hero",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game with big potential in the future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game, too bad paragon is dead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games hella fun and hella rage inducing, i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the only MOBA I play and I only play it with friends who have been playing since it was called Paragon. It's very cool to see a sunsetted game get a fresh go at life, and to have such a dedicated fanbase that followed it. Gameplay-wise it's a MOBA, very what-it-says-on-the-tin, but it's a fun romp and deserves a fair bit of credit for receiving continual updates and characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved paragon, love this game. Love what the team is doing with all the updates, and love all the original heroes they make.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very interesting take on the genre.  Giving players the chance to tweak characters to work with a diverse variety of playstyles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "update 1.10 brought me back to the game after a hiatus, pretty enjoyable so far!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the feel of the game compared to its counterparts which can feel more floaty and like you aren't truly hitting your enemies and I enjoy the style a lot. Its nice to play a game that isn't smite or league and I think the more mobas the better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Labour of Love - Great faithful version of the original with enough to make the game work and get most of the best bits of og paragon, but not live in the shadow of a fallen game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic game. not a big enough player base, for those that dont like the top down dota or league but want to try this type of game. this is for you. i never could get into those games friend put me onto this and here we are 300hrs deep. Gets constant updates and new heroes added often enough to keep it fresh. my only thing is that the map needs a rework. Deffo worth a try! Its free. so why not.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was an original Paragon player, then tried multiple \"successors\" which failed, ultimately start playing Predecessor. Not a single game is perfect, but I'm enjoying it. There are still some small issues, but I really hope it will stick with us for a long time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty cool game. I used what I learned from Dota 2 and Mobile Legends to play Predecessor. The Maps | Lanes | Items | Jungling and Towers are all similar. So I just apply what I learned from other games. It's not that hard to start. But, I do have to say that the Items may seem complicated.\n\nIt's super fun!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't review games very often anymore, but this is hands-down the best MOBA I've ever played.\n\nWhat I like about the game:\n\n+All heroes in this game take skill to play.\n+Likeable character designs\n+Gameplay is extremely expressive and complex. \n\n*In a nut-shell it's MOBA shooter-style game, and if you can't aim, you're going to wish you could because this is a damn fun game to play when you get deeper into the game! Come try it!\n\n\nSome things that could be improved on:\n\n-Character Menu is cluttered. It needs to be organized. It's all over the place and finding the profile, the icons, events, etc. It can overwhelm or distract newcomers from jumping in. \n\n-Give more freebies and events for dedicated players. This will help retain a returning player-base. Battle-passes aren't enough incentives for newcomers. \n\n-Have a referral system that rewards skins, amber, etc. Put this in the fore-front so players can invite their friends and help the game grow. \n\nOverall, it's a great game and I'm enjoying it so much. Jump right in, it's a very complex and fun game to play! Play it alone, play it with your friends, just play it; and immerse yourself in this MOBA shooter game. It's a blast!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best moba and its not even close.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a Paragon fan, this hits the spot where Smite/Smite2 just couldn't for me.  My favorite Paragon era hero recreations play just like I remember.  They've finished recreating the Paragon heroes now and have been adding some amazing originals too.\n\nIt's free to play.  Heroes have a weekly free rotation and you can easily earn every one just by playing and accumulating amber.  Pretty standard \"play to earn\" in the space.  You don't need to spend any real money to be able to buy all heroes and their mastery ranks (hero progression, earns skin and title).  However, you can also purchase them with platinum (cash currency) if you want to.\n\nThe rest of the monetization feels fair with a battle pass (~$12 a season/split currently) that rewards some unique skins and other cosmetics along with loot cores.  Loot cores are randomized boxes that can give you amber or a profile cosmetic (spray, emote, skin, recall, icon, etc).  There is a failure system that guarantees a rare+ skin every so many cores opened.  These loot cores can also reward another currency called opals that let's you buy specific skins from another shop that contains premium skin variants.\n\nThere is a platinum/cash only shop too that sells skins.  However, most skin prices, for me, are too high to warrant buying them outright.  That said, I've only spent money on battle passes and feel like I've acquired a good amount of premium skins through the loot cores provided.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty dope, it's a bit hard, but definitely got a lot of potential.\ni can switch from EU to NA in a sec when i need to, and the servers are stable i ain't got no problem playing on NA, which is nice.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Easy game to get into and it's super fun! I hope more people find it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is really good and fun me like",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow!  This game is awesome.  So much has improved over the years of development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard to learn but really fun once you understand what you are doing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! I have put in 1k hours and I enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, still needs some polishing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun moba and since its free i recommend u just give it a try :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As close as the original Paragon it gets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ABsolute beast of a moba! probably the best out",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best part is the matchmaking!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good. Just like the old one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you will lose every game if you aren't stacked",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At least it is not League of Legends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the next best thing to Paragon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game. i cant stop playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent. Would play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "league but actually fun and 3d",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FUCK THIS GAME I LOVE IT AND HATE IT",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good reward system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Predecessor my beloved",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game! <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "need more player in asia server",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best moba oat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting MOBA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictiveeeeeeeeeeeeeeeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god bless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun moba",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dead Game :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly a paragon successor",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "apasih nyebelin ni game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good, Play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game good game fun",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I played this game a lot in beta when there was 5 items and no augments. I enjoyed it more back then because it was slower and your abilities had a flow to them like rock, paper, scissors in lane. Recalling made sure that if you traded poorly you lost objectives on side lanes or bugs in middle. Jungle had decent pathing where you would help your mid secure bugs first spawn. It had potential.\n\nThe itemization of 5 to 6 items made items less impactful. This means that hitting an item spike doesn't feel as rewarding anymore.\n\nAugments are all but pointless for most of the heros with only 1 being clearly good and the rest being basically useless. Where is the counterplay to who you are laning against to change up your playstyle?\n\nThe devs want the game to be faster paced on an already abysmally small map only makes backing after pushing out waves even better with little to no punishment. The base turrets have always not shot after dying once until after a large amount of time has passed. It is made even worse with faster games as the first to take an inhibitor turret wins more often than not.\n\nAdding unreal 5 store assets doesn't make jungle pathing better. It doesn't make it more fun to manage even more timers, because managing timers is not fun.\n\nIt becomes exceedingly more obvious over time that the team that took over the \"will\" of paragon does not want to play paragon. They want to have nostalgia hits with old heros and cringe with awkwardly designed new heros that power creep the old cast into oblivion in most cases. An example of this is almost every new hero having a dash or jump. Then to make the game revolve around their bad game design with meat slapping fights just because that's what the devs want. A hero \"brawler\" not a moba. They want you to 5 man death ball and then take obj then repeat.\n\nThis game is named appropriately, Predecessor, as in the exact opposite of a successor.\n\nIf you want to play a watered down version of paragon with unreal 5 store asset flips, horrible balancing in heros, maps, augments, and game design, lewd skins to sell for desperate losers, insane time sinking required to ever touch ranked play, and best of all a toxic player base that will afk as soon as 5 min with NO PUNISHMENT because the player base is dwindling so much. Then this is for you. \n\nBut hey they bought even more assets from the other failed game \"Paragon: The Overprime\" so I mean look forward to even more copy pasted skins for 20+ dollars. Ironically the reason that that game failed is because it was much faster paced gameplay compared to Predecessor. I look forward to the next game to buy all of this ones assets.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "not the same game anymore dose not feel how they made it added stuff the sucks to the game like augments and stuff like that",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game gets worse with every update, now the game bans you automatically if you ever sit still. Game is crashing left and right and then doesn't relaunch unless you verify files. Lost Battle Pass Exp 3 times now cause game crashed at the very end of the game, like the end screen was popping up and before it got to the stat screen it crashes.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Paragon remade with new additional heros, skins, maps and abilities. One of the most toxic communities you can be a part of. 5v5 lane based team games feel great when you're winning but no ownership when you're not. Play casual, mute everyone - play your game. \n\nRanked Matchmaking is horrendous, player KD and experience are not remotely taken into consideration. People leave mid match all the time.\ni do not recommend this game for anything other than nostalgia of Paragon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why does require me to have 20+ heros to play ranked the game has 47heros thats almoust half. and its not like you get enugh to unlock 1 hero a day where u can play ranked after 20 days of playing even tho that sounds stupid in of it self. am not even a competitive player but i still do like ranked for the fact that it has consequences for afk players and if ranked up a few you will play with people who are not stupid on the game and that wont hold you back and have you raging. and i just dont know why you would gatekeep ranked. its so stupid",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "to be honest is started off ok but very quickly became trash. Between the bugs the awful settings and the lootbox scam its a game that will quickly remind you that it sucks and wont ever receive the time invested to it to become a good game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "wtf did they do to this game? i didnt play for 1 year and every character that came out since then has 5 dashes, everyone is just blinking around and you cant play a slower character... mobility creep is real, sadge WAS a fun game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "just go play deadlock if you want a third person moba. this is a top down moba that just forces you to aim over the shoulder.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is completely horrible. After spending over a  year playing, the community is horrible. Half of the people who player have the skill level below a low tier bot. The game will award people who talk trash on the mic, but once you refute back on chat or mic, you get flagged for inappropriate behavior. The dev's have no control on how to moderate the toxic fan base. If you roam around the map for too long, the game will assume you are AFK and will get hit with a temporary ban. This is not paragon, this is predecessor. Don't expect to replicate the same experience. Unistalling the game is the best thing you can do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you dont spend money they shackle you in the queues. If you spend money you can get away with spouting racial and homophobic slurs, sabotaging teams, leaving matches and getting favorable pairings. Pretty shady game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sucks tanks are op middle and adc cant do anything if solo loses. solo and jungle are the only roles that matter in this game. Community is more toxic than LoL and Smite 2 combined (They are all PS players). Game was good on release just sucks after a few bad updates. LIKE WHY CAN A SOLOLANER THAT WAS LOSING LANE SOLO A MIDLANER THAT WASS 10/0. 3/10 game for me don't recommend to anyone other that hardcore tank players. Il be going back to coping in my corner that Smite 2 with make a comeback when the game fully releases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very neat game but it often has issues loading into the match resulting in you getting a ban for AFK despite it being the game's fault. Should be like DOTA where you have time to reconnect etc. Ridiculous banning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is good, but matchmaking is horrible. Needs a game mode that isn't 5v5 so you can avoid half the player base. Joust or siege would do it. Also some way to separate LA players from NA. Actual experience isn't far from torture.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game seems great but only getting stuck in bot matches sooooooo Im not gonna waste my time on this...\nIf you are looking for another MOBA as much as I hate to say it go to smite or league",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Predecessor needs so many improvements, the map is way to small and there is other thing's that it needs, but I would want a FOV slider. The camera is way to close to the character and worse for bigger character's. There is also a few bugs, nothing game breaking but just annoying. Finally, the game can be fun, but with it's problems, I find myself wanting to walk away.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the concept of the game. However, servers suck, constant packet loss. Also, community is so toxic. About every game either someone quits or throws on purpose and it turns into a big waste of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game caters to the crybaby quitters who play 5 minutes of a match then quit, get reported and receive a slap on the wrist then do it all over again... You get your random aimboters and ESP users but mostly just smurfs who play like gods idek if they are just bot accounts or what but they never make any mistakes and know where you are at all times... Feels like Omeda does nothing about it just pushes more Fortnite like content...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game dosn'nt feel finished, animations are kinda stiff, tho models too, the intarface is too simple, thi dsing of the itens too, and it dosnt apear to be dsing choice, its just look like they didnt had the budget to pay an descent artist and UI dsigner. Just the overall feel of the game is that im playing an undercoocked alpha version of the game. hoppe they improve it cuz it have potential",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Want a Paragon remake? Well, this is the only one you're gonna get. So uh, get in here, and get ready to get flamed to hell and back by the auto-on voice comms and having people scream in your ear about how SHIT you are when you first start the game. Enjoy!\n\nPros:\n+ 2nd best Paragon remake to come out (Paragon The Overprime was fantastic until it became a rugpull).\n+ Graphics are good, well optimized, characters feel good to play.\n+ Game is actually pretty well balanced, took some time, but they got mostly there.\n\nCons:\n- VERY small playerbase compared to other MOBAs\n- INCREDIBLY TOXIC playerbase. Literally on par if not worse than League of Legends.\n- Devs don't seem to pick up on the things that make maps more interactive, or make the game more interesting\n- VOICE CHAT? IN A MOBA? ARE YOU FUCKING KIDDING ME ARE YOU INSANE? ITS ON BY DEFAULT? FUCK OFF!\n\n\nMy Opinions (lol who cares right?):\n~ Phase should be a mage mid laner. The way that Paragon: The Overprime did it was fantastic.\n~ Just purchase the rights to the most popular characters that Paragon: The Overprime created and put them in the game.\n~ For the love of god at least buy Marty. That was the most fun I've had in a Paragon clone in so fucking long.\n~ PUT SOME FUCKING BUSHES ON THE MAP DUDE!\n~ Seriously, look at how Paragon: The Overprime did their game, and learn from it. It may have been a rugpull, but it WAS popular, and it WAS the better of the two games. The dynamics surrounding the map, the changes they made, were fantastic. It doesn't have to be a vanilla Paragon map.\n\n\nAm I still gonna play it? Eh, probably here and there. \n\n~rant to devs~:\n\nBut please Omeda, get your head out of your asses. Your 24-hour peak on Steam is 1,751 at this time. Your all time peak is 7,272 players on Steam. I'm aware that this does not account for the Playstation, Xbox, and Epic games players. However, MOBAs playerbases are PC dominated. Steam holds around 75% of the PC digital game distribution market. Epic holds roughly around 3-5%.\n\nI know you're not going to compete with League, or DOTA. But hell, you could at least smack the crap out of SMITE and Heroes of the Storm. I want this game to get large. I want the playerbase to skyrocket. I've been wanting this since Epic shut down Paragon to begin with. For the love of God, at least CONSIDER the things the other clones did that made their versions popular. Like bushes for example. Or how they transformed the map. It changed the way the game played completely. It made it more FUN and DYNAMIC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They keep updating it but it just doesn't get better, the game sutters like crazy, has random lock ups where you cant move, the community is awful. The gameplay is fun if you can find a match, and not have a team of people who are brain dead. i tried to keep playing with ARAM but its just the same issues but faster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like moba style games and I love playing this. Only thing i hate is how sometime some people just get a ridiculous amount of money and just start making it one sided. Or the fact that the projectile heroes get outshine by melee and vise versa very vast. And i can understand the highlighting to see which enemy is being hit but on top of that you just got to have accuracy to even hit other players. not like the projectile size make up for it. And trying to get another hero? holy moly that takes forever. Barely even half way to unlocking a character because of the amount they reward you with in game currency to unlock heroes. sometimes you get a random amount that is good but thats just about it with getting it. they want you to play constantly for hours just for one character you want. then people just go afk or just dont play at all and it ruins so much gameplay. otherwise of those problems its not a bad game to me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im surprised to see this franken moba of a failed game still exist tbh\n\nconsidering the game is just made with the unity posted assets of the original game (paragon) and a team that clearly didnt want to use them to there full extent im impressed it lasted this long\n\nim also impressed it somehow manages to feel worse than fucking indie games do when all you had to fucking do was make the fucking underside of the game since everything topside was fucking done for them\n\nthis is probably the cheapest shittiest feeling moba ive ever had the displeasure of playing and the only joy out of it is it reminded me of that one time amazon tried to make a moba and killed in before its first betatest even finished \n\nalso rip art direction why is every character not from paragon just bimbotitslutsmcgee its like some dickhead on the art team heard the \"bag of boobs\" line from borderlands 2 and decided that was peak comedy and so profound every character ever should be that\n\nEdit: Thanks for the points dipshit lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First of all they're making money of a free game that has died before. Than the community they have is mindblowingly stupid. leavers all over the game/intentionally feeders and just below average fights. Whoever hits his ultimate last wins the coinflip.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "with the amount of money their apparently making, i seriously dont appreciate the use of AI for their already very bland character designs, no wonder its bland and boring. A white guy with a sword and a robot? Literally the oppisite of what made paragon interesting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They cant figure out ranked play. You get a retar  d on your team and your fk no way out. One day these tards might figure it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst moba ever , all the the player who do not know how to play a moba is playing this game ! hero are unbalenced and they ban easy for no reason. The pacing of the game is slow, everyone stay in the tower zone and wait for the npc !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "13 minutes in a loading screen just to tell me it cant connect to steam when it opened through steam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Grafika laba (kāda bija Paragonā), bet spēle tāds pats disbalansa mēsls kā liela daļa MOBAs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute terrible game, worst moba ive seen to be honest... like even mobile phone based mobas are better ffs. No role q in qp causes trolls. I called out a guy who had been given duo lane, im roamer i said i will afk if your going to just drop your lane. Game instantly flagged me as afk when im still walking around in lane under turret waiting for my dog carry to turn up. Carry continues to not come to lane... i call him out again i get repped and chat banned. WTF IS THIS POS GAME. Genuinely why anyone would play this is beyond me, its clunky, melee range can often no reg even when your stood on top of people, hook mechanics are trash... one min you hook someone with it barely on them next you can literally be stood on top of them with clear LOS and it still derps, heroes are mid, players are morons.\n\nDont waste your time IMO go play Smite its 10x better than this garbage.... and guess what i dont even rate smite either XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "User Interface seemed too complicated in comparison to other MOBA's.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "could be a good game but follows the same eomm bulllshit that every other moba does except this one is so dead that u sit there for 10min then do it again because someone dodged the game. then when u finally get in a game if u have above a 50% winrate u are guaranteed to have the rest of your team be 0-15 by minute 10. until these braindead companies stop prioritizing profits over good matchmaking these types of games will never be able to be properly enjoyed piss off omeda",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played 3 matches, on my third game a team mate  went afk under tower spamming emotes, what a fantastic community already, they can close the game and sell the rights to another company already, since this game already failed 3 times. Keep it up and maybe don't try to copy league of legend items",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant find a game after queueing for 8 mins. when i play bots the gameplay is solid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad matchmakiing 5 stacks against solos in ranked and smurfs everywhere",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of quitters. Queuing time takes up to 5 mins.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "5-10 minutes of waiting on average, only to play against a cheater. Brilliant",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broke people play the silliest things.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They somehow succesfully managed to ruin Paragon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad Community. Worse Balance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cash grab game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "learn to use shit egine 5, makes pc crash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0/10 \n\nI miss paragon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "budget moba",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PRS-8 error",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "whole lotta BS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Damn this community is ass, game is fun so I guess we just play perma mute because people expect you to be the best player in existence 5 hours in on Quick Play. It would be different if it were ranked but Quick Play, I had people calling me the R Slur and just being racist constantly.\n\nHopefully the community doesn't kill this game because its fun but needs better reporting with also an average of one leaver per game. Sadly not on the developer so maybe this becomes a recommend later but until then play like its a single player game",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "If you are looking for a moba this should be your last stop. This is a team deathmatch game on a moba map. Played around snowball killing and ignoring lanes to kill the other team at record pace.\n\nI was asked to edit my review and I still stand by it 100%. The devs I believe made a change to the gold off minoins to balance it but the problem is the iq of the average player is so low they cant farm to punish them for perma roaming. So you have dudes who were losing lane chasing them around the map perma feeding them, instead of farming and punishing them for walking aimless circles (maybe if they make extra in game tutorials for in depth educatoin?).",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I really wish to I could recommend this game, but with the state it's in and the direction (if there even is a direction) it's heading I think it's time to just move on to something else. \nI played the shit out of this game when the EGS gave away the early access for free and loved absolutly everything about it. It was clearly missing a whole bunch of stuff, it's early access after all, but they had a really solid base to build on.\n\nBut here we are now, over a year since the lukewarm release of 1.0 and the game is clearly having an identity crisis with deciding whether it wants to appeal to the MOBA crowd or the more casual hero shooter crowd.\n\nThe constant changes to the game's speed and attempts to lower match times is slowly killing the little bits left of the MOBA feeling this game had. It's as if the devs watched the success of marvel rivals and wanted to cannibalise their game into becoming a clone of that instead. \n\nThe map has been a major complaint from the majority of the early access players, and the only thing we got was a few tiny changes that only serve to speed up the game further without addressing the problem. The map is tiny and cramped, it already allowed for rotations to go unpunished constantly, laning is barely a thing anymore with how badly you're punished if you don't follow and counter every enemy rotation , how fast they can get back from base after a recall, and how short early death timers are, you'll be lucky to shove a wave under their tower before they comeback in time. Constant team fights are pretty much just the standard now, by the 5 minute mark you'll be throwing the match if you're team isn't gathered going from lane to lane trying to get as many kills as they could after the 5 minute mark.\n\nEven the art direction of the game went on a massive downward spiral after for whatever reason after 1.0 . The new hero designs are...fine I guess, they're pretty uninspired save for a few are passable. The skin design on the other hand is laughably generic, repetitive, and kind of embarrassing with how clearly the artists think that adding a cartoonishly massive ass crack and side flaps to every character gets the job done,  Not to mention how insane the prices are for just how low the quality is. I actually won't be surprised if the art department is just one guy throwing prompts into stable diffusion for 'inspiration'. Not to mention the item art is still placeholders from early access, and they're still adding more placeholders for items, and now even the new objectives are just store bought assets. \n\nUsually this would be a none issue to me, small studios gotta use their resources carefully. But where the hell are those resources even going? The game is getting constantly hit with barely thought out changes to the gameplay, the art direction is practically none-existent, the map is getting changes that try to work around an inherently flawed structure, and seemingly everything is planned to be worked on but is not a priority. And that's my current biggest problem: what even is the priority right now? Is there a vision? a direction? or are the devs waiting for the next big game to be released so they could morph the game around that as well?",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "As much as I want to recommend this game, I can't. The fact that ONLY console has the ability to turn off crossplay and PC doesn't, paired with console players just being down right bad with negative awareness of what's happening or who to prioritize, just really ruins a lot of the matches you'll play. On top of that, the aim assist in this is way too overtuned and for some stupid reason, the dev's are just not willing to address it. Until they address the issues at hand, I will most likely not ever recommend this game. Also forgot to mention that the matchmaking is the most abysmal I've ever seen in a MOBA with Smite being slightly worse than this.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "I played this game a lot in beta when there was 5 items and no augments. I enjoyed it more back then because it was slower and your abilities had a flow to them like rock, paper, scissors in lane. Recalling made sure that if you traded poorly you lost objectives on side lanes or bugs in middle. Jungle had decent pathing where you would help your mid secure bugs first spawn. It had potential.\n\nThe itemization of 5 to 6 items made items less impactful. This means that hitting an item spike doesn't feel as rewarding anymore.\n\nAugments are all but pointless for most of the heros with only 1 being clearly good and the rest being basically useless. Where is the counterplay to who you are laning against to change up your playstyle?\n\nThe devs want the game to be faster paced on an already abysmally small map only makes backing after pushing out waves even better with little to no punishment. The base turrets have always not shot after dying once until after a large amount of time has passed. It is made even worse with faster games as the first to take an inhibitor turret wins more often than not.\n\nAdding unreal 5 store assets doesn't make jungle pathing better. It doesn't make it more fun to manage even more timers, because managing timers is not fun.\n\nIt becomes exceedingly more obvious over time that the team that took over the \"will\" of paragon does not want to play paragon. They want to have nostalgia hits with old heros and cringe with awkwardly designed new heros that power creep the old cast into oblivion in most cases. An example of this is almost every new hero having a dash or jump. Then to make the game revolve around their bad game design with meat slapping fights just because that's what the devs want. A hero \"brawler\" not a moba. They want you to 5 man death ball and then take obj then repeat.\n\nThis game is named appropriately, Predecessor, as in the exact opposite of a successor.\n\nIf you want to play a watered down version of paragon with unreal 5 store asset flips, horrible balancing in heros, maps, augments, and game design, lewd skins to sell for desperate losers, insane time sinking required to ever touch ranked play, and best of all a toxic player base that will afk as soon as 5 min with NO PUNISHMENT because the player base is dwindling so much. Then this is for you. \n\nBut hey they bought even more assets from the other failed game \"Paragon: The Overprime\" so I mean look forward to even more copy pasted skins for 20+ dollars. Ironically the reason that that game failed is because it was much faster paced gameplay compared to Predecessor. I look forward to the next game to buy all of this ones assets.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Do yourself a favor... Don't play this game. The community is simply just not it. Too many times have I come across people who simply don't understand the game or quit simply just to troll. I remember the good old days of PARAGON and Predecessor simply does not fill the shoes that PARAGON once did.\r\n\r\n1.Community is simply toxic, and will simply clown you or belittle you for trying to help someone or simply asking for HELP when it's a team base MOBA. The reports on players are non-existent or consequences to that player just don't happen. Devs only care about making money, and not fixing the current MMR issue that is ongoing within rank (LETS NOT FORGET A BRONZE PLAYER IS CLASSIFIED AS A GOLD PLAYER ALREADY). Also there is no voicing your opinion on the game even if it's negative because OMEDA will simply outcast you from becoming a content creator for their game (GO LOOK UP JOEYOURSTRULY you will understand) and they also lie. \r\n\r\n2. The constant tweaking of making heroes better, and or worse is trial and error at this point (Devs have no clue what they're doing). The game no longer feels like a moba but rather it's a brawler game constant fighting rather than completing some objectives, and then fighting in between. Also the penalty on players VP is absurd when a player does good but loses they get penalized the same amount as a player who did worse than you or under performed (This goes without saying if you're gold and a player is silver they lose less than you because of the broken system they have).\r\n\r\n3. Just don't waste your time playing this game. The player count keeps dropping because of how the way is being directed, and the community itself. Can't have a normal conversation talking about what we can do in order to win instead you get trash talked, and they quit playing, and throw the game. \r\n\r\nAGAIN I REPEAT DO NOT PLAY THIS GAME IT IS TERRIBLE, TOXIC, AND WILL ONLY RUIN YOUR DAY BECAUSE PEOPLE DON'T KNOW HOW TO PLAY A TEAM BASE GAME.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "not the same game anymore dose not feel how they made it added stuff the sucks to the game like augments and stuff like that",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game gets worse with every update, now the game bans you automatically if you ever sit still. Game is crashing left and right and then doesn't relaunch unless you verify files. Lost Battle Pass Exp 3 times now cause game crashed at the very end of the game, like the end screen was popping up and before it got to the stat screen it crashes.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i want to enjoy this game but the players are just to toxic not the people i am going against, it's the teammate it is just sad how people can just Ruin a good game like this one.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game has potential but the heroes are very unbalanced such as renna i'm always seeing her and shes pretty OP  just someone who can constantly jump float in the air and get way from some other heroes abilities... so ye balanced. the items themselves that are in game aren't balanced as well and aren't that flavorful you'll see the same builds majority of the time and it feels like it takes too long to actually build your items. For the final thing is the skins are pretty cool idk if they have different visual effects for them but they are way overpriced.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Toxic, slowly dying game. Don't bother getting into it now. Probably gonna EoS soon with how long ranked and even quick matches are.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game HAD potential when it use to be called Paragon. I'd Rather play league of legends because they actually penalize players that grieve, Afk , or are just simply bad. It feels like you're just playing with a bunch of people trying the game out vs playing with people trying to play and win. \r\n\r\nDon't waste your time if you're trying to enjoy something.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Paragon remade with new additional heros, skins, maps and abilities. One of the most toxic communities you can be a part of. 5v5 lane based team games feel great when you're winning but no ownership when you're not. Play casual, mute everyone - play your game. \n\nRanked Matchmaking is horrendous, player KD and experience are not remotely taken into consideration. People leave mid match all the time.\ni do not recommend this game for anything other than nostalgia of Paragon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why does require me to have 20+ heros to play ranked the game has 47heros thats almoust half. and its not like you get enugh to unlock 1 hero a day where u can play ranked after 20 days of playing even tho that sounds stupid in of it self. am not even a competitive player but i still do like ranked for the fact that it has consequences for afk players and if ranked up a few you will play with people who are not stupid on the game and that wont hold you back and have you raging. and i just dont know why you would gatekeep ranked. its so stupid",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A lot better on console. People are constantly cheating, the devs can't seem to balance the characters at all. Gameplay is pretty good, graphics and sound are good. Do I recommend it, no. Between the other pc players cheating, the devs inability to balance the characters, and the amount of players who get upset and will throw the game because they didn't get the role they wanted and you getting penalized if you choose to leave to get away from that toxicity....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to be honest is started off ok but very quickly became trash. Between the bugs the awful settings and the lootbox scam its a game that will quickly remind you that it sucks and wont ever receive the time invested to it to become a good game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "worst matchmaking i have ever seen, i have team mates that have less than 10 hours in the game against 1k hour players every single game,ive been playing since paragon and the matchmaking has killed this game for me\n\naim assist is way too strong, they cant miss",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "wtf did they do to this game? i didnt play for 1 year and every character that came out since then has 5 dashes, everyone is just blinking around and you cant play a slower character... mobility creep is real, sadge WAS a fun game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "delete renna from the games servers and i'll consider revisiting it. there is no reason a character like that should exist in your game. genuinely might be the worst designed moba character of all time and thats not even an exaggeration in any capacity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just go play deadlock if you want a third person moba. this is a top down moba that just forces you to aim over the shoulder.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is completely horrible. After spending over a  year playing, the community is horrible. Half of the people who player have the skill level below a low tier bot. The game will award people who talk trash on the mic, but once you refute back on chat or mic, you get flagged for inappropriate behavior. The dev's have no control on how to moderate the toxic fan base. If you roam around the map for too long, the game will assume you are AFK and will get hit with a temporary ban. This is not paragon, this is predecessor. Don't expect to replicate the same experience. Unistalling the game is the best thing you can do.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "In short? Game is bad. You play against bots, it's riddled with leavers if you play against humans and technically it has so many issues that I won't bother any longer.\n\nNo (Super)Ultrawide Support as it zooms in and crops UI, no FOV Slider, you can't even set a proper resolution as it detects some strange ones.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really want this game to succeed, but its so hard to enjoy it rn with the ranked matchmaking and the character balancing, its awful sadly :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Matchmaking is broken and not at all balanced.\nThe fangtooth buff is too strong of a buff and pretty much whoever gets it first will will the match\nIf players select the same role then it is randomly assigned instead of the one who picks it first.\nThis has the potential to be a great game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you dont spend money they shackle you in the queues. If you spend money you can get away with spouting racial and homophobic slurs, sabotaging teams, leaving matches and getting favorable pairings. Pretty shady game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sucks tanks are op middle and adc cant do anything if solo loses. solo and jungle are the only roles that matter in this game. Community is more toxic than LoL and Smite 2 combined (They are all PS players). Game was good on release just sucks after a few bad updates. LIKE WHY CAN A SOLOLANER THAT WAS LOSING LANE SOLO A MIDLANER THAT WASS 10/0. 3/10 game for me don't recommend to anyone other that hardcore tank players. Il be going back to coping in my corner that Smite 2 with make a comeback when the game fully releases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very neat game but it often has issues loading into the match resulting in you getting a ban for AFK despite it being the game's fault. Should be like DOTA where you have time to reconnect etc. Ridiculous banning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This moba has the same critical flaw that every other does; most games are non-games because there is always a thrower. If you wanna buy skins and troll people online then go ahead but if you're in any way a reliable teammate then stay the fuck away from this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played 15 hours am level 15, game still does not provide game selection button, i know the game requires level 5 to unlock non-bot games. Have played over 10 bot games. I just want to play arams or normal games but wont let me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh boy, do I hate this game. After the amount of time I've put in, I mainly only play this with my buddies because this is the one of the only games that manages to make me yell out loud.\n\nSo, it's origins was nice. Very FPS oriented, smooth flow, very oriented with skill. Then they added a perk system which to be honest was pretty cool, but completely changed the game. Which, fine, it's a change of pace but I love builds. Then they brought back the old map, which most of the community was STOKED for from Paragon, then REMOVED IT, only to bring it back as an ARAM mode which I've yet to play. *Insert Internal screaming*\n\nGameplay itself was originally a balanced feel, but now with whatever update they did it now feels one-sided after a certain point. Typically trades in the beginning of MOBA's aren't as impactful, but there gets to a certain point where you realize when a game is simply done because of snowballing rewards. Extra gold is very farmable, tower bonuses/jungle bonuses maintain a winning team's momentum much easier than a losing team's capability to catch up. And each patch just kept getting worse.\n\nThey added loot cores awhile back that was a pretty cool way to coax Free-to-Play individuals, and then proceeded in the last patch to LOWER drop rates for a pitty system which is arguably worse--in the original, you could earn premium currency sometimes (even though it was small) and now it is impossible to gain any.\n\nFunny that I don't recommend it, yet I'm still gonna go back to it like a toxic ex. So, hey, there's gotta be some kind of fun. Right?...Right???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: Visually pleasing, fun casual F2P game WITH friends, but the game is marred with toxic players, a small playerbase that you'll rarely encounter new players once you hit a set internal MMR bracket, greedy monetization, and small (usually reverted) balancing decisions along with slow iterative changes that make the game stale quickly. I can't in good conscience recommend this to a solo player, maybe if you want a F2P casual experience with 2+ friends.\r\n\r\nPros: Gameplay is fun and relatively easy to learn. One of the more visually approachable games to play. Developers seem to engage and be active with community.\r\n\r\nCons: Playerbase is small (or at least feels that way) despite being cross platform, I run into same players constantly and PC (Steam) player counts usually peak around 2.5k on weekends-usually <2k- so sometimes you need to wait to queue to mitigate this. The internal MMR seems to be in place for casual modes as well.  Toxicity is common, with players getting upset early, not communicating, or just AFK'ing at base so it becomes a 4v5 or worse. It also doesn't help when majority of voice chat users are toxic, \r\nIn general, the studio and dev team reek of incompetence despite claiming to have 60+ employees and this being the ONLY game they've developed.\r\nPatch notes & game balance are inconsistent. Rare comprehensive hero changes (I don't think I've seen patch notes mention ALL heroes in recent patches which is sad considering their roster is one of the lowest in the genre compared to its major competitors, about 40 heroes total. The devs will simply omit heroes). Balancing of heroes seem to fluctuate/revert changes within 2-4 patch cycles . Overall, they've made large improvements since their early beta days, but not impressive over almost 3 years with early access on PC since late 2022. They've only developed 6 original new heroes. They removed a casual game mode after ~1 year and say it will return. They added a new map/mode recently, but they decided to not include it or bring back an old mode to effectively reduce the number of playable modes? Odd choices. They \"implemented\" a feature for AFK players as well with auto surrender, but they removed that feature. UI for game is mediocre on console and not intuitive. And the cherry on top is charging ~20+ dollars for character skins that are free public assets (this game is basically a spiritual successor to a dead game Paragon by Epic Games in mid 2010s). They've implemented loot crates for cosmetics and premium currency. but are filled with so much bloat (e.g. UI player icons/banners only visible in friends lists or match loading screen).  Progression for a casual player to unlock all heroes takes a good chunk of time (all heroes free to unlock).\r\nOverall there are better options out there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rating: ★★☆☆☆\n\nPredecessor had potential, but it just doesn’t hit. Combat feels clunky, the map design is confusing, and matchmaking can be frustrating. I wanted to like it, but it ended up feeling more frustrating than fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Made it impossible to get the premium currency for free, reduced the drop rate of legendaries, hasn't keep their promises about anything changes they were going to make.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "community is terrible you could be the only other person actually doing something yet still say i dont do anything. many times i would have either the most kills or 2nd most and always getting hated on saying that i sucked. Idk the community is backwards",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game play is really good, and I wish more people played...\n\nBut honestly... the amount of leaving or afk players ruined it for me. No one wants a team member to leave in the first 10 min and have to play 20 min more. There needs to be a stricter punishment for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not sure how to put in a complaint to the devs so ill just put it here and pretend they will see it, but this last patch has been so bad i cant recommend anyone play this game like this.  i cant tell if its new unexplained mechanics or just a bad glitch but it acts so weird lately.  stuns come from no where, skills interrupted and on cooldown with no animation or effect flash at all but still counts as being used?  never used to be like that.  and the hit boxes are so delayed its a mess. new update of september 2025, game still sucks the same ass if not there is even MORE bs happening and i only played one match.  trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you try your best at the game but you get a trash piss of a fucking team mate he sucks so much he someone goes 1-15-0 in 20m of a game bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is somehow worse than smite. \nIn theory, it's an interesting title. The characters look polished. But the actual game itself is a complete joke.\nMy first match into the game was one against seasoned players, fair enough. Not every new player can play against new players not a big deal. But it was also 4v5 and the game forces you to play even if someone never connects. On top of that, there is no new player guide. You get infographics with information that really doesn't mean anything unless you have PLAYED mobas before. There's no practice mode, no tutorial mode to go into a game and scope what it's like. They just throw you in. Utterly garbage. I didn't know Omeda before this and I can guarantee I won't after this. Hi rez somehow has a better business model.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game tried to be paragon but its not. This game is a shadow of its self. Whats worse is the player base and how penalties are applied. If you tell you're teammate they are playing bad guess what. You are chat banned for 24 hours. A teammate Afks in the fountain for the rest of the 30 minute game. They can queue again in the next match. Don't play this game. It will only make you angry.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "inconsistant in the deeper mechanics not by accident but by design philosophy so u get actually punished by trying to create a better build if you do not check for every step if its working. Many item abilitys are secretly disabled on many Champs. I really gave this game again and again a chance, but if you are a buildcrafter like me and do not just there for brainless clicking enemies heads, you will not have fun. It presents itself in a way that makes you think they want deep buildcrafting, but sabotage it over intentional inconsistancies.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is good, but matchmaking is horrible. Needs a game mode that isn't 5v5 so you can avoid half the player base. Joust or siege would do it. Also some way to separate LA players from NA. Actual experience isn't far from torture.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game seems great but only getting stuck in bot matches sooooooo Im not gonna waste my time on this...\nIf you are looking for another MOBA as much as I hate to say it go to smite or league",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Predecessor needs so many improvements, the map is way to small and there is other thing's that it needs, but I would want a FOV slider. The camera is way to close to the character and worse for bigger character's. There is also a few bugs, nothing game breaking but just annoying. Finally, the game can be fun, but with it's problems, I find myself wanting to walk away.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the concept of the game. However, servers suck, constant packet loss. Also, community is so toxic. About every game either someone quits or throws on purpose and it turns into a big waste of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game caters to the crybaby quitters who play 5 minutes of a match then quit, get reported and receive a slap on the wrist then do it all over again... You get your random aimboters and ESP users but mostly just smurfs who play like gods idek if they are just bot accounts or what but they never make any mistakes and know where you are at all times... Feels like Omeda does nothing about it just pushes more Fortnite like content...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game dosn'nt feel finished, animations are kinda stiff, tho models too, the intarface is too simple, thi dsing of the itens too, and it dosnt apear to be dsing choice, its just look like they didnt had the budget to pay an descent artist and UI dsigner. Just the overall feel of the game is that im playing an undercoocked alpha version of the game. hoppe they improve it cuz it have potential",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Want a Paragon remake? Well, this is the only one you're gonna get. So uh, get in here, and get ready to get flamed to hell and back by the auto-on voice comms and having people scream in your ear about how SHIT you are when you first start the game. Enjoy!\n\nPros:\n+ 2nd best Paragon remake to come out (Paragon The Overprime was fantastic until it became a rugpull).\n+ Graphics are good, well optimized, characters feel good to play.\n+ Game is actually pretty well balanced, took some time, but they got mostly there.\n\nCons:\n- VERY small playerbase compared to other MOBAs\n- INCREDIBLY TOXIC playerbase. Literally on par if not worse than League of Legends.\n- Devs don't seem to pick up on the things that make maps more interactive, or make the game more interesting\n- VOICE CHAT? IN A MOBA? ARE YOU FUCKING KIDDING ME ARE YOU INSANE? ITS ON BY DEFAULT? FUCK OFF!\n\n\nMy Opinions (lol who cares right?):\n~ Phase should be a mage mid laner. The way that Paragon: The Overprime did it was fantastic.\n~ Just purchase the rights to the most popular characters that Paragon: The Overprime created and put them in the game.\n~ For the love of god at least buy Marty. That was the most fun I've had in a Paragon clone in so fucking long.\n~ PUT SOME FUCKING BUSHES ON THE MAP DUDE!\n~ Seriously, look at how Paragon: The Overprime did their game, and learn from it. It may have been a rugpull, but it WAS popular, and it WAS the better of the two games. The dynamics surrounding the map, the changes they made, were fantastic. It doesn't have to be a vanilla Paragon map.\n\n\nAm I still gonna play it? Eh, probably here and there. \n\n~rant to devs~:\n\nBut please Omeda, get your head out of your asses. Your 24-hour peak on Steam is 1,751 at this time. Your all time peak is 7,272 players on Steam. I'm aware that this does not account for the Playstation, Xbox, and Epic games players. However, MOBAs playerbases are PC dominated. Steam holds around 75% of the PC digital game distribution market. Epic holds roughly around 3-5%.\n\nI know you're not going to compete with League, or DOTA. But hell, you could at least smack the crap out of SMITE and Heroes of the Storm. I want this game to get large. I want the playerbase to skyrocket. I've been wanting this since Epic shut down Paragon to begin with. For the love of God, at least CONSIDER the things the other clones did that made their versions popular. Like bushes for example. Or how they transformed the map. It changed the way the game played completely. It made it more FUN and DYNAMIC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They keep updating it but it just doesn't get better, the game sutters like crazy, has random lock ups where you cant move, the community is awful. The gameplay is fun if you can find a match, and not have a team of people who are brain dead. i tried to keep playing with ARAM but its just the same issues but faster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like moba style games and I love playing this. Only thing i hate is how sometime some people just get a ridiculous amount of money and just start making it one sided. Or the fact that the projectile heroes get outshine by melee and vise versa very vast. And i can understand the highlighting to see which enemy is being hit but on top of that you just got to have accuracy to even hit other players. not like the projectile size make up for it. And trying to get another hero? holy moly that takes forever. Barely even half way to unlocking a character because of the amount they reward you with in game currency to unlock heroes. sometimes you get a random amount that is good but thats just about it with getting it. they want you to play constantly for hours just for one character you want. then people just go afk or just dont play at all and it ruins so much gameplay. otherwise of those problems its not a bad game to me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im surprised to see this franken moba of a failed game still exist tbh\n\nconsidering the game is just made with the unity posted assets of the original game (paragon) and a team that clearly didnt want to use them to there full extent im impressed it lasted this long\n\nim also impressed it somehow manages to feel worse than fucking indie games do when all you had to fucking do was make the fucking underside of the game since everything topside was fucking done for them\n\nthis is probably the cheapest shittiest feeling moba ive ever had the displeasure of playing and the only joy out of it is it reminded me of that one time amazon tried to make a moba and killed in before its first betatest even finished \n\nalso rip art direction why is every character not from paragon just bimbotitslutsmcgee its like some dickhead on the art team heard the \"bag of boobs\" line from borderlands 2 and decided that was peak comedy and so profound every character ever should be that\n\nEdit: Thanks for the points dipshit lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First of all they're making money of a free game that has died before. Than the community they have is mindblowingly stupid. leavers all over the game/intentionally feeders and just below average fights. Whoever hits his ultimate last wins the coinflip.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}