{
  "positive": [
    {
      "review": "I... I don't really know what to say here. I'm in tears after finishing the game. In most games, your friends (and yourself) don't really get a choice on when they die. It just happens, and you restart or move on. Here, you have to CHOOSE to let them go. To let yourself go. And god, I've never done anything tougher. How do you leave a world you've spent forty, fifty hours in go? How do you say, \"Well, I guess this is it?\" This game asks that question. It forces you to let your friends leave, after truly learning about them and loving them, because it's what they want. It's what's best.\r\n\r\nI think, going forward, my life is forever changed. I get attached to characters so easily, and for a while, I refused to finish my final task. How could I? But, well. I did. And I think that now, maybe it'll become a little easier to let others go. Because I've had to do it, and I've come out alright.\r\n\r\nIf there's one thing I could say to anyone thinking about playing this game... DO IT. Sink hours into it. Complete every quest, every shenanigan, every achievement. Let yourself love the characters, and grapple with letting them go. I think the morals and lessons from this game is one everyone needs to hear.\r\n\r\nTo Thunder Lotus, thank you for making this game, and allowing us all a safe space to learn to process grief.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I haven't finished the game yet. Right now, 14 hours in and only at 28%. Yet, I can't recommend this game enough: you won't find anything else like it in your life. Wonderful artstyle and character design, marvellous writing and characters, beautiful music and sound design and the most tear-jerking, heartfelt, im-going-to-kms goodbyes ever. This is one of the most beautiful games I've ever played.\n\n20/11/25 edit: Dear God. I'm a changed man.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "One of the best stories I've ever encountered. Heartfelt, tender, emotionally honest, this game is capable of simultaneously breaking you in tears and evoking a reassuring smile.\n\nThe tiny rough edges and sparks of familiar routine don't detract from the game; on the contrary, they lend a natural feel and ground it somewhat, just as our flaws balance our strengths and underscore our very existence. \n\nLikewise, this game - as a project of minds, as a symbiosis of ideas, as a world of tales, and as a work of art - lives in its own magical, enchanting way, while motivating us to believe in the indestructibility of stubborn hopes: \n\"All is not yet lost.\"\n\"You worth a lot.\"",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I've got probably 100 hours on my Switch for this game. Amazing. The best representation of grief, loss, love, family (and found family) ever. All wrapped up in a lovely cozy atmosphere that is visually and aurally stunning.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game. \n\nItÂ´s incredibelly unique in the themes it is portraying, the artstyle, and the game mechanics. I have never played a game like this. I found it when I was looking for a game similar Stardew Valley to loose myself in during a difficult time, and had no idea that my now favorite game ever would help me make peace with the loss and allow me to process my grief in such a gentle manner. This game is the definiton of bittersweet, in the best way. It shows death in all its variations, from both the perspective of the dying and the ones left behind. You could almost forget the unsettling truth of life, that is unevitable, with how serene and beautiful the enviroments and sound design are, but the game has a very realistic way of bringing the aching reality out again. I have never seen death and grief materialized this perfectly. With the amount of diverse and heartbreaking stories, chances are you will find one or more that particularly resonate with you. And it will transform your  experience of the game, I can promise you that. You are the exception if you did not cry during this game. It is a part of its beauty, embrace it â™¡\n\nI would recommend this game to everyone. If you do decide to play it, prepare to have a blast with both hilarious and heartwrenching dialogues. This game will keep you on your toes. You can also expect challanging platformer puzzles and minigames. But also a lot of therapeutic, soothing, liminal \"in between\". The pacing might be out of the ordinary for you, but please, give it a chance. You will grow used to it, fond of it even, and it will be worth it!\n\nMost of all, I just hope that you end up as sucked in and enjoy this extraordinary story, with an equally impressive aesthetic experience, as much as I did. These characters will stay with me forever. Thank you, Thunder Lotus! \n\nPs. I wrote one of my seminar works about how this game tackeled the themes of death and loss, not kidding. This game changed me. And the music has been on repeat for me since.\n\nPps. I will be playing any new game that Thunder Lotus releases. YouÂ´ll have a loyal supporter in me, Thuder Lotus, until Stella send me off too â™¡",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Unironically one of the best story games i've ever played, I finished it at like 94% on xbox but honestly don't have the guts to replay, I don't wanna lose atul agian, though it is peak",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Spiritfarer is just one of those games. It is one that can only be played. It cannot be watched. It also just hurts so much. I first learned of this game through a friend I have lost contact with and man has this game just made that loss hurt so much more. But at the same time it has comforted me. \n\nThis game is perfect in it's imperfections. You know how big corporations water everything down in order to try to appeal to everyone? It's fair to call this game the opposite approach to the same goal. You will not like some of the spirits you encounter and that's just fine. They weren't made for you. A great example of this is Daria. To those she isn't made for at best she's a confusing character and at worst she's just in the game as the token mental health character. But allow me to inform you that is not the case at all. She was made for people like me. And man does she comfort me. Rather than try to make everything appeal to everyone this game instead makes specific parts of it built for specific groups of people.\n\nThis game is genre breaking. No, not in the traditional sense of the word. I play FPS, rougelike, strategy games! Yet here I am with my favorite game being an emotional hotel manager game. It just, hits differently.\n\nSpiritfarer is my favorite game. Not because it is perfect in every aspect. I hate Bruce and Mickey. But because the parts that do work for me hit me harder than any other media. Daria is my favorite character and if you decide to buy and then play through the game to see what I'm talking about chances are high that you won't like Daria. But along the way there will be another spirit that speaks to you emotionally. Don't be afraid to just sit in your chair or on the coach to just think about what you just witnessed what you were just told. A decent portion of your playtime can and should be you staring at the monitor or TV crying as you process what just happened. \n\nSpiritfarer doesn't shine when you are playing the game. Spiritfarer truly shines when you are laying on your bed, the coach, the floor letting the game run while you try to make sense of what you were just told. The more you are willing to put into it the more it will give you. Cannot recommend it enough. I look forward to seeing your reason why it's your favorite game. Will it be Daria? Summer? maybe you can explain to me how Bruce and Mickey affected you. Please do come back and tell me in the event you decide buy this amazing game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played this game well over two years ago and still feel immense love for it anytime it crosses my mind.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Loved it, very chill,  nice mechanics, lovely story, very contemplative, pretty graphics, interesting characters...certain game mechanics could have been improved (e.g the zipline) but overall pretty good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game hits me hard everytime.\n\nI'm not ready for their goodbyes. When they leave, the things they left behind always reminds me of their final moments, its bittersweet, but its for the best\n\nalso, the game is a solid 9/10 btw",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sooooo\r\nI knew this game was great, but I didn't know it was THAT great.\r\nThe world building, the implications, the characters, everything is so well written.\r\nHad a blast playing this game, it took me about 32h I think to finish the main story, and now I got a few more things to do, but I believe I'm very close to the 100%.\r\n\r\nI highly recommend this game if you wanna chill, and go through some pretty heavy stuff emotionally speaking.\r\nMight be among my fav games ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the most beautiful but heartbraking games I've played. Getting to know the characters and creating a bond just to release them 5 minutes later made me shed a tear every time. \r\n\r\nAs someone else said, \"The best representation of grief, loss, love, family (and found family) ever.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spiritfarer is not the kind of game I usually play, quite far from it actually. But Spiritfarer has a lot of good things going for it: it has a really nice ambience mixed with dramatic moments in which we unravel the life of Stella, several characters which allow us to delve into different aspects of Stella's relationship with her surrondings, it has some funny events sprinkled here and there and it has good music and sound effects. \n\nOverall, is just a really cozy and relaxing game in which we need to help everyone we can by going from A to B and talking to people, allowing some of them to share the journey with us and making their lives a bit easier along the way... up until the end. If you like cozy games, give it a try. It might look a bit boring, but the story pieces got me interested on knowing more, so that might happen to you as well!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Play a cozy game\" they said. \"You'll LOVE Spiritfarer\" they said. \"Stream this cozy game for us.\" \nI feel like I should be awarded some sort of compensation for the absolute heartbreak this made me feel. Screw you guys, it's a great game, but screw you.  10/10 game. I helped Alice home for the last time and I'm still crying. How DARE you do this to me. Anyway I can't recommend this one enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please go into this game blind and just feel the emotions that pass.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a beautiful game. Played the whole experience in couch co-op. Spent so much time not wanting to end the game, so did a fairly completionist-ish run.\n\nThere were definitely some moments we got a bit stuck and frustrated from how grindy the game got, but we just put it away for a while and came back later. This game isn't designed to be completed in a single setting, just a bit every now and then, and it feels best to take it at a slow pace.\n\nIt's a beautiful game. A very sad one, but also a cozy one. Definitely one of the best couch co-op games I have ever played, but be prepared to cry several times. Especially Stanley and Jackie hit me hard.\n\nBug sidenote:\nOnly really ran into a single annoying bug: hugging spirits (the blue coloured ones) as Daffodil can lock up the game for player 2 (but this is quite minor and you can just save and quit and reload with 0 progress loss).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game. Yes, the grind is ~real~ , but the story is so beautiful. The animation is *chef's kiss* . You really fall in love with every character, and it's heart wrenching to have to say goodbye to everyone. So far, Alice was by far the hardest to let go and most emotional goodbye (and I've only let go of her and Gwen...so I know this is gonna get even harder moving forward). Not sure if I'm emotionally ready to complete the game if the second person to say goodbye to was this difficult. Alas, to the end we go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The art style is beautiful and the music is amazing. The story is very rich. Fun to play, lots of gameplay, cozy, ect. Includes fishing!! Very fun to play Tetris with the structures. Did I mention that the story is great? Not only in execution, but the idea is great as well. (I cried.) It will tear your soul and rip your heart out. Good luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say it's a rather great game, though...\r\n- It requires quite a large amount of grind.\r\n- The game occasionally demands finding certain resources in order to continue to the plot, and I personally sometimes struggled to find them, cause there were no clues at all.\r\n- Moving across the map on the ship is a bit annoying. Only in the very end of the game it stops being annoying.\r\n\r\nbut:\r\n- The hand-drawn animations are INCREDIBLE. So smooth, so gorgeous. I love them.\r\n- Anthro characters are great, not only in terms of appearance, but also each of them are different and interesting to get closer to.\r\n- Mini-games are admirable! Truly interesting. I never got bored of them.\r\n- The overall atmosphere + music are pretty good too.\r\n\r\nI'd say this game is much better than their previous projects such as Sundered. Finally they realized that doing games with no fights is what they should be doing. 8.5 out fo 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game with a heart-warming story. I love how it tackles heavy topics with the sense of a feel-good hug instead of a darker approach. Not necessarily too optimist sentiment, but more of \"it's flawed, yet that what makes life beautiful\" kind of thing.\r\n\r\nCan I applaud for the beautiful 2D animation and concept? It was so beautiful, I have to take awhile every single time Im playing this game because Im so awed with how gorgeous it is. I love the art direction of this game! The game mechanic is super fun too! Challenging but quite fun regardless.\r\n\r\nHaving the overwhelming positive in steam is well deserved <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I haven't yet finished my first complete playthrough. I already played a heinous amount of this in the past few days, to the degree that I am concerned for myself hahaha. It just sucks you in, really. For me personally it helps that I like both platformers and management/farming sims (my two favourite genres, besides interactive fiction in any sense, which this game ALSO has). I guess I've been speedrunning the process a little, given I've mostly just - kept progressing further and further until now, where I'm at what? Probably somewhere around 80% completion as it stands. I think I only have three more spirits left to ferry away. But it's genuinely such a gem of a game. I love how the shrines and the unlockable abilities can unlock a ton of new parts of specific places you've already been to. Like, I like that kind of replayability. I like returning to places in order to experience them differently now. I assume a lot of people have already commented how the characters are great and that the stories that are embedded into this are amazing. They are correct. I've gotten teary eyed multiple times and it takes skill to actually make me cry. In the sense that I feel a lot of things in general, but oftentimes need more exposure to that in order to truly get to tears. And given I'd consider the balance of story vs gameplay a 40-60 split in this game right? It's truly impressive that I've actually been a little inconsolable about certain characters moving on. I am afraid I'd need to actually progress until the end to fully understand the greater picture BUT. Man is it such a good game. Please do not be like me and genuinely take your time with it. Just enjoy the ride, y'know. I'm enjoying it but I wish I didn't rush through quests to see how the story plays out. The story is written so that you take your time with it. This is one of those games you play to relax, and possibly cry. Yeah. I don't know if the Farewell Edition is any different from the original but MAN this is a great experience regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, it's taken me a minute to get into another game recently. I wanted to restart Dave the Diver, I usually play Stardew, frontier games, just finished Dispatch -- This is up there. Usually for cozy games I get caught up in wanting to finish the story arc as quickly as possible, but I was really able to take my time in this! \r\n\r\nI really enjoy the music, quirkiness, and the fact that each map area isn't HUGE. You're mainly on your boat navigating small islands, you can map your own routes, and the cooking is also really fun. \r\n\r\nThanks to the team that put this together, it's honestly such a great game; I've barely started and I'm already dreading finishing it too quick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute beautiful game. 10/10 Great soundtrack, stunning art and awesome gameplay. Would highly recommend. Tissues at the ready!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best damn games I've ever played. I cried like a baby and regret nothing except those fucking sheep getting on my boat, I wish I could kill them and make lamb chops. I was so angry at sending some spirits away because I would've made the same creative choice and it hurt like hell. Goddammit you beautiful bastards you made me FEEL THINGS. I swear, you guys are incredible and I will buy every game you make. This game will stay with me for the rest of my life. You have truly made something incredible and I can't recommend this enough. I would definitely recommend playing with a friend and a box of kleenex. I will definitely replay this game someday once I stop crying <3 <3 <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is frankly too long, but that's about the only negative thing I have to say about it. Once you get an hour in, you really start rolling, the gameplay loop makes sense and is fun, and the characters are amazing. A couple of the spirits (the hedgehog and the mushroom) nearly brought tears to my eyes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is my absolute favorite game- i fell in love with the story instantly and it opened up an entirely new way of thinking for me. i love spiritfarer, love thunder lotus, and i can't wait to see what comes next!!!\n\nthis game is amazing pls give it a chance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is beautifully drawn, has  a great story and nice quests, but is a bit slow and repetitive at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I knew roughly what to expect out of this game, and even then I was surprised with how much of a roller coaster of a journey it was, and how much depth its world held. \n\nI found this gameâ€™s â€œCozyâ€ and somewhat tedious gameplay loop to be somewhat of a grounding element that contrasts well with the storyâ€™s overall somber subject matter, this gameâ€™s lovely cast of characters and writing kept me invested in the journey throughout my 40 hour playthrough and genuinely upset me at multiple points throughout the story only to lull me back into a hopeful mood of carrying on for those whose lives and experiences helped guide you through your own.\n\nA beautiful melancholic masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most beautiful and heartfelt games i've ever played. you'll cry, and that's good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game, Id reccomend it to anyone who wants a cozy realaxation game with super cool visuals and story. Also helps with dealing with grief and feeling understood in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please play this game, just once at least. Speak to EVERYONE, hug everyone, cherish every moment. Remember it's not the end you're trying to race to, it's the journey you're trying to fulfill, and those you meet along the way.\n\nA calming, beautifully illustrated masterpiece of a game with gorgeous soundtrack and unforgettable characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is beautiful, and I'm glad I finished playing through it.  A small word of warning - it may cause you to cry multiple times due to how attached you will become with the other spirit passengers.  Developers stated they had a psychologist help them flesh out the dynamics between Stella and the other spirits, and it definitely shows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glad I gave this game a chance. Beginning is a slow burn but it eventually turns into something much deeper. The gameplay is like a mix of Raft, and Stardew Valley / other community farming sims. \r\n\r\nInterpretations of the story vary but there's a lot of themes about loss, dreams, coma, and bucket lists. Definitely worth a try for anyone who wants something casual with tear jerker moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely beautiful and touching game, all the characters are lovable in their own way, the artsyle and gameplay are so calm it makes you want to take your time getting around and getting to know the characters. This is a very unique game that gives a new perspective to life and death.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful art style, intuitive gameplay and controls, and a story that's made me sob multiple times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I meet you with a trailer, and I played enough to know you are one of the greatest games with passion on it's art and characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "controls are a bit hard to learn but its fun outside of that. easy to play w one hand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not the most exciting game but its a beautiful and sobering meditation on death and grief",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a love-hate relationship with Spiritfarer. It's not like other games that I have a love-hate relationship, because they don't get updates, or the devs don't understand their own game, or the game is simply bad and I like it regardless. No, Spiritfarer is different. I love it because the world building is magnificent, the graphics are divine, and the characters are as spirited as possible. And I hate this game because it's entire premise is taking that one character everybody loved and killing them off. Which yes, that is what I signed up for when I bought the game, but I didn't expect it to be so devastating. \r\nSo yes, I love this game, and I hate it because I love it.\r\nIf you want to experience the same rollercoaster, then I highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly fun game, very chill and comfy while being interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spiritfarer is a game that I really enjoy, one of my favourites in fact. The music is great, the graphics are pleasant, the characters are endearing, and the overall development of the story is enjoyable and touching. You might want to have some tissues handy.\nThanks for the game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spiritfarer is probably one of my favorite games of all time. I personally love management games and it never got too repetitive or boring for me. I also have the art book, I really enjoy the art direction in this game and reading about the reasons for many of the characters' designs only made me like it more. The story is beautiful- the way Stella's story is gradually revealed but not directly spoken is done wonderfully and even when you don't know the full picture, the character interactions make you endeared to all the spirits you meet. This game also has one of my favorite soundtracks. Max LL's tracks are bittersweet, haunting, and tranquil right when they need to be. I intend to finish all the achievements on my next playthrough, which will be my third time around, and I'm really looking forward to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've yet to 100 the game, but I am enthralled. The character design. The message. Stella's cat. Peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a masterful feat of game design. it somehow does everything. it defies genre. it has no combat but still touches on dark topics without ever getting too dark. it is incredibly wholesome and deep at the same time. and the farming/cooking/selling/upgrading is an addicting loop. the movement is also so so fun. hopping and zipping around and unlocking movement upgrades keeps the game always challenging and a mental puzzle to figure out whether or not you can reach that ledge or you need to unlock something in the future. truly a wonderful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it's a very pretty game, I haven't even finished it yet at 12 hours, the stories make me sad which is a good thing I guess?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what can I say it's a cozy game man. granted i haven't touched it in over a year (wow wtf smh *chuckle* ), but even though I still love to play it. I had to start a new a file, bc I forgot the mechanics haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game !\n\nI finally found a way to resume the game (on my Mac) but it isn't very intuitive. \nI wish this game played in its own window instead of taking over the whole screen and no way to just pause it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely breathtaking from start to finish. Everything about it, from the art style to the music to the writing and narrative to the exploration, management, upgrading and platforming aspects to the sheer amount of detail in every single part of this world and story to the emotional gut punch it packs... I'd honestly go so far as to call the game perfect.\n\nIt made me cry on probably fifteen different occasions and that is a huge compliment. The way the characters are written make them so tangible and letting go of them feels very cleansing.\n\nThis game is challenging at times, but at other times purely relaxing, and it is intentionally slow in certain moments, which really allows you to reflect and feel some kind of peace. It's extremely comforting.\n\nThere is exactly one achievement you cannot get on a single playthrough, and I'm so not even mad about it because it gave me an excuse to start a new file on this masterpiece immediately after completing it. I wouldn't have known what to do with myself otherwise.\n\nGive this game a try. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played and beat the game on my Switch. Of course I had to replay it on my PC since new things have come out since. <3 10/10 cozy and perfect. Makes everyone I know cry at the perfect times, it's honestly just perfect. If you're into cozy games and just low risk, explore and do things- this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this on sale, I will say I played 6 hours but I could not get into this game, I tried to I really wanted to but it was so slow for me. I did enjoy the mechanics and the design, I just felt it was slower but I would still recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Screw this game for making me both laugh and cry in the span of 10 minutes. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cozy and emotional game, beautiful design of characters and locations, I love the idea and the execution!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spiritfarer was one of those games that I was very on and off with, taking big breaks and not really completing it. At the time of this review I had finally completed it and wow. This game goes through a lot of subject, most notibly of grief and acceptance. I felt very attached to all the characters and love the story, also the OST is phenomenal and really puts a lot of emotion into the game. I would put this at a 9/10 and will be sure to 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the game but I feel it is too short and kind of pushes you to end it before you finish everything even tho there's so much still to be done. I do recommend it and I have to say the details of playing in this game are absolutely beautiful and heartwarming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gorgeous game. The art is amazing, the story, the game play. It's (to me) the perfect game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You are on for a journey. This is one of those game where you expect nothing and get serve the buffet of amazing storytelling, emotions and beautiful artwork. If you are looking for a cozy well thought game, this is for you. I cried, they cried, we cried. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spiritfarer is a beautiful and deeply emotional game thatâ€™s both relaxing and addictive. Thereâ€™s always something to do â€” from crafting and collecting materials to taking care of your ship and helping the spirits you meet along the way. The graphics are stunning, and the world feels alive and full of heart. The gameplay is satisfying, thoughtful, and perfectly balanced â€” a truly special experience that stays with you long after you stop playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nearly perfect gaming experience. Unique, powerful, heartwarming, rewarding. The writing on these characters you're guiding to the \"end\" is stellar. The mini-games to gather resources along the way are often fun and tie directly into how you've built your ship. Will you prioritize aesthetics, efficient resource-grinding, or the mini-games?\n\nThe smallest critique would be that the late-middle through most of the end-game can be a touch grind-intensive.\n\nI would probably love this game even more if I wasn't so ADHD and hadn't taken such long breaks between being active with the game. I'm sure I've forgotten well over half of the interactions and details I loved most about the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At the beginning, I felt like this was a chill game about death...well as much as death can be chill. It reminded me a bit like Stardew except on a boat and obviously about spirits. I played it every night until I got tired or frustrated (normally at not knowing how to get things before I had stuff unlocked). The game does give you the hints at how the storyline/progress needs to go through the tasks/missions. At the beginning of the game, I found the places I couldn't reach and the things I couldn't get to quite annoying but as I progressed it did make sense and can see why the developers did it that way.\n\nThe characters make you feel so many emotions. There is so much heart in the characters that I genuinely got sad saying goodbye to them or genuinely got annoyed at them. I also liked how the collections were not overloaded with things you didn't need or barely used, all stuff you came across mostly naturally during gameplay.\n\nThe only part I didn't like is how some levels can be hard to control (on PC) like Daria's levels made me rage quit too many times and some of the zipwires in the mines. I'm not sure how this can be improved on but they were frustrating when the rest of the game is quite easy.\n\nOverall, I'd recommend playing this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sosososososososososososo good\r\ni love this game <3\r\nif anything, play it for the music and the art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beautiful yet heartbreaking game. im only halfway through but ive already shed a lot of tears.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "took a while to finish the game due to the mid and late part of the game is really grindy. No new mechanics are introduced after",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing game, so cosy but definitely prepare to cry at points! I played through a good chunk of the game at a friends house and just had to get it myself!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game lingers long after playing it. Iâ€™ve never seen grief and death depicted with such beauty and depth in any form of media. Experiencing this game is something everyone should do at least once in their life - itâ€™s unforgettable, heartbreaking, and beautiful all at once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] What is this game? [/h1]\nSpiritfarer is a story heavy, semi-collectathon. This game puts the player in the shoes of \"Stella\" - a young girl who becomes the new Charon for spirits, having to give them closure before eventually sending them through the Evergate (basically death for spirits).\n\n[h2] Price/replay value [/h2]\nHorrible - Bad - [u] Decent [/u] - Good - Amazing\n\n[h2] Achievement hunting [/h2]\nAll achievements can be gotten within 1 run (assuming a reload for sealed/closed lips) - none are particularly challenging, but some can be missed quite easily e.g.; [i] The Happy Dance.[/i] With proper planning this shouldn't be an issue however.\n\n[h2] Pros/cons [/h2]\n[b] Pros [/b]\n[list]\n[*]Amazing writing with some very realistic characters\n[*]Good graphics and amazing soundtrack\n[*]Very casual\n[/list]\n\n[b] Cons [/b]\n[list]\n[*]Starts out [i] extremely [/i] slow with very little to do\n[*]Incredibly grindy sections during mid/late game\n[*]Spirit pathfinding is a mess \n[/list]\n\n[h2] Overall opinion [/h2]\nSpiritfarer is not a perfect game. \nThat said, I still enjoyed it a lot. The game at first really gave me the \"ick\" if you will, making me consider putting it down due to the tedious early game. After you chew through the tough skin that is the early game though, you'll be blessed with a deliciously juicy game that offers a ton of interesting characters and fun dialogue. From those who yearn to die, to those who fear what the Everdoor might behold, there's a bit of everything. Sadly I can't go into depth without spoiling that though so...\n\nThe gameplay, whilst quite repetitive, does eventually start to snap into place and offers a relaxing, and smooth experience. There's fishing, gardening, woodsawing... All having little minigames that you get to learn and get better at, making your resource production increase alongside your skill level. \nThe main traversal is via a map which simply requires choosing a location and you'll ship automatically go there. Whilst the controls could've used a bit more depth, it overall feels fine and responsive. The game also often does encourage going to unknown dark spots of the map so the player can find secret or obscure islands and treasures.\n\n\n[h2] tldr; [/h2]\nVery laid back, with a beautiful story.\n\n[h2] Should you buy it? [/h2] \nGo for it if you prefer story driven games. If you only care about gameplay, then this isn't for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very exciting game with amazing story! Very recommended to play it with your friend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it, amazing game. \r\nopen world, incredible narrative, very well done graphics, its a beautiful journey",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game (emotionally and maneuverable interactive story, actually) has helped me cope with the deep rooted grief of lost loved ones I did not get the chance to have a peaceful or soft goodbye with. It has also helped me deal with my own grief of chronic illness and oncologists, exhaustion, and depression. To some these are just games - but to others, like myself, they keep us alive and with something to look forward to. I took a few minutes away from playing this currently to write this - I hope it helps anyone else who is seeking an interactive, also controller friendly, safe place to game and heal maybe without it being a therapy appointment or someone telling you that you weren't good enough. This story made helped me understand I am always good enough. You are too. ðŸ’œ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heartwarming and take time pretty much enjoy except fishing mechanic.I find it's quite hard to fish a tuna.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the premise and the passengers stories.\r\n\r\nReally hated all the parkour and jumping around to get loot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics, indulging dialogues and a cozy vibe. Love it!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very wholesome and very hearty like a bowl of warm soup I love this game so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crashing on High End PC\n\nCPU: i5 10400\nGPU: GTX 1650\nRAM: 8GB DDR3\nDisplay: LG G4 OLED 4K\n\nfix your game plz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is my everything. it's rare that i love a game this much this fast, but this is a masterpiece. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually lovely with relaxing gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not yet finished the game, but I love it. The art is beautiful and the characters have depth. \r\nIt does get quite sad at times, it is a game about death after all, but is such a beautiful portrait of death and what lingers on after you're gone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall pretty neat. The only quirk that is of note is the pair of achievements that are mutually exclusive, either requiring one and a half playthroughs to 100% the game or a bit of save scumming like I did. Besides that, I recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insanely stunning and well made game. The atmosphere and game play were so enjoyable and it felt so rich to experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I cannot explain the journey that this game took me on. At first, I was captivated by the art style, then the characters, then the story. This game taught me how to deal with grief and trauma in ways that I never thought of trying. It gives you an intense look at inner struggles and how people perceive life. You absolutely need to play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spiritfarer is a game that makes you stop and think about what needs to be done, whether you want it to happen or not.  Beautiful soundtrack, well-written characters, tear-jerking story progression, and so much more is packed into this wonderful game.  I cannot recommend it enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i can't believe i won't get to experience this game for the first time again...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spiritfarer isnâ€™t just a game, itâ€™s a warm hug that eventually breaks your heart and then bakes you a pie.\n\nYou help spirits pass on, but instead of grim reapers and darkness, you get cozy hugs and a talking cat. ðŸˆ Every passenger has quirks, some make you laugh, some test your patience, and some are frustrating. ðŸ˜…\n\nItâ€™s the perfect blend of chill management, exploration and emotional storytelling. Youâ€™ll be cooking, farming, upgrading your boat and much more.\n\nThe art is beautiful, the music hits hard and in the end you understand the writing feels painfully real. You donâ€™t just ferry spirits, you learn from them and then you let them go. ðŸ’› :-)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I cried... a lot... and that's fine! \r\nMay Jerome/\"Buck\" plan RPG-rounds somewhere out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOW COULD YOU NOT [spoiler]LET US HAVE A PROPER GOODBYE WITH ATUL[/spoiler].\n\n[spoiler]I DIDNT GIVE GWEN HER COFFEE BEFORE SHE GO. AND I DIDNT KNOW WE COULD DELAY HER DEPARTURE.[/spoiler] ðŸ˜­ðŸ˜­ðŸ˜­ðŸ˜­ðŸ˜­",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the most beautiful game I have ever played <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game yang asik terus slow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "death is an opportunity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The ninjas... Cutting onions again...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One hour in and I already love it to bits !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game to just relax to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TEARS! TEARS! DESPAIR!!! LIFE IS PAIN AND ALSO BEAUTIFUL!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game! Highly recommend â™¥",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a pretty game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great cosy game, really enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm in shambles but it was worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful, give me 10 more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all i do is cry on this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love you Mom. Please, forgive me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't know I could cry this hard, neat.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah this game has a cozy vibe to it, and the story line stands out in a way, but after a while the game play becomes so tedious and boring that it feels more like a chore rather than something you enjoy. Most of the mini-games feel like they're there just for the sole purpose of stretching the game out and don't offer anything in terms of fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thunder Lotus team always delivers the visuals, it's the main reason I bought this.\nHowever, this game's dialog is genuinely awful and off-putting.  It doesn't fit in with the setting and feels exhaustive and out of place.  Spiritfarerâ„¢ played nice and \"cozy\", but everytime you have to interact with a character (which is often), it rips out your comfort and jabs at your senses.  \nI wanted a chill game to play with my daughter on the couch and this seemed like a good idea, but reading the writing out loud adds an extra level of pain to the gameplay.  \nTheir previous titles didn't really have any dialog, but I figured with all the hype and advertising, it would at least be minimal and sweet.  Not the case.\nThe other gameplay elements are fine, like I said the visuals are great.  But this game gets dragged down too much by the writing for me to keep anymore interest in playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah this game has a cozy vibe to it, and the story line stands out in a way, but after a while the game play becomes so tedious and boring that it feels more like a chore rather than something you enjoy. Most of the mini-games feel like they're there just for the sole purpose of stretching the game out and don't offer anything in terms of fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thunder Lotus team always delivers the visuals, it's the main reason I bought this.\nHowever, this game's dialog is genuinely awful and off-putting.  It doesn't fit in with the setting and feels exhaustive and out of place.  Spiritfarerâ„¢ played nice and \"cozy\", but everytime you have to interact with a character (which is often), it rips out your comfort and jabs at your senses.  \nI wanted a chill game to play with my daughter on the couch and this seemed like a good idea, but reading the writing out loud adds an extra level of pain to the gameplay.  \nTheir previous titles didn't really have any dialog, but I figured with all the hype and advertising, it would at least be minimal and sweet.  Not the case.\nThe other gameplay elements are fine, like I said the visuals are great.  But this game gets dragged down too much by the writing for me to keep anymore interest in playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah this game has a cozy vibe to it, and the story line stands out in a way, but after a while the game play becomes so tedious and boring that it feels more like a chore rather than something you enjoy. Most of the mini-games feel like they're there just for the sole purpose of stretching the game out and don't offer anything in terms of fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thunder Lotus team always delivers the visuals, it's the main reason I bought this.\nHowever, this game's dialog is genuinely awful and off-putting.  It doesn't fit in with the setting and feels exhaustive and out of place.  Spiritfarerâ„¢ played nice and \"cozy\", but everytime you have to interact with a character (which is often), it rips out your comfort and jabs at your senses.  \nI wanted a chill game to play with my daughter on the couch and this seemed like a good idea, but reading the writing out loud adds an extra level of pain to the gameplay.  \nTheir previous titles didn't really have any dialog, but I figured with all the hype and advertising, it would at least be minimal and sweet.  Not the case.\nThe other gameplay elements are fine, like I said the visuals are great.  But this game gets dragged down too much by the writing for me to keep anymore interest in playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah this game has a cozy vibe to it, and the story line stands out in a way, but after a while the game play becomes so tedious and boring that it feels more like a chore rather than something you enjoy. Most of the mini-games feel like they're there just for the sole purpose of stretching the game out and don't offer anything in terms of fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thunder Lotus team always delivers the visuals, it's the main reason I bought this.\nHowever, this game's dialog is genuinely awful and off-putting.  It doesn't fit in with the setting and feels exhaustive and out of place.  Spiritfarerâ„¢ played nice and \"cozy\", but everytime you have to interact with a character (which is often), it rips out your comfort and jabs at your senses.  \nI wanted a chill game to play with my daughter on the couch and this seemed like a good idea, but reading the writing out loud adds an extra level of pain to the gameplay.  \nTheir previous titles didn't really have any dialog, but I figured with all the hype and advertising, it would at least be minimal and sweet.  Not the case.\nThe other gameplay elements are fine, like I said the visuals are great.  But this game gets dragged down too much by the writing for me to keep anymore interest in playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah this game has a cozy vibe to it, and the story line stands out in a way, but after a while the game play becomes so tedious and boring that it feels more like a chore rather than something you enjoy. Most of the mini-games feel like they're there just for the sole purpose of stretching the game out and don't offer anything in terms of fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Interesting premise and a concept which is okay, feeling inspired by something like Ori with its big moments and events clad in moving music. But unfortunately the game is too long for its own good and the pacing can get messed up by the characters which where added after the initial release. Some of them are cool, like Gustav or the frog, whose name I already forgot.\r\n\r\nThis made me end up not really caring much about the characters I had left on my boat or at Overbrook and kind of rush towards the ending, just to finish it after playing for about 20 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I feel like this game wasted my time. It's hard to be emotionally invested in the story when I have to trawl through slop for hours to get a peanut. Way too much padding, pointless repetitive resource management, backtracking, really basic platforming and no real player input or choices in the story or progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the artstyle is lovely, and the characters are quite charming. i can see why people like this game. those two, coupled with people's positive reviews about the story are what drew me in in the first place.\n\nhowever, for me, the gameplay loop was extremely tedious, and essentially boiled down to doing the same boring tasks over and over with little to no variation. not to mention having to sit through long animations that play everytime you do these tasks. sure, the animations were cute at first, but since you can't cancel these animations (like in most other games), it got real annoying super fast.\n\nthere might have been heartfelt moments tucked in there somewhere, but i never bothered to seek them out cus the gameplay loop drained me before the story could land. the urge to alt f4 and play something else is sstrong with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I reaaaally want to like this game but it's so overwhelming, I played it a few years ago for around 30 hours and ended up dropping it because I got super overwhelmed by all the requests and the game not telling you where to find certain resources so I would constantly need google open or how if feels like to do 1 request I need to build like 3 different things, find a resource I've never seen before and upgrade my ship just to finish one request and I tried to play it again today, I couldn't start from my old save because I had no idea what was going on but I really wanted to try again so I started a new save, played it for a few hours and got overwhelmed again and remembered why I stopped playing it in the first place, this game feels like it's trying to be relaxing but instead it just makes me feel guilty when I can't complete my guests over complicated requests and overwhelms me when I'm told I need specific resources without telling me how to actually get them, it's just too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Thunder Lotus team always delivers the visuals, it's the main reason I bought this.\nHowever, this game's dialog is genuinely awful and off-putting.  It doesn't fit in with the setting and feels exhaustive and out of place.  Spiritfarerâ„¢ played nice and \"cozy\", but everytime you have to interact with a character (which is often), it rips out your comfort and jabs at your senses.  \nI wanted a chill game to play with my daughter on the couch and this seemed like a good idea, but reading the writing out loud adds an extra level of pain to the gameplay.  \nTheir previous titles didn't really have any dialog, but I figured with all the hype and advertising, it would at least be minimal and sweet.  Not the case.\nThe other gameplay elements are fine, like I said the visuals are great.  But this game gets dragged down too much by the writing for me to keep anymore interest in playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was all for this game until the Golden Dragon. Why make this cozy, sweet game and then throw such a sour left hook right into the player's face like that? The stupid, mean Golden Dragon mini-game/quest makes me want to rage quit this game.\n\nDaria's platform game is insufferable. I read the developers meant it as an allegory for mental illness but reading frustrated reviews on Reddit it made a bunch of frustrated and mentally ill. There is making difficult games and then there is being antisocial and mean to the players.\n\nThe ending is so lackluster. After all that work! There were a couple of interesting characters - Stanley was my favorite - but most were annoying and rude. I skipped past most of the word dump because I simply. did. not. care.  \n\nI bet in over 50 hours because I was determined to finish the game and now that I have, I doubt I will ever return to it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It start up nice and chilling but too much grinding just after like 2hour into the game, it just making me do chores for the passing days instead of enjoying time passing by anymore.\r\nFeed, travel, collect resource, doing \"request\". no time to chill at all and the game attacking on your conscience if i not doing the chores my spirit is \"unhappy\". While doing all of those chores, you are doesn't get much help from them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too childish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR - The game starts off interesting enough to pull your attention -- then drops the ball as the game progresses with poorly thought out resource management, and tedious repetition for gameplay length padding.\n\nThe majority of negative reviews hit this one on the mark. Someone came up with an okay story idea, but didn't have a well thought out plan of how to convert that into a long gameplay experience.\n\nThe resource management in the game is ridiculous, and only gets more tedious as the game progresses. There is an excessive amount of backtracking that is made more cumbersome by not being able to custom mark the map for things like abilities needed for certain areas or goals not yet met. There are a good amount of fast travel points, but it still does not offset the need to write down or remember special attributes about each island that you may have to revisit later due to inaccessible areas.\n\nThe gameplay loop starts to get stale after the first couple of completions as the loop does not really change much as you progress further into the story. You get some fetch quests, upgrade homes, then turn them in. The character stories are okay, but there's not too much depth to the characters themselves to pull you into what ails them.\n\nEventually you kind of just stop caring at all what they have to say. You become a dead husk inside from the tedium. As a consequence of this, you kind of start speeding through the dialog so you can take their next request, grind the necessary resources, and then send them on their way -- Spiritfarer: Jaded Edition.\n\nThe hand drawn art is well done, and the character design is neat. Music helps pass the time in game, but it isn't something that will get stuck in your head. Player control is solid, and game customization like display options and control mapping is done well.\n\nThis game was one that I was going to think was okay if you got it on sale. However, after putting more and more time into it to see what direction the game takes after you sink a good chunk of time into it, I really just ended up wishing I hadn't wasted the time I had already put into it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Devs seem to have struck gold with a certain audience that eats this up writing essays about how the stories made them cry their eyes out, without a single mention of the plethora of flaws this game has. For me, after giving it two chances, 10 hours of playtime each, I can confidently say that there are way too many things wrong with the actual gameplay for me to recommend this game. I continued playing where I stopped last year, and a couple hours in it became clear again why I got tired of playing this game:\n\nSpiritfarer as a videogame is basically tedium in fancy clothes, looks and sounds good but when it comes to the actual gameplay elements? Good Lord what were they thinking... Every single task takes an eternity and has to be repeated in full hundreds of times throughout a playthrough, from the stale minigames to the long and slow animations, farming, mining, cutting trees, processing resources, it all takes such an insanely long time that I really can't be bothered anymore. Each and every single item has to be added one by one to boot, there is no slider or \"add max\" button, nothing, if you want to process 50 logs of wood, guess what? You're pressing that \"add\" button 50 freakin times... only to then manually saw each individual piece during a repetitive mini game. For the last 3 hours in this game I've just constantly been asking myself \"why did they not let players unlock \"auto\" mode after repeating the manual process a set number of times?\", it really, really feels like playtime was padded in the worst way possible, making you repeat tedious needless actions ad nauseam.\n\nTo expand on this a bit further: Take planting crops for example. You build a garden which has 3 plots of land, you put a seed in every plot, every single time you plant a seed, an animation plays. Then you need to water each individual plot separately because why not, and of course another slow animation plays. You'd think that'd be that, now it's waiting time! But nahh, you'll need to water them AGAIN before the plants mature. And that's just a single garden lmao... You could have 4 gardens and 4 fields (or, God forbid, even more), that's 24 plots of land, yeah, it gets insanely tedious. All of this would have been forgiven if you could just upgrade your buildings to maybe automatically water your plants, but no, you'll be doing it manually for literally dozens of hours, hundreds perhaps thousands of times. And that's just your plants, you want to milk cows? Watch a slow milking animation, then watch an animation of the cow lying down, because you can't feed the cow until it finishes the animation, and then you feed the cow or it won't produce milk again over time. Picking apples from your tree? Yeah, watch your character slowly touch the tree until the apples fall off. I mean, what are we doing here, this isn't a chill game, this is watching paint dry almost taken literally.\n\nOn top of all of this, progression is literally just fetch quest after fetch quest, the game constantly sends you back and forth to islands across the map that are all filled with tall buildings that you can enter, but that don't contain a single thing, you can climb them from the inside, but there's no purpose, it's annoying, it's frustrating, it makes me feel like my time is being intentionally wasted. Traversing the map is painfully slow for most of the playthrough as well, and if you pass through an optional event to collect resources, your boat will stop in it's track without exceptions and you'll have to first interact with an NPC on your ship in order to skip the event. Why, just why?...\n\nThere's more small annoyances all over, like your map being inaccessible at night because you can't sail your ship after dark. Ok, but why am I being prevented from seeing the map and planning where I want to sail the next day? It just doesn't make any sense at all, like many things in Spiritfarer.\n\nI'll probably try to finish my run but after 20 hours I am completely and utterly done with the tedious nature of every single repetitive task, and it looks like I'm not even halfway done with the story, so that's promising. It will take some serious surprises to make me change my opinion on this one, not recommended for people who are looking for actual fun gameplay, recommended for people who get emotional easily and have never played an actually fun and engaging resource management game I guess?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I love the premise, the characters, the artstyle, but for me the game is held back by very repetitive resource managment gameplay where you have to do the same small mindless minigames that lose their novelty the first time you try them.\n\nI tried to get into this game on multiple occasions, but I cannot plough trough the dull resource grind which greatly sours my gameplay experience.\n\nI feel a bit sad that I'll never get around to learn all the characters' stories. I suppose the pace of the game simply isn't for me. I don't doubt that many other people may not have a problem with it or even prefer it due to its supposedly \"relaxing\" vibes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really believe that this game has a beautiful story that follows very well with its art style. However, the monotonous gameplay is just not well designed and it made me lose my patience really quick. It feels so slow for what it wants to be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I feel like it was just a time consuming after a while. I am sad to give a thumbs down to this game but it doesn't make me feel like what it was suppose to be as a \"game\" itself. doesn't fullfill my expectations either doesn't enjoy me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has a strong start with a few well written characters, then falls off a cliff in quality for the next 40 hours. Maybe worth watching as a lets play, but the gameplay is shallow, tedious, and repetitive, the majority of the characters are unpleasant to interact with, and the surrounding community is abysmally abhorrent.\n\nthe musics pretty good, animations are a weird mix between very pretty and fluid, or the cheapest ugliest method possible.\n\ntheres a little to really love about this game, and a lot to really dislike.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, well, well, this game is definitely addictive, but in a very bad way. It reminds me of a mobile game you can't put down but leaves you feeling like it was an absolute waste of time afterwards. If I had to describe it with one word, it would be 'stretched'. Everything in this game is stretched ad nauseam.\nThe mini games get worse (!) over time. How is this even possible? The fishing and planting was ok imo (could have developed in a better way to be not that wearing, but well) but what the hell was the Smithy? First you need to simply wait for it to be done, then you need to craft it in an absolutely unenjoyable way. And you can't really do something between the waiting and the crafting 'cause you only have to wait up to ~30 seconds so it's not worth to do something else. It's just boring and time consuming. Like everything else in the game.\nI don't really understand why I only get one onion out of my onion plant. I need to buy seeds, I need to plant them, I need to water them, I need to wait, I need to harvest them and that all for one single onion. Why? \nI also really disliked the mini games to get the lightning in a bottle and the nebula fibre and all the other ones. I mean, the character moves smooth and that's kinda fun, but the ladders. I absolutely despise all the ladders on the boat. Every time I jump, my character ends up hanging on a ladder, every time I move, everytime I try to fall down, boom â€“ stuck on a ladder. It's incredible annoying.\n[spoiler]Eventually you get the dash, but it has a cooldown. Why does this ability have a cooldown? For what reason? It's not as if there are any enemies in the game. Yeah, you would get ridiculous mobility, but isn't that kinda the point? On top of that it shares the cooldown with the Light Burst ability. Just great.\nThe XP potion event is the worst imo. You're just standing there waiting for the purple â€ženemiesâ€œ to appear which you can only kill with the Light Burst, but the Light Burst has a cooldown that's longer than the enemies stay. So if two purple enemies spawn simultaneously, you can just kill one of them, therefore get one potion, and there is not a single thing you can do about it. Funny thing when the event itself isn't spammable and you have to wait ingame time to do it again. What a feature![/spoiler]\nIt's nice that there is a teleportation system, but I ended up ignoring it 'cause it started feeling like another waste of time. Why do I have to sail to the teleportation point to teleport? Yeah, it only takes a few seconds, but I can't really do something in that time. And I need to get in my cabine to set sail, I need to talk to Alex, I need to get in my cabine again to choose my final destination. There are just so many unnecessary steps in between. That's fine in the beginning, but if you have to do it again and again it wears you down.\nThe quests are kinda â€¦ meh. The progression is all over the place. [spoiler]E.g. Jackie. He has a pager to contact me. And he contacts me instantly I get back on my boat. Why? I just talked to him, give this guy a little time ffs.[/spoiler]\nAnother problem I had with the game â€“ why can't I sail at night? There is not a single reason not to. The game tells you 'it's too dangerous'. But what should happen? It's just another tool to stretch the game. You can't even access your map to look where you wanna go next or where you missed something. Just annoying, annoying, annoying.\nThen you can't choose the amount of wood you wanna saw, the amount of coal you wanna use in the Foundry, etc. You have to manually transfer every single piece of wood, every single piece of coal. And it goes up to 50. And of course you have to saw every single piece of wood afterwards yourself. So that's fun.\nInteracting with the characters is also a pain in the ass most of the time. I can't count how often I wanted to give Buck something to eat only for him to dump some new info on me and immediately fly across the boat. Wow. So now I have to find him again? On my big ass Fearless Whale without any indicator of where to look for him? Nice.\nBut Mickey and Bruce were the worst. Every time you wanna talk to them, Bruce has to turn Mickey around if you're standing on the wrong side, then Bruce has to fly on Mickey's nose cause otherwise they obviously cannot talk to you. It just takes ages. And then they are so damn demanding about their food. But sorry, I don't know the ingredients for every dish in my inventory, so after a while I just didn't bother to feed them anymore.\n\nI don't have much to say about the story. I lost interest after a few hours cause the gameplay was so flat and stressful at the same time. There's one thing I have to give the game credit for â€“ you always have something to do. It might not be the most interesting thing, but you can always go fishing, try to cook a new meal, plant, water, feed your animals, shear your sheep, play your plants some music, travel somewhere, progress this quest, hug that spirit, â€¦ The list goes on. Kinda a wild mix of a slow, emotional story, yet hectic gameplay. Didn't work for me. I skimmed and skipped through most of the dialogue. But I don't think the story would've been my cup of tea anyway. [spoiler]I don't really like that Stella is presented as Charon's heir, but all of the spirits she takes care of are connected to her in one way or another. The game makes it pretty clear from the beginning that it's Stella's journey to the Everdoor and not the tale of a new ferryman for the dead (which I would've been more interested in tbh). Which is why it doesn't make sense that she's supposed to be a new Charon.[/spoiler]\nThe dynamic between Stella and the spirits was a little bit too familiar for my liking. I mean, she is new, but everyone knows her. Didn't really feel right for me. (I know, it makes sense storywise, but idk)\nI must admit the game is visually stunning. The character designs are great, the Everydoor looks phenomenal, the idea of creating new character-based signs of the zodiac is fantastic. But in the end I only had â€žrealâ€œ fun for roughly the first 3 hours, after that it was a very tedious (and addictive) experience. I can't bring myself to recommend this.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}