{
  "positive": [
    {
      "review": "It's dwarf fortress not much more to say. You love it or you don't care about it.\r\nTo me i could never play with the ASCII graphics (and i tried multiple times) and with graphic mods it was at least playable, but now on steam the graphics actually make the game look nice.\r\nI think this is a first game for me where graphics actually amtter.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "This game plays \"yes, and...\" escalation with you, and simply never stops. Every time you've finished a task, you think of ten more things you need to be doing, and before you know it, you've played through the night and get just as startled by the existence of the sun as your dwarves do. I love this game. (My sleep schedule hates it, though. <3)",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "This is the definition of a Labour of Love! Development started in 2002, it was first publicly released in 2006, and it remains actively developed, with no end in sight.\n\nGenerate vast, procedurally created worlds complete with detailed histories, civilizations, and ecosystems, then manage a group of dwarves to construct and defend an underground fortress against threats like sieges, monsters, and environmental hazards\n\nDwarf Fortress emphasises complex simulation mechanics, including individual dwarf personalities, skills, needs, and interactions that can lead to emergent storytelling and challenges!",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "You will either fall in love with this game or spit it out like an over-pungent cheese and I would have it no other way",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "don't be intimidated.  this is one of the best games ever made. yes it's a little hard to get into, but it's worth it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Its the greatest game ever made, I´ve played since the late 2000´s in all its ASCII glory at the time. I don´t agree with all the changes the new game has. But that´s just me being stuck in my old ways, as the game has moved on for the better. \r\n\r\nIf you want adventure, fun, and death spirals caused by a dwarf who hid in a tree and had to have it cut down so they would leave the map, get mad about getting cut down out of the tree and then proceeding to murder the poor dwarf who helped them down out of the tree.. Then this is the game for you ;3",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "A fully simulated world where anything can happen. Best game there ever was, period.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I have been playing Dwarf Fortress since 2017, and through that time spend many thousands of hours before the steam release, and I'm sure I will continue to play it for many thousands more. It is the most detailed, immersive colony-sim / story generator that exists.\r\n\r\nDwarf Fortress is self-directed and self-motivated; it's not the sort of game you can ever beat.\r\n\r\nThere's a pretty steep learning curve -- exponentially less now with the 50.+ release and GUI / mouse interface and tutorials -- but learning how to get a fortress to produce soap, steel, dyed and studded clothes, instruments, books, all take understanding and organization and time.\r\n\r\nThe fact that Tarn continues to push out substantial updates that rework or implement entirely new systems is ongoing testament to his life-long dedication to the project and the consistency of his vision and roadmap into the future.\r\n\r\nMay Amok guide your pick! STRIKE THE EARTH!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "After numerous fortresses that got off to a peaceful start, I knew it was time for a greater challenge. I had never experienced a haunted location before and had been warned to not embark upon one but my interest was piqued. \n\nI found a nice haunted place surrounded by goblin pits and decided this would give me action a bit more quickly than usual. I spent ages kitting out the dwarves to make sure I had the perfect party to embark and be prepared for anything that could possibly come at them. \n\nLooking around the landscape, everything looked so much weirder than I was accustomed to; plants I had never heard of and the ground was covered in slime. \n\nAs soon as I unpaused, a zombie ogre seemed to appear out of nowhere and grab the first dwarf by the arm, tearing it off in one swift motion. The unarmed dwarf started running away and the ogre was in pursuit. Meanwhile the arm that had been cast away suddenly re-animated and grabbed another dwarf by the throat. It squeezed hard until that dwarf was decapitated but then the head also got re-animated and bit another dwarf in the foot, tearing the toes off. \n\nWithin moments, every single dwarf had lost limbs which were all re-animated and crawling around attacking each other. \n\nThen the sky opened and blood started to rain upon the landscape...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game, infinite possibilities, insane dwarves. Please play this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dwarf Fortress is a game I started playing in high school. I built friendships off learning and teaching this game.\n\nThe official release for this game was heavily anticipated, and for good reason. Tarn and Zach Adams, and Kitfox Games, did a great job with the release of this game, and maintain both this paid version with amazing visuals, mouse controls, and OST, and the free version, which longtime players probably have spent infinite amounts of time mastering and love dearly.\n\nThe learning curve may be high, but it's not as high as it used to be. It is certainly learnable. \n\nRemember, \"Losing is Fun!\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Possibly deepest and the most complex colony/city builder simulator and story generator with appealing visual style and meditative soundtrack. More than 100 hours were not enough for me to fully comprehend the game and I can't yet build my perfect fortress that might satisfy me enough, though I'm not tired pursuing this goal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best game ever made.\nIts a bit buggy sometimes. But it more than makes for that with everything else.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Best indie game! Recommend for anyone looking for a highly detailed, fun game that keeps you on your toes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dwarf Fortress — A God-Tier Strategy Game That Somehow Got Snubbed\n\nDwarf Fortress not getting a Game Awards nomination for Strategy/Simulation 2025 is a joke. The nominees this year were forgettable at best, embarrassing at worst. Meanwhile, this game exists — a world simulator so deep it might as well be an alternate universe running on your hard drive.\n\nTwo guys built this. Two.\nAnd their work absolutely deserves recognition.\n\nIn Dwarf Fortress you can build religions from scratch, carve entire civilizations out of a mountainside, pump magma through engineered reservoirs to vaporize invaders, raise the dead, imprison demons, create legendary taverns, collapse entire caverns by accident, and lose your fortress in 300 different hilarious and catastrophic ways. You will fail over and over — and you’ll love every second of it.\n\nbest personal experience ( i had a dwarf decide he would go fill a bucket with magma then douse a giants leg with it to kill the giant.)\n\nNo other strategy or simulation game even touches this.\nNot in depth.\nNot in creativity.\nNot in “holy shit, did that actually just happen?” moments.\n\nYour imagination is the actual limit here. If you can dream it, the game will let you attempt it — and probably punish you for it in some spectacular fashion.\n\n10/10. Absolutely recommended. One of a kind.\nPlay it, lose a million times, and thank me later.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Dwarf Fortress is a deep and endlessly repayable colony sim where every choice can turn into an epic story or hilarious disaster. The Steam version adds clean pixel art and a modern UI, making it way more approachable while keeping all the wild complexity. The learning curve is steep, but once it clicks, it's one of the most rewarding strategy experiences out there.  Every fortress becomes its own mix of triumph, chaos, and pure madness.  Also, if you want a completely different vibe, Adventure Mode lets you explore the world like an RPG. If you like deep, complex sims, this one's an easy recommend. \n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a steam review. It is decorated with great words and awards. This object menaces with spikes of rage. On the item is an inscription of a dwarf murdering another dwarf. The dwarf is laughing.\n\nThe written portion consists of a guideline called Dwarf Fortress Steam Review, authored by Urist Armok. It concerns the losing is fun mentality of dwarf fortress and clunky, frustrating mechanics. The writing is organized and thorough.\n\nOverall, the prose is mediocre at best.\n\n+All Craftsdwarfship is of the highest quality+",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "> start game\r\n> do a mistake that's gonna cost you your fortress in 20 hours 7 minutes in\r\n> the fortress inevitably falls due to my incompetence\r\n> ragequir\r\n> do it all over again 4 months later",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been in these mines for years, longer than even I could tell you. I remember hearing whispers of a game called Slaves of ARMOK in school, but while searching around the old internet, found Dwarf Fortress instead. I put so many hours into this game, it's been a core pillar of my life for years.\n\nWhen the Steam listing popped up, I was so excited. This is a game of truly endless entertainment, but you need to work for it, and it will be unforgiving. Literally my first game in this version I had a dwarf, the only one with an axe, either get carried up a tree by a bird, or climbed up the tree to eat the bird's eggs and got stuck. Either way, he refused to climb back down because he was so offended that the bird existed, and died up there. The rest of my dwarves got so depressed because they could see his corpse in the tree, they all stopped working and only drank until dying. I couldn't get anyone to make a new axe to cut the tree down, and no one could climb the tree without getting pecked to death.\n\nI've been here for a long time, and I'll be here in 20 years, when this game finally hits version 1.0.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite possibly the best story generator of all time. The grand-daddy of all colony sims. Just buy it if you like these types of games. But be prepared to do some reading and learning. Once you know all the tools, you can be extremely creative. You're a small part of a big world, and it's a lot of fun to be part of that. Losing is fun after all!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, One of the best games ever made.\nIt has the most depth of ANY game I've every played... which is saying a lot. So, with that said, there is a definite learning curve to a game like this so it might not be for the feint of heart. I mostly played on the versions prior to it coming to Steam but did play a bit on here and it seems like a fine port.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is packed with complex systems on a simplified interface. The main game mode is a colony sim that has an enjoyable learning curve that can often remind you how much fun losing can be. I have yet to play much in Adventurer mode. What I really like about Dwarf Fortress over similar games is the in depth stories that get generated as you play. \r\nRecently, I had a Forgotten Beast arrive in the cavern near my fortress. It was stranded on a tree in a lake at the edge of the map. I had the dwarves dig out a space nearby where I thought my archers could see the beast through carved fortifications. That didn't work, so I had more rock dug away.  The miner finishing the dig got the beast's attention so they were now in melee with the uninvited guest. The archers were able to back up the miner, who landed the killing blow unscathed. I had a statue carved of the miner thinking that this fight would be memorialized. Instead, it commemorated the miner's love for a fellow dwarf in my fortress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is quite relaxing and fun. It is the most interesting open world game I have ever played. I was surprised by the detail of the game and the story surrounding it. One of the games worth playing. It is quite interesting that it was released 20 years ago and is still being developed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is probably the best game I ever played. Learning curve is like from good old 90s. I really find enjoyment in unofficial motto of the game \"Losing is fun\", which I experienced so many times in soo many different ways. Every year there are even new updates for free. Summed up,  this game exceeded all my expectations but it is not for weak players,",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "an excellent game for those who love sinking 1000s of hours into a colony sim. The detail is incredible and I recommend to anyone who loves this genre. Its top of the crop. Honestly. Just simply the descriptions of things are so magical and randomly generated so they will never be the same twice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My first fortress was fucking dogshit. Everyone was fucking angry and the dogs were eating mushroom men from the caves. Also the only invasions i've had was that of annual pedophilic child snatching gobloids. 10/10 thank you Adams brothers im gratefull for this contribution to the autism community.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game with long and epic legacy. Very deep and meditative. Now comes with better visuals and sound! \r\n\r\nOverall amazing experience well worth the time spent in it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, and I've been playing for nearly a decade, maybe longer. I plan to play it until I can't play games anymore.\n\nBy that point, I hope I'm at least competent at the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this game for almost 20 years and it still amuses me to this day. Recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In a world bloated with mediocre games, dwarf fortress is one of Humanity's last standing pillars of what it means to develop games, for gamers, by gamers.\r\n\r\nDF is a game where you'll feel overwhelmed initially, not because of its complexity but due to its breadth and depth in terms of game mechanics. The purpose of the game on the other hand, is rather straightforward, you have X number of threads executing in your simulation, your job is to ensure they are alive and have everything in their possession to keep on 'living'. In the end, you will understand it is not about one's destination, but the journey itself. Once you get to where you want, you have but the moments you cherished, up to the point you have reached, and that is [strike]life[/strike] Dwarf Fortress.\r\n\r\n\r\nP.S.: I had to go over world gen over 10 times to finally feel like I had enough understanding to embrace the responsibility of taking care of my dwarfs, do not let the game's apparent complexity discourage you!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm completely terrible at this game, but I love it all the same. It's one of the most complex things you can get your hands on and fumble through and still enjoy what's happening in front of you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is more than I can handle. I knew that ahead of time, but I bought it anyway because these guys deserve to be successful for what they've created.\n\n(Proof: https://steamcommunity.com/app/975370/discussions/0/3709307511570311787/  )",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Tarn Adams needs to be Mr. House'd so he can continue to work on this game far after the apocalypse.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's similar to Aquaspace for the Nintendo Wiiware but with dwarves and danger.\n\nI have only sunk my teeth into what this game can do, and I'm thoroughly impressed. It simulates so much and its not as repetitive as you might expect for a simulator game. Starting your first fort and keeping it going is a challenge and it will require some consulting of the wiki and online tutorials. I lost mine because we didn't dig deep enough to a cavern and aquifier. So when the river froze over in the winter. my dwarves were parched to death. \nMy second fort is doing ok, but we are dearly lacking meat and there is a giant bat that is killing my dwarves right now. I'll update with its fate when it happens.\n\n10/10 Can't wait for more.\nAlso, the game is free on the website, but its the ASCII version.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Long fan of this game! It has steep learning curve but it is totally worth it. You can expect many years of updates for dwarf fortress, because it's really created by people with passion. Try it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dwarf Fortress, the most in-depth colony game there is. Complexities and Hair pulling await you.\r\nDont expect to play this and not use your brain.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Captain of the Guard was knocked unconscious by a child. When a doctor came out of the hallway she beat him too. She played with a puzzlebox while they lay there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredibly in depth mechanics, combined with just the right amount of sillyness, while still being challenging. You can play out pretty much any Fortress you can imagine the game allows creative minds to go wild.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing DF on-and-off for 15 years, and the Steam release is amazing. I honestly can't believe I took this long to get it. If you're at all interested in fantasy world generation, true old-school roguelike adventure in a freeform world, or base building/management, I recommend it.\r\n\r\nAlso, you can see dwarves home-run goblins into cavern walls using warhammers. What's not to like?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will challenge and doesn't explain a lot, and even once you know you'll realize how much you don't. There are great content creator guides that will assist you on the journey. Just enjoy the ride and the water slide.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dwarf Fortress is the buggiest game I've played and really enjoyed. The many overhauls of this game including the graphical update for steam have made it dramatically more approachable. Gone are the days when people would say it's the best game you'll never play. Anyone can play this ... especially if you are  ready to either ignore/avoid the bugs or buckle down and figure out how to fix/work around them.\r\n\r\nUnderneath some of the remaining barriers is a charming game about keeping dwarves happy or if you prefer a psyopathic sandbox of disposable dwarves sent to their doom. (I'm in it for the first one.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "have a dwarf miner parry crossbow bolts with a pickaxe is peak dwarf!\n\na good make your own fun type of game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this since before there were Z-Levels, and if I can figure out a way to upload my consciousness to the cloud, I'll continue playing this until the heat death of the universe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing quite like this labour of love. A true sandbox, rich with DIY storytelling and world building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dwarf Fortress is the most detail obsessive building game of all time and it has quite a unique twist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game where anything can happen and stories unfold in most unusual ways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the absolute best colony simulator no questions asked. with my (at the time) 160 hours i only have a basic understanding of this game and the depth is that which you could spend thousands of hours while consistently finding new things. if you are holding back due to the price, i urge you to play the free version; its still updated and the reason for this version having a price tag is simply graphics and QOL but you should get a good idea of if this game is for you or not because the two hour refund limit is not nearly enough to truly get a grasp at this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, a little complex at the start but give it time and it opens up to a really fun and relaxing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great already and constantly getting better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The OG colony sim, to call it a labor of love would be an understatement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game even before it had been released on steam. I have been killing dwarf either through stupid mistakes or random events for ages. Sometimes, I succeed in making them survive only to be doomed just because some idiot dwarfs throw some tantrum and mess everything up. Every single playthrough is different and it will keep me coming back playing from more. It is not an easy game to get into and even I myself who have been playing the game for ages keep messing up and returning back to watching tutorials on youtube just to fix the mess I created in the first place. I bought it because I want to support the developer but you want to give it a try and don't want to spend a single cent, there is a free version on its official page - bay12games.com. Give it a try and I bet it will test your patience every single time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty much the epitome of passion project games. insane amounts of complexity that lead to very funny interactions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, dwarf got scared of enemies and ran into minecart. 11/10, intricate grave made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is less of a game and more of a world simulator. I have raised armies and conquered worlds and built some really dumb shit in this game. You can do anything your heart desires",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dwarf fortress is a game whose reputation precedes and lives up to it to its fullest, it is an eternal classic and trend setter, possibly the best colony manager out there and does so many things to simulate a living world within itself that it is difficult to review it, it takes no shortcuts, I can only say that I can never recommend it enough and that it is one of the games every person interested in the medium of virtual gaming has to play at least once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are several games that come to mind when I think \"Labor of Love\", this is the one that is at the top of that list.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been in and out of my life since I was a child, The fact we're here today talking about it is just incredible. In the success this game has had over the past couple decades im still surprised on how far its come. I miss Sparking Fortress though, and I know the OG is now working on the game with the Bro's so I know his time is well spent, But I still miss having a sayian fortress having battles with everything and everyone, watching them slam into the ground with force while im throwing ki-blast's at him. I know the KI mechanic was buggy/broken at the time, but damn it was fun.\r\n\r\nHope to see Sparking fortress make a return one day, but in the meantime, Dwarves will own the land!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game for over ten years. This version is the most accessible for new players. \nI created a volcano fortress and expanded it to 200 dwarfs. All this fell apart when a vampire came and started a civil war and every dwarf died in the chaos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strike the earth!\r\n\r\na wonderful game, well worth buying to support the devs,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never has a colony sim game gotten me as attached to the population as in this game.\r\nIt is very imersive and you can never really know what to expect next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's genuinely lovely. Quite a big fan of it, I'm always learning (and failing) more. I could tell stories of how the militia broke when the citizens didn't. How we dug too deeply. How we marched against the goblin menace. I won't though, because it's better you find that out yourself.\n\nAdventure mode is somewhat fun as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great game that I have been playing on and off to the concern and worry of my friends and family.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very *fun* (lookup fun on the wiki)\nThis is endless, play your way, learn the hard way type of game.\nFeatures are slow but it's steadily improving.\nThere is always a new trick, situation or surprise to learn. And the non stop generation of stories.\n10/10, would play even after a fort fell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rock and Stone, miners!\n\nWait, wrong game-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game off and on for 15 years and it's still the best colony sim out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I nominated this game for the Labor of Love award, because how else can you describe the incredible dedication that has gone into this game since 2006. The game was free (and still is as the ASCII version) for years. I really don't know how else to describe it than a true labor of love from some incredibly passionate developers. Although my playtime in this game is scarcely anything compared to the countless hours many have put into this game. I can already tell this is a game I will be constantly coming back to.\n\nNot to mention the incredibly atmospheric soundtrack that is amazing to listen to for DND, or just while you work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super challenging but super fun, once You got how it works. This is this kind of game that, without Reddit or Youtube to find some guides, it can be somewhat hard to understand what to do or how to do something. It is also a sandbox game so You need to put some challenges, goals, or conditions for Yourself. Or You can just simply relax and build one working fortress after another. ;) There is never the 100% same playthrought as You did before. Once it can be super chill and relax, once You can have unexpected giant out of nowhere that is going to smash Your city, goblin raid or necromancer walking by Your fort. Every fortress will be different and You will fail many times, so be prepared for it and don't be frustrated by this, it is part of this game. Overall it is a very good game that is having constant updates and support from its owners.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dwarf Fortress is a truly iconic game. I picked it up and sat down to play it one day to see what the hype was all about. As soon as I got the grove with the massive and in-depth gameplay loop I instantly fell in love. A fantastic game and one I would recommend to my friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game tweaks chronopreception to the max. You start the game some time in the evening, 30 minutes pass by and your better half walks in and says, \"So this is the reason you didn't get to bed last night\"\n\nThat is all you need to know about the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Losing is fun. You will lose a lot. You will therefore have a lot of fun. 10/10, would have half my fort starve to death stuck in webs again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game and have been playing it for many many years. Losing is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most in depth games ever made, the brothers behind this game are super impressive and I'm glad they've finally found the success they deserve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I played tons of the classic version, easily one of the deepest and most unique games out there, plus many exciting updates to come. The replay value here is insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One doesn't play dwarf fortress. Dwarf fortress steals your soul and runs with it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dwarf Fortress is an absurdly deep, endlessly surprising masterpiece. Every fortress feels like a living story generator where triumph, tragedy, and pure chaos collide in the most hilarious ways. The simulation detail is jaw-dropping, the emergent storytelling is unmatched, and no two playthroughs are ever the same. If you love games that reward creativity, imagination, and a bit of madness, Dwarf Fortress is pure gold.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game even before it came out on Steam, had tons of hours playing just to \"basically\" getting the fortress to start properly. After that's all done, experimenting on how to properly set up a hospital, dormitory, barracks and training schedule, work order efficiency, nobles and justice...\n\nUntil dig deep enough for the circus to arrive. Then it's all !!FUN!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Dwarf Fortress. I dont know what to say. I played it since 2010. Of course I recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The oldest memory I have of this game was when a dragon came in and burned down the entire map (heavily forested) and I sent my military to go fight it. They got burned too, but one dorf got close, was burned by boiling barley wine in the metal flask that he was carrying, and took the head of the dragon with a swing from his steel short sword.\n\n9/10 would boil barley wine again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best there is at what it s doing. No contest.  Thanks devs for giving their whole life to this single project.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Minecraft's ancestor, this fantasy world simulator is extremely old and complex but somewhat easy, meaning you can have fun without understanding most of what's going on. You can try the game for free on the bay12games website, but you'll have to either tolerate ASCII graphics or mod in a tileset nowhere near as good as what you get with the Steam version, which also adds music and sounds.\n\nFortress mode, the mode where you build a colony in the world, is fleshed out and I prefer it over Rimworld. Dwarves are resilient and hardworking giving lots of room for neglect in the early game, where I tend to worry more about accidentally flooding my fortress. You can send units to interract with other civilizations or be visited by them in the form of traders and raiders, some might even join your fortress.\n\nAdventure mode, the mode where you create and play as one or multiple units in open world roguelike fashion, is a concept I actually prefer. Unfortunately, it still feels barebones as you can't build or dig (But you can join one of your fortresses from fortress mode) and many skills go unused. On the upside, turn-based combat describing your foe being decapitated down to the bruised organs is surprisingly satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the one that started it all, a generator of brutal and unforgettable landscapes that could never be recreated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, very complete and fun. Simple graphics should not be considered a flaw, but an additional charm. I recommend playing with DFHack to make things funnier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from not being accessible, its an ultimate game of its genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game takes getting used to, personally the tutorial did not help but you will never forget your first game, for example.\n\nMy main fortress threat was little birds, they kept poking my dwarves eye, then some child snatchers came but the music was too good to care.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I enjoy ASCII games like Brogue and the old ADoM, the complexity and scale of Dwarf Fortress always exacerbated the visual abstraction, repelling me from the game. No longer. The Steam edition's graphical tileset opens this game up to a whole new generation of people for whom the older version was just untouchable. If you've ever wanted to play one of the greatest indie games ever, the time is now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What's really interesting is that this is not only a game that is complex, deep and beautiful in how it is all brought together, it teaches you many things. It teaches you to love your dwarves, that metal is a truly beautiful thing, you can never dig too deep if you're prepared, and that losing is fun. It's okay to lose. Rebuild, recreate, write your story, and remember Koganusan.\n\n10/10 AKUR AKIR AKAM",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun so far. When they say losing is fun they mean it. The dwarfs find some interesting ways to get killed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game i always dreamed of playing back when it was just ASCII. When they had announced it with a graphical overhaul with mouse integration - i was ecstatic. And it didn't let me down. Still one of my most played colony builder (Rimworld takes the cake, DF walked so RW could run!) When i want a colony game to sink my teeth into with tons of chaos and expecting not to live (I dug too greedily), it has to be DF. One of the best games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard to learn, hard to survive, impossible to master.\n\n10/10 What a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, such a classic that inspired so many games. It's age does show a bit tho, several parts of what makes it difficult is just really bugs or non-intuitive mechanics. Oh you want to setup your archers to train? Get ready for some hours reading online posts to figure out how to do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm honestly shocked i've not written a review for this before. But Dwarf Fortress has always been a great game to me. The main issue was accessibility, for the free version atleast. The Steam version has some small new bugs and some annoying changes to the keybindings if you're used to the free version. But otherwise has been great and made it a much easier and readable game to play. I was afraid the graphics would ruin the imagination part of the game, but it feels like a good balance between simple and detailed and enough that you can still easily imagine things differently.\n\nIt truely is a sandbox in the sense of no actual objective so you can really care about the emergent stories and learning the personality of your dwarves, or just subject your dwarves the barest conditions to keep them happy while you try to see if you can make a cave dragon into a sentry flamethrower for your fort.\n\nIt's a very difficult game to review without playing it. I would recommend Kruggsmash's how to play tutorial which is for an older version of the game but holds up very well, minus all the finicking with ini files because we don't have to do it anymore.\n\nEven if you just love the free version it's worth supporting the devs if you can.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite good and can run on my computer quite well. Make sure to nueter the cats so your computer do not slow down. Also water has physics lost to many dwarfs and several forts to water.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most unique games out there. Incredibly fun, and I will never be good at it, because its the kind of game you have more fun at when you don't 100% know what'll happen next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for a decade now, and the love that Kitfox has put into helping Bay12Games port the game and make it more accessible for new players is admirable and has made the Steam port worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing DF for over a decade now, since the 2D version. The depth of detail is an OCD gamers dream.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I've been playing it on and off for years and I still don't understand how it works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that started the whole 'city-builders' like RimWorld or Prison Architect.\n\nThe game has continued to evolve and expand since it was first created and continues to go above and beyond.\n\nA brilliant game with a simple concept; Lead your dwarfs and avoid dying, however nothing could be harder. Between goblins, magma, winter, cave-ins or nearly everything else, keeping your dwarfs alive it a challenge, keeping them happy is another however this game is always fun without being overbearing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dwarf fortress is the most game ever made, the lifes work of arch-lich Tarn and his brother and of the most complex simulations of a society of alcoholics one can get without walking outside.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Learning curve is not as bad as some people suggest, especially compared to original version, but you'll definitely need a YouTube tutorial to get you started. But once you're in - you'll be hooked! \r\nThe game is also getting pretty big content updates so there's always something to come back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A titan; this game probably influenced at least one of your favorite games. They put it in the Museum of Modern Art in New York. I first played this in 2009 I think. It was incredible back then, it's been in development for almost 20 years. It's not for everyone, but if it seems even remotely interesting, then I recommend you try Dwarf Fortress",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I use to love this game and would play for hours. Now, I can't even start a new game and play without stumbling over the keys like a 5 year old because I've memorized every keystroke for the menus. If you're going to make a full graphical sprite and music update you at least should make the ability to designate keys and give us back full keyboard only play. Please toady. Please!!!!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "wanted to like this game given it's cult following, gave it a good 60+ hours but I find it to be a combination of unplayable and not that interesting:\n1. Not well programmed to manage simple scaling (e.g., fires and siege drag fps down to ~0.5-2FPS...and it's not pegging the CPU/memory either, so to me that says it's bad programming) -> this bad performance is so common that it looks like players just accept it \"Usually FPS death occurs at over 200 or so dwarves\" or \"<Change a few settings> and go and wait 20 minutes and come back for <everything to be done>\" (via forum posts)\n2. Wanted to enjoy Adventurer mode but for me I found it to just not be fun (too much micromanaging, way to complex to get started, not enough variety)\n3. The main draw seems to be it's long history/world building + the classic dig deep and build things; but IMHO it gets old fast given that lack of variety or clear skill/item building tree; for example everything can be an artifact (I had a dwarf make an artifact chair...so exotic)\n4. <Insert classic complaint about poor UX and tutorials>\n\nTL;DR this game would be infinitely better if it was fully open source/community built, so many quality of life improvements to be had and variety (i.e., dungeon soup crawl is fantastic for this)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Appallingly bad quality of life and seriously tedious gameplay loop, and the good parts just weren't frequent or interesting enough to make up for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the premise of this game and just wish that the missions worked properly! Right now they seem very buggy. I'll come back as soon as they get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the original game in the genre, but easily one of the worst. The interface isn't just archaic, it's awful. No explanation of almost anything, you depend entirely on forum posts from 10-20 years ago for basic instructions. Want to have dwarves hunt? Good luck, and God forbid you assign them to a \"squad\" and then they spend the rest of their lives spamming equipment mismatch errors that you're supposed to magically know how to resolve. \r\n\r\nThe game is a great idea, in theory but the documentation is awful and completely unintuitive. Leading you to depend on Google for basic understanding of how the basic game functions operate.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I have tried to play this game a couple times. I just cannot get into it. The controls, shortcuts and ui, are just really bad in my opinion. Maybe for some people this is not a problem, but I do not have fun when I am repeating the same clicks over and over again.\nI know that Rimworld was heavily inspired by Dwarf Fortress, but it is just better. Maybe expecting Rimworld level quality was just too much to ask.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "once you've figured out how to make a fortress run the game gets pretty boring, just building bedrooms ad nausium..  Never found any of the interesting events people talk about in other reviews.  Tried Adventure mode after i got board with fortress but the controls where just as cumbersome and i just couldn't be bothered figuring it all out again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's really weird this game is so highly praised when it's such a bug ridden mess that ultimately renders the game unplayable. The community has this word they use for this \"!FUN!\", what that means is eventually your fort will fail and it won't be your fault, maybe a small altercation between dwarves will trigger a bug that causes they fort to engage in massive civil war, killing potentially everyone. There are civil wars in teh game but im refering to \"loyalty cascades\", a known bug for over a half a decade that seems to now be considered a feature in the game. Meaning no matter how successful you are your fort will at some point decide to cannibalize itself, but you had !FUN! right?\r\n\r\nAnother problem is patients not being fed food or drink and dying in their beds. You can set a cutoms labour for your entire fort that is for only feeding patients and they won't do it. Good thing there aren't any bugs in the game involving mass, unpreventable fights from breaking out in your fort. Something like that would ultimately make the game a massive waste of time wouldn't it?\r\n\r\nThere's even a seperate program called DFHack that was made to help address the plethora of issues that seem to have existed for so long that other people seem to need to fix the problems because it seems evident that these sluppy feature are just a part of the !FUN! of the game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like these styles of open-ended open world building games, but something is holding me back on this one. I think its the UI/UX. I am used to modern UI's where for example amount of needed clicks is optimized, but in this, it feels very clunky. Achieving things like building, zoning, work orders and conditions; they dont feel great to use. So much \"needless\" clicking around. And also could be the lack of visual feedback from the UI. I am sure things feel intuitive for old timers, but coming in fresh, it does not feel great. Also things feel illogical, like some tasks are pre-emptively red when you dont have required items, some are not. Then you add tasks only to get a notification you dont have the required item, amongst the other 20 notifications of missing items. I understand managing the dwaves is the core of the game and it should not be too streamlined, otherwise what would the player do, but some quality of life improvements would certainly be in place. Should I be a high-level fortress manager or micromanager? Also that distinction feels like I need to be both simultaneously.\n\nIt surely is possible that I don't know how to play the game properly with this many mechanics. Still, after 15h and fortress of population 50, knowing or not does not change what I felt as a new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to be a very particular type of person to enjoy this game. Special, bordering on a mental disorder.\r\nThe game has some of the worst interfaces I've ever seen. \r\nThe game mechanics are so opaque and cryptic that you will spend more time searching for answers than actually playing.\r\nThere are more issues with this game, but I just don't wanna bother any longer.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My Amiga 500 from 40 years ago was better at this.\r\nVery crap graphics, dont waste any money on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for the adventure mode and I was surprised at how bad it is. The dialogue is complete gibberish and you can go across the world and talk to a completely different NPC and see the exact verbatim dialogue. I'm not sure what their idea of \"procedural\" is but just vomiting up random tidbits of nonsense from a databank of 4 pieces of dialogue does not make a good game. \n\nMaybe the other modes of this game are fun, but adventure mode is embarrassingly underbaked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rim World's inspiration.  \r\n\r\nMicro management to the extreme.  Very steep learning curve.  You'll need the Wiki.  All that's fine, but many of the tasks are so buried or counter intuitive that it is hard to complete simple tasks.\r\n\r\nAnd just like Rim World... you then have to deal with all the whiny little dwarves crying about everything imaginable...  Bunch of pussies... ugh...  It would have been enjoyable to have killed most of my colony myself, break out the death squads...\r\n\r\nNot for me at this point in my life...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's only for people who never leave their house and count rice - tedious, slow, cumbersome, over complicated and extra counter-intuitive. I'm not saying it's a bad game, but it's really not for everyone. If you want to read 3 books before playing a game this is for you - can't learn on the fly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game takes the mechanics of other colony survival games and adds six extra steps just cause. Let me build a door? Nah, create a work order. Wait for a manager to assign work order. Wait for someone to craft the door. Wait for someone to haul the door. Ten minutes later I've got a door! Complexity does not equal good gameplay. \n\nI think I've spent more time reading the wiki and reddit threads on how to deal with issues than actually playing the game because it's just a hot mess of barely functional features.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Whoa whoa whoa, did they delete my negative review???  Good to know they are bloating positive reviews! [/h1]\nDon't bother deleting again, i saved it and WILL submit it over again.\n\nIn short, UI is atrocious, all controlls are beyond retraded, game in majority consist of - going through horribly made menus, windows and excel spreadsheets.\n\nThere is no game in \"game\" and deleting negative reviews is possibly most pathetic and shameful thing they could have done. Also, bloated price for glorified excel is hilarious.\n\nAnd again, i saved my review so if you shamelessly delete it, I will post it again AND spread of your filthy ways.\nWorst of luck and no regards.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "20 hour in to a game\nstill have no idea how to play :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "im sorry, its boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is kinda just ehhhh",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy as hell",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly, I'm not autistic enough for this one :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am sure this game is good, when you have about 100 hours of experience. I have so far spent more time watching youtube trying to figure out how to do basic things rather than play the game.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "New player here with 10h of gameplay.\nJust for context, I like economy/settlement/strategy games. I enjoyed playing Rimworld, Factorio, Europa Universalis, Stellaris, Crusader Kings, Age of Empires, Total War, etc. Those are all GOOD GAMES. Dwarf Fortress will never be part of those in my heart. This game was a truly horrible experience.\n\nAfter 10h of gameplay, I can tell confidently that I HATED my time playing this game, mostly because of one main thing that plagues every aspect and square inch of this game: a truly impressively bad user interface (UI) and user experience (UX).\nHere, I'm talking menus, their layouts, the unintuitive, slow and convoluted way you need to click at things all the time, the way elements to craft/build/do are displayed, arranged, ordered, grouped, etc. I've never seen anything so bad in my entire life.\nI never thought that I could be traumatized by a bad game UI and design, but here we are.\n\nThis game was launched originally in 2006, not in 1988. There was good UIs back then, so the fact that the game is old is not even a good excuse. SimCity 4 came out in 2003. And even if the game is old, a UI can change, can evolve, can be refined, refactored. Nothing of this sort here after 20+ years of development. Just a bad UI experience which was never cared for, and which will probably never be fixed. Once again, impressively bad.\n\nThis game can be overwhelmingly detailed about things that you really don't care, like every body part down to the teeth having a health status, while at the same time, the game doesn't care to explain to you the basics of how this or that object is produced, or what it can be used for. \"You just need to go read the Wiki!\" players often respond. Yeah that's right, to make up for a really badly designed game, I now need to go read 50 pages of wiki just to try to understand what the hell the game developer tried to do on this specific feature. This is madness. This is not how games are supposed to work. This is not a scientific simulation software, this is sold on Steam, this is just a game. A BAD GAME.\n\nSometimes, things are even outright misleading, with the same object being referenced by two different names in different UI panels. For example, I discovered at some point, enraged, that the names \"chair\" and \"throne\" were referencing the same object (I tried to find where I could craft a \"throne' by searching for 10 minutes in every workshop possible...), and a bit later discovered that \"mug\" and \"goblet\" were also the same object. Wonderful. In a game where you can craft hundreds (thousands?) of different objects, I'm not so sure things like this exist because of a huge lack of care or outright evil. \n\nIf the game was embodied into human form, they would be overly obsessed about useless details in obscure subjects, while at the same time being completely socially indifferent, not looking you in the eyes, not speaking nicely to you, not caring about how you feel, and just ignoring you in general. This is what Dwarf Fortress felt like to me. If you try to play the game for the first time, and even after playing the tutorial (at least, there was an attempt), you will notice that the game itself, its entire structure, doesn't care about you. It doesn't even try to have a somewhat modern or standard way for you to play a game. This is truly appalling. I got very angry at some point because of the obvious lack of empathy towards the players displayed by the game itself.\n\nIronically enough, the main slogan of the game is \"Losing is Fun\". Before I started to play, I imagined that the meaning of this was about a high difficulty, Dark Souls-like. I imagined that creatures would attack my base if I forgot to build defenses, things like this. And i guess that a lot of players probably see this slogan this way. But oh, no, that's not how I see it now.\nInstead, this slogan resonates in me with this meaning now: \"You see, the game is so badly designed, every mechanic and UI element is so cryptic and difficult to understand that you have no idea what you're supposed to do or what the game is doing, therefore, you will lose a lot. But look! This is so fun right!!!!\"\nNo, this is not fun. This is a delusional post-rationalization of a bad game, created purely to support a lack of accountability when it comes to fixing it. To every problem that the game has, one can answer \"Losing is fun!\".\n\nThis slogan is to me the illustration of how delusional people can get about their own work or habits they developed. \"What i made is bad? No no, you don't get it, this is intentional! Yeah, actually this is intentionally bad haha! You see? Problem solved!\"\n\nThis slogan has become ironic to me when I see it anywhere.\n\nThe game is also bad is a very weird way. The game is not lazy in the traditional sense of \"lack of features\", there is a LOT of features and things going on in Dwarf Fortress. But this is exactly the problem. Too much is going on, without any explanation, without anything being put in order. It's like this game has Diogenes syndrome: \n- severe self-neglect (of the UI)\n- domestic squalor (of the menus)\n- social withdrawal (doesn't care about the players)\n- compulsive hoarding (thousands of objets, lore elements, personality traits, body part health statuses, mechanics, etc)\n- lack of shame (no care for fixing the base aspects of the game after 20 years of development, while still adding new features).\nYep, actually, everything in this game checks out this definition pretty well.\n\nBut why waste my time with this game then if I hate it so much? Why did I take the time to write such a long review today?\nWell, because I feel like something wrong happened to me here. I was really ready to love this game. There is a big community of players around this game, and they really made me think that this game was a truly good game. I trusted them, and I just feel betrayed now. I feel wronged. I lost my time, and the only thing I got from this game is hours of frustration instead of entertainment. I need to balance this out. When games do something wrong, they need to be called out for it. That's what happened with Starfield, with Cyperpunk 2077, etc. Here, it's a little bit different because this is an indie game. But oh my god, this game is so bad, you can't treat every indie dev like a child that hands you a very bad drawing. Even indie devs need accountability at some point. I really feel like this game has been too bad for too long to be excusable.\n\nHere it is, I think I explained pretty much all the bad things that this game did to me in those 10 hours of gameplay.\n\nIf you want an economy/strategy/settlement game with a nice, welcoming, polished gameplay and UI, for the love of God run away as fast as you can.\n\nIf you want to suffer in an unintuitive and unnecessarily complex hot mess, Dwarf Fortress is for you.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Err.... This is a though one.\n\nI was really hyped for this game, but ultimately kinda ended up dissatisfied. The game is [i]alright[/i], I just expected more from it.\n\nInventory & colony management is convoluted and difficult for no reason? Your failings feel more like you're failing at understanding what's happening and playing properly, not because there's an actual problem happening to your dwarves. UI is highly unintuitive.\n\nAlso, you quickly become detached from the members of your colony. The names of people, places and events are an uncomprehensive mess of words and making it really hard to remember who's who and what's what. I'd rather they are called \"Steve\" than \"Èrithtosidianthur Zulbaneral\"...\n\nSimilar games I've played are: [url=https://store.steampowered.com/app/294100/RimWorld/]Rimworld[/url] (Fortress mode) and [url=https://cataclysmdda.org/]CDDA[/url] (Adventure mode), which I highly recommend over this one. There's just better alternatives...\n\nI can't, in good faith, tell a friend to spend $30 on this over the other games out there. If you've already played the other games and want more of the genre. And if you're ready to torture yourself with this one's complicated mechanics which requires 50 hour commitment to understand basic things like how to feed yourself, then go for it! I [b]don't[/b] think this is a bad game!",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I use to love this game and would play for hours. Now, I can't even start a new game and play without stumbling over the keys like a 5 year old because I've memorized every keystroke for the menus. If you're going to make a full graphical sprite and music update you at least should make the ability to designate keys and give us back full keyboard only play. Please toady. Please!!!!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Decent game, not as hard as you might think. If you have played any other micro colony sim you will get by, don't worry.\n\nIn fact, descendent games like Rimworld, ONI and Going Medieval have more systems you actively engage with and demand a greater burden of knowledge than DF. But yes, when it comes to passive random generation of text and values then sure, this game wins out.\n\nHas great pixel art, honestly very appealing and nice to look that, props to Kitfox on networking the artists.\n\nUI is still not there yet. I can think of a dozen simple changes that would make playing this game infinitely less tedious. They should have hired a UI/UX dev just like they did the art team because it wasn't and isn't their expertise and the game massively suffers because of it.\n\nThe whole experience still feels very Early Access and is quite rough around the edges. Had a couple major bugs that made me restart forts. In terms of meaningful content and features it still feels incomplete but I'm sure they will keep adding to it. \n\nUsually, by year 2 or 3 once you have around 3-4 squads, over 150+ dwarves and 1000+ food and drink each slowly climbing you basically have nothing more to look forward to.  At that point your only option is to start again in some harder/annoying biome or do gimped self imposed runs to get playtime out of it. \n\nMoreover getting to that point is more of a checklist thing than any real design roadblocks or game play push back you face, most mental energy you'd need is dealing with fluids and that's still not a lot when compared to contemporaries in the genre.\n\nWill give it a try once the Siege update drops to see if they addressed the mid-game but I doubt this game moves that fast, so in a few years I'm sure once the magic update drops it will be a far more complete game.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Fun to play but some stuff is just damn stupid. To many die from not drinking, Think of drinking water all your life so you die of thirst since you're bored of water. Very stupid. Even if you have alcohol dwarfs will die ten at a time since they are bored of the same drink. At a point its just limiting game play with stupid mechanics. Then you end up with hundreds of dead dwarfs over a few years having to make your city turn all its production capability to caskets and coffins. Then whats the point in playing just to make coffins",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Just not really it to be honest. \n\nAll of the cool story stuff you hear about happens through interfaces that are cumbersome to keep up with and track, especially as your fort balloons in size and scope. Everything kind of gets lost in the sauce and you're watching a soulless automated empire do its thing with or without your engagement. \n\nCompared to something like Rimworld which is a lot more intimate in scope and displays everything that's happening through actual onscreen actions and a concise, simple UI, I think it ends up being the more engaging storytelling simulator by a large margin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "wanted to like this game given it's cult following, gave it a good 60+ hours but I find it to be a combination of unplayable and not that interesting:\n1. Not well programmed to manage simple scaling (e.g., fires and siege drag fps down to ~0.5-2FPS...and it's not pegging the CPU/memory either, so to me that says it's bad programming) -> this bad performance is so common that it looks like players just accept it \"Usually FPS death occurs at over 200 or so dwarves\" or \"<Change a few settings> and go and wait 20 minutes and come back for <everything to be done>\" (via forum posts)\n2. Wanted to enjoy Adventurer mode but for me I found it to just not be fun (too much micromanaging, way to complex to get started, not enough variety)\n3. The main draw seems to be it's long history/world building + the classic dig deep and build things; but IMHO it gets old fast given that lack of variety or clear skill/item building tree; for example everything can be an artifact (I had a dwarf make an artifact chair...so exotic)\n4. <Insert classic complaint about poor UX and tutorials>\n\nTL;DR this game would be infinitely better if it was fully open source/community built, so many quality of life improvements to be had and variety (i.e., dungeon soup crawl is fantastic for this)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Appallingly bad quality of life and seriously tedious gameplay loop, and the good parts just weren't frequent or interesting enough to make up for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the premise of this game and just wish that the missions worked properly! Right now they seem very buggy. I'll come back as soon as they get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the original game in the genre, but easily one of the worst. The interface isn't just archaic, it's awful. No explanation of almost anything, you depend entirely on forum posts from 10-20 years ago for basic instructions. Want to have dwarves hunt? Good luck, and God forbid you assign them to a \"squad\" and then they spend the rest of their lives spamming equipment mismatch errors that you're supposed to magically know how to resolve. \r\n\r\nThe game is a great idea, in theory but the documentation is awful and completely unintuitive. Leading you to depend on Google for basic understanding of how the basic game functions operate.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I have tried to play this game a couple times. I just cannot get into it. The controls, shortcuts and ui, are just really bad in my opinion. Maybe for some people this is not a problem, but I do not have fun when I am repeating the same clicks over and over again.\nI know that Rimworld was heavily inspired by Dwarf Fortress, but it is just better. Maybe expecting Rimworld level quality was just too much to ask.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "once you've figured out how to make a fortress run the game gets pretty boring, just building bedrooms ad nausium..  Never found any of the interesting events people talk about in other reviews.  Tried Adventure mode after i got board with fortress but the controls where just as cumbersome and i just couldn't be bothered figuring it all out again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's really weird this game is so highly praised when it's such a bug ridden mess that ultimately renders the game unplayable. The community has this word they use for this \"!FUN!\", what that means is eventually your fort will fail and it won't be your fault, maybe a small altercation between dwarves will trigger a bug that causes they fort to engage in massive civil war, killing potentially everyone. There are civil wars in teh game but im refering to \"loyalty cascades\", a known bug for over a half a decade that seems to now be considered a feature in the game. Meaning no matter how successful you are your fort will at some point decide to cannibalize itself, but you had !FUN! right?\r\n\r\nAnother problem is patients not being fed food or drink and dying in their beds. You can set a cutoms labour for your entire fort that is for only feeding patients and they won't do it. Good thing there aren't any bugs in the game involving mass, unpreventable fights from breaking out in your fort. Something like that would ultimately make the game a massive waste of time wouldn't it?\r\n\r\nThere's even a seperate program called DFHack that was made to help address the plethora of issues that seem to have existed for so long that other people seem to need to fix the problems because it seems evident that these sluppy feature are just a part of the !FUN! of the game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like these styles of open-ended open world building games, but something is holding me back on this one. I think its the UI/UX. I am used to modern UI's where for example amount of needed clicks is optimized, but in this, it feels very clunky. Achieving things like building, zoning, work orders and conditions; they dont feel great to use. So much \"needless\" clicking around. And also could be the lack of visual feedback from the UI. I am sure things feel intuitive for old timers, but coming in fresh, it does not feel great. Also things feel illogical, like some tasks are pre-emptively red when you dont have required items, some are not. Then you add tasks only to get a notification you dont have the required item, amongst the other 20 notifications of missing items. I understand managing the dwaves is the core of the game and it should not be too streamlined, otherwise what would the player do, but some quality of life improvements would certainly be in place. Should I be a high-level fortress manager or micromanager? Also that distinction feels like I need to be both simultaneously.\n\nIt surely is possible that I don't know how to play the game properly with this many mechanics. Still, after 15h and fortress of population 50, knowing or not does not change what I felt as a new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to be a very particular type of person to enjoy this game. Special, bordering on a mental disorder.\r\nThe game has some of the worst interfaces I've ever seen. \r\nThe game mechanics are so opaque and cryptic that you will spend more time searching for answers than actually playing.\r\nThere are more issues with this game, but I just don't wanna bother any longer.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My Amiga 500 from 40 years ago was better at this.\r\nVery crap graphics, dont waste any money on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for the adventure mode and I was surprised at how bad it is. The dialogue is complete gibberish and you can go across the world and talk to a completely different NPC and see the exact verbatim dialogue. I'm not sure what their idea of \"procedural\" is but just vomiting up random tidbits of nonsense from a databank of 4 pieces of dialogue does not make a good game. \n\nMaybe the other modes of this game are fun, but adventure mode is embarrassingly underbaked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rim World's inspiration.  \r\n\r\nMicro management to the extreme.  Very steep learning curve.  You'll need the Wiki.  All that's fine, but many of the tasks are so buried or counter intuitive that it is hard to complete simple tasks.\r\n\r\nAnd just like Rim World... you then have to deal with all the whiny little dwarves crying about everything imaginable...  Bunch of pussies... ugh...  It would have been enjoyable to have killed most of my colony myself, break out the death squads...\r\n\r\nNot for me at this point in my life...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's only for people who never leave their house and count rice - tedious, slow, cumbersome, over complicated and extra counter-intuitive. I'm not saying it's a bad game, but it's really not for everyone. If you want to read 3 books before playing a game this is for you - can't learn on the fly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game takes the mechanics of other colony survival games and adds six extra steps just cause. Let me build a door? Nah, create a work order. Wait for a manager to assign work order. Wait for someone to craft the door. Wait for someone to haul the door. Ten minutes later I've got a door! Complexity does not equal good gameplay. \n\nI think I've spent more time reading the wiki and reddit threads on how to deal with issues than actually playing the game because it's just a hot mess of barely functional features.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Whoa whoa whoa, did they delete my negative review???  Good to know they are bloating positive reviews! [/h1]\nDon't bother deleting again, i saved it and WILL submit it over again.\n\nIn short, UI is atrocious, all controlls are beyond retraded, game in majority consist of - going through horribly made menus, windows and excel spreadsheets.\n\nThere is no game in \"game\" and deleting negative reviews is possibly most pathetic and shameful thing they could have done. Also, bloated price for glorified excel is hilarious.\n\nAnd again, i saved my review so if you shamelessly delete it, I will post it again AND spread of your filthy ways.\nWorst of luck and no regards.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "20 hour in to a game\nstill have no idea how to play :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "im sorry, its boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is kinda just ehhhh",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy as hell",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly, I'm not autistic enough for this one :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am sure this game is good, when you have about 100 hours of experience. I have so far spent more time watching youtube trying to figure out how to do basic things rather than play the game.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "New player here with 10h of gameplay.\nJust for context, I like economy/settlement/strategy games. I enjoyed playing Rimworld, Factorio, Europa Universalis, Stellaris, Crusader Kings, Age of Empires, Total War, etc. Those are all GOOD GAMES. Dwarf Fortress will never be part of those in my heart. This game was a truly horrible experience.\n\nAfter 10h of gameplay, I can tell confidently that I HATED my time playing this game, mostly because of one main thing that plagues every aspect and square inch of this game: a truly impressively bad user interface (UI) and user experience (UX).\nHere, I'm talking menus, their layouts, the unintuitive, slow and convoluted way you need to click at things all the time, the way elements to craft/build/do are displayed, arranged, ordered, grouped, etc. I've never seen anything so bad in my entire life.\nI never thought that I could be traumatized by a bad game UI and design, but here we are.\n\nThis game was launched originally in 2006, not in 1988. There was good UIs back then, so the fact that the game is old is not even a good excuse. SimCity 4 came out in 2003. And even if the game is old, a UI can change, can evolve, can be refined, refactored. Nothing of this sort here after 20+ years of development. Just a bad UI experience which was never cared for, and which will probably never be fixed. Once again, impressively bad.\n\nThis game can be overwhelmingly detailed about things that you really don't care, like every body part down to the teeth having a health status, while at the same time, the game doesn't care to explain to you the basics of how this or that object is produced, or what it can be used for. \"You just need to go read the Wiki!\" players often respond. Yeah that's right, to make up for a really badly designed game, I now need to go read 50 pages of wiki just to try to understand what the hell the game developer tried to do on this specific feature. This is madness. This is not how games are supposed to work. This is not a scientific simulation software, this is sold on Steam, this is just a game. A BAD GAME.\n\nSometimes, things are even outright misleading, with the same object being referenced by two different names in different UI panels. For example, I discovered at some point, enraged, that the names \"chair\" and \"throne\" were referencing the same object (I tried to find where I could craft a \"throne' by searching for 10 minutes in every workshop possible...), and a bit later discovered that \"mug\" and \"goblet\" were also the same object. Wonderful. In a game where you can craft hundreds (thousands?) of different objects, I'm not so sure things like this exist because of a huge lack of care or outright evil. \n\nIf the game was embodied into human form, they would be overly obsessed about useless details in obscure subjects, while at the same time being completely socially indifferent, not looking you in the eyes, not speaking nicely to you, not caring about how you feel, and just ignoring you in general. This is what Dwarf Fortress felt like to me. If you try to play the game for the first time, and even after playing the tutorial (at least, there was an attempt), you will notice that the game itself, its entire structure, doesn't care about you. It doesn't even try to have a somewhat modern or standard way for you to play a game. This is truly appalling. I got very angry at some point because of the obvious lack of empathy towards the players displayed by the game itself.\n\nIronically enough, the main slogan of the game is \"Losing is Fun\". Before I started to play, I imagined that the meaning of this was about a high difficulty, Dark Souls-like. I imagined that creatures would attack my base if I forgot to build defenses, things like this. And i guess that a lot of players probably see this slogan this way. But oh, no, that's not how I see it now.\nInstead, this slogan resonates in me with this meaning now: \"You see, the game is so badly designed, every mechanic and UI element is so cryptic and difficult to understand that you have no idea what you're supposed to do or what the game is doing, therefore, you will lose a lot. But look! This is so fun right!!!!\"\nNo, this is not fun. This is a delusional post-rationalization of a bad game, created purely to support a lack of accountability when it comes to fixing it. To every problem that the game has, one can answer \"Losing is fun!\".\n\nThis slogan is to me the illustration of how delusional people can get about their own work or habits they developed. \"What i made is bad? No no, you don't get it, this is intentional! Yeah, actually this is intentionally bad haha! You see? Problem solved!\"\n\nThis slogan has become ironic to me when I see it anywhere.\n\nThe game is also bad is a very weird way. The game is not lazy in the traditional sense of \"lack of features\", there is a LOT of features and things going on in Dwarf Fortress. But this is exactly the problem. Too much is going on, without any explanation, without anything being put in order. It's like this game has Diogenes syndrome: \n- severe self-neglect (of the UI)\n- domestic squalor (of the menus)\n- social withdrawal (doesn't care about the players)\n- compulsive hoarding (thousands of objets, lore elements, personality traits, body part health statuses, mechanics, etc)\n- lack of shame (no care for fixing the base aspects of the game after 20 years of development, while still adding new features).\nYep, actually, everything in this game checks out this definition pretty well.\n\nBut why waste my time with this game then if I hate it so much? Why did I take the time to write such a long review today?\nWell, because I feel like something wrong happened to me here. I was really ready to love this game. There is a big community of players around this game, and they really made me think that this game was a truly good game. I trusted them, and I just feel betrayed now. I feel wronged. I lost my time, and the only thing I got from this game is hours of frustration instead of entertainment. I need to balance this out. When games do something wrong, they need to be called out for it. That's what happened with Starfield, with Cyperpunk 2077, etc. Here, it's a little bit different because this is an indie game. But oh my god, this game is so bad, you can't treat every indie dev like a child that hands you a very bad drawing. Even indie devs need accountability at some point. I really feel like this game has been too bad for too long to be excusable.\n\nHere it is, I think I explained pretty much all the bad things that this game did to me in those 10 hours of gameplay.\n\nIf you want an economy/strategy/settlement game with a nice, welcoming, polished gameplay and UI, for the love of God run away as fast as you can.\n\nIf you want to suffer in an unintuitive and unnecessarily complex hot mess, Dwarf Fortress is for you.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Err.... This is a though one.\n\nI was really hyped for this game, but ultimately kinda ended up dissatisfied. The game is [i]alright[/i], I just expected more from it.\n\nInventory & colony management is convoluted and difficult for no reason? Your failings feel more like you're failing at understanding what's happening and playing properly, not because there's an actual problem happening to your dwarves. UI is highly unintuitive.\n\nAlso, you quickly become detached from the members of your colony. The names of people, places and events are an uncomprehensive mess of words and making it really hard to remember who's who and what's what. I'd rather they are called \"Steve\" than \"Èrithtosidianthur Zulbaneral\"...\n\nSimilar games I've played are: [url=https://store.steampowered.com/app/294100/RimWorld/]Rimworld[/url] (Fortress mode) and [url=https://cataclysmdda.org/]CDDA[/url] (Adventure mode), which I highly recommend over this one. There's just better alternatives...\n\nI can't, in good faith, tell a friend to spend $30 on this over the other games out there. If you've already played the other games and want more of the genre. And if you're ready to torture yourself with this one's complicated mechanics which requires 50 hour commitment to understand basic things like how to feed yourself, then go for it! I [b]don't[/b] think this is a bad game!",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I use to love this game and would play for hours. Now, I can't even start a new game and play without stumbling over the keys like a 5 year old because I've memorized every keystroke for the menus. If you're going to make a full graphical sprite and music update you at least should make the ability to designate keys and give us back full keyboard only play. Please toady. Please!!!!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Decent game, not as hard as you might think. If you have played any other micro colony sim you will get by, don't worry.\n\nIn fact, descendent games like Rimworld, ONI and Going Medieval have more systems you actively engage with and demand a greater burden of knowledge than DF. But yes, when it comes to passive random generation of text and values then sure, this game wins out.\n\nHas great pixel art, honestly very appealing and nice to look that, props to Kitfox on networking the artists.\n\nUI is still not there yet. I can think of a dozen simple changes that would make playing this game infinitely less tedious. They should have hired a UI/UX dev just like they did the art team because it wasn't and isn't their expertise and the game massively suffers because of it.\n\nThe whole experience still feels very Early Access and is quite rough around the edges. Had a couple major bugs that made me restart forts. In terms of meaningful content and features it still feels incomplete but I'm sure they will keep adding to it. \n\nUsually, by year 2 or 3 once you have around 3-4 squads, over 150+ dwarves and 1000+ food and drink each slowly climbing you basically have nothing more to look forward to.  At that point your only option is to start again in some harder/annoying biome or do gimped self imposed runs to get playtime out of it. \n\nMoreover getting to that point is more of a checklist thing than any real design roadblocks or game play push back you face, most mental energy you'd need is dealing with fluids and that's still not a lot when compared to contemporaries in the genre.\n\nWill give it a try once the Siege update drops to see if they addressed the mid-game but I doubt this game moves that fast, so in a few years I'm sure once the magic update drops it will be a far more complete game.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Fun to play but some stuff is just damn stupid. To many die from not drinking, Think of drinking water all your life so you die of thirst since you're bored of water. Very stupid. Even if you have alcohol dwarfs will die ten at a time since they are bored of the same drink. At a point its just limiting game play with stupid mechanics. Then you end up with hundreds of dead dwarfs over a few years having to make your city turn all its production capability to caskets and coffins. Then whats the point in playing just to make coffins",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Just not really it to be honest. \n\nAll of the cool story stuff you hear about happens through interfaces that are cumbersome to keep up with and track, especially as your fort balloons in size and scope. Everything kind of gets lost in the sauce and you're watching a soulless automated empire do its thing with or without your engagement. \n\nCompared to something like Rimworld which is a lot more intimate in scope and displays everything that's happening through actual onscreen actions and a concise, simple UI, I think it ends up being the more engaging storytelling simulator by a large margin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "wanted to like this game given it's cult following, gave it a good 60+ hours but I find it to be a combination of unplayable and not that interesting:\n1. Not well programmed to manage simple scaling (e.g., fires and siege drag fps down to ~0.5-2FPS...and it's not pegging the CPU/memory either, so to me that says it's bad programming) -> this bad performance is so common that it looks like players just accept it \"Usually FPS death occurs at over 200 or so dwarves\" or \"<Change a few settings> and go and wait 20 minutes and come back for <everything to be done>\" (via forum posts)\n2. Wanted to enjoy Adventurer mode but for me I found it to just not be fun (too much micromanaging, way to complex to get started, not enough variety)\n3. The main draw seems to be it's long history/world building + the classic dig deep and build things; but IMHO it gets old fast given that lack of variety or clear skill/item building tree; for example everything can be an artifact (I had a dwarf make an artifact chair...so exotic)\n4. <Insert classic complaint about poor UX and tutorials>\n\nTL;DR this game would be infinitely better if it was fully open source/community built, so many quality of life improvements to be had and variety (i.e., dungeon soup crawl is fantastic for this)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Appallingly bad quality of life and seriously tedious gameplay loop, and the good parts just weren't frequent or interesting enough to make up for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the premise of this game and just wish that the missions worked properly! Right now they seem very buggy. I'll come back as soon as they get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the original game in the genre, but easily one of the worst. The interface isn't just archaic, it's awful. No explanation of almost anything, you depend entirely on forum posts from 10-20 years ago for basic instructions. Want to have dwarves hunt? Good luck, and God forbid you assign them to a \"squad\" and then they spend the rest of their lives spamming equipment mismatch errors that you're supposed to magically know how to resolve. \r\n\r\nThe game is a great idea, in theory but the documentation is awful and completely unintuitive. Leading you to depend on Google for basic understanding of how the basic game functions operate.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I have tried to play this game a couple times. I just cannot get into it. The controls, shortcuts and ui, are just really bad in my opinion. Maybe for some people this is not a problem, but I do not have fun when I am repeating the same clicks over and over again.\nI know that Rimworld was heavily inspired by Dwarf Fortress, but it is just better. Maybe expecting Rimworld level quality was just too much to ask.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "once you've figured out how to make a fortress run the game gets pretty boring, just building bedrooms ad nausium..  Never found any of the interesting events people talk about in other reviews.  Tried Adventure mode after i got board with fortress but the controls where just as cumbersome and i just couldn't be bothered figuring it all out again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's really weird this game is so highly praised when it's such a bug ridden mess that ultimately renders the game unplayable. The community has this word they use for this \"!FUN!\", what that means is eventually your fort will fail and it won't be your fault, maybe a small altercation between dwarves will trigger a bug that causes they fort to engage in massive civil war, killing potentially everyone. There are civil wars in teh game but im refering to \"loyalty cascades\", a known bug for over a half a decade that seems to now be considered a feature in the game. Meaning no matter how successful you are your fort will at some point decide to cannibalize itself, but you had !FUN! right?\r\n\r\nAnother problem is patients not being fed food or drink and dying in their beds. You can set a cutoms labour for your entire fort that is for only feeding patients and they won't do it. Good thing there aren't any bugs in the game involving mass, unpreventable fights from breaking out in your fort. Something like that would ultimately make the game a massive waste of time wouldn't it?\r\n\r\nThere's even a seperate program called DFHack that was made to help address the plethora of issues that seem to have existed for so long that other people seem to need to fix the problems because it seems evident that these sluppy feature are just a part of the !FUN! of the game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like these styles of open-ended open world building games, but something is holding me back on this one. I think its the UI/UX. I am used to modern UI's where for example amount of needed clicks is optimized, but in this, it feels very clunky. Achieving things like building, zoning, work orders and conditions; they dont feel great to use. So much \"needless\" clicking around. And also could be the lack of visual feedback from the UI. I am sure things feel intuitive for old timers, but coming in fresh, it does not feel great. Also things feel illogical, like some tasks are pre-emptively red when you dont have required items, some are not. Then you add tasks only to get a notification you dont have the required item, amongst the other 20 notifications of missing items. I understand managing the dwaves is the core of the game and it should not be too streamlined, otherwise what would the player do, but some quality of life improvements would certainly be in place. Should I be a high-level fortress manager or micromanager? Also that distinction feels like I need to be both simultaneously.\n\nIt surely is possible that I don't know how to play the game properly with this many mechanics. Still, after 15h and fortress of population 50, knowing or not does not change what I felt as a new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to be a very particular type of person to enjoy this game. Special, bordering on a mental disorder.\r\nThe game has some of the worst interfaces I've ever seen. \r\nThe game mechanics are so opaque and cryptic that you will spend more time searching for answers than actually playing.\r\nThere are more issues with this game, but I just don't wanna bother any longer.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My Amiga 500 from 40 years ago was better at this.\r\nVery crap graphics, dont waste any money on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for the adventure mode and I was surprised at how bad it is. The dialogue is complete gibberish and you can go across the world and talk to a completely different NPC and see the exact verbatim dialogue. I'm not sure what their idea of \"procedural\" is but just vomiting up random tidbits of nonsense from a databank of 4 pieces of dialogue does not make a good game. \n\nMaybe the other modes of this game are fun, but adventure mode is embarrassingly underbaked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rim World's inspiration.  \r\n\r\nMicro management to the extreme.  Very steep learning curve.  You'll need the Wiki.  All that's fine, but many of the tasks are so buried or counter intuitive that it is hard to complete simple tasks.\r\n\r\nAnd just like Rim World... you then have to deal with all the whiny little dwarves crying about everything imaginable...  Bunch of pussies... ugh...  It would have been enjoyable to have killed most of my colony myself, break out the death squads...\r\n\r\nNot for me at this point in my life...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's only for people who never leave their house and count rice - tedious, slow, cumbersome, over complicated and extra counter-intuitive. I'm not saying it's a bad game, but it's really not for everyone. If you want to read 3 books before playing a game this is for you - can't learn on the fly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game takes the mechanics of other colony survival games and adds six extra steps just cause. Let me build a door? Nah, create a work order. Wait for a manager to assign work order. Wait for someone to craft the door. Wait for someone to haul the door. Ten minutes later I've got a door! Complexity does not equal good gameplay. \n\nI think I've spent more time reading the wiki and reddit threads on how to deal with issues than actually playing the game because it's just a hot mess of barely functional features.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Whoa whoa whoa, did they delete my negative review???  Good to know they are bloating positive reviews! [/h1]\nDon't bother deleting again, i saved it and WILL submit it over again.\n\nIn short, UI is atrocious, all controlls are beyond retraded, game in majority consist of - going through horribly made menus, windows and excel spreadsheets.\n\nThere is no game in \"game\" and deleting negative reviews is possibly most pathetic and shameful thing they could have done. Also, bloated price for glorified excel is hilarious.\n\nAnd again, i saved my review so if you shamelessly delete it, I will post it again AND spread of your filthy ways.\nWorst of luck and no regards.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "20 hour in to a game\nstill have no idea how to play :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "im sorry, its boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is kinda just ehhhh",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy as hell",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly, I'm not autistic enough for this one :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am sure this game is good, when you have about 100 hours of experience. I have so far spent more time watching youtube trying to figure out how to do basic things rather than play the game.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "New player here with 10h of gameplay.\nJust for context, I like economy/settlement/strategy games. I enjoyed playing Rimworld, Factorio, Europa Universalis, Stellaris, Crusader Kings, Age of Empires, Total War, etc. Those are all GOOD GAMES. Dwarf Fortress will never be part of those in my heart. This game was a truly horrible experience.\n\nAfter 10h of gameplay, I can tell confidently that I HATED my time playing this game, mostly because of one main thing that plagues every aspect and square inch of this game: a truly impressively bad user interface (UI) and user experience (UX).\nHere, I'm talking menus, their layouts, the unintuitive, slow and convoluted way you need to click at things all the time, the way elements to craft/build/do are displayed, arranged, ordered, grouped, etc. I've never seen anything so bad in my entire life.\nI never thought that I could be traumatized by a bad game UI and design, but here we are.\n\nThis game was launched originally in 2006, not in 1988. There was good UIs back then, so the fact that the game is old is not even a good excuse. SimCity 4 came out in 2003. And even if the game is old, a UI can change, can evolve, can be refined, refactored. Nothing of this sort here after 20+ years of development. Just a bad UI experience which was never cared for, and which will probably never be fixed. Once again, impressively bad.\n\nThis game can be overwhelmingly detailed about things that you really don't care, like every body part down to the teeth having a health status, while at the same time, the game doesn't care to explain to you the basics of how this or that object is produced, or what it can be used for. \"You just need to go read the Wiki!\" players often respond. Yeah that's right, to make up for a really badly designed game, I now need to go read 50 pages of wiki just to try to understand what the hell the game developer tried to do on this specific feature. This is madness. This is not how games are supposed to work. This is not a scientific simulation software, this is sold on Steam, this is just a game. A BAD GAME.\n\nSometimes, things are even outright misleading, with the same object being referenced by two different names in different UI panels. For example, I discovered at some point, enraged, that the names \"chair\" and \"throne\" were referencing the same object (I tried to find where I could craft a \"throne' by searching for 10 minutes in every workshop possible...), and a bit later discovered that \"mug\" and \"goblet\" were also the same object. Wonderful. In a game where you can craft hundreds (thousands?) of different objects, I'm not so sure things like this exist because of a huge lack of care or outright evil. \n\nIf the game was embodied into human form, they would be overly obsessed about useless details in obscure subjects, while at the same time being completely socially indifferent, not looking you in the eyes, not speaking nicely to you, not caring about how you feel, and just ignoring you in general. This is what Dwarf Fortress felt like to me. If you try to play the game for the first time, and even after playing the tutorial (at least, there was an attempt), you will notice that the game itself, its entire structure, doesn't care about you. It doesn't even try to have a somewhat modern or standard way for you to play a game. This is truly appalling. I got very angry at some point because of the obvious lack of empathy towards the players displayed by the game itself.\n\nIronically enough, the main slogan of the game is \"Losing is Fun\". Before I started to play, I imagined that the meaning of this was about a high difficulty, Dark Souls-like. I imagined that creatures would attack my base if I forgot to build defenses, things like this. And i guess that a lot of players probably see this slogan this way. But oh, no, that's not how I see it now.\nInstead, this slogan resonates in me with this meaning now: \"You see, the game is so badly designed, every mechanic and UI element is so cryptic and difficult to understand that you have no idea what you're supposed to do or what the game is doing, therefore, you will lose a lot. But look! This is so fun right!!!!\"\nNo, this is not fun. This is a delusional post-rationalization of a bad game, created purely to support a lack of accountability when it comes to fixing it. To every problem that the game has, one can answer \"Losing is fun!\".\n\nThis slogan is to me the illustration of how delusional people can get about their own work or habits they developed. \"What i made is bad? No no, you don't get it, this is intentional! Yeah, actually this is intentionally bad haha! You see? Problem solved!\"\n\nThis slogan has become ironic to me when I see it anywhere.\n\nThe game is also bad is a very weird way. The game is not lazy in the traditional sense of \"lack of features\", there is a LOT of features and things going on in Dwarf Fortress. But this is exactly the problem. Too much is going on, without any explanation, without anything being put in order. It's like this game has Diogenes syndrome: \n- severe self-neglect (of the UI)\n- domestic squalor (of the menus)\n- social withdrawal (doesn't care about the players)\n- compulsive hoarding (thousands of objets, lore elements, personality traits, body part health statuses, mechanics, etc)\n- lack of shame (no care for fixing the base aspects of the game after 20 years of development, while still adding new features).\nYep, actually, everything in this game checks out this definition pretty well.\n\nBut why waste my time with this game then if I hate it so much? Why did I take the time to write such a long review today?\nWell, because I feel like something wrong happened to me here. I was really ready to love this game. There is a big community of players around this game, and they really made me think that this game was a truly good game. I trusted them, and I just feel betrayed now. I feel wronged. I lost my time, and the only thing I got from this game is hours of frustration instead of entertainment. I need to balance this out. When games do something wrong, they need to be called out for it. That's what happened with Starfield, with Cyperpunk 2077, etc. Here, it's a little bit different because this is an indie game. But oh my god, this game is so bad, you can't treat every indie dev like a child that hands you a very bad drawing. Even indie devs need accountability at some point. I really feel like this game has been too bad for too long to be excusable.\n\nHere it is, I think I explained pretty much all the bad things that this game did to me in those 10 hours of gameplay.\n\nIf you want an economy/strategy/settlement game with a nice, welcoming, polished gameplay and UI, for the love of God run away as fast as you can.\n\nIf you want to suffer in an unintuitive and unnecessarily complex hot mess, Dwarf Fortress is for you.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Err.... This is a though one.\n\nI was really hyped for this game, but ultimately kinda ended up dissatisfied. The game is [i]alright[/i], I just expected more from it.\n\nInventory & colony management is convoluted and difficult for no reason? Your failings feel more like you're failing at understanding what's happening and playing properly, not because there's an actual problem happening to your dwarves. UI is highly unintuitive.\n\nAlso, you quickly become detached from the members of your colony. The names of people, places and events are an uncomprehensive mess of words and making it really hard to remember who's who and what's what. I'd rather they are called \"Steve\" than \"Èrithtosidianthur Zulbaneral\"...\n\nSimilar games I've played are: [url=https://store.steampowered.com/app/294100/RimWorld/]Rimworld[/url] (Fortress mode) and [url=https://cataclysmdda.org/]CDDA[/url] (Adventure mode), which I highly recommend over this one. There's just better alternatives...\n\nI can't, in good faith, tell a friend to spend $30 on this over the other games out there. If you've already played the other games and want more of the genre. And if you're ready to torture yourself with this one's complicated mechanics which requires 50 hour commitment to understand basic things like how to feed yourself, then go for it! I [b]don't[/b] think this is a bad game!",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I use to love this game and would play for hours. Now, I can't even start a new game and play without stumbling over the keys like a 5 year old because I've memorized every keystroke for the menus. If you're going to make a full graphical sprite and music update you at least should make the ability to designate keys and give us back full keyboard only play. Please toady. Please!!!!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Decent game, not as hard as you might think. If you have played any other micro colony sim you will get by, don't worry.\n\nIn fact, descendent games like Rimworld, ONI and Going Medieval have more systems you actively engage with and demand a greater burden of knowledge than DF. But yes, when it comes to passive random generation of text and values then sure, this game wins out.\n\nHas great pixel art, honestly very appealing and nice to look that, props to Kitfox on networking the artists.\n\nUI is still not there yet. I can think of a dozen simple changes that would make playing this game infinitely less tedious. They should have hired a UI/UX dev just like they did the art team because it wasn't and isn't their expertise and the game massively suffers because of it.\n\nThe whole experience still feels very Early Access and is quite rough around the edges. Had a couple major bugs that made me restart forts. In terms of meaningful content and features it still feels incomplete but I'm sure they will keep adding to it. \n\nUsually, by year 2 or 3 once you have around 3-4 squads, over 150+ dwarves and 1000+ food and drink each slowly climbing you basically have nothing more to look forward to.  At that point your only option is to start again in some harder/annoying biome or do gimped self imposed runs to get playtime out of it. \n\nMoreover getting to that point is more of a checklist thing than any real design roadblocks or game play push back you face, most mental energy you'd need is dealing with fluids and that's still not a lot when compared to contemporaries in the genre.\n\nWill give it a try once the Siege update drops to see if they addressed the mid-game but I doubt this game moves that fast, so in a few years I'm sure once the magic update drops it will be a far more complete game.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Fun to play but some stuff is just damn stupid. To many die from not drinking, Think of drinking water all your life so you die of thirst since you're bored of water. Very stupid. Even if you have alcohol dwarfs will die ten at a time since they are bored of the same drink. At a point its just limiting game play with stupid mechanics. Then you end up with hundreds of dead dwarfs over a few years having to make your city turn all its production capability to caskets and coffins. Then whats the point in playing just to make coffins",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Just not really it to be honest. \n\nAll of the cool story stuff you hear about happens through interfaces that are cumbersome to keep up with and track, especially as your fort balloons in size and scope. Everything kind of gets lost in the sauce and you're watching a soulless automated empire do its thing with or without your engagement. \n\nCompared to something like Rimworld which is a lot more intimate in scope and displays everything that's happening through actual onscreen actions and a concise, simple UI, I think it ends up being the more engaging storytelling simulator by a large margin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "wanted to like this game given it's cult following, gave it a good 60+ hours but I find it to be a combination of unplayable and not that interesting:\n1. Not well programmed to manage simple scaling (e.g., fires and siege drag fps down to ~0.5-2FPS...and it's not pegging the CPU/memory either, so to me that says it's bad programming) -> this bad performance is so common that it looks like players just accept it \"Usually FPS death occurs at over 200 or so dwarves\" or \"<Change a few settings> and go and wait 20 minutes and come back for <everything to be done>\" (via forum posts)\n2. Wanted to enjoy Adventurer mode but for me I found it to just not be fun (too much micromanaging, way to complex to get started, not enough variety)\n3. The main draw seems to be it's long history/world building + the classic dig deep and build things; but IMHO it gets old fast given that lack of variety or clear skill/item building tree; for example everything can be an artifact (I had a dwarf make an artifact chair...so exotic)\n4. <Insert classic complaint about poor UX and tutorials>\n\nTL;DR this game would be infinitely better if it was fully open source/community built, so many quality of life improvements to be had and variety (i.e., dungeon soup crawl is fantastic for this)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Appallingly bad quality of life and seriously tedious gameplay loop, and the good parts just weren't frequent or interesting enough to make up for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love the premise of this game and just wish that the missions worked properly! Right now they seem very buggy. I'll come back as soon as they get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the original game in the genre, but easily one of the worst. The interface isn't just archaic, it's awful. No explanation of almost anything, you depend entirely on forum posts from 10-20 years ago for basic instructions. Want to have dwarves hunt? Good luck, and God forbid you assign them to a \"squad\" and then they spend the rest of their lives spamming equipment mismatch errors that you're supposed to magically know how to resolve. \r\n\r\nThe game is a great idea, in theory but the documentation is awful and completely unintuitive. Leading you to depend on Google for basic understanding of how the basic game functions operate.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I have tried to play this game a couple times. I just cannot get into it. The controls, shortcuts and ui, are just really bad in my opinion. Maybe for some people this is not a problem, but I do not have fun when I am repeating the same clicks over and over again.\nI know that Rimworld was heavily inspired by Dwarf Fortress, but it is just better. Maybe expecting Rimworld level quality was just too much to ask.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "once you've figured out how to make a fortress run the game gets pretty boring, just building bedrooms ad nausium..  Never found any of the interesting events people talk about in other reviews.  Tried Adventure mode after i got board with fortress but the controls where just as cumbersome and i just couldn't be bothered figuring it all out again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's really weird this game is so highly praised when it's such a bug ridden mess that ultimately renders the game unplayable. The community has this word they use for this \"!FUN!\", what that means is eventually your fort will fail and it won't be your fault, maybe a small altercation between dwarves will trigger a bug that causes they fort to engage in massive civil war, killing potentially everyone. There are civil wars in teh game but im refering to \"loyalty cascades\", a known bug for over a half a decade that seems to now be considered a feature in the game. Meaning no matter how successful you are your fort will at some point decide to cannibalize itself, but you had !FUN! right?\r\n\r\nAnother problem is patients not being fed food or drink and dying in their beds. You can set a cutoms labour for your entire fort that is for only feeding patients and they won't do it. Good thing there aren't any bugs in the game involving mass, unpreventable fights from breaking out in your fort. Something like that would ultimately make the game a massive waste of time wouldn't it?\r\n\r\nThere's even a seperate program called DFHack that was made to help address the plethora of issues that seem to have existed for so long that other people seem to need to fix the problems because it seems evident that these sluppy feature are just a part of the !FUN! of the game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like these styles of open-ended open world building games, but something is holding me back on this one. I think its the UI/UX. I am used to modern UI's where for example amount of needed clicks is optimized, but in this, it feels very clunky. Achieving things like building, zoning, work orders and conditions; they dont feel great to use. So much \"needless\" clicking around. And also could be the lack of visual feedback from the UI. I am sure things feel intuitive for old timers, but coming in fresh, it does not feel great. Also things feel illogical, like some tasks are pre-emptively red when you dont have required items, some are not. Then you add tasks only to get a notification you dont have the required item, amongst the other 20 notifications of missing items. I understand managing the dwaves is the core of the game and it should not be too streamlined, otherwise what would the player do, but some quality of life improvements would certainly be in place. Should I be a high-level fortress manager or micromanager? Also that distinction feels like I need to be both simultaneously.\n\nIt surely is possible that I don't know how to play the game properly with this many mechanics. Still, after 15h and fortress of population 50, knowing or not does not change what I felt as a new player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You need to be a very particular type of person to enjoy this game. Special, bordering on a mental disorder.\r\nThe game has some of the worst interfaces I've ever seen. \r\nThe game mechanics are so opaque and cryptic that you will spend more time searching for answers than actually playing.\r\nThere are more issues with this game, but I just don't wanna bother any longer.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My Amiga 500 from 40 years ago was better at this.\r\nVery crap graphics, dont waste any money on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game for the adventure mode and I was surprised at how bad it is. The dialogue is complete gibberish and you can go across the world and talk to a completely different NPC and see the exact verbatim dialogue. I'm not sure what their idea of \"procedural\" is but just vomiting up random tidbits of nonsense from a databank of 4 pieces of dialogue does not make a good game. \n\nMaybe the other modes of this game are fun, but adventure mode is embarrassingly underbaked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rim World's inspiration.  \r\n\r\nMicro management to the extreme.  Very steep learning curve.  You'll need the Wiki.  All that's fine, but many of the tasks are so buried or counter intuitive that it is hard to complete simple tasks.\r\n\r\nAnd just like Rim World... you then have to deal with all the whiny little dwarves crying about everything imaginable...  Bunch of pussies... ugh...  It would have been enjoyable to have killed most of my colony myself, break out the death squads...\r\n\r\nNot for me at this point in my life...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's only for people who never leave their house and count rice - tedious, slow, cumbersome, over complicated and extra counter-intuitive. I'm not saying it's a bad game, but it's really not for everyone. If you want to read 3 books before playing a game this is for you - can't learn on the fly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game takes the mechanics of other colony survival games and adds six extra steps just cause. Let me build a door? Nah, create a work order. Wait for a manager to assign work order. Wait for someone to craft the door. Wait for someone to haul the door. Ten minutes later I've got a door! Complexity does not equal good gameplay. \n\nI think I've spent more time reading the wiki and reddit threads on how to deal with issues than actually playing the game because it's just a hot mess of barely functional features.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Whoa whoa whoa, did they delete my negative review???  Good to know they are bloating positive reviews! [/h1]\nDon't bother deleting again, i saved it and WILL submit it over again.\n\nIn short, UI is atrocious, all controlls are beyond retraded, game in majority consist of - going through horribly made menus, windows and excel spreadsheets.\n\nThere is no game in \"game\" and deleting negative reviews is possibly most pathetic and shameful thing they could have done. Also, bloated price for glorified excel is hilarious.\n\nAnd again, i saved my review so if you shamelessly delete it, I will post it again AND spread of your filthy ways.\nWorst of luck and no regards.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "20 hour in to a game\nstill have no idea how to play :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "im sorry, its boring.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is kinda just ehhhh",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}