{
  "positive": [
    {
      "review": "One of the best Science Fiction action games of all time both for it's single player and multiplayer. Start with 1  and go in release order, you'll enjoy every bit of it. Don't wait for the remake, it's not worth the wait for the pretty graphics, also you must play Halo 1 in classic graphics not remastered. 2 is fine in remastered. Enjoy!",
      "voted_up": true,
      "votes_helpful": 59
    },
    {
      "review": "I didn't play the Halo games growing up so this is a great way to make all the games accessible for pc players including a few remasters, customisation and even pvp.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "This game is jam packed with some of the greatest fps games ever released. Great fun with buddies.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Halo Reach one of the best campaigns of all time. All multiplayer modes fun and whimsical.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This package is now excellent. Playing Combat Evolved at 120HZ with the original graphics fully intact now is glorious.\n\nJust remember, Forerunners are Humans! :)",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "[h1]The best deal on Steam deal if you like coop campaigns[/h1]\n\nThis is one of the best deals in gaming ESPECIALLY if you like playing campaign coop.\n\nThis gives you six different full games in the [i]HALO[/i] universe including 1-4 and the two spin-off side stories, [i]HALO Reach[/i] and [i]HALO 3 ODST.[/i]\n\nIt's worth getting just for the classic 1-3 even aside from the spinoffs and [i]HALO 4[/i] and even those are worth getting on sale.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3591346330\n\nThe games are beautiful, the HALO 2 Remaster and HALO 4 really hold their own even against modern games, and all of them are substantially better in style than most games out there. All of the games in this collection have campaign coop which is why I got them.\n\n[h1]Story[/h1]\n\nAll games in this collection have stories which are adequate at least, certainly better than the transgressive nonsense you'd get in a game like [i]Borderlands.[/i] If you play through the series in order, you will eventually end up with a very good story in the ending of [i]HALO 3[/i] which is probably the best story in the [i]HALO[/i] franchise and a MUCH better ending than the one in Mass Effect 3.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3604697835\n\nSpeaking of [i]Mass Effect,[/i] just as the [i[]Mass Effect: Legendary Edition[/i] would be my top recommendation for people like like single-player action RPGs, this collection is my top recommendation for people who like coop shooters, shooters with a campaign (single-player or otherwise) and probably several other categories I haven't thought of yet. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3605938451\n\nIn fact, I would even recommend this collection to people who usually play vehicle-combat games since there are enough of those (and enough options like unlimited ammo etc.) that this game is an above average experience for vehicle fans in comparison to other FPS type games. \n\n[h1]Quality of life improvements[/h1]\n\nBecause this is a collection of previously released content, you start with access to a lot of the quality of life features that you would normally unlock after finishing the game.\n\nYou can watch movies from the terminals even if you didn't find them from the extras section, you can use options like unlimited ammo that make the game easier as well as many other which make it harder, you can select any mission you want to play, etc. \n\nIn other words, you already played through these games before somewhere else and want to replay a specific part with something you unlocked before, you can just jump in and do that here without having to jump through any hoops. \n\nTo put it another way, this game starts out with all the options and content that you would have to unlock (or purchase as microtransactions) in a recent [i]Resident Evil[/i] game. \n\n[h1]Conclusion[/h1]\n\nWhile I personally don't like the direction they took with the story in [i]HALO 4,[/i] This would be worth getting even at full price for all the other games and even HALO 4 is a good game if you don't think about the story in relation to the previous (better) story of [i]HALO 3.[/i]\n\n[h1]Troubleshooting[/h1]\n\nThe one significant bug which I encountered in this game was that on one mission in [/i]HALO 3, it started to slow down as if it had a memory leak.[/i] This was apparently a problem with the save file as the problem was replicated if I quit and reloaded the save but disappeared if I selected the same mission from mission select rather than using \"resume\".\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3606070861\n\nIn short, if your game slows down, select that mission from mission select rather than loading the save. Thankfully the quality of life feature that is mission select prevents the save problem from becoming a real issue.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of the best franchises out there. Great story, amazing gameplay, what more do i need to say?",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "A collection of all time classics a must purchase for any video game player.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best way to replay the classic Halo trilogy and spin-offs on PC. With multiplayer and Workshop support!\nThe anniversary versions are overall kind of downgrades, besides Halo 2's in some aspects. However, you don't have to play the anniversary versions if you don't wanna. You get to choose!\n\nWeird that it also comes with this strange fan game?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "there are achievements and goals to last forever it has no ending as you can play multiplayer but it would be nice if more could be split screen",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A brilliant collection of some of the most solid and fun FPS games ever made even if certain parts of the older games are starting to show their age a little. See below for thoughts of the individual games\r\n\r\nHalo CE: A Genre defining game that has stood the test of time even if certain parts of it are starting to show their age. Despite this the game has great and smooth controls that have stood the test for with a beautiful graphics update that brings it in line with the rest of the series (even if it sacrifices to amazing atmosphere and ambiance of certain levels), sadly the game had some parts that very got under my skin at times, the sometimes random difficulty spikes wild and all over the place checkpoint system and certain levels especially the 4, 8 and 9 level not being fun due to long stretches of the same level design coupled with sections, where the amount of enemies really starts to bog the pacing down to the point where you are unsure if its an endless spawn section your supposed to ignore or a finite number that you have to battle through.\r\nHere's hoping that these are issues that are exclusive to the first game as i really enjoyed the game for the most part, it's just those sour points really did sour the experience. \r\n\r\nHalo 2: An improvement on the original with some minor frustrations that can sometimes mar the experience. Some levels can last too long and have frustrating, sometime unfair moments and the new Brute and flying enemies can really start driving you up the wall, but overall i enjoyed my time with this game. high recommendation. \r\n\r\nHalo 3: What a Finale, i can finally see why this was spoken about so much back in the day. a satisfying ending for the original series and a damn fine game. The only things holding it back are a small number of minor problem which thankfully can be ignored... all except the second to last level which can be a miserable, unpleasant slog with puts a dent on what is a well paced and fantastic campaign.\r\n\r\nHalo 3 ODST: Halo 3 ODST is a bit of a mixed bag for me, on one hand it has amazing atmosphere, likeable character and an amazing detective like story where the more you play the more the story makes sense. on the other hand, navigating New Monbasa City becomes very tiring after awhile and the mission can sometimes have wild difficulty spike that catch you off guard. Nevertheless I still enjoyed my time with this game, still a high recommendation\r\n\r\nHalo Reach: As Bungie's last game for the franchise, it's a sober but brilliantly made game that is as fun as the rest of the series, with all almost all the little tweaks and improvements mostly working to tell a brilliant story of humanity's most devastating defeats in the series. Without those little lighthearted moment present in the previous games however, this game becomes one the most depressing to play through, which i know is the point, but the other games in the series had a better balance of the dour and depressing contrasted with little lighthearted and hopeful moments \r\n\r\nHalo 4: AS 343 studios first FPS game in the Halo universe, it's not a bad first attempt but it sadly plays too safe and doesn't really do enough to stand out. the new enemies fluctuate between fun challenge and frustrating unfairness and the story while a good set up can be overwhelming, frantic and confusing at times saved only by the heartrendingly beautiful character moments between MC and Cortana. It's a shame then that 343 fumbled the other games stories after this as we could have had the start of something amazing. still a high recommendation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This isn’t just a game. It’s a piece of gaming history that hits you right in the heart and reminds you why we ever picked up a controller.\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great collection of FPS history!\r\nMust have for me as i played the original halo back in 2001 christmas i'll never forget playing for the first time.\r\nHighly recommend picking this up for great story single player & co-op and the pvp multiplayer is a blast if you're competitive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was recommended to me by my brother. Wasn't that big of a fan at first, but the gunplay and enemy elements were a refreshing perspective. The Warthog was a nightmare to control, being one of the first driving mechanics being introduced, still a blast to drive off a cliff and laugh about. Great series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bring back original game menus and loading screens",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i heart cortana, cheifs cheeks, six's. rookies, arbiters lovely mouth, sgt johnsons lips, and bungie devs anhdjusjfdhghdhshjsjsjjs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 no debate, 6 games for the price of one, with multiplayer as well. worth it, it usually goes on sale and you can get it pretty cheap.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best value plays on Steam:\n•\t7 campaigns\n•\t6 multiplayer suites\n•\t4 forge modes\n•\t2 firefight suites\n•\tServer browser for custom games\n•\tNew armors and weapon skins\n•\tMod support\n•\tAll the enhancements and added content",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are several key points to note regarding The Master Chief Collection. Consider:\n\n- The utter disrespect, the sheer neglect towards these absolute classics, these cultural phenomenons from 343 or \"hAlO sTuDiOs\" and Microsoft, should be punishable. Severely. The only thing I'm willing to commend them on is their effort to restore Halo CE and Halo 2 to their original glory. Even then, they apparently enlisted the help of modders so...\n\n- There is workshop support, with a very active community. Hlao.\n\n- The games are presented in chronological order. I wouldn't recommend to play them that way for first timers. Play them in order of release. ODST and Reach really put things into perspective.\n\n- Halo CE. Experience the glory of the original, the one that started it all, my personal favourite. Wort wort wort.\n\n- Halo CE Anniversary is ass. This might be down to personal preferance, but man, does that look like ass. The new sounds are cool.\n\n- Did I ever tell you the definition of insanity? It is Halo 2 on legendary. Never, ever, ever, ever attempt Halo 2 on legendary. Ever.\n\n- Halo 3. Peak.\n\n- ODST is a dim, candle lit dinner on a rainy night, coupled with an inexpensive, yet surprisingly savory wine and you get laid in the end. Mmwah.\n\n- Reach might be in contest with Saving Private Ryan for best war story ever told. Man that game...\n\n- When you ultimately get to Halo 4, just set it to easy and power through for the story, it's the only decent thing about it.\n\n- Did I ever tell you the definition of insanity?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dude i am having so much fun with this, the whole package of Halo every game is pretty dang cool, my only downside is having to make a Microsoft account, i wish i had the option to only play with my steam account, that's my only downside. 343 and Microsoft please make this an option please, i get it this game came out on consoles first. but please find a way to make an option to play with my steam account thank you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best things Microsoft has put out.\r\n\r\nWhat's better than 1 Halo game? How about 6 Halo games designed to run smoother on new hardware and with better graphics? Microsoft has really been shooting themselves in feet recently and even though this has been out for a while. It's still easily one of the best things Microsoft and 343 have put out. Shame that MCC is still going to be 10x better than the next Halo game but sometimes you just can't beat the classics.\r\n\r\nBuy the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "every game in this collection is good. dont let a purist stuck in the past try to tell you otherwise",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its like 6 halo games in one with extras and workshop support. it has its issues, quite a few annoying little quirks. it absolutely has a hacker problem, and sometimes it won't even let you sign in after installation, especially on steam deck. unfortunately 343 has cut support for this game, and it doesn't look like that will even be remotely changing anytime soon. either way, all the content inside for $40? absolutely worth it, just avoid the main online, or better yet, just get it on xbox. bypasses the login and the hacker problem is way less prevalent, but its completely understandable if that isn't an option, given that it's xbox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A classic series brought to PC with updated graphics. As someone who never played Halo before, it was delightful diving into the galaxy as Master Chief and saving humanity from aliens. An action movie storyline combined with sharp gameplay makes for an experience you will cherish for years to come.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game was my childhood, decided to replay it on steam this time when i saw the sale. No regrets",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think Halo is a pretty cool guy. Eh kills aliens and doesn't afraid of anything.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's Halo on PC. One of Xbox greatest franchise on PC... What else is there to say!?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed replaying through each campaign again recently. Halo 3  and Reach are definitely the peak though, with both games providing an amazing double whammy of a single player campaign and multiplayer. Even without touching Halo 4, multiplayer still gets good population. The only Halo you'll ever need.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty darn good. Buy it on sale--it is one of the best deals on Steam! Halo 1 and 2 look absolutely fantastic, and playing the Silent Cartographer is a therapeutic experience. I only wish Halo 3's cut scenes got the same treatment as the ones in Halo 1 and 2, but the gameplay holds up nicely. I friggin' love Reach. ODST is a neat side story, and I really like the silenced SMG. However, Dare's face is terrifying. And Halo 4 is included as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played combat evolved a bit with a good friend when it came out, never played the games after he passed away. These are great games and it feels nostalgic to play them again now. Great for something to putz around with on the steam deck.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Halo, pre-343, is peak. Halo's CE to Reach are all worth playing at least once, if not, then obsessively.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the easiest way to play the original Halo trilogy on PC is this buggy mess that 343 didn't bother to fix despite countless feedback (I know they call themselves Halo Studios, but they will forever remain 343 Guilty Studios).\n\nHalo CE is basically a 2004 Gearbox port with minor improvements, yet still inferior to the Xbox original\nAlso do yourself a favor, and play Halo CE with original graphics. So much of the exceptional art style was lost in anniversary version. And though this game is 25 years old, it looks great given that Bungie devised the unique art style around the Xbox' technical abilities.\n\nHalo 2 is slighlty fixed Vista port of the original game, and still has bugs that originated 5 years ago.\nIn contrast with Halo CE, Halo 2 is better in remastered form, as the original design envisioned by Bungie for this game was never realized in the original due to Xbox technical limitations. Bungie wanted to make shadows a viable part of the level design (Doom 3 was a thing back then), yet the old Xbox could not handle this, hence the game looked bland. The remastered version adds that needed depth to the level design, as well as is way more restrained in its improvements compared to Halo CE remaster. \nOne thing that taints the experience with Halo 2 remaster is bugs. sometimes checkpoints do not register, there is annoying bug with random grenade throws on standard gamepad layout (I swapped LT with LB for grenades). Sometimes switching visuals in between cutscenes crashes the game. All those bugs are well known, but 343 is too busy ruining the series so there are no fixes 5+ years later.\n\nHalo 3 seems to be ok, thanks to it being X360 game and seemingly requiring less effort to run properly. So its basically a PC port of that game, and it looks the way it did when I first played it on 720p TV. And that looks great. Bungie might sometimes suck at level design and console-ish gameplay, but their art style during OG Halo years was top notch.\n\nThere is also a decent ODST spin-off here that adds some stuff to original story with solid gameplay, as well as Reach, which is a mixed bag given its innovations that now are associated with 343's games.. And Halo 4, not that anyone should care about it since Master Chief's story was done with Halo 3, and none of 343's poorly witten fanfics cannot change it.\n\nI am stuggling to rate MCC positive, given it still has bugs that by now are old enough to go to school, and the fact that the only *real* added value is Halo 2 Anniversary, but if you want to play the OG Halo trilogy without trying abondonware (like Gearbox'  Halo CE build they published a year after PC port's release), this is the simplest way. But be prepapred for a rough ride, especially for Halo 2.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "HELLA fun if i knew how fun it would be i would have paid the full price but getting it on a 75% discount adds even more value to that collection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say about 6 or 7 hours playing Halo... The gameplay is definitely Mango, but some multiplayer matches were very Mustard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing collection that goes on sale quite often for next to nothing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved Halo as a kid, love it still. Nothing else to say really......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has been with the game since launch on Xbox back in 2014 and seen everything this community has gone through I can confidently say this is the most healthy this game has been with active players and NEW mods coming regularly. No more game breaking bugs or endless wait times in matchmaking. I would recommend this to anyone who is looking for a great bang for your buck. I think whether you're only interested in matchmaking or campaign both experiences have more hours of entertainment than most other full price games. Definitely worth picking up. This game will always be 1th in my heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it all started with halo CE on pc back in the day, then i played reach on xbox 360, now on pc and it's amazing, because i prefer mouse and keyboard. always waited for this moment to be able to play all these games on pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is a classic game, my brother showed me halo 1 and I LOVED it, I was relatively new to gaming but this game shook me out of my boots. 10/10 da goat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to replay these games from years ago and a lot of fan made gems in the workshop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't care what anyone says, the fact that we have all the og Halo games in one launcher and with this great price speaks volumes, unlike other games that sell franchise games separately. Gameplay wise, I'm playing on my laptop and everything runs smooth, no bugs no nothing.\r\n\r\nJust pure nostalgia baby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lost a friend because of this game and it pissed me off, but this is peak halo at it's finest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very great game one of my fav halo games of all time first game I played on the xbox one love the teabagging mechnics as well, but there is a serious issue they need to fix tho, I could be 1 hour in the game and the game crashes same happens if I play with one of my buddies in the campaign game could freeze mid way, tried lowering settings but to no avail, pc version of this game is a bit broken but other than that would highly recommed game to anyone or to first time fps players brings me back to the good old 360 days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent graphics, excellent storyline, works great with an Xbox/PC controller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its halo what can i say. great remaster great deal great support good job 343 you didnt completely fumble something for once",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is such an amazing game, started playing it when I was 2 years old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo, it is fun this is the first game i ever played and i still love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hackers arent that bad. I see one about one or two months on average.\r\nIt has workshop mods so it has LOTS of content for both single and co-op.\r\nIt might be difficult to learn how to counter some methods of play so patience is required if you actually wanna get good...if you care about that.\r\nStill a good shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This collection should be in everyone's library. A collection of 5 stellar games (and Halo 4) that frequently goes on deep discount, it's honestly a steal. While Halo may no longer be what it once was, it's great to have the opportunity to revisit the originals in a reasonably faithful (though not perfect) re-release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was awesome playing through all my childhood halo games and 6 games for $10 (on sale) was almost the best deal I've got on steam so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just finished playing halo reach, about to finish playing the rest of the collection later, but for now, this is my honest opinion about this collection coming from someone who never played halo before, this game is genuinely fun despite how old it is, the story, the guns, the maps, the characters, they're beautifully well made, if the collection is on a discount, BUY IT IMMEDIATELY! it's worth it, a close friend of mine recommended the collection for me and I thought about giving it a try since it was on discount, and I'm so glad that I bought this instead of cod mw2019, overall, 10/10, a masterpiece that people shouldn't miss out on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is one of my favourite franchises. there are 6 amazing games in this collection and very good value for money.\n\nvery good campaigns and still has an active multiplayer.\n\nsome of the most unique and iconic weapons in gaming to date.\n\nDo your self a favour and try halo out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good, there isn't much to say about.\r\nIt's all halos through 1 - 4 including halo reach and halo 3 ODST.\r\nIt's halo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MCC has multiple halo games of difrent virenties some are good and others not so much but these games are entertaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried to play Halo back in the day. Never had an Xbox and I never could get use to playing games with k and m. So, i wrote this game off like alot of others that just wasnt for me. Recently i found the Master Collection for 10 bucks? That is stealing if you ask me. Found a PS4 controller laying around and booted it up. The game looks great for its age and playing with controller is just the way I like it. I usually play alot of adventure games where you spend more time looking for collectibles than playing actual story line. I usually do not care for fps's, like call of duty, to fast pace for me, but replaying this collection after all these years is just flat out wonderful. Just run around and shoot everything. I would like to send a shout out to those that make it possible for an old dog like myself to have the opportunity to enjoy the Halo experience like others have enjoyed for years. Thank You and Happy Holidays. B Good, B Safe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the one and only...its been remade 7,645 times for a reason , ultimate classic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played the original on mac and pc last milenium - but never the whole series. So great to now play it on codeweavers crossover on my m2 MacMini",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "would recommend it, sadly there isn't much people online anymore but the campaign is good. Firefight is awsome in this. I played a lot of firefight back in the day and it has firefight from halo reach and halo 3 odst.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a massive game with an epic story line and constant action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game changed my life\n\n\nif you haven't played it, what the hell are you doing\nit goes for ten dollars on sale, go buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This port nearly expired my refund time due to me trying to fix the audio not working and being unable to invite my friends into my party. I recommend the games themselves, but the method of playing them violates my 8th amendment rights. Its days like this when I want Valve to add a Mixed option for whether I recommend a game or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They want a comment as to why I like a Halo MCC, so it's a good game. Yes you have to have a Microsoft account to play but you don't have to pay for an Xbox live account just to be able to play. It supports LAN which is how I play with my friends anyways. It is an easy way to have all of your Halo games you love on 1 system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been a Halo fan since the very first game, and seeing all the games gathered in the Master Chief Collection… it’s just amazing. You get the full journey, from Halo: Reach right through to Halo 4. Reach is still one of my favorite. The story, the characters, the atmosphere… I could spend hours just playing it.\n\nGraphically, everything has been polished really well, it runs super smoothly, and matchmaking finally feels good. Replaying the classic multiplayer maps gave me the same thrill I felt the first time I played Halo. Honestly, whether you’re nostalgic or discovering the series for the first time, this is the perfect package.\n\nBottom line… one piece of advice: if you love epic FPS games and the Halo universe, just buy it. Seriously, you won’t regret it.\n\nVerdict: 10/10 – Halo forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game also moding is really easy just go to the communtity page hit workshop and boom easy (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Collection to bring back all the Halo games from the Xbox to the PC. Really fun to play. 6 Games with Multiplayer for 30€. Unbeatable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only gripe is that the name is incorrect, as it includes 2 games not featuring the Chief at all (Reach + ODST), while omitting 2 games that do (Guardians and Infinte). Not going to complain though, and being able to port the progress / account from my Xbox was an extremely nice touch.\r\n100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is already worth it but the workshop and what they have there makes it double as good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, amazing mods, amazing to glass stuff would recommend :steamthumbsup:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played Halo but now it's my favorite game and it's better than Half-Life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this had some huge issues when first released but after all the fixes and adding reach it's a great way to enjoy most of the games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic set of games, great for with friends or solo. Can be a real challenge with LASO or just a laugh while chatting with mates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6 amazing games in 1. Played 1000+ hours of this on xbox, now playing on PC with higher frame rates and mouse and keyboard is even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever if you find it on sale buy it fast those sales dont last long",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as fun as having a 16-player LAN party in the early 2000s, but it's close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my very first time experiencing Halo and I started it on Reach and went to others and I must say it is beautiful, even that Halo 4 having some flaws, it never stops me from enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo reach imo is the best game ever made also GREAT SOUNDTRACK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only recommend this game for the story mode and casual custom games. The game is randomly unstable online. Servers randomly go offline for example. The leader boards are hacked. People AFK / leave out of games. The game has quietly become discontinued with developer support in general! The in game career stats have been broken in areas for years. You will find that double exp is rare with a small population remaining. (Halo has 1 million at least fans on social media).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thes Best Game Ever, Except for H4 has all the great bungie classics and the custom servers are great aswell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is a game of men, and wo-men that have always been men (sorta....I guess....idunno lol), small wo-men and vannilla men that want to be acknowledged as men, the definition of being being men is playing halo. Men halo, and halo men. we were always men, time to Halo men, amen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo 1, then Halo 2, finally Halo 3. Stop there, don't play more Halo. Enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Iconic Halo Collection available for as low as $10...\r\n\r\nI have not tested multiplayer yet, but I can say the campaigns are exported faithfully to what they originally were.\r\n\r\nYou can access literally all games from a list, and select any mission, in but a minute after booting the game. Or happily quit halo 1 for instance and immediately load into halo reach if you would like.\r\n\r\nThe biggest gripe with this collection, to my understanding is that local split screen co-op is not built into the game. You have to go out of your way and install a mod to do so.\r\n\r\nThis collection may be the easiest and cheapest access to the entire Halo franchise, but 343 industries are about borderlining on having done the bare minimum when they neglect incorporating split screen co-op.\r\n\r\nBesides this, the campaigns are a magnificent port.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this was a fun game but what i really didnt like how there was not inf stamina if you know what i mean like in the other games but its really fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good value for all the content, not demanding on PC. A collection of games that are actually good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is a game i just started and have gotten attached to it for a while. The gameplay, weapon selection, warthog, it all is just a good recipie for an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost the entire Halo franchise in one package. The earlier games show their age a bit (especially 1) but honestly just happy to have them preserved and easily accessible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feature rich with crossplay and the custom games browser, it doesn't get better than this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play halo CE with Halo: Rebalanced, best mod ever\r\nIncredible game series \r\n\r\nis very nice :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much content for 40 bucks, unfortunately, the game is dead so multiplayer is hard to find lobbies in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the base game is amazing and the modding community is just so passionate about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak games, steam workshop is great on this game specifically",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing since i was a wee little tot, and i love this game so very much, and i think you should play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What do you even say? It's all the GOOD Halo games in one bundle. Sure Halo 4 managed to weasel its way in there too but we'll forgive it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the kind of game we should be playing. Great as always.117.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "arguably has one the best trilogies in gaming in one package, plus ODST and reach which are peak as well. get it when it's on sale, it's a steal for $10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always thought this game was just overrated, but once I actually started playing it, I was completely surprised. It genuinely amazed me. Modern MMOs can be exhausting with their endless systems and grind, but old-school games free you from that pressure and remind you what pure fun really feels like.\nFor me, this one is a solid 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute Cinema and Incredible Gameplay, Solid 10/10 no matter how you look at it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who's first two Halo games were Halo 4 and Halo Reach, getting The Master Chief Collection is honestly the reason I love the Halo games so much, as all the halo games (with the exception of Halo 5 [doesn't exist] and Infinite) are easily accessable and quite a lot of fun to play, especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the halo series, especially Halo 3, the story is amazing and the characters within the story are just executed so well, i can definitely recommend playing this collection, as it also has an amazing modding community along with multiplayer, its practically endless fun.\r\nIf i could rate this collection out of -/5 i would give it a full 5/5 stars.\r\n\r\nAlso they put the mamsnrhbr chehfde in the soder!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The GOAT of Console FPS games. Halo 2 & ODST will forever be my favourite Halo games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Halo is an oldie but goodie. The graphics are unreal.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Does not let me log in. Even to play single player games. I am already logged in on steam, let me play the game I paid for!\n\nFollowing some instructions, I just tried to Alt + F4 after logging in, but before getting an error message. Then when I reopened the game, I was logged in! I hope this helps other people!\n\nI shouldn't have had to do this to get my game working, but I guess Microsoft is just a tiny 4 trillion dollar company that can't afford to fix their own games.",
      "voted_up": false,
      "votes_helpful": 435
    },
    {
      "review": "typical microsoft ruining every game with their sign in bullshit. cant even play a single player game because microsoft is so fucking shit that the game is gatekept by a login that does not even work. do not buy this, or any microsoft game for that matter.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Thumbs down just for the Microsoft login when you launch the game. Needlessly frustrating when you just want to play the game.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Game doesn't let you past the forced Microsoft Login screen, shouldn't be sold on steam",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unable to log into Microsoft Account rendering the entire game completely unplayable despite multiple attempts to fix such as clearing cache and fiddling with Windows Credential Manager would suggest avoiding the game until this issue is fixed if it ever is.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Forcing you to log into your microsoft account is stupid. fuck bill gates and fuck you",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Can't play the game because I have to login but the login process is bugged.\r\nThanks for making unplayable single player game",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Cool game but, I tried to play today and instead of playing the game I spent 20 minutes getting errors on \"sign in\". I just don't understand why quality games and studios continue to make barriers to playing their damn games. This is why Indie games are better, they have never made me \"sign in\" to play the game. They don't make me install kernal level anti-cheat software to play the game. They actually just let you play the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I love Halo, but this version has been having serious issues as of late. When opening the game it asks for me to log into my Microsoft account and then crashes. It will not move forward past this even after an uninstall, key removal, system restart, or any other method online. We need a single player version that does not require a log in to play.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "[h1]Quite literally unplayable.[/h1]\n\nThe genuises at Microsoft figured it should be mandatory to have an Xbox Live account signed in to play this game. \nI signed in, and the game just infitinely searches for servers, never connecting.\n\nI found approx. 20 different Reddit, Steam, and Halo Waypoint threads all trying to solve this issue with the Steam version, and accross them all nobody seems to have found a consistent fix, some even going as far as wiping their computer and reinstalling everything including Windows itself only to have the game still not work. \n\nI've tried a lot of different fixes and none of them work in my case. \n\nI used to love you Xbox, but this is why your company is crashing and burning. Embarassing issues like this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Microsoft login wont accept any Microsoft account I throw at it, and won't let me make a new account after flagging my activity as 'suspicious'. I wish I could recommend this game, but out of 7 of my friends that bought this game, 2 people, myself and another friend were unable to log in. For a series like halo, having ~30% of purchases of the game be unable to access the game they paid for is unacceptable at best, and legally dubious at worst. Thankfully steam refunds can allow most people to get a refund on their game, so big W's for steam",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "do not buy\nthird party xbox live login required\ndoesnt even work\nso you are stuck on the login page without option to play",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "unplayable trash when it forces you to login to their crappy xbox live network that never lets you in and blocks you from playing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game login via Microsoft account is broken and constantly does not allow login without complicated removal of credentials that doesnt always work.  Game is useless if you can't play it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Campaign is cool. Multiplayer sucks. Had more fun playing CS2. And 70% of that game's community is a Neo N*zi cesspool. Stick to campaign if you want a good experience. Don't waste you time with multiplayer.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Can't sign in. Forced login errors out, making the game unplayable.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Garbage implementation of the mandatory microsoft account. Endless loop logging in.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "po infelizmente tem que logar na porcaria da xbox live, se eu quisesse usar esse serviço eu comprava o jogo lá, meu sonho é a steam bloquear essa palhaçada de ter que logar em outros serviços pra jogar a porcaria de um jogo de 2010",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even play single player due to always online forced connection and the servers have been down for days. No, microsoft has said nothing regarding this most recent issue but I can't take it anymore. After this, I am 100% making certain to NEVER buy an always online product ever again unless 100% of the game is actual online play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Re-downloaded the game recently. Tried to play, but the window to connect to my Microsoft account couldn't load. I am now blocked from playing the game because of Microsoft...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolute Banger of a game 10/10 \n\nnegative because lol make me sign in to the worst service possible , micro*dk*soft and xbox live, cant even play a single player game offline because of that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Does not let me log in, cannot play anything.\nUseless, cannot believe this kind of user experience exists in 2025.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another case of XBOX/Microsoft making games as unplayable as they possibly can. Can't play unless you have a Microsoft account. 0/10 would not recommend",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "require log in into microsoft account now for some reason, for a single player game too.\nGreat game ruined by dump company.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Actually incredibly disappointing. I was looking forward to playing this but it is literally unplayable, the microsoft sign in feature is broken and even after that it just gives me {\"version\":1,\"currentRequests\":102,\"maxRequests\":100,\"periodInSeconds\":600,\"limitType\":\"Rate\"} this error. I looked online to fix it, the only thing was on reddit and it was specifically for Linux. I should not have to go through these hurdles just to play a 2 decade old game. This is why I sail the 7 seas. Your products are trash mister Soft. And your wiener is micro.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Does not let me login to to play the game, complete fail thanks microsoft!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Can't even sign in anymore and I'm done trying. It would be great if I could actually play it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Requires microsoft account with bugged sign in, captcha, 2FA and all the crap that circlejerks, but doesnt work the same as in windows, just half-arsed implementation.\nAll that after youre alreaddy loggedin to steam, just to play single player",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Halo games are great. Why game companies make launchers that don't work is perplexing. Be prepared to be able to play Halo SOMETIMES but certainly not every time you try to launch it.\r\nJust google Master Chief Collection and the first link is to a thread about people not being able to load the launcher. It's been a couple years, its not going to be fixed. Cannot recomend this version of Halo even though they are great games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Forcing you to sign into a microsoft account to play a singleplayer game on steam is criminal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Full of cheaters. campaigns are fun because they weren't made by 343.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to try the Halo experience for the very first time, but Microsoft disappointed me. I played for a few hours and I got through the second mission of CE when suddenly a Microsoft windows pops out and tells me to sign in again. When I do, it tells me that my account was blocked for \"suspicious activity\". I played it on my Steam Deck. Fresh Microsoft account. No mods. What was so suspicious about it?. Imagine you are playing GTA V for the first time and Rockstar games suddenly decides to block your account after you play a few hours.\n\nThese kinds of first impressions matter and Halo games had always picked somewhat of an interest for me. But I am disappointed with what happened and I don't think this is a way to treat a new player who wants to get into the franchise. I spent $9.99 on this bundle and I am not spending any more money in anything Halo related again. Thanks, Microsoft.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Halo Co Op simply does not function, anytime a checkpoint is loaded anyone excluding the Host freezes. The game is unplayable and this just sucks. Please fix this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Halo games are all awesome but Microsoft constantly breaks the MCC with shitty updates and sign-in errors.  I'm signed into the same Microsoft/Xbox account in Windows/GameBar/Xbox App but then this game tells me \"{\"version\":1,\"currentRequests\":101,\"maxRequests\":100,\"periodInSeconds\":600,\"limitType\":\"Rate\"}\" when i try to sign in and I can't play the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I installed the game, 30 gb for just the original xbox version to confirm that anyone that bought this game and Halo Infinite are unable to login, therefore you bought a game that you cannot play, and since devs are just as incompetent as Xbox themselves, you pretty much bought a nothing burger.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "god forbid i dont sign in to a non-functioning server to play the campaign on a 20 year old game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Halo is fine, Microsoft app is complete shit. Constant problems with frends joining, constant lags and dissconnects. You requre Microsoft account to play even single player and after playing 4h microsoft decides to block your account without cause and to unblock it you need to give them your phone number to get some code to proceed. Phone number isn attached to my mail, i can't think of a reason for them to need my phone number to do anything in game. Pirate if possible if you want single player, otherwise prepare to suck their dick for them to graciously allow you to play game you paid for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Microsoft account seems mandatory to even get to the game menu.\n\nAccount was locked after 1 evening playing. Cannot link different account (always prompts for password of not-working account). Cannot even close the game from there.\n\nGame without Anti-Cheat and limited services (I don't play online, just campaign) gives Fatal Error.\n\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It has nothing to do with the game, If you are going to make me create an account (which I despise)  it should work! At the very least. Is incredible that the halo page offers advice on what files to delete to be able to play... Its your game, fix the launcher, or better yet.. dont ask me for my personal information for an offline game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Awful Co-op Experience, Campaign won't even start.\nDo not buy this game if you're planning on going co-op",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't log in to my Microsoft account since moving over to a new system. Keep getting different errors or infinite loading screens after attempting a login. \nTried every fix i could find online, including individually deleting every Xbl credential on my system, and spent multiple hours with Microsoft support whom weren't of any help. \nSpent 70 dollars for a game that I'm locked out of.\nReminder Bill Gates had a close relationship with Jeffery Epstein and the two met on numerous occasions well after Epstein had pleaded guilty to soliciting a minor for prostitution in 2011. \nhttps://www.nytimes.com/2019/10/12/business/jeffrey-epstein-bill-gates.html",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This unbelievably shitty app just made me log into my Microsoft account with email and password. Then it made me log into my GITHUB account with email and password, and then required a 2FA token from my phone. Then it required me to enter a code they sent to my email address. And THEN IT DIDN'T EVEN FUCKING WORK, requiring me to enter all the same information again. All to play a single player game. Completely unacceptable bullshit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cannot play game without logging in microsoft account. it used to not be this way.  Eff this game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this in the past but forgot why I uninstalled it, reinstalled it a few days ago and found out why. Until they let you play the game without logging in to M$, I won't be playing this again. Being a long time M$ Win user, I figure they have enough of my data, they don't need any more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Microsoft's AI riddled code is so broken you can't play a singleplayer game because you need to log into an account it refuses to let you log into",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love Halo, but it's unplayable, gets stuck right at the beginning with the microsoft login.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unable to login to Microsoft Account and therefore unable to play the game at all; as I understand it hundreds of people have this exact same issue.\n\nThere has been no announcement from 343, no resolution provided by Microsoft, and the /r/halo subreddit deleted my post about the issue as 'repetitive'. There is no 100% working guaranteed fix.\n\nSuffice to say, there is a very strong likelihood the MS login requirement has completely broken access to the game for paying customers, and they don't give a shit. DO NOT BUY.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cannot sign in anymore. Even though I have used my Microsoft Authenticator app. Regardless it gets stuck on an endless load screen. This issue even happens when trying to play mods. Unfortunately I had to uninstall this game. Please fix this 343",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't login to Microsoft upon launching this game. I bought the game on Steam, and I have a Microsoft account for gaming (unfortunately), but clearly MS doesn't care to have their end of that bargain work.\n\nClassic Microsoft moment and here's my thumbs down.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Edit: To fix the Login, you must try to login again, when it fails, hit ALT + F4. Re-open and it will work. It's incredibly silly that this is the fix, but it worked for me and others. \n\nI LOVE the Halo Series... I'm on a brand new $2.5k computer and can't even log-in due to Xbox Live having errors. I've done everything posted online (from deleting cache'd files in the MCC folder, deleting Xbox Live Credentials to refresh them, and disabling the \"Enable GPU accelerated rendering in web views\", which was recommended by Xbox Live Support. 0/10 Since I can't even play it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If the idiots at Microsoft would make it so I can actually LOG IN their dumb game it would help. I already played 300 hours of the thing but had to uninstall. I reinstalled now and the game can't connect to my account. Stupid enough that the game doesn't have a way around that, now the sign in process just runs in circles without connecting. Sucks to suck, Halo, I'm gonna play something else. And fuck Microsoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just want to click and play, but not with this game, this game makes you have difficult ways to log in, to be able play the game, i dont know how to play this game and i paid for it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game on sale because I got nostalgic after seeing the new remake trailer. Now as I open the game, I see that not only do I have to log in to a Microsoft account and it doesn't even work. I just keep getting this blank gray box with no way to move forward. Microsoft gaming is such a joke that clings to old glories and can't even do them right. The customer shouldn't have to jump through hoops to use your product because you invite stupid incidents like this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Empresa multimillonaria no es lo suficientemente competente para desarrollar una interfaz de inicio de sesión que no falle cada rato, increíble.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game used to work fine.\r\nDid not play it for a few months, starting it now requires a microsoft login? \r\nNot only that, you can only use the last used microsoft account on your PC/laptop.\r\nWhich happens to be my work account. Yay.....\r\nWay to go screwing your customers over Microsoft...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No splitscreen :c\n0/10\nGreat game, but not the PC version",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loved this game as a kid but Microsoft have absolutely fucking ruined this shit.\r\nMods don't work.\r\nMandatory sign in to Microsoft account.\r\nPoor Performance.\r\nDisconnections during online play.\r\nSeems their online shop works PERFECTLY FINE - everything else sucks.\r\ni FUCKING hateee Microsoft for what they have done to this franchise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Microsoft login can and will decide you don't get to play this game.  Login loops, permissions rabbitholes, Steam Browser specific settings changes, WINDOWS KEY MANAGER CHANGES.  This game digs fingers so deep into your computer settings all to then fail to implement a basic start button.  This is worse than always online, this is /shoddy API-driven security/.  They did it to minecraft and they've done it to Halo...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It requires sign in to online account to play the single player, this isn't acceptable I don't care how good the game is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant log in, fuck this shit.\nMircrosoft used to be at the peak of user experience, now its stopping me from playing nostalgic games.\nim off to emulate them, fuck this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game straight up doesn't work half the time and it's been years. can't even play co-op with my friend.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Remember when you used to be able to just start a game and play it without needing to jump through hoops?\nI bought the game to play the game, not to have to sign contracts with any companies or require accounts across multiple companies, can we just get back to install game + start game + play game again please?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Get it from a friend, remembered playing the Xbox version and wanted to play it.\nSpent 2 hours just trying to fix getting past the damn title screen. Got nowhere. Refunding him his money back.\n\nFuck you Microsoft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is virtually unplayable with co op. First I had issues getting the game to sign in my xbox account, and now that I'm finally in, the game refuses to let us launch into any kind of campaign.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unable to sign in, why do I have to fucking sign in for a singleplayer campaign to begin with?\n\nEdit: I fixed this by downloading the Xbox app and starting the game through there. Unacceptable but what do you expect from multi-billion dollar company?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I would give it a updoot if this didnt require an internet connection to play. The entire game is already ON my computer. I do not need to log in to xbox live just to play campaign and I refuse to believe \"its required\". I had a few of the games on my og xbox and NEVER had this problem. This shouldnt be normalised. Abolish this kinda crap please and thanks.\nASIDE from all that, halo ce is a beloved childhood game for me and I havent played both 2 and 3. So! I will be experiencing those for the first time with this pack. Which is cool :)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The fact a halo game does not have local co op is probably the worst decision they could have made. What were they thinking.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "microsoft and there ai can't get make a log in ui work, grab an xbox one if you want to play this shit, or better yet just dust off the original xbox and play halo, no strings attached",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have to log in to xbox live in order to play singleplayer. After successfully logged into my xbox live account, I get an error telling me connection to xbox live failed, and now I'm stuck in a deadlock.\r\n\r\nThat you even need to be logged into xbox, when you already are logged into steam, in order to play a single player game, is insane",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst controls I have ever seen in a FPS and online is messed up. I can empty my charger in an oponent's face and they walk away while I die from a single bullet to the foot. Matchmaking is also nonexistent. New players are pitched against players who have been playing non-stop since 2001. As far as the campains go. only 2 and Reach are worth playing. If for the campains only, I'd recommend getting those 2 only in their original form instead of this mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yikes.... First thing im greeted to is annoying forced login, I literally had to change my old email password just to play\n(I was gifted this so I wasnt aware when I first got it, but regardless this sucks and shouldnt be a thing for games on steam to begin with)\n\nAnyway first thing I immediately noticed: The whole \"remastered\" versions is absolutely awful to look at, Ive never cared much for the Halo series, but even I could tell the original vision/look was completely ruined in the \"enhanced\" version, random generic sci-fi \"greeble\" everywhere for all textures, bright lighting that doesnt even fit original, and characters that now blend into background, a waste of disk space and should have been optional to download.\n\nNow for the game: Maybe its just first original game not quite having found its footing yet, classic stuff for old games... But the gameplay of fighting in exact looking corridors for the first 45 minutes was not very engaging or fun, I figured it was maybe just because it was a \"tutorial\", but I quickly learned later gameplay was no different, its just constantly fighting in some huge empty \"open world\", walking slowly/driving to another outpost/tower thing, and fighting enemies from dropships over and over until I realized I could just leave the area at any moment, and went on to next outpost which was exactly the same for 3-4 more times.\n\nMaybe I just didnt \"get it\", but this was just incredibly unfun, I tried playing the first 45 mintues of Reach too which was just more of the same, drive some vehicle in a huge empty valley with an empty building here and there, then fighting gunship enemies, and moving on to next spot, I cant imagine this changes much later game based on previous experience.\n\nIm sure \"it gets better\" later but I dont think I have it in me to play more, and I have zero interest in multiplayer either so im judging purely by singleplayer, which so far was not a very enjoyable experience at all.\n\nIf you like driving through massive open valleys, defending big towers from endless waves of dropships and shooting enemies in dark samey-looking sci fi corridors over and over, then this is for you, if not then I dont know...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, great story, a classic game, but the price please no, i bought the game for 227rs it now goes for freaking 800 on sale. clearly they want you to sub to xbox gamepass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game wont start now.\r\nIt requires a sign in to mucrosoft account, which i have.. But it keeps getting errors and wont sign in.\r\nSo i cant play singleplayer halo 1 campaign because for some reason it needs online account? This is stupid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Love Bungie's original product but 343/halo studios has sloppified the fuck out of the game with unecessary skins and add ons constant political messaging with pride month, black history month, disability pride month and many more all of which hilariously have their comments turned off on steam. The original bungie halo campaigns will forever be unmatched and the sad piano music from halo 3 always brings a tear to my eyes but it's just not the same people making these games anymore it's no longer a small team of highly skilled nerdy guys writing a story which was a pro USA retelling of the war in the middle east, now it's a massively bloated team of blue haired gender studies r-tards who think its more important to put transgender spartans in the game than actually make it fun for the players",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate that I cannot play the game without logging into a Microsoft account. It is a good collection of games, but if  Xbox Live is having issues, the game becomes unplayable because you cannot log in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do you want to log into your Microsoft account constantly? Do you want to spend an indefinite amount of time trying to load into the main menu? Do you want to play a game that has an amazing community but the developer was so bad at their job that they were replaced not an IC level but as a studio. Then you've come to the right place.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Microsoft got me for another one. I dont know what i was thinking buying this. \"You need to log in to your microsoft account\" for what... gooner skins? OnLiNE cOnTEnt OmaGERd yeah.. who tf cares about the online trash, this was and still is peak split screen and single player experience and you cant say otherwise. Microsoft sells slop stinkier than 3rd world dung parties. Been saving a hefty sum avoiding your other products. The layoffs couldnt happen any sooner and dont worry ill make sure the celebratory beer wont be as tasteless as your recent attempts at cash grabbing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game won't run on my preferred monitor no matter what I change in the settings. 11 years since MCC came out, nearly 6 years since it came out on Steam and it's constantly broken.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Microsoft, 343, whoever, ... FIX THIS GAME!  It was a bargain when it came out and was fun, but now, not so much as I can't LOGIN to the game in spite of all the good people in Discussion  trying  to come up with fixes.  It's broken.  Note: I will re-review should a consistent patch/fix be released by BIG Corp.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible performance, specifically on Halo: CE. Constant crashing, exiting game, stutters, etc. I'm 8 hours in and have been kicked out of the game a dozen times, even after turning graphics way down, V-sync off, and checking for driver updates, among other troubleshooting. I got this on sale, but would be very disappointed to have paid full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After installing 18 gigs of content from steam, I couldn't start the game because I had to create a BS Microsoft account, then trying to start playing the Halo 1 campaign, I'm not it's not even fucking installed!? What am I installing when I buy and download this piece of shit? It took me half an hour to figure out how to mollify the BS login requirement, and I'm still trying to actually play the game that I ostensibly bought more than an hour later. Go find a cracked version of this on the high seas. I'd pay double for a game that I could just play, especially if the money didn't go to Microsoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game (not counting the time i tried it on gamepass a while ago), queued in a halo 3 game with either a cheater or a god gamer on the enemy team that went 20-0 with a sniper and i had 1 kill, then next match told by the game i was banned from matchmaking. Okay then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trying to play a co-op campaign with friends is virtually impossible. you can send as many invites to players as you like, they'll never receive any of them",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was great, now Microsoft have made it so you can't get through the start menu without logging in. Log in interface seems to fail often and can now no longer play the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After creating an account and signing in, and after playing a total of 109 minutes I was locked out/banned from my account.\n\nThanks for killing games, no need to purchase this as you can clearly see they don't want you playing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horribly deisgned, ive never seen a game so poorly made. constant co op kicks, constant trouble shooting just to run the game, separate downloads for each campaign, no fixes online-- horrible and inexcusable incomptency from a multi billion dollar company. would've liked to play it but the game wasn't designed to be accessed easily.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really amazing games. Halo 3 is one of my favorite games of all time.\r\n\r\nWas on a trip and couldn't load the game to play the singleplayer campaign I had already installed without Wi-Fi. I'm apoplectic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is easily the biggest piece of shit I've ever played.\r\n*Try's to co-op with a friend*\r\nWon't let you join, won't let them join, requires xbox live to play together.\r\nAdd friend, finally get a lobby!\r\nMake it about 2 minutes into the first level and it crashes over and over and over.\r\nWhat the fuck is wrong with your online systems?\r\nThis is absolutely disgusting how poor this works, or doesn't work as it seems.\r\nAbsolutely unbelievable.\r\nMicrosoft does it again!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've just bought the game, but it's not working. I can't connect online or join my friends' party. What's going on? Can somebody help me?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice one Microsoft, yeah, really\r\nIt's true you need a Microsoft account even for single player\r\n> Try to log in, \"account locked\" \"add a phone number\" aka \"We didn't farm enough info from you\"\r\n> Can't choose another one, stuck with this one account\r\n> even after unlocking your account, it gives me an error signing in\r\nPLEASE LET ME PLAY THE THING I PAID FOR. IT'S THE LEAST YOU CAN DO AND YOU ARE FAILING \r\nBeyond unacceptable, year of our lord 2025, can't even play the game that was totally playable 20 years ago, just take the money and run I guess\r\nYou know it's bad when the reviews are not even about the game, just how it's being treated by the very people that sell it. \r\nIf you were blessed to buy the original games when they came out just play these, If you are younger and really wanted to try Halo like me I guess you're out of luck since Microsoft wants you to go through Dante's Inferno before.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Requires internet connection and Micro$oft account Xbox live sign in to play singleplayer; multiplayer on Linux requires copying DLLs from a Windows installation of the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont know what they did but for my pc the game has crazy glitches graphically. things popping in and out of existence, skybox changing from light to dark extremely fast, and unrelated but my controls keep getting reset.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh yeah easy negative, multiplayer freezes if you enable anything above 60fps, and if you freeze you have to close the game, close the game you get a temp ban. So heres a thumbs down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "better off original hardware, msoft gutted this beautiful game. If microsoft is down you're not playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign not cross-play with xbox they have butchered this franchise, the least they could do is make the old games work properly. Total waste of money. :) (only mulit-player is cross-play)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played this quite a bit when it first came out on Xbox One, but just recently got it on pc. Honestly this was the first halo game that really got me into the franchise (thats criminal i know) but it's really nice to get to experience all of the campaigns and multiplayer on pc. The game itself runs really well and luckily I have not run into any game breaking bugs! I will say it is annoying that you have to sign in with a Microsoft account in order to play. But overall a great collection of games, and very worth the price!\n\nEdit: nevermind, the game is unplayable as every time i get into a match it fully crashes my entire pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't access the content that I paid for because the game is perpetually stuck logging into xbox game services AFTER microsoft patched the game post fact to require a microsoft account be linked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Problems on microsofts side makes it impossible for me to play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trying to sign into this game has had me change my password on my email, create a new email and change the password on that and it still hasn't let me in. great job microsoft, your quest for data has taken all the fun out of the experence.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even get past the start menu because of some stupid microsoft sign in bug. Can't ignore, can't even sign in with an actual account. Unplayable at the moment. Fuck off, Microsoft.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}