{
  "positive": [
    {
      "review": "the best free game to play, of course you CAN buy better things still cant beat it and its not going anywhere",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Amazing game with a legendary storyline, connections to nearly every aspect of Star Trek without breaking immersion, and enough customisation to put most RPGs to shame",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've played for a lot more than 38 hours. This is a fresh account. STO is faithful to the source, with all sorts of systems and subsystems to dive into if you prefer. You can also just stick with the original crew and spaceship go brrrrr. You can easily spend hours in the game if you're not careful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This has been a long standing go-to game. Well thought out, Great storys, Non-toxic community.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Unlike a lot of Perfect World games this one is actually worth something. It's actually the best Star Trek game there is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best Star Trek MMO currently in existence.  But really, the space barbie is fantastic, the ground combat is awful, the stories are fun and full of Trek voice actors, easter eggs, and references.  If you like Star Trek, play this free game and just enjoy the ride.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is old, and the ground combat is pretty clunky, but you get most of the game's content for free, which is fantastic. The map is massive and the story arcs are well developed, despite the amount of loading screens. If you're a Trekkie like me, or are just looking for a deep space MMO that doesn't require cash, this game is the real deal.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "great game and  fun, great graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I stopped after the Solanae Dyson Sphere expansion on my ps4, then moved on to various different games. It was really good then, had its problems then as well as now, but it is an over all good game. Now with all of the consoles raising their yearly sub price, eff that noise, moved over to pc about 2 weeks ago, and surprise, surprise , (not surprised at all btw) it is still a very good game in true Arc/ Cryptic fashion. You don't need to spend any extra money in the store to have fun and be good at end game level tasks. That said, keep up the good work Arc/Cryptic! You are going to get my money for a lifetime sub on STO for keeping the updates coming! . Also cryptic has a lot of good games. check out Neverwinter if D&D is more you thing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good niche game for Star Trek fans or those who know the Star Trek universe. I don't know if there are better Star Trek games out there. It has some minor nuances, but I've been playing for years and I don't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is a must for any Trekker. loads of fun especially if you can get ort make a fleet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7000 hrs on console and more than a few hundred on pc . This game is engaging, fun and beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is a great game.  It fits together a lot of what you would ever want from the Star Trek universe in a very welcoming and durable MMO.  I haven't ever really played this game \"hard core\", and I hop back in every once in a while and I see the content and I always enjoy my time, whether playing solo or loosely connected with a guild/clan/group.  The combat, like the general gameplay and navigation, is complex enough to offer versatility while being simple enough to run a lot of missions \"on autopilot\" more or less.  I would say that even if you've never played a computer game before, this is a happy place to get into it, and even if you've got 10,000 hours in a half-dozen MMOs, there might still be something here to \"engage\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredibly fun game, the space ship mechanics are some of the best ive ever played with in any game, directional shields and positioned guns make manoeuvring important, assigning your bridge officers(BOFFS) to certain positions and utilising their skills in battle is incredibly fun and rewarding. Basically any T6 is viable for the whole game, constant events and giveaways makes this one of my favourite games atm. Ground battles are okay, but a compelling story makes it worthwhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best star trek game still running. it would be nice to see elite forces (both) and deep space nine the fallen on steam. armada was another good one too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A deep and faithful story heavy star trek game that truly shows the developers knew the source material and drastically expanded upon it over many many years.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If star trek changed your life you'll enjoy this. If not, this is not really gonna be your thing. If your into spending a stupid amount of effort for the best things in the game, your gonna spend money and time a lot of it. This game has the only micro transaction model I will praise, but you still have to either give time a lot of time or a lot of money. You do not have to spend money at all to get every item availible in the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I could go into detail about how this is a great game. Instead I'm going to keep it short and sweet. As of 11/05/2025 I have 7,318 hours invested in the game. That should tell you everything you need to know about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the most amazing game world to ever be simulated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the MMORPG GOATs + the Star Trek universe.  What more do you want?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun and immersive for anyone with a good imagination and a love of star trek",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The space combat tickles my pickle but the AWAY MISSIONS SUCK DOO DOO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best (although quite buggy) Star Trek game out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent feel of being in the ST:TNG universe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like sex but without the sex but very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have lifetime on xbox decided to try here loving it so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "captaining a ship in space or on the ground",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played this game for dozens of hours. i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Star Wars Old Republic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great F2P game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like Star trek take a look at this it will fill your need",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "FUN but use ARC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Canon. And, then some.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THE CHARACTER CUSTOMISATION AAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's star trek.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE THE GAME",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUN GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "star trek",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "32 Hours on Steam.  10 years on past platforms.  If you are a trekkie... this is a must and as fun as you make it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay can feel outdated. But if you truly love and appreciate Star Trek as a series this is a must play. It feels like the last piece of modern media that cares.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Star Trek Online is not my favorite game, but it is my favorite Star Trek game. It’s the only title that truly captures the breadth of the franchise: space combat, away missions, shuttle runs, and high-concept storylines that feel like an episode brought to life. The developers’ care shows in details big and small, whether it’s securing the original actors for their roles, subtle atmosphere in places like Deep Space 9, or expanding into stories drawn from Trek novels and comics. In those moments, it’s the most immersive Star Trek experience available.\r\n\r\nBut as a game, it struggles. Its monetization model is absurd at times, with some items priced beyond even AAA standards. The engine shows its age: this is a 15-year-old MMO, and it looks and feels like one. Performance can be frustrating, with rubber-banding mid-combat being a daily thing. Balance is shaky at best: power creep runs rampant, and there’s effectively no stable “meta” to speak of. Most sessions wear thin after an hour of repetitive gameplay.\r\n\r\nSo here’s the truth: Star Trek Online is not the best game you’ll play, but it is the best way to live inside Star Trek. For all its flaws, no other title lets you step so completely into that universe, craft your own captain and crew, and chart a course through stories that feel like they belong in the canon.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I only wish for more exploration and daily ship duties and less combat",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "It is a very fun game that is still receiving updates, patches, and new content. It is an immersive MMORPG.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I went through the trouble of recovering my account from 2017 to play again.  I have even spent money this time.\r\n\r\nIt is a great way to spend time exploring the Galaxy.  Have Starship, will travel.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I have played this game on and off since the original release 15 years ago. Now it shows its age with its graphics and bugs that pop up especially if you are using windows 11 though it is still a solid game. The paid content is definitly overpowered and it is hard to win PvP without it but the PvE is still doable if you play the game the way it was originally designed and dig into what loadouts are most synergistic rather than just the bigger number better approach so it loses a star for the paid bits but for a free to play game it is definitly top tier and one of the least bad in terms  of how it is monetiezed since you don not actually need to pay to get to max level and be competitive.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game but you have to have a lot of money to progress to get better ships a lot of zen needed or just fly around like i do in the best ship you can afford",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "its a great game with so much to it but its pretty overwhelming with what the game expects you to know - its hard to know whats good and bad or slightly better sometimes theres way too much going on with all the menus and stats etc. its way too janky on ground i find space is the most fun for me anyway. But it is Star Trek so yea good vibe to the game but could do with refining on the systems/ mechanics. Feels like a 2010 MMO with duct tape from 2022.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "the best free game to play, of course you CAN buy better things still cant beat it and its not going anywhere",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "great game just wish they did the maintenance in the background it 2025 i feel like im back in 2005 time to make a change and upgrade",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Is it old? Yep! Is it the only Star Trek game in town? Pretty much! You're going to get all the bad that comes with a game this old and you're going to get all the good stuff a Star Trek fan would want. \nIf you are not into Star Trek, I don't think there's any reason to really get into this game unfortunately. But the hardcore Trekkies among us keep coming back. If you are a Trek fan and haven't really played this game, there is quite a bit of content to go through with great stories and voice acting. It's not overly difficult but can get a bit complex at times.\nLLAP 🖖",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Good if you standard of games is 'Spock is there sometimes,' and 'I'm not aware of any other MMO that I could play instead.' The ship combat is some of the worse that I've ever experienced and it's MANDATORY. Ugh. If there was a paid option to skip/have it done automatically, I would have bought it years ago and would actually have fun playing this neh game. \r\n\r\nIf there were any other good Star Trek game offerings (from this century), I would be playing those instead. But it's here, and it's free, and will have to suffice. It's like when the trains are down for track maintenance so they give you a free bus to take instead. Sure I'll live, but if I wanted to take the bus, I would have in the first place.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It has its cheesy / bad writing / bad voice acting / \"Oh this is an MMO with a ST skin\" moments, but it's so fun to have voice actors and their associated live action characters show up on missions. Very enjoyable as a life long ST and gaming fan :) Worth a shot. Stick to Federation initially and play through the story missions. See what you think after 6-10 hours... you'll spend a lot more of your time playing if you enjoy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played for a lot more than 38 hours. This is a fresh account. STO is faithful to the source, with all sorts of systems and subsystems to dive into if you prefer. You can also just stick with the original crew and spaceship go brrrrr. You can easily spend hours in the game if you're not careful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This has been a long standing go-to game. Well thought out, Great storys, Non-toxic community.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game with a legendary storyline, connections to nearly every aspect of Star Trek without breaking immersion, and enough customisation to put most RPGs to shame",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Unlike a lot of Perfect World games this one is actually worth something. It's actually the best Star Trek game there is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best Star Trek MMO currently in existence.  But really, the space barbie is fantastic, the ground combat is awful, the stories are fun and full of Trek voice actors, easter eggs, and references.  If you like Star Trek, play this free game and just enjoy the ride.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is old, and the ground combat is pretty clunky, but you get most of the game's content for free, which is fantastic. The map is massive and the story arcs are well developed, despite the amount of loading screens. If you're a Trekkie like me, or are just looking for a deep space MMO that doesn't require cash, this game is the real deal.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "7000 hrs on console and more than a few hundred on pc . This game is engaging, fun and beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this is a great game.  It fits together a lot of what you would ever want from the Star Trek universe in a very welcoming and durable MMO.  I haven't ever really played this game \"hard core\", and I hop back in every once in a while and I see the content and I always enjoy my time, whether playing solo or loosely connected with a guild/clan/group.  The combat, like the general gameplay and navigation, is complex enough to offer versatility while being simple enough to run a lot of missions \"on autopilot\" more or less.  I would say that even if you've never played a computer game before, this is a happy place to get into it, and even if you've got 10,000 hours in a half-dozen MMOs, there might still be something here to \"engage\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredibly fun game, the space ship mechanics are some of the best ive ever played with in any game, directional shields and positioned guns make manoeuvring important, assigning your bridge officers(BOFFS) to certain positions and utilising their skills in battle is incredibly fun and rewarding. Basically any T6 is viable for the whole game, constant events and giveaways makes this one of my favourite games atm. Ground battles are okay, but a compelling story makes it worthwhile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best star trek game still running. it would be nice to see elite forces (both) and deep space nine the fallen on steam. armada was another good one too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been a few years since I last played Star Trek Online, but one of the highlights for me was always the bite-sized missions that the studio kept rolling out. I really appreciated the stories, they were engaging without being too time-consuming, and the progression felt pretty smooth. At one point, I even found myself buying some DLC because I appreciated how well they were creating content.\r\n\r\nNow, with the game being around 15 years old and still seeing new content as of September 2025, it’s pretty impressive. If you're a fan of the Star Trek universe and you like episodic adventures with a lot of history behind them, it's definitely worth a look.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun and love the story line still I am in tutorial 6 hours later but Its a good thing to learn the game well and how to story came to be 5 out of 5 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love STO/ played thousands of hours buildiing numerous fleets and bases. one of my go to games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Huge selection of ships, different factions, missions player-made or company made, always something to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waited to play this for a long time and it never gets old. Been a Star Trek far back as i can remember. Wasn't able to play it due to lacking a proper PC to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazing and classic game for Star Trek fans of any kind. The ability to create your own character and chose from a Skittles commercial level of starships to use on your adventure!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Star Trek Online is a wonderful game to play, for those who know the Franchise and wanna command their own ship that is. There are quite a few races to choose from, and their story lines are rich and wonderful to explore.\r\n\r\nLong live the Empire! Qa'Plah!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The captain creation is very open and you can design your own alien.  Game play can be more challenging at times, but for the most part play through is easy enough that you can enjoy the story telling.  I would really only recommend to other Star Trek fans though, but if you are a fan then the game is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for star trek fans and rististance is futile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immersive. Spans quite a lot of lore and multiple time-lines so far apparently. I played in the beginning, been a while since, and the game is so much more complicated now... It's been 10 in-game hours and I'm still working out keyboard/mouse controls. Regardless, GREAT GAME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an MMO, for better and worse. Development is taking place, and there are tons of players to adventure with. However, like all MMOs theres no living NPCs, everyone just hangs out in their location 24/7.\r\n\r\nGraphics are ok for 2005. No gameplay challenging the standard slogs of MMO's. Adventures are common drivel with a twist to make it seam like a Star Trek game, but really every adventure could be a <<insert random game from a completely different universe and make them Klingon, Ferengi, Federation, etc>>. Thus after only 7 hours I really struggle to continue to playing. It's a like a mobile game, cool idea, basic level of detail to make it look like someone is trying to make a good game, but at it's core there's no character development and no grand story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it can keep yp busy for hours. love the ships and weapons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I normally do not like MMO's. I played this game when it first came out many years ago and did not like it. But for some reason I downloaded it again recently and I have been playing it every day since. The storylines are compelling and the quests are challenging without being overwhelming. There is a solid character and crew development scheme. And as with all things star trek, the characters, stories, and mechanics are true to the star trek genre. Purity, of course, is key.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it feels nice and gentle, not overstimulating with thousands of information and things to do and look at all of a sudden. Decent graphics, loving the story mode feeling mixed with massive roleplaying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look, this point this game is fairly casual for an MMO. I pick it up again every few years and play through the new content (usually relearning the whole game because I forgot how it works in the extended time away) until I get bored and put it on the shelf for another few years.\n\nYes, its \"free.\" Yes, it can be grindy. Yes, There is so many different systems that trying to keep everything running can seem like you log in just to refresh duty missions ans such. BUT. And here is a good but: It's fun and totally gives players the ability to get into only as much as they care too.\n\nBe the casual, only log on for play with friend times. Be a solo and play it like a single player game. Grind away at events and get a ton of free premium crap (It is grindy to get stuff, but if you are enjoying playing the game a bunch, you tend to just earn stuff as a matter of course). Or, be super sweaty and min/max the heck out of your Epic Gear that you spend untold hours shooting Borg drones to get.\n\nThis game is 15 years old, and they are still adding new content. Where they used to have to chart their own narrative course due to a dearth of Star Trek; the newer content does a decent job of incorporating storylines from the new shows into the existing STO cannon.  \n\nWhy do I keep coming back, I have fun. When I don't on the shelf it goes, ready to reimerge in few years again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good, however, it very intimidating for new players or even returning players. If the developers \"cleaned\" out the UI or got rid of some legacy bloat it would be a massive improvement. Also changing the out some or even removing some of the currency, would be a big improvement. There is just too many currency types to collect and manage. \r\n\r\nUnderstanding this is a free to play game and not much may change, still really enjoy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its slow to start and takes a minuet to figure all the macanics out but once you do its a pretty fun game and is worth trying if your a star trek fan or even if your just into this kind of fantasy stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the reason i became a gamer, always loved star trek and was a big sci fi fan. I've loved this game since the day it came out and worked two jobs at one point in order to afford upgrades to my computer in order to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game doesn't get enough praise for the fact that it manages to have two entirely distinct games built into one game that is also an MMO, and is mostly stable.\n\nThat said the new mirror borg arc is awful. At least the previous arc was funny, this one's just stupid; with stupid mechanics focused around the lesser of the game's two modes: ground combat. Using melee to kill borg? Not anymore, now they explode. How about kinetic damage ranged weapons to avoid adaption? Not anymore, now they become Immune to all damage for the fun of it. Annoying, unnecessary, awful. A great movie villain where there macguffins to save the day; and lo and behold the questline involving them gives you a macguffin. Terrible. Literally quit mid-mission the first mission they were introduced because it was such a slog that I genuinely stopped caring about whatever rewards I was going to get or the story.\nIt just wasn't fun.\nMost of the other story arcs are fine if not good. A few are even genuinely enjoyable to replay just because; personally I've probably played \"What Lies Beneath\" over a dozen times because I enjoy it so much.\n\nTL;DR: underrated good game. recent stuff bad, play old stuff instead.\n\nWhile writing a review for a different game, I thought of what games I considered \"perfect\", and this is one of them.\nThe other two perfect games in my opinion are Europa Universalis V and Starbound.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic I keep playing no matter what. It has a lot of room for improvement, but I still play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a long-time Star Trek fan, I've seen my share of games that have tried to capture the magic of the franchise, but none have done it quite like Star Trek Online (STO). Despite being over a decade old, this game continues to be a vibrant and engaging experience that truly feels like you're stepping into the Star Trek universe.\n\nWhat sets STO apart is its incredible dedication to the source material. The game's story, which has expanded into an epic saga, feels like a genuine, high-stakes television series. You'll encounter beloved characters from every era of Trek, voiced by the original actors, and explore iconic locations from the Alpha, Beta, Delta, and even Gamma Quadrants. The attention to detail is remarkable, from the ship designs to the sound effects, everything feels authentic.\n\nThe gameplay loop is incredibly satisfying. Ground combat is a fun mix of tactical abilities and phaser blasts, and the space combat is, for me, the highlight of the game. It's not just a chaotic brawl; it's a strategic dance of positioning, managing power levels, and using your ship's unique abilities. Nothing beats the feeling of successfully executing a classic \"Trek-style\" maneuver to outsmart a Klingon Bird-of-Prey or a Borg cube.\n\nBut beyond the mechanics, what truly makes Star Trek Online special is its community. There's a genuine sense of camaraderie and cooperation, especially within Fleets. It's a game where players work together to complete missions, build up their starbases, and share their love for the franchise. The developers, Cryptic Studios, have done an amazing job of keeping the content fresh with regular updates, new episodes, and exciting events.\n\nWhether you're a veteran captain or a fresh-faced ensign, there's something for everyone in Star Trek Online. It's a game that respects its fans and the legacy of Star Trek, offering a deep, rewarding experience that you can get lost in for hundreds of hours. If you've ever dreamed of commanding your own starship, exploring strange new worlds, and boldly going where no one has gone before, then STO is the game for you. I can't recommend it enough. Live long and prosper!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Am not a trek fan, have never been a trek fan- this is like a time capsule into the mid aughts, a prefect vision of that era's mmo. If you are looking for vintage tab targeting, funny acting, and decent character design this is it baby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always loved the Star Trek universe. being able to play in it has been very fun and enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Liquidators. Ships cost $30 you need 7 ship masteries to complete a set on 1 that you \"wanted\" from a promo box $100+, by completing a yearly campaign, or spending $100 to players with 1000s of accounts. To complete a ship fully in a timely fashion can cost near $500 to $1000 with \"best you can get\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Star Trek game. A bit P2W but very playable without spending money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Learning from my MANY mistakes as I play the game.  But it is satisfying at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its relaxing game and you can battle and explorer space and mostly missions only if this game dont have lock on planets to beam down with out missions free roming around that be good and looting like division game combind that be awsome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all these years still the best game to ever capture the Star Trek experience of commanding  a ship and crew.  Great work on the constant updates and improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "def older graphics but still really fun! I levelled up to Lieutenant pretty fast. game play is a bit complicated at times but the game offers pop-up suggestions and tips during play to assist with the learning curve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a interesting game that i keep falling back on when there isn't a lot else on steam worth playing at that time but.. Its a shame that you could say its pay to win..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story rich game. If you are Star Trek fan then this is as close as it gets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This and The Old Republic are the last remnants of the IPs we love before it's utter desecration by modernity and agenda driven slop.",
      "voted_up": true,
      "votes_helpful": 4
    }
  ],
  "negative": [
    {
      "review": "I am willing to change my feedback if, and will say with a big IF, Deca or whoever took ownership of this game, will change the direction of STO to what is supposed to be: a Star Trek game, with exploration, contacts, and other intriguing missions rather than a Cash Grab game.\n\nI have 800 hours on this account, but I did play STO even before (out of Steam) when the top tier ship was the Fleet one, and I played it until the Odyssey was released for the first time as a free ship. No strange weapons combination, the meta was anti-proton damage and the ESD map was, basically, square. \n\nThe game changed a lot during the years in what it is now considered as a cash grabbing / FOMO game. Whales are keeping the game alive without even considering they are damaging the game rather than helping it to stay alive. I understand perfectly this is the only Star Trek game worth to be considered nowadays, which other ST game allows you to create your on Character, your own Crew, and fly your own ship (from the tons you have in there) and customising the equipment? It's great in that sense, and also the graphic and visuals are outstanding.\n\nBut, similar to other games, STO is ten miles wide and one inch deep. Klingon original story campaign, as well as the Romulan and Cardassian one, have been revamped and shrunk, to align to the needs of the story of the 24xx era. Clusters have been removed and replaced with Duty Officer missions. Reputations are a tedious farm to get something small in return because, yes, the best components/weapons/ships are from the Store or from the Lockboxes, which means cash grabbing. Don't get me wrong, you can still accomplish lot's of stuff in this game without even paying a penny, but the amount of ships they are throwing at you recently on the Store, is a pathetic way to monetise. \n\nBut funs will criticise you the moment you say something negative against this game. For them, STO is a church, something sacred that cannot be criticised. That's the current status of the game.\n\nI love Star Trek, I used to love a lot STO and I hope it will last forever, but if things won't change, this game will be only targeted towards whales that throw money at the 100th Miranda re-skin without a second thought.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Would recommend as a free game only. When you get the life time membership they will start to harass you.This game is under a new game studio and these guys are scam artists. Good game but don't trust your personal account info with these people.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "I misclicked a bundle item and bought it. There was no conformation menu to the purchace it just spent my ZEN without my complete consent. Tried to get the bundle remove from my account, result is as follows:\r\n\r\n------\r\n\r\nphicubed***********\r\n\r\nNov 21, 2025, 17:24 PST\r\n\r\nHello.\r\n\r\nI misclicked and bought this bundle. I had no intention of buying it. I have my mind set on other items in the shop.\r\n\r\nI havn't opened the ships or used anything that comes with the bundle and I don't intend to because I did not want it in the first place.\r\n\r\nI'd like my zen refunded to my account please.\r\n\r\nThanks.\r\n\r\nReply:\r\n\r\nHello,\r\n \r\nThank you for waiting.\r\n \r\nOur Senior Game Lead reviewed your request.\r\n \r\nI'm sorry, since the contents of the bundle has already been unlocked to the account, we can no longer refund back the Zen used. The Support Team doesn't have the ability to remove the contents or locked it again on the account.\r\n \r\nWe apologize for the inconvenience. If you have any other concerns, please let us know.\r\n\r\nMy Reply:\r\n\r\nwait. you're saying that the administrator cannot administer the game to remove items?\r\n\r\nSecondly, you have my money already. It's just a matter of administering the account.\r\n\r\nIf the company wants me to spend more real money in the game in the future I'd advise adminning the account as per my request asap.\r\n\r\n------\r\n\r\nThe admin or new owners or who ever is incharge really doesn't care anymore for the player base. I've been playing this game since nearly the launch of it in 2011. I have 5385 hours played just on Steam, not counting the launcher that wasn't connected to Steam before the switch so more like 6000 hours played. I've contacted support once and \"only once\" in the past for a misclick purchased item and the guy's were great and unaderstood that sometimes it happens. We're people, we make mistakes. We're human.\r\n\r\nThe new owners apperently don't care.\r\n\r\nFor the immidiate future I'm spending my money eltswhere until this company gets it's soul back. But I don't see soul in the company anymore so thats not happening any time soon IMHO.\r\n\r\ntldr: Don't waste real money on in game currency for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Star Trek Online is something you can enjoy, but you should also consider its value.\n\nAs a fan of the Star Trek universe, you're guaranteed to find something you like here.\n\nThe possibilities are there, but not accessible to everyone.\n\nThere are tons of starships from all over the galaxy, a large number of story missions with excellent voice acting, and a wide variety of customization options for your captain, bridge officers, and ship.\n\nOn top of that, there are PvE and PvP events, seasonal events, fleets with bases, different factions, and much more.\n\nSo basically, it's a complete package for all Trekkies.\n\nHowever, we also have to consider the Gorn in the room: \nFOMO, gacha, pay2win, bugs, and slow hotfixes (if they happen at all).\n\nI'm not someone you can just milk, but I've met many players who, without hesitation, shell out a hundred euros for a ship bundle just to get a single, specific console.\n\nAnd that's insane, because it's profiting off the backs of people who are ultimately being blackmailed.\n\nIt's about maximizing digital \"performance,\" hidden behind a massive paywall.\n\nIf it were just about cosmetics, it wouldn't be so problematic in my eyes, but these are items that significantly impact the gameplay experience.\n\nAnd if enough people have purchased the package, a small patch will often be released to mitigate the \"accidentally\" overpowered item... \nWhat a surprise!\n\nThe rabbit hole you can climb here is deep if you're looking for optimizing your experience.\n\nVery, very deep.\n\nI mean - watch some videos about top tier builds.\n\nAnd now, after 15 years of STO, I have to say that the still clunky interface, the truly awful character animations, the disproportionately expensive items in the shop, the terrible communication from the developers (last Steam post from April 25, 2017), the bugs that have persisted for years, the pay-to-win mechanics, and much more,\nshow how little respect they really have for the fan and player community.\n\n/peace",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is like a mobile game, it even has fake currency you can buy with real money to speed up your in game progress. The actual gameplay is very bad. The Dialogue is set, no choices. In fact you never get any choices. You walk around and press F, to activate the thing. Then either watch a video or shoot at some guys who are never a threat. You barely aim, as long as your pointed in the general direction of the bad guy you'll hit them. The ship combat you don't aim at all. You can fly around but there's no point. Just keep clicking the weapon buttons till you win. If you ever die that doesn't matter, just respawn exactly where you died, as many times as you want. The graphics are raw and unfinished. The is no problem solving or exploration at all. You travel across a space map to each mission, but you can't use the holodeck or go to 10 forward or anything during the trip. Just sit and wait 1-5 minutes. \n\nI'm not sure what this is. It does have 3D game elements in it. But you click a button to win. The dialogue doesn't actually matter but can at least give you a Star Trek feeling. But there's no tension, no skill, no new stories, no good writing, no good anything. this is an absolute ZERO effort game that really can't even be called a game. With that said I haven't completely uninstalled yet, but it's hard to take in more than 20 minute segments at a time. It's really really bad even to someone who's watched every episode 20 times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played this game on console since 2020 purchases DO NOT CARRY OVER to pc so yeah basically a cash grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the balancing is awful, if you are not a wale you will need to be ready to die constantly or have a wale hold your hand through the game after you reach lvl. 50",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just starting out the game so fare it pretty damn boring if it get better i'll update if not well you know how i feel of this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to love this game but since DECA took over its gotten worse, \n\nGreediest change so far is charging people extra vat on top of zen purchases without informing them",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Controls completely crashed during first mission. Much better on a console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Until they fix their security CRAP, and lock steam to the login.  Instead of how they do it now, which even with the old team was not able to login, even with going through their steps.  Have not been able to find down load to install on linux out side of steam, so this game is dead to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely not playable using controller only despite the page saying so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the first few hours you will love this game if you a star trek fan. Then the gatcha mechanics and systems start to take effect more and more as you progress. You will fine yourself being forced to either spend money or be resource bottlenecked into oblivion and can only crawl along at a snails pace every day. I have some hours and I've spent some money and I wish I had not.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "What used to be. \n\nStar Trek went woke after enterprise. And as this game tries to parallel paramount, many of the new story content went woke as well. \n\nIt's disgusting. \n\nAlso it appears that new series academy will be woke as well, meaning more garbage woke content is headed for this game.  I probabally spent thousands in this game when i played it on PS4, well those transactions do not cross platform, so basically screw the players. \n\nIt's. Probabally better not to waste your money. The early game stories are cool, after delta quadrant content, it becomes puke tier expired taco bell. \n\nThey don't make content for the fans. They make content for people who don't watch or play anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "jhyhjfh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game used to be good a few years ago but its become too pay 2 win... Your starter ship is thrown against enemies with so much health and so many powerful abilities that unless you buy one of their overpriced ships for real money, youll spend al your missions respawning to throw yourself against an undestructible enemy...\n\n(ps: i bought a T6 dreadnough with real cash, just out of curiosity... The game instantly became playable.... this is not a ragequit... im quitting because i had to spend money in order to make the game playable... this is unacceptable.)",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "I am willing to change my feedback if, and will say with a big IF, Deca or whoever took ownership of this game, will change the direction of STO to what is supposed to be: a Star Trek game, with exploration, contacts, and other intriguing missions rather than a Cash Grab game.\n\nI have 800 hours on this account, but I did play STO even before (out of Steam) when the top tier ship was the Fleet one, and I played it until the Odyssey was released for the first time as a free ship. No strange weapons combination, the meta was anti-proton damage and the ESD map was, basically, square. \n\nThe game changed a lot during the years in what it is now considered as a cash grabbing / FOMO game. Whales are keeping the game alive without even considering they are damaging the game rather than helping it to stay alive. I understand perfectly this is the only Star Trek game worth to be considered nowadays, which other ST game allows you to create your on Character, your own Crew, and fly your own ship (from the tons you have in there) and customising the equipment? It's great in that sense, and also the graphic and visuals are outstanding.\n\nBut, similar to other games, STO is ten miles wide and one inch deep. Klingon original story campaign, as well as the Romulan and Cardassian one, have been revamped and shrunk, to align to the needs of the story of the 24xx era. Clusters have been removed and replaced with Duty Officer missions. Reputations are a tedious farm to get something small in return because, yes, the best components/weapons/ships are from the Store or from the Lockboxes, which means cash grabbing. Don't get me wrong, you can still accomplish lot's of stuff in this game without even paying a penny, but the amount of ships they are throwing at you recently on the Store, is a pathetic way to monetise. \n\nBut funs will criticise you the moment you say something negative against this game. For them, STO is a church, something sacred that cannot be criticised. That's the current status of the game.\n\nI love Star Trek, I used to love a lot STO and I hope it will last forever, but if things won't change, this game will be only targeted towards whales that throw money at the 100th Miranda re-skin without a second thought.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "I pre-ordered the Collector's Edition. While I'm not the biggest Star Trek fan, I agree with others that STO may be the best Trek game out there - unfortunately, that says more about the state of Trek gaming than anything. I haven't played much since 2012, but I pop my head in every few years because the space combat is addicting. \n\nI would prefer not to downvote this game, but unfortunately, it has some significant issues that cannot be overlooked:\n\n[list]\n    [*]It is a 15-year old MMORPG. Like all older MMOs, the newer content looks good with better animations and higher resolution textures. But, when bumped up against older content and models, they stand out. This is universal with all MMOs. \n    [*]Ground combat sucks. It sucked in 2010 and especially in 2025. Cryptic attempted to \"modernize\" it over the years, but it's not great. Space combat is amazing - even non-Trek fans should enjoy it. \n    [*]STO's monetization strategy makes mobile games blush. End game ships run $25-30 each. Bundles of ships with additional perks are $100+. Many players justify these costs - if you're devoting dozens or hundreds of hours a year, it may balance out. To the more casual fan, it does not. [b]Remember:[/b] There is no subscription for STO. It's F2P or Zen store. \n[/list]\n\n[h3] My Recommendation [/h3]\nTry it out. Level up some characters. There are some free T6 (end game) ships available through events - although they're a slugfest to get and likely not the \"cool ones,\" that you may want. Since it is F2P, it doesn't hurt to try.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "99% Dps, near zero skill based combat. Some ships have amazing detail, others look like something out of the N64 generation (really annoying when the ship with the right gameplay-features has textures that would make last century look like the future). Furthermore, the level scaling is outright unfair. Never in my life have I \nplayed a game where I've dreaded leveling up more than in this game. At a certain point you are forced into using the crafting system as the current enemies are to powerful for any gear you can buy with your basic currency. Now that wouldn't be a problem if it wasn't for the fact that BY THE TIME YOU HAVE GOT THE ITEMS REQUIRED TO CRAFT YOU KIT, IT'S ALREADY OUTDATED!",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "In the beginning this game was extremely fun and entertaining, but it became confusing, complicated and tedious, its behind a pay wall (Micro transactions), while I understand that an FTP game must make money some how, they are ridiculously expensive.  Trying to find out which phaser array goes with which build, and which crew goes best with what ship has become daunting and complicated.  Also if you enjoy doing the same boring missions over and over and over again, than this is your game.  Otherwise move on to another of the plethora of MMOs out there, that are far more entertaining, like Star Wars The Old Republic (SWTOR for short), its far less complicated, and far more fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Would recommend as a free game only. When you get the life time membership they will start to harass you.This game is under a new game studio and these guys are scam artists. Good game but don't trust your personal account info with these people.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Initially, a fun game. Wasted three hours on Dewa III looking for samples. Found 90%, then much wandering. A good game for the patient.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Star Trek Online is something you can enjoy, but you should also consider its value.\n\nAs a fan of the Star Trek universe, you're guaranteed to find something you like here.\n\nThe possibilities are there, but not accessible to everyone.\n\nThere are tons of starships from all over the galaxy, a large number of story missions with excellent voice acting, and a wide variety of customization options for your captain, bridge officers, and ship.\n\nOn top of that, there are PvE and PvP events, seasonal events, fleets with bases, different factions, and much more.\n\nSo basically, it's a complete package for all Trekkies.\n\nHowever, we also have to consider the Gorn in the room: \nFOMO, gacha, pay2win, bugs, and slow hotfixes (if they happen at all).\n\nI'm not someone you can just milk, but I've met many players who, without hesitation, shell out a hundred euros for a ship bundle just to get a single, specific console.\n\nAnd that's insane, because it's profiting off the backs of people who are ultimately being blackmailed.\n\nIt's about maximizing digital \"performance,\" hidden behind a massive paywall.\n\nIf it were just about cosmetics, it wouldn't be so problematic in my eyes, but these are items that significantly impact the gameplay experience.\n\nAnd if enough people have purchased the package, a small patch will often be released to mitigate the \"accidentally\" overpowered item... \nWhat a surprise!\n\nThe rabbit hole you can climb here is deep if you're looking for optimizing your experience.\n\nVery, very deep.\n\nI mean - watch some videos about top tier builds.\n\nAnd now, after 15 years of STO, I have to say that the still clunky interface, the truly awful character animations, the disproportionately expensive items in the shop, the terrible communication from the developers (last Steam post from April 25, 2017), the bugs that have persisted for years, the pay-to-win mechanics, and much more,\nshow how little respect they really have for the fan and player community.\n\n/peace",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Played this game on console since 2020 purchases DO NOT CARRY OVER to pc so yeah basically a cash grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The servers are just not stable enough, the game was great and some of the plots are amazing but none of that matters if the servers keep disconnecting you every 5 mins and your unable to enjoy the game.\r\nSuch a a shame for  what was once an amazing game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was fun pre chinese studio. Now it's just ass on top of the ass that treks been since JJ touched it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(I've actually played this game for many hundreds of hours on a different account. It's been fun despite a steep learning curve...)\n\nStar Trek Online is a basic fighting game well-dressed in Star Trek clothing, both Federation and Klingon factions must fight a lot, repeatedly. There are two ways to fight: personal combat (Ground) and spaceship combat (Space). Players can play against the computer’s programming (PvE) or against other players (PvP). Besides fighting, there are many social zones where players do not fight but may interact with other players in and out of context (RPG). The purpose of the game for players should be to have fun with the game and with each other, and this usually happens because of the friendly community! \n\nSome Star Trek fans and fans of space in general have their fun rooted in realism. However, this game is not an accurate simulation of either space or combat. It is more like an entertaining theme park with games and rides. Understanding this may adjust your expectations and result in having more fun while playing the game.\n\nSome players have fun playing a game for free (F2P). This game is definitely F2P. Not only that, but there are regular giveaways, recurring events, and special occasions that provide opportunities for players to make the most of resources accrued. This will cost a player their time daily for years, but not their money, and keep them coming back to reset timers. However, players who wish to save time and avoid repeating or “grinding,” may pay for their character’s advancement in various ways, including game-like mechanics resembling gambling mechanisms. The depth and cost of in-game purchases is vast, and a player may eventually find themselves repeating or “grinding” with their money just as much as a F2P player would with their time! It is recommended to have fun within your means rather than “grind” too much. Nevertheless, the game is very good at tempting players who enjoy it to make at least occasional purchases. In fact, some F2P players actually have a separate account that is definitely not F2P! So there can be some fun in progressing a F2P account, to see how well you can do for free. With some out-of-game research, anyone can make a reasonably fun character that can do fairly well in both PvE and PvP matches.\n\n\nReality versus Fantasy\n\nMany things about Star Trek Online are different than Star Trek as represented in other media and real life. Some of this is deliberate to make the game easier to play; some of this is unavoidable because of the game engine itself.\n\nFor example, we rarely see personal shield generators when Star Trek characters engage in Ground combat, except for the Borg. However, in Star Trek Online, personal shield generators are standard equipment for players and their bridge crew. This is necessary to allow for fighting, since this is a fighting game; there would be no fight if everyone was actually afraid to die from a weapon’s first fatal blow! Star Trek Online also allows players to respawn in the event of incapacitation or destruction, costing the player’s team valuable time.\n\nDistances and zone-of-controls are standardized and considerably reduced in both Ground and Space combat. For example virtually all weapons have the same effective range, and zone-of-controls ignore potential sensor ranges and even line-of-sight until trespassed! This, of course, detracts from realism but contributes to ease of play.\n\nSpace combat is more like aerial hover-drone combat and not at all like space combat should be, but this is a limitation of the game engine, which was never designed to simulate three-dimensional movement in open space. For example, spaceships cannot change their horizon with partial rolls and are limited by finite pitch within an invisible room with a hidden floor and ceiling. There is no free inertia countered by acceleration and deceleration or vectored thrust, and no orbiting stellar bodies. These along with the above mentioned standardized and reduced distances break any thrill of simulation. However, these limitations actually make the game easier and quicker to play for most who want to “grind” and represent fairly what viewers have seen in televised representations of Star Trek.\n\n\nTactics and Strategy\n\nThe tactics of almost all content of this game revolves around defeating enemies in fights rather than avoiding them. To that end, there are a seemingly limitless number of different pieces of equipment offering various protections and offensive capabilities.\n\nHowever, with regard to tactics none of all that really makes any difference. For example, it doesn’t really matter if you shoot with a phaser weapon or with a disruptor weapon, or any other type of weapon. A lot of things that you would think should make a big difference, such as terrain, weather, range, line-of-sight, mass, physics, are not really major considerations. That is because the technology of Star Trek Online has rendered these real-world considerations more-or-less moot.\n\nTactics, therefore, boils down to the ability to damage targets versus the target’s ability to absorb and heal damage. For PvE, the focus is usually on building a loadout that contributes what is needed for a team of players and maximizes damage per second, or DPS. This tactic attempts to destroy enemies before they can even pose a significant threat. With PvP, however, the focus is usually on survivability first and contributing to a team effort to reduce a competitor’s ability to heal and sustain damage and eventually destroy the competitor.\n\nThe real-world tactics in both Ground and Space, is in the gradual acquisition of better equipment and unlocking better abilities, and in the player’s—not the character’s—gradually learning what works and does not and how to do things such as run and fly. The better equipment is mostly the kit frame and modules for the Ground setting, and the bridge officer stations of a spaceship for the Space setting. As a consequence, the entire game actually revolves around constantly acquiring various in-game currencies to purchase better kit frames and kits and better spaceships with the best officer stations; and to upgrade them and all your other equipment that supports them. There is, however, a very steep learning curve and one could easily spend as many hours reading and watching fan-created content designed to inform players as one could spend actually playing the game. Not to mention that new content, including equipment, is continually created and added to the game!\n\nAs far as overall strategy on a grand scale, there is none that a player can affect for good or bad. The galaxy is static, set in stone. In the long run it does not matter to the galaxy if a player chooses to side with the Federation or Klingon faction. Despite eventually becoming an admiral, a player will make no decisions that affect grand strategy, though they will be labored with numerous repetitive administrative duties for rewards to help further levelling up and acquisition of in-game currencies. However, a player will play through story episodes and missions that role-play through great predestined galaxy-shaking events, along with many favorite Star Trek characters! To that end, there is a lot of story content that could be enjoyed for many, many hours, much of which is actually a pleasure to repeat once in a while.\n\nIn conclusion, if you want to forget reality for hours on end and enjoy a Star Trek fantasy theme park, if you want to research fan-created instructions, guides, and recommendations out of necessity, if you actually read this entire review to your benefit, then this game is recommended for you!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be good. Quests were like Star Trek episodes, some were good, some were badly written. Over all it was fun.\n\nThen they over saturated it with dumb kurtzmantrek shit and lots of dumb ships that make no sense within the narrative and world building existing.\n\nThey gave idiots too much creative freedom which ruins the star trek setting and takes you out of it when someone in a swim suit or bright pink outfit runs by.\n\nDon't get me started on the ships idiots make and name.\n\nThis game is ruined by stupidity.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "for the gutter in my case - first installed STO Stardate 0.2014 - never got one min of gamplay - not back then nor now Stardate 0.2025 - figure reinstalling it - looks like my uhura007 tag isnt well seen @ StarTrek(!) - not one min of gameplay! NOT ONE! - highly illogical!\n\nhave better to do then spend another >ten years for a running game:\n\nWish you a healthy and prosperous life\n\na vulcan",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sigh, where to begin, it's the most horrendously pay to win, microtransaction for literally everything the soul can desire, janky as hell especially in ground combat type of mmo with a superficial star trek skin designed to get you to pay for iconic and cool ships....... But it's star trek so i love it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would not recommend this game to anyone who is not a Star Trek fan. Outside the stories (which are pretty good) and seeing/interacting with characters from the series, this game doesn't have much going for it.\n\nPros: Interesting stories that keep you engaged, returning characters from the series who you often interact with, lots of customization (ships, ship designs, ship weapons, character weapons, characters, bridge crew, etc.)\n\nCons: Unacceptable bugs (audio overlapping, missions that need to be dropped and then picked back up because the story wont load necessary events, leaving a system and getting trapped within the 3D models of the stars [gotta leave and come back unless you transwarp], UI has incorrect overlapping screens [getting a coms call will still display the ship's shields and hull health over the coms call text for some reason]), confusing UI that tells you you can have more bridge crew (but you can't but you can [yeah, I'm just as confused as you]), waves of sponge enemies (seriously, this needs to stop. Nobody wants to play a clicking simulator. That's NOT fun), not enough save points (this is an online game, there NEEDS to be more save points to prevent massive wastes of time), overly complex and cluttered UI, overly complex literally everything else (I'm STILL getting tutorials after I'm over 20 hours in and I'm lost on what most of this is supposed to do because it's so overwhelming), monetized to heck and back, some tutorials come AFTER you've already dealt with the thing it's trying to teach you.\n\nOverall, I think this game is okay, it's just marred by a lot of issues that just shouldn't be. If you're a Star Trek fan, you can probably push past all the jank and actually enjoy it.\n\nEdit: Just tried out the events for the first time. Yikes. That wont be a mistake I make ever again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay to Win. Missions are going to kill you over and over until you spend 100 or more, at least.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My love for Star Trek is being extorted by this product. Demands to much time for progression.\r\n\r\nDo try it out for free but you'll see what I'm talking about fast.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the balancing is awful, if you are not a wale you will need to be ready to die constantly or have a wale hold your hand through the game after you reach lvl. 50",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just starting out the game so fare it pretty damn boring if it get better i'll update if not well you know how i feel of this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Where to begin with this game.....Well, for starters, it doesn't seem to know what KIND of game it is. It's a Space Sim, no wait, it's a Space Tactics game, no wait, it's a 3PS with literally the worst controls and gameplay I've ever experienced, (and I lived through the MS-DOS era of gaming), no, now it wants to be an MMO! I get that Star Trek encompasses all of these genres, but this game seems to think that being terrible at most of them is better than being good at one of them.\n\nNext, we get into the real hot-topic of this game being P2W. Without exception, it's 100% pay to win. The wait times for prizes are excessive, and you HAVE to buy keys to unlock these \"prize boxes\". So yes, it's pay to win or put more accurately: if you don't pay, you're going to respawn insanely often.\n\nLet's also consider that the game has been in development for 15 years now. 15 years! And they still haven't figured out how to make ground combat manageable without having to click on (up to) 100 individual tiles. The graphics still meet the bare minimum definition of the word \"graphics\" as we knew it in 2015, and in 2025, there's just no excuse for loading issues and horrendous hit boxes anymore. I can't even get into the stupendously clunky control schemes without going into a full on rant about keyboard efficiency and effective gameplay.\n\nOverall, I give this game a 3/10. It tried hard to give us the entire Star Trek experience, but only resulted in a \npretty awful all around experience wrapped in a Pay 2 Win package that used fans' love of Star Trek to make absurd amounts of money. I feel bad for the OG Trek actors who provided their voices to this game, for being associated with a total scam. I also feel bad for Terry Matalas for giving this game a shout out (via the Enterprise F's cameo) in Picard Season 3. That was a huge shout out, Cryptic, the Enterprise F has been etched into Star Trek Canon now, and it comes back to this complete scam of a game. The fact that we have to live with the STO Enterprise F forever in Star Trek lore now is probably the thing that disgusts me the most about this game. The best season of Picard, the TNG comeback we've wanted for 20+ years, and it's sullied by Star Trek Online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I prefer open world experiences to market bazaars and force-following quest markers.  It's not role playing if the role is played for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to love this game but since DECA took over its gotten worse, \n\nGreediest change so far is charging people extra vat on top of zen purchases without informing them",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just too old and janky.  It's free to play, but I would not recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls completely crashed during first mission. Much better on a console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Until they fix their security CRAP, and lock steam to the login.  Instead of how they do it now, which even with the old team was not able to login, even with going through their steps.  Have not been able to find down load to install on linux out side of steam, so this game is dead to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to review a game that i cannot play, game installs and the tries patching, 1% for 20 mins then stops responding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't discern any purpose to this game except to fly slightly better ships to destroy other ships. Looks like Star Trek, sometimes sounds like Star Trek, but it lacks the purpose, ideas and entertainment value of Star Trek.  The Lifetime Sub I got for this game years and years ago is the anchor that ties me to this sinking ship.  I got the lifetime sub because I missed the opportunity of getting one for a genuine game -- Lord of the Rings Online.  No idea if the game has any potential, it certainly looks fixed in a sad rut.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant run the game, cant install the game, months back i was able to get it installed and working now i cant no matter what i do. so f!!k this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant there be a non moblie looking star trek game for once, one that is very in depth and not just story lined? idk if its js me but i wish there was some good star trek games for today not these moble ones if i could would leave mixed bc its still good for other people but for me i have to leave a negitave here.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Launcher Boot-looping in a patch update, cant tell if its good or not cause i cant even START",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thing's seem to be happening \"more\" which is good. That now need's to keep up, and I will change this recommendation and this writing. Consistent Upgrade Weekends, better availability to complete Monthly Events. More T6 ship reward (no zen requirement)\n\n[I can list countless games you can get everything for free on. There's 0 justification for the difference between those Game Models and this Game except greed.] \n\nChange that and allow some T6 ship rewards. And again I will change this recommendation and this writing to Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complete lies about controller support, reporting to steam for blatant false advertising. \nNot worth the price, and yes I know its free.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For the first few hours you will love this game if you a star trek fan. Then the gatcha mechanics and systems start to take effect more and more as you progress. You will fine yourself being forced to either spend money or be resource bottlenecked into oblivion and can only crawl along at a snails pace every day. I have some hours and I've spent some money and I wish I had not.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "What used to be. \n\nStar Trek went woke after enterprise. And as this game tries to parallel paramount, many of the new story content went woke as well. \n\nIt's disgusting. \n\nAlso it appears that new series academy will be woke as well, meaning more garbage woke content is headed for this game.  I probabally spent thousands in this game when i played it on PS4, well those transactions do not cross platform, so basically screw the players. \n\nIt's. Probabally better not to waste your money. The early game stories are cool, after delta quadrant content, it becomes puke tier expired taco bell. \n\nThey don't make content for the fans. They make content for people who don't watch or play anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "jhyhjfh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am willing to change my feedback if, and will say with a big IF, Deca or whoever took ownership of this game, will change the direction of STO to what is supposed to be: a Star Trek game, with exploration, contacts, and other intriguing missions rather than a Cash Grab game.\n\nI have 800 hours on this account, but I did play STO even before (out of Steam) when the top tier ship was the Fleet one, and I played it until the Odyssey was released for the first time as a free ship. No strange weapons combination, the meta was anti-proton damage and the ESD map was, basically, square. \n\nThe game changed a lot during the years in what it is now considered as a cash grabbing / FOMO game. Whales are keeping the game alive without even considering they are damaging the game rather than helping it to stay alive. I understand perfectly this is the only Star Trek game worth to be considered nowadays, which other ST game allows you to create your on Character, your own Crew, and fly your own ship (from the tons you have in there) and customising the equipment? It's great in that sense, and also the graphic and visuals are outstanding.\n\nBut, similar to other games, STO is ten miles wide and one inch deep. Klingon original story campaign, as well as the Romulan and Cardassian one, have been revamped and shrunk, to align to the needs of the story of the 24xx era. Clusters have been removed and replaced with Duty Officer missions. Reputations are a tedious farm to get something small in return because, yes, the best components/weapons/ships are from the Store or from the Lockboxes, which means cash grabbing. Don't get me wrong, you can still accomplish lot's of stuff in this game without even paying a penny, but the amount of ships they are throwing at you recently on the Store, is a pathetic way to monetise. \n\nBut funs will criticise you the moment you say something negative against this game. For them, STO is a church, something sacred that cannot be criticised. That's the current status of the game.\n\nI love Star Trek, I used to love a lot STO and I hope it will last forever, but if things won't change, this game will be only targeted towards whales that throw money at the 100th Miranda re-skin without a second thought.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Game used to be good a few years ago but its become too pay 2 win... Your starter ship is thrown against enemies with so much health and so many powerful abilities that unless you buy one of their overpriced ships for real money, youll spend al your missions respawning to throw yourself against an undestructible enemy...\n\n(ps: i bought a T6 dreadnough with real cash, just out of curiosity... The game instantly became playable.... this is not a ragequit... im quitting because i had to spend money in order to make the game playable... this is unacceptable.)",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "Would recommend as a free game only. When you get the life time membership they will start to harass you.This game is under a new game studio and these guys are scam artists. Good game but don't trust your personal account info with these people.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I pre-ordered the Collector's Edition. While I'm not the biggest Star Trek fan, I agree with others that STO may be the best Trek game out there - unfortunately, that says more about the state of Trek gaming than anything. I haven't played much since 2012, but I pop my head in every few years because the space combat is addicting. \n\nI would prefer not to downvote this game, but unfortunately, it has some significant issues that cannot be overlooked:\n\n[list]\n    [*]It is a 15-year old MMORPG. Like all older MMOs, the newer content looks good with better animations and higher resolution textures. But, when bumped up against older content and models, they stand out. This is universal with all MMOs. \n    [*]Ground combat sucks. It sucked in 2010 and especially in 2025. Cryptic attempted to \"modernize\" it over the years, but it's not great. Space combat is amazing - even non-Trek fans should enjoy it. \n    [*]STO's monetization strategy makes mobile games blush. End game ships run $25-30 each. Bundles of ships with additional perks are $100+. Many players justify these costs - if you're devoting dozens or hundreds of hours a year, it may balance out. To the more casual fan, it does not. [b]Remember:[/b] There is no subscription for STO. It's F2P or Zen store. \n[/list]\n\n[h3] My Recommendation [/h3]\nTry it out. Level up some characters. There are some free T6 (end game) ships available through events - although they're a slugfest to get and likely not the \"cool ones,\" that you may want. Since it is F2P, it doesn't hurt to try.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "99% Dps, near zero skill based combat. Some ships have amazing detail, others look like something out of the N64 generation (really annoying when the ship with the right gameplay-features has textures that would make last century look like the future). Furthermore, the level scaling is outright unfair. Never in my life have I \nplayed a game where I've dreaded leveling up more than in this game. At a certain point you are forced into using the crafting system as the current enemies are to powerful for any gear you can buy with your basic currency. Now that wouldn't be a problem if it wasn't for the fact that BY THE TIME YOU HAVE GOT THE ITEMS REQUIRED TO CRAFT YOU KIT, IT'S ALREADY OUTDATED!",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "In the beginning this game was extremely fun and entertaining, but it became confusing, complicated and tedious, its behind a pay wall (Micro transactions), while I understand that an FTP game must make money some how, they are ridiculously expensive.  Trying to find out which phaser array goes with which build, and which crew goes best with what ship has become daunting and complicated.  Also if you enjoy doing the same boring missions over and over and over again, than this is your game.  Otherwise move on to another of the plethora of MMOs out there, that are far more entertaining, like Star Wars The Old Republic (SWTOR for short), its far less complicated, and far more fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I misclicked a bundle item and bought it. There was no conformation menu to the purchace it just spent my ZEN without my complete consent. Tried to get the bundle remove from my account, result is as follows:\r\n\r\n------\r\n\r\nphicubed***********\r\n\r\nNov 21, 2025, 17:24 PST\r\n\r\nHello.\r\n\r\nI misclicked and bought this bundle. I had no intention of buying it. I have my mind set on other items in the shop.\r\n\r\nI havn't opened the ships or used anything that comes with the bundle and I don't intend to because I did not want it in the first place.\r\n\r\nI'd like my zen refunded to my account please.\r\n\r\nThanks.\r\n\r\nReply:\r\n\r\nHello,\r\n \r\nThank you for waiting.\r\n \r\nOur Senior Game Lead reviewed your request.\r\n \r\nI'm sorry, since the contents of the bundle has already been unlocked to the account, we can no longer refund back the Zen used. The Support Team doesn't have the ability to remove the contents or locked it again on the account.\r\n \r\nWe apologize for the inconvenience. If you have any other concerns, please let us know.\r\n\r\nMy Reply:\r\n\r\nwait. you're saying that the administrator cannot administer the game to remove items?\r\n\r\nSecondly, you have my money already. It's just a matter of administering the account.\r\n\r\nIf the company wants me to spend more real money in the game in the future I'd advise adminning the account as per my request asap.\r\n\r\n------\r\n\r\nThe admin or new owners or who ever is incharge really doesn't care anymore for the player base. I've been playing this game since nearly the launch of it in 2011. I have 5385 hours played just on Steam, not counting the launcher that wasn't connected to Steam before the switch so more like 6000 hours played. I've contacted support once and \"only once\" in the past for a misclick purchased item and the guy's were great and unaderstood that sometimes it happens. We're people, we make mistakes. We're human.\r\n\r\nThe new owners apperently don't care.\r\n\r\nFor the immidiate future I'm spending my money eltswhere until this company gets it's soul back. But I don't see soul in the company anymore so thats not happening any time soon IMHO.\r\n\r\ntldr: Don't waste real money on in game currency for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Star Trek Online is something you can enjoy, but you should also consider its value.\n\nAs a fan of the Star Trek universe, you're guaranteed to find something you like here.\n\nThe possibilities are there, but not accessible to everyone.\n\nThere are tons of starships from all over the galaxy, a large number of story missions with excellent voice acting, and a wide variety of customization options for your captain, bridge officers, and ship.\n\nOn top of that, there are PvE and PvP events, seasonal events, fleets with bases, different factions, and much more.\n\nSo basically, it's a complete package for all Trekkies.\n\nHowever, we also have to consider the Gorn in the room: \nFOMO, gacha, pay2win, bugs, and slow hotfixes (if they happen at all).\n\nI'm not someone you can just milk, but I've met many players who, without hesitation, shell out a hundred euros for a ship bundle just to get a single, specific console.\n\nAnd that's insane, because it's profiting off the backs of people who are ultimately being blackmailed.\n\nIt's about maximizing digital \"performance,\" hidden behind a massive paywall.\n\nIf it were just about cosmetics, it wouldn't be so problematic in my eyes, but these are items that significantly impact the gameplay experience.\n\nAnd if enough people have purchased the package, a small patch will often be released to mitigate the \"accidentally\" overpowered item... \nWhat a surprise!\n\nThe rabbit hole you can climb here is deep if you're looking for optimizing your experience.\n\nVery, very deep.\n\nI mean - watch some videos about top tier builds.\n\nAnd now, after 15 years of STO, I have to say that the still clunky interface, the truly awful character animations, the disproportionately expensive items in the shop, the terrible communication from the developers (last Steam post from April 25, 2017), the bugs that have persisted for years, the pay-to-win mechanics, and much more,\nshow how little respect they really have for the fan and player community.\n\n/peace",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Initially, a fun game. Wasted three hours on Dewa III looking for samples. Found 90%, then much wandering. A good game for the patient.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is like a mobile game, it even has fake currency you can buy with real money to speed up your in game progress. The actual gameplay is very bad. The Dialogue is set, no choices. In fact you never get any choices. You walk around and press F, to activate the thing. Then either watch a video or shoot at some guys who are never a threat. You barely aim, as long as your pointed in the general direction of the bad guy you'll hit them. The ship combat you don't aim at all. You can fly around but there's no point. Just keep clicking the weapon buttons till you win. If you ever die that doesn't matter, just respawn exactly where you died, as many times as you want. The graphics are raw and unfinished. The is no problem solving or exploration at all. You travel across a space map to each mission, but you can't use the holodeck or go to 10 forward or anything during the trip. Just sit and wait 1-5 minutes. \n\nI'm not sure what this is. It does have 3D game elements in it. But you click a button to win. The dialogue doesn't actually matter but can at least give you a Star Trek feeling. But there's no tension, no skill, no new stories, no good writing, no good anything. this is an absolute ZERO effort game that really can't even be called a game. With that said I haven't completely uninstalled yet, but it's hard to take in more than 20 minute segments at a time. It's really really bad even to someone who's watched every episode 20 times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played this game on console since 2020 purchases DO NOT CARRY OVER to pc so yeah basically a cash grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The servers are just not stable enough, the game was great and some of the plots are amazing but none of that matters if the servers keep disconnecting you every 5 mins and your unable to enjoy the game.\r\nSuch a a shame for  what was once an amazing game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was fun pre chinese studio. Now it's just ass on top of the ass that treks been since JJ touched it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played this for a long time on another platform, game is still an UNACCEPTABLE cashgrab. horrific monetisation. you pay the price of a full game for a ship, and then have to grind for hundreds of hours to arbitrarily fill out the components. then the fans will try and gaslight you by saying \"its free to play\" or \"you can earn the currency\"\r\n\r\nwhen in reality the entire endgame experience is a soulless grind, thats gated behind real-life waiting periods, unless you pay to skip it. but then that's it, its just grinding. there's no substance outside of the story, much of which you can't even access anymore because they removed a lot.\r\n\r\nnot to mention they STILL have extremely predatory lootboxes with a >1% droprate for anything useful. Imagine CS cases but with no resale value.  arc games are scumbags.  also the ground combat in this is total dogshit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "(I've actually played this game for many hundreds of hours on a different account. It's been fun despite a steep learning curve...)\n\nStar Trek Online is a basic fighting game well-dressed in Star Trek clothing, both Federation and Klingon factions must fight a lot, repeatedly. There are two ways to fight: personal combat (Ground) and spaceship combat (Space). Players can play against the computer’s programming (PvE) or against other players (PvP). Besides fighting, there are many social zones where players do not fight but may interact with other players in and out of context (RPG). The purpose of the game for players should be to have fun with the game and with each other, and this usually happens because of the friendly community! \n\nSome Star Trek fans and fans of space in general have their fun rooted in realism. However, this game is not an accurate simulation of either space or combat. It is more like an entertaining theme park with games and rides. Understanding this may adjust your expectations and result in having more fun while playing the game.\n\nSome players have fun playing a game for free (F2P). This game is definitely F2P. Not only that, but there are regular giveaways, recurring events, and special occasions that provide opportunities for players to make the most of resources accrued. This will cost a player their time daily for years, but not their money, and keep them coming back to reset timers. However, players who wish to save time and avoid repeating or “grinding,” may pay for their character’s advancement in various ways, including game-like mechanics resembling gambling mechanisms. The depth and cost of in-game purchases is vast, and a player may eventually find themselves repeating or “grinding” with their money just as much as a F2P player would with their time! It is recommended to have fun within your means rather than “grind” too much. Nevertheless, the game is very good at tempting players who enjoy it to make at least occasional purchases. In fact, some F2P players actually have a separate account that is definitely not F2P! So there can be some fun in progressing a F2P account, to see how well you can do for free. With some out-of-game research, anyone can make a reasonably fun character that can do fairly well in both PvE and PvP matches.\n\n\nReality versus Fantasy\n\nMany things about Star Trek Online are different than Star Trek as represented in other media and real life. Some of this is deliberate to make the game easier to play; some of this is unavoidable because of the game engine itself.\n\nFor example, we rarely see personal shield generators when Star Trek characters engage in Ground combat, except for the Borg. However, in Star Trek Online, personal shield generators are standard equipment for players and their bridge crew. This is necessary to allow for fighting, since this is a fighting game; there would be no fight if everyone was actually afraid to die from a weapon’s first fatal blow! Star Trek Online also allows players to respawn in the event of incapacitation or destruction, costing the player’s team valuable time.\n\nDistances and zone-of-controls are standardized and considerably reduced in both Ground and Space combat. For example virtually all weapons have the same effective range, and zone-of-controls ignore potential sensor ranges and even line-of-sight until trespassed! This, of course, detracts from realism but contributes to ease of play.\n\nSpace combat is more like aerial hover-drone combat and not at all like space combat should be, but this is a limitation of the game engine, which was never designed to simulate three-dimensional movement in open space. For example, spaceships cannot change their horizon with partial rolls and are limited by finite pitch within an invisible room with a hidden floor and ceiling. There is no free inertia countered by acceleration and deceleration or vectored thrust, and no orbiting stellar bodies. These along with the above mentioned standardized and reduced distances break any thrill of simulation. However, these limitations actually make the game easier and quicker to play for most who want to “grind” and represent fairly what viewers have seen in televised representations of Star Trek.\n\n\nTactics and Strategy\n\nThe tactics of almost all content of this game revolves around defeating enemies in fights rather than avoiding them. To that end, there are a seemingly limitless number of different pieces of equipment offering various protections and offensive capabilities.\n\nHowever, with regard to tactics none of all that really makes any difference. For example, it doesn’t really matter if you shoot with a phaser weapon or with a disruptor weapon, or any other type of weapon. A lot of things that you would think should make a big difference, such as terrain, weather, range, line-of-sight, mass, physics, are not really major considerations. That is because the technology of Star Trek Online has rendered these real-world considerations more-or-less moot.\n\nTactics, therefore, boils down to the ability to damage targets versus the target’s ability to absorb and heal damage. For PvE, the focus is usually on building a loadout that contributes what is needed for a team of players and maximizes damage per second, or DPS. This tactic attempts to destroy enemies before they can even pose a significant threat. With PvP, however, the focus is usually on survivability first and contributing to a team effort to reduce a competitor’s ability to heal and sustain damage and eventually destroy the competitor.\n\nThe real-world tactics in both Ground and Space, is in the gradual acquisition of better equipment and unlocking better abilities, and in the player’s—not the character’s—gradually learning what works and does not and how to do things such as run and fly. The better equipment is mostly the kit frame and modules for the Ground setting, and the bridge officer stations of a spaceship for the Space setting. As a consequence, the entire game actually revolves around constantly acquiring various in-game currencies to purchase better kit frames and kits and better spaceships with the best officer stations; and to upgrade them and all your other equipment that supports them. There is, however, a very steep learning curve and one could easily spend as many hours reading and watching fan-created content designed to inform players as one could spend actually playing the game. Not to mention that new content, including equipment, is continually created and added to the game!\n\nAs far as overall strategy on a grand scale, there is none that a player can affect for good or bad. The galaxy is static, set in stone. In the long run it does not matter to the galaxy if a player chooses to side with the Federation or Klingon faction. Despite eventually becoming an admiral, a player will make no decisions that affect grand strategy, though they will be labored with numerous repetitive administrative duties for rewards to help further levelling up and acquisition of in-game currencies. However, a player will play through story episodes and missions that role-play through great predestined galaxy-shaking events, along with many favorite Star Trek characters! To that end, there is a lot of story content that could be enjoyed for many, many hours, much of which is actually a pleasure to repeat once in a while.\n\nIn conclusion, if you want to forget reality for hours on end and enjoy a Star Trek fantasy theme park, if you want to research fan-created instructions, guides, and recommendations out of necessity, if you actually read this entire review to your benefit, then this game is recommended for you!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be good. Quests were like Star Trek episodes, some were good, some were badly written. Over all it was fun.\n\nThen they over saturated it with dumb kurtzmantrek shit and lots of dumb ships that make no sense within the narrative and world building existing.\n\nThey gave idiots too much creative freedom which ruins the star trek setting and takes you out of it when someone in a swim suit or bright pink outfit runs by.\n\nDon't get me started on the ships idiots make and name.\n\nThis game is ruined by stupidity.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "for the gutter in my case - first installed STO Stardate 0.2014 - never got one min of gamplay - not back then nor now Stardate 0.2025 - figure reinstalling it - looks like my uhura007 tag isnt well seen @ StarTrek(!) - not one min of gameplay! NOT ONE! - highly illogical!\n\nhave better to do then spend another >ten years for a running game:\n\nWish you a healthy and prosperous life\n\na vulcan",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feel like a World of Warcraft game of endless grinding and game store. Feels like pay to win type of game. I started playing years back it was fun at first then it got stale and boring. Same stuff over and over. Nothing is really new and exciting. Still no Tier 7 ships yet bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would not recommend this game to anyone who is not a Star Trek fan. Outside the stories (which are pretty good) and seeing/interacting with characters from the series, this game doesn't have much going for it.\n\nPros: Interesting stories that keep you engaged, returning characters from the series who you often interact with, lots of customization (ships, ship designs, ship weapons, character weapons, characters, bridge crew, etc.)\n\nCons: Unacceptable bugs (audio overlapping, missions that need to be dropped and then picked back up because the story wont load necessary events, leaving a system and getting trapped within the 3D models of the stars [gotta leave and come back unless you transwarp], UI has incorrect overlapping screens [getting a coms call will still display the ship's shields and hull health over the coms call text for some reason]), confusing UI that tells you you can have more bridge crew (but you can't but you can [yeah, I'm just as confused as you]), waves of sponge enemies (seriously, this needs to stop. Nobody wants to play a clicking simulator. That's NOT fun), not enough save points (this is an online game, there NEEDS to be more save points to prevent massive wastes of time), overly complex and cluttered UI, overly complex literally everything else (I'm STILL getting tutorials after I'm over 20 hours in and I'm lost on what most of this is supposed to do because it's so overwhelming), monetized to heck and back, some tutorials come AFTER you've already dealt with the thing it's trying to teach you.\n\nOverall, I think this game is okay, it's just marred by a lot of issues that just shouldn't be. If you're a Star Trek fan, you can probably push past all the jank and actually enjoy it.\n\nEdit: Just tried out the events for the first time. Yikes. That wont be a mistake I make ever again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay to Win. Missions are going to kill you over and over until you spend 100 or more, at least.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the balancing is awful, if you are not a wale you will need to be ready to die constantly or have a wale hold your hand through the game after you reach lvl. 50",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just starting out the game so fare it pretty damn boring if it get better i'll update if not well you know how i feel of this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I prefer open world experiences to market bazaars and force-following quest markers.  It's not role playing if the role is played for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Where to begin with this game.....Well, for starters, it doesn't seem to know what KIND of game it is. It's a Space Sim, no wait, it's a Space Tactics game, no wait, it's a 3PS with literally the worst controls and gameplay I've ever experienced, (and I lived through the MS-DOS era of gaming), no, now it wants to be an MMO! I get that Star Trek encompasses all of these genres, but this game seems to think that being terrible at most of them is better than being good at one of them.\n\nNext, we get into the real hot-topic of this game being P2W. Without exception, it's 100% pay to win. The wait times for prizes are excessive, and you HAVE to buy keys to unlock these \"prize boxes\". So yes, it's pay to win or put more accurately: if you don't pay, you're going to respawn insanely often.\n\nLet's also consider that the game has been in development for 15 years now. 15 years! And they still haven't figured out how to make ground combat manageable without having to click on (up to) 100 individual tiles. The graphics still meet the bare minimum definition of the word \"graphics\" as we knew it in 2015, and in 2025, there's just no excuse for loading issues and horrendous hit boxes anymore. I can't even get into the stupendously clunky control schemes without going into a full on rant about keyboard efficiency and effective gameplay.\n\nOverall, I give this game a 3/10. It tried hard to give us the entire Star Trek experience, but only resulted in a \npretty awful all around experience wrapped in a Pay 2 Win package that used fans' love of Star Trek to make absurd amounts of money. I feel bad for the OG Trek actors who provided their voices to this game, for being associated with a total scam. I also feel bad for Terry Matalas for giving this game a shout out (via the Enterprise F's cameo) in Picard Season 3. That was a huge shout out, Cryptic, the Enterprise F has been etched into Star Trek Canon now, and it comes back to this complete scam of a game. The fact that we have to live with the STO Enterprise F forever in Star Trek lore now is probably the thing that disgusts me the most about this game. The best season of Picard, the TNG comeback we've wanted for 20+ years, and it's sullied by Star Trek Online.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's just too old and janky.  It's free to play, but I would not recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to love this game but since DECA took over its gotten worse, \n\nGreediest change so far is charging people extra vat on top of zen purchases without informing them",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Controls completely crashed during first mission. Much better on a console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Until they fix their security CRAP, and lock steam to the login.  Instead of how they do it now, which even with the old team was not able to login, even with going through their steps.  Have not been able to find down load to install on linux out side of steam, so this game is dead to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unable to review a game that i cannot play, game installs and the tries patching, 1% for 20 mins then stops responding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't discern any purpose to this game except to fly slightly better ships to destroy other ships. Looks like Star Trek, sometimes sounds like Star Trek, but it lacks the purpose, ideas and entertainment value of Star Trek.  The Lifetime Sub I got for this game years and years ago is the anchor that ties me to this sinking ship.  I got the lifetime sub because I missed the opportunity of getting one for a genuine game -- Lord of the Rings Online.  No idea if the game has any potential, it certainly looks fixed in a sad rut.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant run the game, cant install the game, months back i was able to get it installed and working now i cant no matter what i do. so f!!k this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant there be a non moblie looking star trek game for once, one that is very in depth and not just story lined? idk if its js me but i wish there was some good star trek games for today not these moble ones if i could would leave mixed bc its still good for other people but for me i have to leave a negitave here.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely not playable using controller only despite the page saying so.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Launcher Boot-looping in a patch update, cant tell if its good or not cause i cant even START",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT PLAY ON STEAM \nWASTE OF TIME\nCANT REDEEM ANY ARC PROMOTIONS\nNO SALES ON ZEN\nCANT LINK ACCOUNTS\nPLAY ON ARC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the first few hours you will love this game if you a star trek fan. Then the gatcha mechanics and systems start to take effect more and more as you progress. You will fine yourself being forced to either spend money or be resource bottlenecked into oblivion and can only crawl along at a snails pace every day. I have some hours and I've spent some money and I wish I had not.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "What used to be. \n\nStar Trek went woke after enterprise. And as this game tries to parallel paramount, many of the new story content went woke as well. \n\nIt's disgusting. \n\nAlso it appears that new series academy will be woke as well, meaning more garbage woke content is headed for this game.  I probabally spent thousands in this game when i played it on PS4, well those transactions do not cross platform, so basically screw the players. \n\nIt's. Probabally better not to waste your money. The early game stories are cool, after delta quadrant content, it becomes puke tier expired taco bell. \n\nThey don't make content for the fans. They make content for people who don't watch or play anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "jhyhjfh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am willing to change my feedback if, and will say with a big IF, Deca or whoever took ownership of this game, will change the direction of STO to what is supposed to be: a Star Trek game, with exploration, contacts, and other intriguing missions rather than a Cash Grab game.\n\nI have 800 hours on this account, but I did play STO even before (out of Steam) when the top tier ship was the Fleet one, and I played it until the Odyssey was released for the first time as a free ship. No strange weapons combination, the meta was anti-proton damage and the ESD map was, basically, square. \n\nThe game changed a lot during the years in what it is now considered as a cash grabbing / FOMO game. Whales are keeping the game alive without even considering they are damaging the game rather than helping it to stay alive. I understand perfectly this is the only Star Trek game worth to be considered nowadays, which other ST game allows you to create your on Character, your own Crew, and fly your own ship (from the tons you have in there) and customising the equipment? It's great in that sense, and also the graphic and visuals are outstanding.\n\nBut, similar to other games, STO is ten miles wide and one inch deep. Klingon original story campaign, as well as the Romulan and Cardassian one, have been revamped and shrunk, to align to the needs of the story of the 24xx era. Clusters have been removed and replaced with Duty Officer missions. Reputations are a tedious farm to get something small in return because, yes, the best components/weapons/ships are from the Store or from the Lockboxes, which means cash grabbing. Don't get me wrong, you can still accomplish lot's of stuff in this game without even paying a penny, but the amount of ships they are throwing at you recently on the Store, is a pathetic way to monetise. \n\nBut funs will criticise you the moment you say something negative against this game. For them, STO is a church, something sacred that cannot be criticised. That's the current status of the game.\n\nI love Star Trek, I used to love a lot STO and I hope it will last forever, but if things won't change, this game will be only targeted towards whales that throw money at the 100th Miranda re-skin without a second thought.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Game used to be good a few years ago but its become too pay 2 win... Your starter ship is thrown against enemies with so much health and so many powerful abilities that unless you buy one of their overpriced ships for real money, youll spend al your missions respawning to throw yourself against an undestructible enemy...\n\n(ps: i bought a T6 dreadnough with real cash, just out of curiosity... The game instantly became playable.... this is not a ragequit... im quitting because i had to spend money in order to make the game playable... this is unacceptable.)",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "Would recommend as a free game only. When you get the life time membership they will start to harass you.This game is under a new game studio and these guys are scam artists. Good game but don't trust your personal account info with these people.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I pre-ordered the Collector's Edition. While I'm not the biggest Star Trek fan, I agree with others that STO may be the best Trek game out there - unfortunately, that says more about the state of Trek gaming than anything. I haven't played much since 2012, but I pop my head in every few years because the space combat is addicting. \n\nI would prefer not to downvote this game, but unfortunately, it has some significant issues that cannot be overlooked:\n\n[list]\n    [*]It is a 15-year old MMORPG. Like all older MMOs, the newer content looks good with better animations and higher resolution textures. But, when bumped up against older content and models, they stand out. This is universal with all MMOs. \n    [*]Ground combat sucks. It sucked in 2010 and especially in 2025. Cryptic attempted to \"modernize\" it over the years, but it's not great. Space combat is amazing - even non-Trek fans should enjoy it. \n    [*]STO's monetization strategy makes mobile games blush. End game ships run $25-30 each. Bundles of ships with additional perks are $100+. Many players justify these costs - if you're devoting dozens or hundreds of hours a year, it may balance out. To the more casual fan, it does not. [b]Remember:[/b] There is no subscription for STO. It's F2P or Zen store. \n[/list]\n\n[h3] My Recommendation [/h3]\nTry it out. Level up some characters. There are some free T6 (end game) ships available through events - although they're a slugfest to get and likely not the \"cool ones,\" that you may want. Since it is F2P, it doesn't hurt to try.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "99% Dps, near zero skill based combat. Some ships have amazing detail, others look like something out of the N64 generation (really annoying when the ship with the right gameplay-features has textures that would make last century look like the future). Furthermore, the level scaling is outright unfair. Never in my life have I \nplayed a game where I've dreaded leveling up more than in this game. At a certain point you are forced into using the crafting system as the current enemies are to powerful for any gear you can buy with your basic currency. Now that wouldn't be a problem if it wasn't for the fact that BY THE TIME YOU HAVE GOT THE ITEMS REQUIRED TO CRAFT YOU KIT, IT'S ALREADY OUTDATED!",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "In the beginning this game was extremely fun and entertaining, but it became confusing, complicated and tedious, its behind a pay wall (Micro transactions), while I understand that an FTP game must make money some how, they are ridiculously expensive.  Trying to find out which phaser array goes with which build, and which crew goes best with what ship has become daunting and complicated.  Also if you enjoy doing the same boring missions over and over and over again, than this is your game.  Otherwise move on to another of the plethora of MMOs out there, that are far more entertaining, like Star Wars The Old Republic (SWTOR for short), its far less complicated, and far more fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I misclicked a bundle item and bought it. There was no conformation menu to the purchace it just spent my ZEN without my complete consent. Tried to get the bundle remove from my account, result is as follows:\r\n\r\n------\r\n\r\nphicubed***********\r\n\r\nNov 21, 2025, 17:24 PST\r\n\r\nHello.\r\n\r\nI misclicked and bought this bundle. I had no intention of buying it. I have my mind set on other items in the shop.\r\n\r\nI havn't opened the ships or used anything that comes with the bundle and I don't intend to because I did not want it in the first place.\r\n\r\nI'd like my zen refunded to my account please.\r\n\r\nThanks.\r\n\r\nReply:\r\n\r\nHello,\r\n \r\nThank you for waiting.\r\n \r\nOur Senior Game Lead reviewed your request.\r\n \r\nI'm sorry, since the contents of the bundle has already been unlocked to the account, we can no longer refund back the Zen used. The Support Team doesn't have the ability to remove the contents or locked it again on the account.\r\n \r\nWe apologize for the inconvenience. If you have any other concerns, please let us know.\r\n\r\nMy Reply:\r\n\r\nwait. you're saying that the administrator cannot administer the game to remove items?\r\n\r\nSecondly, you have my money already. It's just a matter of administering the account.\r\n\r\nIf the company wants me to spend more real money in the game in the future I'd advise adminning the account as per my request asap.\r\n\r\n------\r\n\r\nThe admin or new owners or who ever is incharge really doesn't care anymore for the player base. I've been playing this game since nearly the launch of it in 2011. I have 5385 hours played just on Steam, not counting the launcher that wasn't connected to Steam before the switch so more like 6000 hours played. I've contacted support once and \"only once\" in the past for a misclick purchased item and the guy's were great and unaderstood that sometimes it happens. We're people, we make mistakes. We're human.\r\n\r\nThe new owners apperently don't care.\r\n\r\nFor the immidiate future I'm spending my money eltswhere until this company gets it's soul back. But I don't see soul in the company anymore so thats not happening any time soon IMHO.\r\n\r\ntldr: Don't waste real money on in game currency for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Star Trek Online is something you can enjoy, but you should also consider its value.\n\nAs a fan of the Star Trek universe, you're guaranteed to find something you like here.\n\nThe possibilities are there, but not accessible to everyone.\n\nThere are tons of starships from all over the galaxy, a large number of story missions with excellent voice acting, and a wide variety of customization options for your captain, bridge officers, and ship.\n\nOn top of that, there are PvE and PvP events, seasonal events, fleets with bases, different factions, and much more.\n\nSo basically, it's a complete package for all Trekkies.\n\nHowever, we also have to consider the Gorn in the room: \nFOMO, gacha, pay2win, bugs, and slow hotfixes (if they happen at all).\n\nI'm not someone you can just milk, but I've met many players who, without hesitation, shell out a hundred euros for a ship bundle just to get a single, specific console.\n\nAnd that's insane, because it's profiting off the backs of people who are ultimately being blackmailed.\n\nIt's about maximizing digital \"performance,\" hidden behind a massive paywall.\n\nIf it were just about cosmetics, it wouldn't be so problematic in my eyes, but these are items that significantly impact the gameplay experience.\n\nAnd if enough people have purchased the package, a small patch will often be released to mitigate the \"accidentally\" overpowered item... \nWhat a surprise!\n\nThe rabbit hole you can climb here is deep if you're looking for optimizing your experience.\n\nVery, very deep.\n\nI mean - watch some videos about top tier builds.\n\nAnd now, after 15 years of STO, I have to say that the still clunky interface, the truly awful character animations, the disproportionately expensive items in the shop, the terrible communication from the developers (last Steam post from April 25, 2017), the bugs that have persisted for years, the pay-to-win mechanics, and much more,\nshow how little respect they really have for the fan and player community.\n\n/peace",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Initially, a fun game. Wasted three hours on Dewa III looking for samples. Found 90%, then much wandering. A good game for the patient.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is like a mobile game, it even has fake currency you can buy with real money to speed up your in game progress. The actual gameplay is very bad. The Dialogue is set, no choices. In fact you never get any choices. You walk around and press F, to activate the thing. Then either watch a video or shoot at some guys who are never a threat. You barely aim, as long as your pointed in the general direction of the bad guy you'll hit them. The ship combat you don't aim at all. You can fly around but there's no point. Just keep clicking the weapon buttons till you win. If you ever die that doesn't matter, just respawn exactly where you died, as many times as you want. The graphics are raw and unfinished. The is no problem solving or exploration at all. You travel across a space map to each mission, but you can't use the holodeck or go to 10 forward or anything during the trip. Just sit and wait 1-5 minutes. \n\nI'm not sure what this is. It does have 3D game elements in it. But you click a button to win. The dialogue doesn't actually matter but can at least give you a Star Trek feeling. But there's no tension, no skill, no new stories, no good writing, no good anything. this is an absolute ZERO effort game that really can't even be called a game. With that said I haven't completely uninstalled yet, but it's hard to take in more than 20 minute segments at a time. It's really really bad even to someone who's watched every episode 20 times.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played this game on console since 2020 purchases DO NOT CARRY OVER to pc so yeah basically a cash grab",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}